{"id": "CTDMJwMZ3K2", "cdate": 1683642186487, "mdate": 1683642186487, "content": {"title": "Near-optimal method for highly smooth convex optimization", "abstract": "We propose a near-optimal method for highly smooth convex optimization. More precisely, in the oracle model where one obtains the pth order Taylor expansion of a function at the query point, we propose a method with rate of convergence $O(1/k^{3p+1/2} )$ after k queries to the oracle for any convex function whose pth order derivative is Lipschitz."}}
{"id": "nQ4DQ3_6yi0", "cdate": 1672531200000, "mdate": 1681635728365, "content": {"title": "ReSQueing Parallel and Private Stochastic Convex Optimization", "abstract": ""}}
{"id": "jwq-W9Uusn", "cdate": 1672531200000, "mdate": 1681490889803, "content": {"title": "The Complexity of Infinite-Horizon General-Sum Stochastic Games", "abstract": ""}}
{"id": "fJrbv6FQ3U", "cdate": 1672531200000, "mdate": 1684349409793, "content": {"title": "Improved girth approximation in weighted undirected graphs", "abstract": ""}}
{"id": "Yii35z0v1q", "cdate": 1672531200000, "mdate": 1683899140151, "content": {"title": "Singular Value Approximation and Reducing Directed to Undirected Graph Sparsification", "abstract": "In this paper, we introduce a new, spectral notion of approximation between directed graphs, which we call Singular Value (SV) approximation. SV-approximation is stronger than previous notions of spectral approximation considered in the literature, including spectral approximation of Laplacians for undirected graphs (Spielman Teng STOC 2004), standard approximation for directed graphs (Cohen et. al. STOC 2007), and unit-circle approximation for directed graphs (Ahmadinejad et. al. FOCS 2020). Moreover, SV approximation enjoys several useful properties not known to be possessed by previous notions of approximation, such as being preserved under products of random-walk matrices and with matrices of bounded norm. Notably, we show that there is a simple black-box reduction from SV-sparsifying Eulerian directed graphs to SV-sparsifying undirected graphs. With this reduction in hand, we provide a nearly linear-time algorithm for SV-sparsifying undirected and hence also Eulerian directed graphs. This also yields the first nearly linear-time algorithm for unit-circle-sparsifying Eulerian directed graphs. In addition, we give a nearly linear-time algorithm for SV-sparsifying (and UC-sparsifying) random-walk polynomials of Eulerian directed graphs with second normalized singular value bounded away from $1$ by $1/\\text{poly}(n)$. Finally, we show that a simple repeated-squaring and sparsification algorithm for solving Laplacian systems, introduced by (Peng Spielman STOC 2014) for undirected graphs, also works for Eulerian digraphs whose random-walk matrix is normal (i.e. unitarily diagonalizable), if we use SV-sparsification at each step. Prior Laplacian solvers for Eulerian digraphs are significantly more complicated."}}
{"id": "P9RXY2PSfJ", "cdate": 1672531200000, "mdate": 1684349409791, "content": {"title": "Quantum Speedups for Zero-Sum Games via Improved Dynamic Gibbs Sampling", "abstract": "We give a quantum algorithm for computing an $\\epsilon$-approximate Nash equilibrium of a zero-sum game in a $m \\times n$ payoff matrix with bounded entries. Given a standard quantum oracle for accessing the payoff matrix our algorithm runs in time $\\widetilde{O}(\\sqrt{m + n}\\cdot \\epsilon^{-2.5} + \\epsilon^{-3})$ and outputs a classical representation of the $\\epsilon$-approximate Nash equilibrium. This improves upon the best prior quantum runtime of $\\widetilde{O}(\\sqrt{m + n} \\cdot \\epsilon^{-3})$ obtained by [vAG19] and the classic $\\widetilde{O}((m + n) \\cdot \\epsilon^{-2})$ runtime due to [GK95] whenever $\\epsilon = \\Omega((m +n)^{-1})$. We obtain this result by designing new quantum data structures for efficiently sampling from a slowly-changing Gibbs distribution."}}
{"id": "GYeyhPA7gf6", "cdate": 1664731450181, "mdate": null, "content": {"title": "Semi-Random Sparse Recovery in Nearly-Linear Time", "abstract": "Sparse recovery is one of the most fundamental and well-studied inverse problems. Standard statistical formulations of the problem are provably solved by general convex programming techniques and more practical, fast (nearly-linear time) iterative methods. However, these latter \"fast algorithms\" have previously been observed to be brittle in various real-world settings.\n\nWe investigate the brittleness of fast sparse recovery algorithms to generative model changes through the lens of studying their robustness to a \"helpful\" semi-random adversary, a framework which tests whether an algorithm overfits to input assumptions. We consider the following basic model: let $\\mathbf{A} \\in \\mathbb{R}^{n \\times d}$ be a measurement matrix which contains an unknown subset of rows $\\mathbf{G} \\in \\mathbb{R}^{m \\times d}$ which are bounded and satisfy the restricted isometry property (RIP), but is otherwise arbitrary. Letting $x^\\star \\in \\mathbb{R}^d$ be $s$-sparse, and given either exact measurements $b = \\mathbf{A} x^\\star$ or noisy measurements $b = \\mathbf{A} x^\\star + \\xi$, we design algorithms recovering $x^\\star$ information-theoretically optimally in nearly-linear time. We extend our algorithm to hold for weaker generative models relaxing our planted RIP row subset assumption to a natural weighted variant, and show that our method's guarantees naturally interpolate the quality of the measurement matrix to, in some parameter regimes, run in sublinear time.\n\nOur approach differs from that of prior fast iterative methods with provable guarantees under semi-random generative models (Cheng-Ge '18, Li et al. '20), which typically separate the problem of learning the planted instance from the estimation problem, i.e. they attempt to first learn the planted \"good\" instance (in our case, $\\mathbf{G}$). However, natural conditions which make sparse recovery tractable, such as RIP, are NP-hard to verify and hence first learning a sufficient row reweighting appears challenging. We eschew this approach and design a new iterative method, tailored to the geometry of sparse recovery, which is provably robust to our semi-random model. We hope our approach opens the door to new robust, efficient algorithms for other natural statistical inverse problems."}}
{"id": "4BoN6bk-FEz", "cdate": 1652737576655, "mdate": null, "content": {"title": "On the Efficient Implementation of High Accuracy Optimality of Profile Maximum Likelihood", "abstract": "We provide an efficient unified plug-in approach for estimating symmetric properties of distributions given $n$ independent samples. Our estimator is based on profile-maximum-likelihood (PML) and is sample optimal for estimating various symmetric properties when the estimation error $\\epsilon \\gg n^{-1/3}$. This result improves upon the previous best accuracy threshold of $\\epsilon \\gg n^{-1/4}$ achievable by polynomial time computable PML-based universal estimators \\cite{ACSS20, ACSS20b}. Our estimator reaches a theoretical limit for universal symmetric property estimation as \\cite{Han20} shows that a broad class of universal estimators (containing many well known approaches including ours) cannot be sample optimal for every $1$-Lipschitz property when $\\epsilon \\ll n^{-1/3}$."}}
{"id": "n3lr7GdcbyD", "cdate": 1652737546473, "mdate": null, "content": {"title": "Optimal and Adaptive Monteiro-Svaiter Acceleration", "abstract": "We develop a variant of the Monteiro-Svaiter (MS) acceleration framework that removes the need to solve an expensive implicit equation at every iteration. Consequently, for any $p\\ge 2$ we improve the complexity of convex optimization with Lipschitz $p$th derivative by a logarithmic factor,  matching a lower bound. We also introduce an MS subproblem solver that requires no knowledge of problem parameters, and implement it as either a second- or first-order method by solving linear systems or applying MinRes, respectively. On logistic regression problems our method outperforms previous accelerated second-order methods, but under-performs Newton's method; simply iterating our first-order adaptive subproblem solver is competitive with L-BFGS."}}
{"id": "tlZFBaT-9_-", "cdate": 1640995200000, "mdate": 1652976694673, "content": {"title": "Semi-Streaming Bipartite Matching in Fewer Passes and Optimal Space", "abstract": "We provide Õ(∊–1)-pass semi-streaming algorithms for computing (1–∊)-approximate maximum cardinality matchings in bipartite graphs. Our most efficient methods are deterministic and use optimal, O(n), space, improving upon the space complexity of the previous state-of-the-art Õ(∊–1)-pass algorithm of [AG18]. To obtain our results we provide semi-streaming adaptations of more general continuous optimization tools. Further, we leverage these techniques to obtain improvements for streaming variants of approximate linear programming, optimal transport, exact matching, transshipment, and shortest path problems."}}
