{"id": "Sbbw7CEzm5", "cdate": 1640995200000, "mdate": 1648672287213, "content": {"title": "CausalSim: Toward a Causal Data-Driven Simulator for Network Protocols", "abstract": "We present CausalSim, a causal inference framework for unbiased trace-driven simulation. Current trace-driven simulators assume that the interventions being simulated (e.g., a new algorithm) would not affect the validity of the traces. However, real-world traces are often biased by the choices of algorithms made during trace collection, and hence replaying traces under an intervention may lead to incorrect results. CausalSim addresses this challenge by learning a causal model of the system dynamics and latent factors capturing the underlying system conditions during trace collection. It learns these models using an initial randomized control trial (RCT) under a fixed set of algorithms, and then applies them to remove biases from trace data when simulating new algorithms. Key to CausalSim is mapping unbiased trace-driven simulation to a tensor completion problem with extremely sparse observations. By exploiting a basic distributional invariance property present in RCT data, CausalSim enables a novel tensor completion method despite the sparsity of observations. Our extensive evaluation of CausalSim on both real and synthetic datasets, including more than ten months of real data from the Puffer video streaming system show it improves simulation accuracy, reducing errors by 53% and 61% on average compared to expert-designed and supervised learning baselines. Moreover, CausalSim provides markedly different insights about ABR algorithms compared to the biased baseline simulator, which we validate with a real deployment."}}
{"id": "JZWSfAO0qos", "cdate": 1640995200000, "mdate": 1679995209493, "content": {"title": "On Multivariate Singular Spectrum Analysis and Its Variants", "abstract": ""}}
{"id": "v2w7CVZGHeA", "cdate": 1621629948655, "mdate": null, "content": {"title": "PerSim: Data-Efficient Offline Reinforcement Learning with Heterogeneous Agents via Personalized Simulators", "abstract": "We consider offline reinforcement learning (RL) with heterogeneous agents under severe data scarcity, i.e., we only observe a single historical trajectory for every agent under an unknown, potentially sub-optimal policy. We find that the performance of state-of-the-art offline and model-based RL methods degrade significantly given such limited data availability, even for commonly perceived \"solved\" benchmark settings such as \"MountainCar\" and \"CartPole\". To address this challenge, we propose PerSim, a model-based offline RL approach which first learns a personalized simulator for each agent by collectively using the historical trajectories across all agents, prior to learning a policy. We do so by positing that the transition dynamics across agents can be represented as a latent function of latent factors associated with agents, states, and actions; subsequently, we theoretically establish that this function is well-approximated by a \"low-rank\" decomposition of separable agent, state, and action latent functions. This representation suggests a simple, regularized neural network architecture to effectively learn the transition dynamics per agent, even with scarce, offline data. We perform extensive experiments across several benchmark environments and RL methods. The consistent improvement of our approach, measured in terms of both state dynamics prediction and eventual reward, confirms the efficacy of our framework in leveraging limited historical data to simultaneously learn personalized policies across agents. "}}
{"id": "i0DmV60aeK", "cdate": 1621629945376, "mdate": null, "content": {"title": "Change Point Detection via Multivariate Singular Spectrum Analysis", "abstract": "The objective of change point detection (CPD) is to detect significant and abrupt changes in the dynamics of the underlying system of interest through multivariate time series observations. In this work, we develop and analyze an algorithm for CPD that is inspired by a variant of the classical singular spectrum analysis (SSA) approach for time series by combining it with the classical cumulative sum (CUSUM) statistic from sequential hypothesis testing. In particular, we model the underlying dynamics of multivariate time series observations through the spatio-temporal model introduced recently in the multivariate SSA (mSSA) literature. The change point in such a setting corresponds to a change in the underlying spatio-temporal model. As the primary contributions of this work, we develop an algorithm based on CUSUM-statistic to detect such change points in an online fashion. We extend the analysis of CUSUM statistics, traditionally done for the setting of independent observations, to the dependent setting of (multivariate) time series under the spatio-temporal model. Specifically, for a given parameter $h > 0$, our method achieves the following desirable trade-off: when a change happens, it detects it within $O(h)$ time delay on average, while in the absence of change, it does not declare false detection for at least $\\exp(\\Omega(h))$ time length on average. We conduct empirical experiments using benchmark and synthetic datasets. We find that the proposed method performs competitively or outperforms the state-of-the-art change point detection methods across datasets. "}}
{"id": "ylbLNoCXRDV", "cdate": 1609459200000, "mdate": 1679995209513, "content": {"title": "Change Point Detection via Multivariate Singular Spectrum Analysis", "abstract": ""}}
{"id": "f95KzxsaLwe", "cdate": 1609459200000, "mdate": 1679995209497, "content": {"title": "PerSim: Data-Efficient Offline Reinforcement Learning with Heterogeneous Agents via Personalized Simulators", "abstract": ""}}
{"id": "PZa4rtby2Y", "cdate": 1577836800000, "mdate": 1679995209513, "content": {"title": "Two Burning Questions on COVID-19: Did shutting down the economy help? Can we (partially) reopen the economy without risking the second wave?", "abstract": ""}}
{"id": "2B3PkeBw6S7", "cdate": 1577836800000, "mdate": 1679995209514, "content": {"title": "tspDB: Time Series Predict DB", "abstract": ""}}
