{"id": "tmn6S0RW8Eq", "cdate": 1672531200000, "mdate": 1683880944444, "content": {"title": "Optimal Mass Transport over the Euler Equation", "abstract": "We consider the finite horizon optimal steering of the joint state probability distribution subject to the angular velocity dynamics governed by the Euler equation. The problem and its solution amounts to controlling the spin of a rigid body via feedback, and is of practical importance, for example, in angular stabilization of a spacecraft with stochastic initial and terminal states. We clarify how this problem is an instance of the optimal mass transport (OMT) problem with bilinear prior drift. We deduce both static and dynamic versions of the Eulerian OMT, and provide analytical and numerical results for the synthesis of the optimal controller."}}
{"id": "TopZVgcYy7", "cdate": 1672531200000, "mdate": 1683880944685, "content": {"title": "A Controlled Mean Field Model for Chiplet Population Dynamics", "abstract": "In micro-assembly applications, ensemble of chiplets immersed in a dielectric fluid are steered using dielectrophoretic forces induced by an array of electrode population. Generalizing the finite population deterministic models proposed in prior works for individual chiplet position dynamics, we derive a controlled mean field model for a continuum of chiplet population in the form of a nonlocal, nonlinear partial differential equation. The proposed model accounts for the stochastic forces as well as two different types of nonlocal interactions, viz. chiplet-to-chiplet and chiplet-to-electrode interactions. Both of these interactions are nonlinear functions of the electrode voltage input. We prove that the deduced mean field evolution can be expressed as the Wasserstein gradient flow of a Lyapunov-like energy functional. With respect to this functional, the resulting dynamics is a gradient descent on the manifold of joint population density functions with finite second moments that are supported on the position coordinates."}}
{"id": "vA3I6n98Ecs", "cdate": 1640995200000, "mdate": 1683880944477, "content": {"title": "Schrödinger Meets Kuramoto via Feynman-Kac: Minimum Effort Distribution Steering for Noisy Nonuniform Kuramoto Oscillators", "abstract": "We formulate and solve the problem of finite horizon minimum control effort steering of the state probability distribution between prescribed endpoint joints for a finite population of networked noisy nonuniform Kuramoto oscillators. We consider both the first and second order stochastic Kuramoto models. For numerical solution of the associated stochastic optimal control, we propose combining certain measure-valued proximal recursions and the Feynman-Kac path integral computation. We illustrate the proposed framework via numerical examples."}}
{"id": "iGxYCkbeef", "cdate": 1640995200000, "mdate": 1683880944583, "content": {"title": "Boundary and Taxonomy of Integrator Reach Sets", "abstract": "Over-approximating the forward reach sets of controlled dynamical systems subject to set-valued uncertainties is a common practice in systems-control engineering for the purpose of performance verification. However, specific algebraic and topological results for the geometry of such sets are rather uncommon even for simple linear systems such as the integrators. This work explores the geometry of the forward reach set of the integrator dynamics subject to box-valued uncertainties in its control inputs. Our contribution includes derivation of a closed-form formula for the support functions of these sets. This result, then enables us to deduce the parametric as well as the implicit equations describing the exact boundaries of these reach sets. Specifically, the implicit equations for the bounding hypersurfaces are shown to be given by vanishing of certain Hankel determinants. Finally, it is established that these sets are semialgebraic as well as translated zonoids. Such results should be useful to benchmark existing reach set over-approximation algorithms, and to help design new algorithms for the same."}}
{"id": "eUNZ6WHdAM_", "cdate": 1640995200000, "mdate": 1683880944548, "content": {"title": "Certifying the Intersection of Reach Sets of Integrator Agents With Set-Valued Input Uncertainties", "abstract": "We consider the problem of verifying safety for a pair of identical integrator agents in continuous time with compact set-valued input uncertainties. We encode this verification problem as that of certifying or falsifying the intersection of their reach sets. We transcribe the same into a variational problem, namely that of minimizing the support function of the difference of the two reach sets over the unit sphere. We illustrate the computational tractability of the proposed formulation by developing two cases in detail, viz. when the inputs have time-varying norm-bounded and generic hyperrectangular uncertainties. We show that the latter case allows distributed certification via second order cone programming."}}
{"id": "dzrfoN45xvH", "cdate": 1640995200000, "mdate": 1683880944471, "content": {"title": "Schrödinger Meets Kuramoto via Feynman-Kac: Minimum Effort Distribution Steering for Noisy Nonuniform Kuramoto Oscillators", "abstract": "We formulate and solve the problem of finite horizon minimum control effort steering of the state probability distribution between prescribed endpoint joints for a finite population of networked noisy nonuniform Kuramoto oscillators. We consider both the first and second order stochastic Kuramoto models. For numerical solution of the associated stochastic optimal control, we propose combining certain measure-valued proximal recursions and the Feynman-Kac path integral computation. We illustrate the proposed framework via numerical examples."}}
{"id": "WSmIJruUsIN", "cdate": 1640995200000, "mdate": 1683880944752, "content": {"title": "Hausdorff Distance between Norm Balls and their Linear Maps", "abstract": "We consider the problem of computing the (two-sided) Hausdorff distance between the unit $\\ell_{p_{1}}$ and $\\ell_{p_{2}}$ norm balls in finite dimensional Euclidean space for $1 \\leq p_1 < p_2 \\leq \\infty$, and derive a closed-form formula for the same. We also derive a closed-form formula for the Hausdorff distance between the $k_1$ and $k_2$ unit $D$-norm balls, which are certain polyhedral norm balls in $d$ dimensions for $1 \\leq k_1 < k_2 \\leq d$. When two different $\\ell_p$ norm balls are transformed via a common linear map, we obtain several estimates for the Hausdorff distance between the resulting convex sets. These estimates upper bound the Hausdorff distance or its expectation, depending on whether the linear map is arbitrary or random. We then generalize the developments for the Hausdorff distance between two set-valued integrals obtained by applying a parametric family of linear maps to different $\\ell_p$ unit norm balls, and then taking the Minkowski sums of the resulting sets in a limiting sense. To illustrate an application, we show that the problem of computing the Hausdorff distance between the reach sets of a linear dynamical system with different unit norm ball-valued input uncertainties, reduces to this set-valued integral setting."}}
{"id": "EFMHRfzRnLD", "cdate": 1640995200000, "mdate": 1683880944654, "content": {"title": "Certifying the Intersection of Reach Sets of Integrator Agents with Set-valued Input Uncertainties", "abstract": "We consider the problem of verifying safety for a pair of identical integrator agents in continuous time with compact set-valued input uncertainties. We encode this verification problem as that of certifying or falsifying the intersection of their reach sets. We transcribe the same into a variational problem, namely that of minimizing the support function of the difference of the two reach sets over the unit sphere. We illustrate the computational tractability of the proposed formulation by developing two cases in detail, viz. when the inputs have time-varying norm-bounded and generic hyperrectangular uncertainties. We show that the latter case allows distributed certification via second order cone programming."}}
{"id": "Cc6tmCJg_ID", "cdate": 1640995200000, "mdate": 1683880944574, "content": {"title": "Convex and Nonconvex Sublinear Regression with Application to Data-driven Learning of Reach Sets", "abstract": "We consider estimating a compact set from finite data by approximating the support function of that set via sublinear regression. Support functions uniquely characterize a compact set up to closure of convexification, and are sublinear (convex as well as positive homogeneous of degree one). Conversely, any sublinear function is the support function of a compact set. We leverage this property to transcribe the task of learning a compact set to that of learning its support function. We propose two algorithms to perform the sublinear regression, one via convex and another via nonconvex programming. The convex programming approach involves solving a quadratic program (QP). The nonconvex programming approach involves training a input sublinear neural network. We illustrate the proposed methods via numerical examples on learning the reach sets of controlled dynamics subject to set-valued input uncertainties from trajectory data."}}
{"id": "6IG7_VVEkI", "cdate": 1640995200000, "mdate": 1683880944539, "content": {"title": "Density-Based Stochastic Reachability Computation for Occupancy Prediction in Automated Driving", "abstract": "We propose a stochastic reachability computation framework for occupancy prediction in automated driving by directly solving the underlying transport partial differential equation (PDE) governing the advection of the closed-loop joint density functions. The resulting nonparametric gridless computation is based on integration along the characteristic curves, and it allows online computation of the time-varying collision probabilities. We provide numerical simulations for multi-lane highway driving scenarios to highlight the scope of the proposed method."}}
