{"id": "WJapAQLm4kx", "cdate": 1681159349203, "mdate": 1681159349203, "content": {"title": "FITNESS : Fine Tune on New and Similar Samples to detect anomalies in Streams with drifts and outliers", "abstract": "Technology improvements have made it easier than ever to collect diverse telemetry at high resolution from any cyber or physical system, for both monitoring and control. In the domain of monitoring, anomaly detection has become an important problem in many research areas ranging from IoT and sensor networks to devOps. These systems operate in real, noisy and non-stationary environments. A fundamental question is then, ‘How to quickly spot anomalies in a data-stream, and differentiate them from either sudden or gradual drifts in the normal behaviour?’ Although several heuristics have been proposed for detecting anomalies on streams, no known method has formalized the desiderata and rigorously proven that they can be achieved. We begin by formalizing the problem as a sequential estimation task. We propose \\name, (\\textbf{Fi}ne \\textbf{T}une on \\textbf{Ne}w and \\textbf{S}imilar \\textbf{S}amples), a flexible framework for detecting anomalies on data streams. We show that in the case when the data stream has a gaussian distribution, FITNESS is provably both robust and adaptive. The core of our method is to fine-tune the anomaly detection system only on recent, similar examples, before predicting an anomaly score. We prove that this is sufficient for robustness and adaptivity. We further experimentally demonstrate that \\name;{is} flexible in practice, i.e., it can convert existing offline AD algorithms in to robust and adaptive online ones."}}
{"id": "VZ63F7l3aD", "cdate": 1676827098977, "mdate": null, "content": {"title": "Online Heavy-tailed Change-point detection", "abstract": " We study algorithms for online  change-point detection (OCPD), where samples that are potentially heavy-tailed, are presented one at a time and a change in the underlying mean must be detected as early as possible. We present an algorithm based on clipped Stochastic Gradient Descent (SGD), that works even if we only assume that the second moment of the data generating process is bounded. We derive guarantees on worst-case, finite-sample false-positive rate (FPR) over the family of all distributions with bounded second moment. Thus, our method is the first OCPD algorithm that guarantees finite-sample FPR, even if the data is high dimensional and  the underlying distributions are heavy-tailed. The technical contribution of our paper is to show that clipped-SGD can estimate the mean of a random vector and simultaneously provide confidence bounds at all confidence values. We combine this robust estimate with a union bound argument and construct a sequential change-point algorithm with finite-sample FPR guarantees. We show empirically that our algorithm works well in a variety of situations, whether the underlying data are heavy-tailed, light-tailed, high dimensional or discrete. No other algorithm achieves bounded FPR theoretically or empirically, over all settings we study simultaneously. "}}
{"id": "7tMRd6-5lPw", "cdate": 1664816287364, "mdate": null, "content": {"title": "C-GATS: Conditional Generation of Anomalous Time Series", "abstract": "Sparsity of the data needed to learn about the anomalies is often a key challenge that is faced when it comes to training deep supervised models for the task of Anomaly Detection (AD). Generating synthetic data by applying pre-determined transformations that conform to a set of known invariances has shown to improve performance of such deep models. In this work we present C-GATS to show that one can learn a much larger invariance space using the available sparse data by training a conditional generative model to do Data Augmentation (DA) for anomalous Time Series (TS) in a model-agnostic way. Particularly, we factorize an anomalous TS sequence into 3 attributes— normal sub-sequence, anomalous sub-sequence, and position of the anomaly and model each of them separately. This factorization helps exploit samples from the dominant class i.e normal TS to train a generative model for the sparse class i.e anomalous TS. We provide an exhaustive study to showcase that C-GATS not only learns to generate different types of anomalies (eg: point anomalies and level-shift) but those generated anomalies improve performance of multiple SOTA TS AD models on a set of popular public TS AD benchmark datasets."}}
{"id": "JlgR7ftH97P", "cdate": 1596129697725, "mdate": null, "content": {"title": "Dominate or Delete: Decentralized Competing Bandits with Uniform Valuation", "abstract": "We study regret minimization problems in a two-sided matching market where uniformly\nvalued demand side agents (a.k.a. agents) continuously compete for getting matched with\nsupply side agents (a.k.a. arms) with unknown and heterogeneous valuations. Such markets\nabstract online matching platforms (for e.g. UpWork, TaskRabbit) and falls within the purview\nof matching bandit models introduced in Liu et al. [24]. The uniform valuation in the demand\nside admits a unique stable matching equilibrium in the system. We design the first decentralized\nalgorithm - UCB with Decentralized Dominant-arm Deletion (UCB-D3), for matching bandits\nunder uniform valuation that does not require any knowledge of reward gaps or time horizon,\nand thus partially resolves an open question in [24]. UCB-D3 works in phases of exponentially\nincreasing length. In each phase i, an agent first deletes dominated arms – the arms preferred by\nagents ranked higher than itself. Deletion follows dynamic explore-exploit using UCB algorithm\non the remaining arms for 2^i rounds. Finally, the preferred arm is broadcast in a decentralized\nfashion to other agents through pure exploitation in (N − 1)K rounds with N agents and K\narms. Comparing the obtained reward with respect to the unique stable matching, we show that UCB-D3 achieves O(log(T)/∆^2) regret in T rounds, where ∆ is the minimum gap across all agents and arms. We provide a (orderwise) matching regret lower-bound."}}
{"id": "TF6fVyZP_vs", "cdate": 1596129579972, "mdate": null, "content": {"title": "Multi Agent Low Dimensional Linear Bandits", "abstract": "We study a multi-agent stochastic linear bandit with side information, parameterized by an\nunknown vector θ^∗ ∈ R^d. The side information consists of a finite collection of low-dimensional\nsubspaces, one of which contains θ^∗. In our setting, agents can collaborate to reduce regret by\nsending recommendations across a communication graph connecting them. We present a novel\ndecentralized algorithm, where agents communicate subspace indices with each other, and each\nagent plays a projected variant of LinUCB on the corresponding (low-dimensional) subspace.\nThrough a combination of collaborative best subspace identification, and per-agent learning of\nan unknown vector in the corresponding low-dimensional subspace, we show that the per-agent\nregret is much smaller than the case when agents do not communicate. By collaborating to\nidentify the subspace containing θ^∗, we show that each agent effectively solves an easier instance\nof the linear bandit (compared to the case of no collaboration), thus leading to the reduced\nper-agent regret. We finally complement these results through simulations."}}
{"id": "RdNPToXxsq", "cdate": 1577836800000, "mdate": null, "content": {"title": "Stability and Scalability of Blockchain Systems", "abstract": "The blockchain paradigm provides a mechanism for content dissemination and distributed consensus on Peer-to-Peer (P2P) networks. While this paradigm has been widely adopted in industry, it has not been carefully analyzed in terms of its network scaling with respect to the number of peers. Applications for blockchain systems, such as cryptocurrencies and IoT, require this form of network scaling. In this paper, we propose a new stochastic network model for a blockchain system. We identify a structural property called \\emph{one-endedness}, which we show to be desirable in any blockchain system as it is directly related to distributed consensus among the peers. We show that the stochastic stability of the network is sufficient for the one-endedness of a blockchain. We further establish that our model belongs to a class of network models, called monotone separable models. This allows us to establish upper and lower bounds on the stability region. The bounds on stability depend on the connectivity of the P2P network through its conductance and allow us to analyze the scalability of blockchain systems on large P2P networks. We verify our theoretical insights using both synthetic data and real data from the Bitcoin network."}}
{"id": "JKHHFHytR_h", "cdate": 1577836800000, "mdate": null, "content": {"title": "The Gossiping Insert-Eliminate Algorithm for Multi-Agent Bandits", "abstract": "We consider a decentralized multi-agent Multi Armed Bandit (MAB) setup consisting of $N$ agents, solving the same MAB instance to minimize individual cumulative regret. In our model, agents collaborate by exchanging messages through pairwise gossip style communications on an arbitrary connected graph. We develop two novel algorithms, where each agent only plays from a subset of all the arms. Agents use the communication medium to recommend only arm-IDs (not samples), and thus update the set of arms from which they play. We establish that, if agents communicate $\\Omega(\\log(T))$ times through any connected pairwise gossip mechanism, then every agent's regret is a factor of order $N$ smaller compared to the case of no collaborations. Furthermore, we show that the communication constraints only have a second order effect on the regret of our algorithm. We then analyze this second order term of the regret to derive bounds on the regret-communication tradeoffs. Finally, we empirically evaluate our algorithm and conclude that the insights are fundamental and not artifacts of our bounds. We also show a lower bound which gives that the regret scaling obtained by our algorithm cannot be improved even in the absence of any communication constraints. Our results thus demonstrate that even a minimal level of collaboration among agents greatly reduces regret for all agents."}}
{"id": "HfjsPzCOsrb", "cdate": 1546300800000, "mdate": null, "content": {"title": "ComHapDet: A Spatial Community Detection Algorithm for Haplotype Assembly", "abstract": "Background: Haplotypes, the ordered lists of single nucleotide variations that distinguish chromosomal sequences from their homologous pairs, may reveal an individual's susceptibility to hereditary and complex diseases and affect how our bodies respond to therapeutic drugs. Reconstructing haplotypes of an individual from short sequencing reads is an NP-hard problem that becomes even more challenging in the case of polyploids. While increasing lengths of sequencing reads and insert sizes {\\color{black} helps improve accuracy of reconstruction}, it also exacerbates computational complexity of the haplotype assembly task. This has motivated the pursuit of algorithmic frameworks capable of accurate yet efficient assembly of haplotypes from high-throughput sequencing data. Results: We propose a novel graphical representation of sequencing reads and pose the haplotype assembly problem as an instance of community detection on a spatial random graph. To this end, we construct a graph where each read is a node with an unknown community label associating the read with the haplotype it samples. Haplotype reconstruction can then be thought of as a two-step procedure: first, one recovers the community labels on the nodes (i.e., the reads), and then uses the estimated labels to assemble the haplotypes. Based on this observation, we propose ComHapDet - a novel assembly algorithm for diploid and ployploid haplotypes which allows both bialleleic and multi-allelic variants. Conclusions: Performance of the proposed algorithm is benchmarked on simulated as well as experimental data obtained by sequencing Chromosome $5$ of tetraploid biallelic \\emph{Solanum-Tuberosum} (Potato). The results demonstrate the efficacy of the proposed method and that it compares favorably with the existing techniques."}}
{"id": "8fD8BgHsYGN", "cdate": 1546300800000, "mdate": null, "content": {"title": "Social Learning in Multi Agent Multi Armed Bandits", "abstract": "Motivated by emerging need of learning algorithms for large scale networked and decentralized systems, we introduce a distributed version of the classical stochastic Multi-Arm Bandit (MAB) problem. Our setting consists of a large number of agents n that collaboratively and simultaneously solve the same instance of K armed MAB to minimize the average cumulative regret over all agents. The agents can communicate and collaborate among each other only through a pairwise asynchronous gossip based protocol that exchange a limited number of bits. In our model, agents at each point decide on (i) which arm to play, (ii) whether to, and if so (iii) what and whom to communicate with. Agents in our model are decentralized, namely their actions only depend on their observed history in the past. We develop a novel algorithm in which agents, whenever they choose, communicate only arm-ids and not samples, with another agent chosen uniformly and independently at random. The per-agent regret scaling achieved by our algorithm is $\\BigO łeft( \\fracłceil\\fracK n \\rceil+łog(n) Δ łog(T) + \\fracłog^3(n) łog łog(n) Δ^2 \\right) $. Furthermore, any agent in our algorithm communicates (arm-ids to an uniformly and independently chosen agent) only a total of Θ(łog(T))$ times over a time interval of T. We compare our results to two benchmarks - one where there is no communication among agents and one corresponding to complete interaction, where an agent has access to the entire system history of arms played and rewards obtained of all agents. We show both theoretically and empirically, that our algorithm experiences a significant reduction both in per-agent regret when compared to the case when agents do not collaborate and each agent is playing the standard MAB problem (where regret would scale linearly in K), and in communication complexity when compared to the full interaction setting which requires T communication attempts by an agent over T arm pulls. Our result thus demonstrates that even a minimal level of collaboration among the different agents enables a significant reduction in per-agent regret."}}
{"id": "Z3QBF6P-T-D", "cdate": 1514764800000, "mdate": null, "content": {"title": "Community Detection on Euclidean Random Graphs", "abstract": "We study Community Detection (CD) on a class of sparse spatial random graphs embedded in the Euclidean space. Our random graph is the planted-partition version of the random connection model studied in Stochastic Geometry. Each node has two labels - an i.i.d. uniform {–1, +1} valued community label and a ℝd valued location label which form the support of a Poisson Point Process of intensity λ on ℝd. Conditional on the labels, edges are drawn independently at random depending both on the Euclidean distance between the nodes and the community labels on the nodes. The CD problem then consists in estimating the partition of nodes into communities better than at random, based on an observation of the random graph and the spatial location labels on nodes. We establish a non-trivial phase-transition for this problem in terms of λ. We show that for small λ, there exists no algorithm for CD, For large λ, our algorithm solves CD efficiently. We show that for small λ, there exists no algorithm for CD. For large λ, we propose an algorithm which solves CD efficiently. In certain special cases, we establish the exact threshold on λ which separates the existence of an algorithm which solves CD from the impossibility of any algorithm. We also establish a distinguishability result which says that one can always efficiently infer the existence of a partition given the graph and the spatial locations even when one cannot identify the partition better than at random. This is a new phenomenon not observed thus far in any non-spatial Erdős-Rényi based models."}}
