{"id": "2Ann7eaLBEv", "cdate": 1637576009492, "mdate": null, "content": {"title": "Can Sequential Bayesian Inference Solve Continual Learning?", "abstract": "Previous work in Continual Learning (CL) has used sequential Bayesian inference to prevent forgetting and accumulate knowledge from previous tasks. A limiting factor to performing Bayesian CL has been exact inference in a Bayesian Neural Network (NN). We perform sequential Bayesian inference with a Bayesian NN using Hamiltonian Monte Carlo (HMC) and propagate the posterior as a prior for a new task by fitting a density estimator on HMC samples. We find that this approach fails to prevent forgetting. We propose an alternative view of the CL problem which directly models the data generating process and decomposes the CL problem in task specific and shared parameters. This method named Prototypical Bayesian CL and performs well compared to the latest Bayesian CL methods."}}
{"id": "eqNpg2HMNi1", "cdate": 1632875545230, "mdate": null, "content": {"title": "Physical System Design Using Hamiltonian Monte Carlo over Learned Manifolds", "abstract": "The design of complex physical systems entails satisfying several competing performance objectives. In practice, some design requirements are often implicit in the intuition and knowledge of designers who have many years of experience working with similar designs. Designers use this experience to sample a few promising candidates in the design space and evaluate or simulate them using detailed, typically slow multiphysics models. The goal in design is usually to generate a diverse set of high-performing design configurations that allow trade-offs across different objectives and avoid early concretization. In this paper, we develop a machine learning approach to automate physical system design. We use deep generative models to learn a manifold of the valid design space, followed by Hamiltonian Monte Carlo (HMC) with simulated annealing to explore and optimize design over the learned manifold, producing a diverse set of optimal designs. Our approach is akin to partial simulated annealing restricted to the learned design manifold, where the annealing schedule is varied to trade-off different objectives. To prevent our approach from traversing off the design manifold and proposing unreliable designs, we leverage Monte Carlo dropout as a way to detect and avoid design configurations where the learned model cannot be trusted. We demonstrate the efficacy of our proposed approach using several case studies that include the design of an SAE race vehicle, propeller, and air vehicle. Across these case studies, we successfully show how our method generates high-performing and diverse designs. "}}
{"id": "vhjsBtq9OxO", "cdate": 1629417963923, "mdate": null, "content": {"title": "HumBugDB: A Large-scale Acoustic Mosquito Dataset", "abstract": "This paper presents the first large-scale multi-species dataset of acoustic recordings of mosquitoes tracked continuously in free flight. We present 20 hours of audio recordings that we have expertly labelled and tagged precisely in time. Significantly, 18 hours of recordings contain annotations from 36 different species. Mosquitoes are well-known carriers of diseases such as malaria, dengue and yellow fever. Collecting this dataset is motivated by the need to assist applications which utilise mosquito acoustics to conduct surveys to help predict outbreaks and inform intervention policy. The task of detecting mosquitoes from the sound of their wingbeats is challenging due to the difficulty in collecting recordings from realistic scenarios. To address this, as part of the HumBug project, we conducted global experiments to record mosquitoes ranging from those bred in culture cages to mosquitoes captured in the wild. Consequently, the audio recordings vary in signal-to-noise ratio and contain a broad range of indoor and outdoor background environments from Tanzania, Thailand, Kenya, the USA and the UK. In this paper we describe in detail how we collected, labelled and curated the data.  The data is provided from a PostgreSQL database, which captures important metadata such as the capture method, age, feeding status and gender of the mosquitoes. Additionally, we provide code to extract features and train Bayesian convolutional neural networks for two key tasks: the identification of mosquitoes from their corresponding background environments, and the classification of detected mosquitoes into species. Our extensive dataset is both challenging to machine learning researchers focusing on acoustic identification, and critical to entomologists, geo-spatial modellers and other domain experts to understand mosquito behaviour, model their distribution, and manage the threat they pose to humans."}}
{"id": "FNUijta5T-1", "cdate": 1623024971785, "mdate": null, "content": {"title": "HumBugDB: a large-scale acoustic mosquito dataset", "abstract": "This paper presents the first large-scale multi-species dataset of acoustic recordings of mosquitoes tracked continuously in free flight. Mosquitoes are well-known carriers of diseases such as malaria, dengue and yellow fever. The motivation for collecting such a large dataset comes from the need to gather information, help predict outbreaks, and inform data-driven policy. The task of detecting mosquitoes from their wingbeats is made challenging due to the difficulty in collecting recordings from realistic scenarios. To address this, as part of the HumBug project, we have conducted global experiments  to record mosquitoes ranging from those bred indoors in culture cages to mosquitoes captured in the wild. As a result, the audio recordings vary widely in signal-to-noise ratio and contain a broad range of indoor and outdoor background environments from Tanzania, Thailand, Kenya, the USA and the UK. The audio recordings have been labelled by domain experts, aided by Bayesian neural networks. As a result, we present 20 hours of mosquito audio recordings expertly labelled with tags precise in time, of which 18 hours are annotated from 36 different species. We provide our data from a regularly maintained database, which captures important metadata such as the capture method, age, feeding status and gender of the mosquitoes. Additionally, we provide code to extract features and train Bayesian convolutional neural networks that can distinguish mosquito sounds from their corresponding background. Our contribution is to provide a dataset that is both challenging to machine learning researchers focusing on acoustic identification, and critical to entomologists, geo-spatial modellers and other domain experts to understand mosquito behaviour, model their distribution, and manage the threat they pose to humans."}}
{"id": "SkbgdEZOZr", "cdate": 1514764800000, "mdate": null, "content": {"title": "Identifying Sources and Sinks in the Presence of Multiple Agents with Gaussian Process Vector Calculus", "abstract": "In systems of multiple agents, identifying the cause of observed agent dynamics is challenging. Often, these agents operate in diverse, non-stationary environments, where models rely on hand-crafted environment-specific features to infer influential regions in the system's surroundings. To overcome the limitations of these inflexible models, we present GP-LAPLACE, a technique for locating sources and sinks from trajectories in time-varying fields. Using Gaussian processes, we jointly infer a spatio-temporal vector field, as well as canonical vector calculus operations on that field. Notably, we do this from only agent trajectories without requiring knowledge of the environment, and also obtain a metric for denoting the significance of inferred causal features in the environment by exploiting our probabilistic method. To evaluate our approach, we apply it to both synthetic and real-world GPS data, demonstrating the applicability of our technique in the presence of multiple agents, as well as its superiority over existing methods."}}
