{"id": "Z5IhldwKjTe", "cdate": 1672531200000, "mdate": 1682414820724, "content": {"title": "Weakly Supervised Knowledge Transfer with Probabilistic Logical Reasoning for Object Detection", "abstract": "Training object detection models usually requires instance-level annotations, such as the positions and labels of all objects present in each image. Such supervision is unfortunately not always available and, more often, only image-level information is provided, also known as weak supervision. Recent works have addressed this limitation by leveraging knowledge from a richly annotated domain. However, the scope of weak supervision supported by these approaches has been very restrictive, preventing them to use all available information. In this work, we propose ProbKT, a framework based on probabilistic logical reasoning that allows to train object detection models with arbitrary types of weak supervision. We empirically show on different datasets that using all available information is beneficial as our ProbKT leads to significant improvement on target domain and better generalization compared to existing baselines. We also showcase the ability of our approach to handle complex logic statements as supervision signal."}}
{"id": "4yqxDCbzS98", "cdate": 1663850122741, "mdate": null, "content": {"title": "Weakly Supervised Knowledge Transfer with Probabilistic Logical Reasoning for Object Detection", "abstract": "Training object detection models usually requires instance-level annotations, such as the positions and labels of all objects present in each image. Such supervision is unfortunately not always available and, more often, only image-level information is provided, also known as weak supervision. \nRecent works have addressed this limitation by leveraging knowledge from a richly annotated domain. However, the scope of weak supervision supported by these approaches has been very restrictive, preventing them to use all available information. In this work, we propose ProbKT, a framework based on probabilistic logical reasoning to train object detection models with arbitrary types of weak supervision. We empirically show on different datasets that using all available information is beneficial as our ProbKT leads to significant improvement on target domain and better generalisation compared to existing baselines. We also showcase the ability of our approach to handle complex logic statements as supervision signal."}}
{"id": "lR5cYRMWpJ", "cdate": 1640995200000, "mdate": 1682414820917, "content": {"title": "SparseChem: Fast and accurate machine learning model for small molecules", "abstract": "SparseChem provides fast and accurate machine learning models for biochemical applications. Especially, the package supports very high-dimensional sparse inputs, e.g., millions of features and millions of compounds. It is possible to train classification, regression and censored regression models, or combination of them from command line. Additionally, the library can be accessed directly from Python. Source code and documentation is freely available under MIT License on GitHub."}}
{"id": "byMmqkr6Lkz", "cdate": 1640995200000, "mdate": 1682414820776, "content": {"title": "Industry-Scale Orchestrated Federated Learning for Drug Discovery", "abstract": "To apply federated learning to drug discovery we developed a novel platform in the context of European Innovative Medicines Initiative (IMI) project MELLODDY (grant n{\\deg}831472), which was comprised of 10 pharmaceutical companies, academic research labs, large industrial companies and startups. The MELLODDY platform was the first industry-scale platform to enable the creation of a global federated model for drug discovery without sharing the confidential data sets of the individual partners. The federated model was trained on the platform by aggregating the gradients of all contributing partners in a cryptographic, secure way following each training iteration. The platform was deployed on an Amazon Web Services (AWS) multi-account architecture running Kubernetes clusters in private subnets. Organisationally, the roles of the different partners were codified as different rights and permissions on the platform and administrated in a decentralized way. The MELLODDY platform generated new scientific discoveries which are described in a companion paper."}}
{"id": "Bn5ARZA68Q", "cdate": 1640995200000, "mdate": 1683879494592, "content": {"title": "Collaborative Drug Discovery: Inference-level Data Protection Perspective", "abstract": "Pharmaceutical industry can better leverage its data assets to virtualize drug discovery through a collaborative machine learning platform. On the other hand, there are non-negligible risks stemming from the unintended leakage of participants' training data, hence, it is essential for such a platform to be secure and privacy-preserving. This paper describes a privacy risk assessment for collaborative modeling in the preclinical phase of drug discovery to accelerate the selection of promising drug candidates. After a short taxonomy of state-of-the-art inference attacks we adopt and customize several to the underlying scenario. Finally we describe and experiments with a handful of relevant privacy protection techniques to mitigate such attacks."}}
{"id": "-Txubr3W_PR", "cdate": 1640995200000, "mdate": 1682414820992, "content": {"title": "Collaborative Drug Discovery: Inference-level Data Protection Perspective", "abstract": ""}}
{"id": "av0s7zxiclx", "cdate": 1620341580738, "mdate": null, "content": {"title": "GRU-ODE-Bayes: Continuous modeling of sporadically-observed time series", "abstract": "Modeling real-world multidimensional time series can be particularly challenging when these are sporadically observed (i.e., sampling is irregular both in time and across dimensions)-such as in the case of clinical patient data. To address these challenges, we propose (1) a continuous-time version of the Gated Recurrent Unit, building upon the recent Neural Ordinary Differential Equations (Chen et al., 2018), and (2) a Bayesian update network that processes the sporadic observations. We bring these two ideas together in our GRU-ODE-Bayes method. We then demonstrate that the proposed method encodes a continuity prior for the latent process and that it can exactly represent the Fokker-Planck dynamics of complex processes driven by a multidimensional stochastic differential equation. Additionally, empirical evaluation shows that our method outperforms the state of the art on both synthetic data and real-world data with applications in healthcare and climate forecast. What is more, the continuity prior is shown to be well suited for low number of samples settings.\n"}}
{"id": "oWrp2ldjb3", "cdate": 1609459200000, "mdate": 1682414820799, "content": {"title": "Self-labeling of Fully Mediating Representations by Graph Alignment", "abstract": "To be able to predict a molecular graph structure (W) given a 2D image of a chemical compound (U) is a challenging problem in machine learning. We are interested to learn $$f: U \\rightarrow W$$ where we have a fully mediating representation V such that f factors into $$U \\rightarrow V \\rightarrow W$$ . However, observing V requires detailed and expensive labels. We propose graph aligning approach that generates rich or detailed labels given normal labels W. In this paper we investigate the scenario of domain adaptation from the source domain where we have access to the expensive labels V to the target domain where only normal labels W are available. Focusing on the problem of predicting chemical compound graphs from 2D images the fully mediating layer is represented using the planar embedding of the chemical graph structure we are predicting. The empirical results show that, using only 4000 data points, we obtain up to 4x improvement of performance after domain adaptation to target domain compared to pretrained model only on the source domain. After domain adaptation, the model is even able to detect atom types that were never observed in the original source domain. Finally, on the Maybridge data set the proposed self-labeling approach reached higher performance than the current state of the art."}}
{"id": "d_pYDDLuc3", "cdate": 1609459200000, "mdate": 1682414820773, "content": {"title": "Expressive Graph Informer Networks", "abstract": "Applying machine learning to molecules is challenging because of their natural representation as graphs rather than vectors. Several architectures have been recently proposed for deep learning from molecular graphs, but they suffer from information bottlenecks because they only pass information from a graph node to its direct neighbors. Here, we introduce a more expressive route-based multi-attention mechanism that incorporates features from routes between node pairs. We call the resulting method Graph Informer. A single network layer can therefore attend to nodes several steps away. We show empirically that the proposed method compares favorably against existing approaches in two prediction tasks: (1) 13C Nuclear Magnetic Resonance (NMR) spectra, improving the state-of-the-art with an MAE of 1.35 ppm and (2) predicting drug bioactivity and toxicity. Additionally, we develop a variant called injective Graph Informer that is provably more powerful than the Weisfeiler-Lehman test for graph isomorphism. We demonstrate that the route information allows the method to be informed about the non-local topology of the graph and, thus, it goes beyond the capabilities of the Weisfeiler-Lehman test. Our code is available at github.com/jaak-s/graphinformer ."}}
{"id": "Tz6QQHvJfw0", "cdate": 1609459200000, "mdate": 1682414820747, "content": {"title": "A novel method for data fusion over entity-relation graphs and its application to protein-protein interaction prediction", "abstract": "Modern bioinformatics is facing increasingly complex problems to solve, and we are indeed rapidly approaching an era in which the ability to seamlessly integrate heterogeneous sources of information will be crucial for the scientific progress. Here, we present a novel non-linear data fusion framework that generalizes the conventional matrix factorization paradigm allowing inference over arbitrary entity-relation graphs, and we applied it to the prediction of protein–protein interactions (PPIs). Improving our knowledge of PPI networks at the proteome scale is indeed crucial to understand protein function, physiological and disease states and cell life in general."}}
