{"id": "H5LUOwUoql5", "cdate": 1646077536484, "mdate": null, "content": {"title": "Decision-Theoretic Planning with Communication in Open Multiagent Systems", "abstract": "In open multiagent systems, the set of agents operating in the environment changes over time and in ways that are nontrivial to predict. For example, if collaborative robots were tasked with fighting wildfires, they may run out of suppressants and be temporarily unavailable to assist their peers. Because an agent's optimal action depends on the actions of others, each agent must not only predict the actions of its peers, but, before that, reason whether they are even present to perform an action.  Addressing openness thus requires agents to model each other’s presence, which can be enhanced through agents communicating about their presence in the environment.  At the same time, communicative acts can also incur costs (e.g., consuming limited bandwidth), and thus an agent must tradeoff the benefits of enhanced coordination with the costs of communication.  We present a new principled, decision-theoretic method in the context provided by the recent communicative interactive POMDP framework for planning in open agent settings that balances this tradeoff. Simulations of multiagent wildfire suppression problems demonstrate how communication can improve planning in open agent environments, as well as how agents tradeoff the benefits and costs of communication under different scenarios."}}
{"id": "x4ZIxgOAqd", "cdate": 1640995200000, "mdate": 1682426708128, "content": {"title": "An Algorithmic Introduction to Savings Circles", "abstract": "Rotating savings and credit associations (roscas) are informal financial organizations common in settings where communities have reduced access to formal financial institutions. In a rosca, a fixed group of participants regularly contribute sums of money to a pot. This pot is then allocated periodically using lottery, aftermarket, or auction mechanisms. Roscas are empirically well-studied in economics. They are, however, challenging to study theoretically due to their dynamic nature. Typical economic analyses of roscas stop at coarse ordinal welfare comparisons to other credit allocation mechanisms, leaving much of roscas' ubiquity unexplained. In this work, we take an algorithmic perspective on the study of roscas. Building on techniques from the price of anarchy literature, we present worst-case welfare approximation guarantees. We further experimentally compare the welfare of outcomes as key features of the environment vary. These cardinal welfare analyses further rationalize the prevalence of roscas. We conclude by discussing several other promising avenues."}}
{"id": "wbKsLcBqguT", "cdate": 1640995200000, "mdate": 1682426708124, "content": {"title": "Decision-theoretic planning with communication in open multiagent systems", "abstract": "In open multiagent systems, the set of agents operating in the environment changes over time and in ways that are nontrivial to predict. For example, if collaborative robots were tasked with fighti..."}}
{"id": "M-3_WNpw-P", "cdate": 1640995200000, "mdate": 1682426708112, "content": {"title": "Sweet tweets! Evaluating a new approach for probability-based sampling of Twitter", "abstract": "As survey costs continue to rise and response rates decline, researchers are seeking more cost-effective ways to collect, analyze and process social and public opinion data. These issues have created an opportunity and interest in expanding the fit-for-purpose paradigm to include alternate sources such as passively collected sensor data and social media data. However, methods for accessing, sourcing and sampling social media data are just now being developed. In fact, there has been a small but growing body of literature focusing on comparing different Twitter data access methods through either the elaborate firehose or the free Twitter search or streaming APIs. Missing from the literature is a good understanding of how to randomly sample Tweets to produce datasets that are representative of the daily discourse, especially within geographical regions of interest, without requiring a census of all Tweets. This understanding is necessary for producing quality estimates of public opinion from social media sources such as Twitter. To address this gap, we propose and test the Velocity-Based Estimation for Sampling Tweets (VBEST) algorithm for selecting a probability based sample of tweets. We compare the performance of VBEST sample estimates to other methods of accessing Twitter through the Search API on the distribution of total Tweets as well as COVID-19 keyword incidence and frequency and find that the VBEST samples produce consistent and relatively low levels of overall bias compared to common methods of access through the Search API across many experimental conditions."}}
{"id": "77f-RaNa9CIo", "cdate": 1640995200000, "mdate": 1652763310090, "content": {"title": "An Algorithmic Introduction to Savings Circles", "abstract": "Rotating savings and credit associations (roscas) are informal financial organizations common in settings where communities have reduced access to formal financial institutions. In a rosca, a fixed group of participants regularly contribute sums of money to a pot. This pot is then allocated periodically using lottery, aftermarket, or auction mechanisms. Roscas are empirically well-studied in economics. They are, however, challenging to study theoretically due to their dynamic nature. Typical economic analyses of roscas stop at coarse ordinal welfare comparisons to other credit allocation mechanisms, leaving much of roscas' ubiquity unexplained. In this work, we take an algorithmic perspective on the study of roscas. Building on techniques from the price of anarchy literature, we present worst-case welfare approximation guarantees. We further experimentally compare the welfare of outcomes as key features of the environment vary. These cardinal welfare analyses further rationalize the prevalence of roscas. We conclude by discussing several other promising avenues."}}
{"id": "Xxbrm2SxIAr", "cdate": 1577836800000, "mdate": null, "content": {"title": "Scalable Decision-Theoretic Planning in Open and Typed Multiagent Systems", "abstract": "In open agent systems, the set of agents that are cooperating or competing changes over time and in ways that are nontrivial to predict. For example, if collaborative robots were tasked with fighting wildfires, they may run out of suppressants and be temporarily unavailable to assist their peers. We consider the problem of planning in these contexts with the additional challenges that the agents are unable to communicate with each other and that there are many of them. Because an agent's optimal action depends on the actions of others, each agent must not only predict the actions of its peers, but, before that, reason whether they are even present to perform an action. Addressing openness thus requires agents to model each other's presence, which becomes computationally intractable with high numbers of agents. We present a novel, principled, and scalable method in this context that enables an agent to reason about others' presence in its shared environment and their actions. Our method extrapolates models of a few peers to the overall behavior of the many-agent system, and combines it with a generalization of Monte Carlo tree search to perform individual agent reasoning in many-agent open environments. Theoretical analyses establish the number of agents to model in order to achieve acceptable worst case bounds on extrapolation error, as well as regret bounds on the agent's utility from modeling only some neighbors. Simulations of multiagent wildfire suppression problems demonstrate our approach's efficacy compared with alternative baselines."}}
{"id": "LNOcfMuseG4", "cdate": 1546300800000, "mdate": null, "content": {"title": "Scalable Decision-Theoretic Planning in Open and Typed Multiagent Systems", "abstract": "In open agent systems, the set of agents that are cooperating or competing changes over time and in ways that are nontrivial to predict. For example, if collaborative robots were tasked with fighting wildfires, they may run out of suppressants and be temporarily unavailable to assist their peers. We consider the problem of planning in these contexts with the additional challenges that the agents are unable to communicate with each other and that there are many of them. Because an agent's optimal action depends on the actions of others, each agent must not only predict the actions of its peers, but, before that, reason whether they are even present to perform an action. Addressing openness thus requires agents to model each other's presence, which becomes computationally intractable with high numbers of agents. We present a novel, principled, and scalable method in this context that enables an agent to reason about others' presence in its shared environment and their actions. Our method extrapolates models of a few peers to the overall behavior of the many-agent system, and combines it with a generalization of Monte Carlo tree search to perform individual agent reasoning in many-agent open environments. Theoretical analyses establish the number of agents to model in order to achieve acceptable worst case bounds on extrapolation error, as well as regret bounds on the agent's utility from modeling only some neighbors. Simulations of multiagent wildfire suppression problems demonstrate our approach's efficacy compared with alternative baselines."}}
{"id": "wkK-dt4KcOR", "cdate": 1451606400000, "mdate": null, "content": {"title": "Investigating Differences in Wiki-based Collaborative Activities between Student Engagement Profiles in CS1", "abstract": "Introductory computer science courses are being increasingly taught using technology-mediated instruction and e-learning environments. The software and technology in such courses could benefit from the use of student models to inform and guide customized support tailored to the needs of individual students. In this paper, we investigate how student motivated engagement profiles developed in educational research can be used as such models to predict student behaviors. These models are advantageous over those learned directly from observing individual students, as they rely on different data that can be available a priori before students use the technology. Using tracked behaviors of 249 students from 7 CS1 courses over the span of 3 semesters, we discover that students with different engagement profiles indeed behave differently in an online, wiki-based CSCL system while performing collaborative creative thinking exercises, and the differences between students are primarily as expected based on the differences in the profiles. Thus, such profiles could be useful as student models for providing customized support in e-learning environments in CS1 courses."}}
{"id": "lD1bK8gjSA7", "cdate": 1451606400000, "mdate": null, "content": {"title": "Individual Planning in Open and Typed Agent Systems", "abstract": ""}}
{"id": "l9tWJmXrF-f", "cdate": 1451606400000, "mdate": null, "content": {"title": "Collaborative Human Task Assignment for Open Systems: (Extended Abstract)", "abstract": "Through gathering information, acting autonomously, learning, and behaving socially, intelligent agents provide useful interfaces between complex systems and human users. For example, agents can interact with people to discover their preferences, skills, and expertise, then find suitable tasks that exploit the users' abilities. We describe modeling environmental openness and human learning in a multiagent system for a human collaborative task assignment problem."}}
