{"id": "te6LiYZtf7M", "cdate": 1577836800000, "mdate": 1631642059418, "content": {"title": "Goal-conditioned Batch Reinforcement Learning for Rotation Invariant Locomotion", "abstract": "We propose a novel approach to learn goal-conditioned policies for locomotion in a batch RL setting. The batch data is collected by a policy that is not goal-conditioned. For the locomotion task, this translates to data collection using a policy learnt by the agent for walking straight in one direction, and using that data to learn a goal-conditioned policy that enables the agent to walk in any direction. The data collection policy used should be invariant to the direction the agent is facing i.e. regardless of its initial orientation, the agent should take the same actions to walk forward. We exploit this property to learn a goal-conditioned policy using two key ideas: (1) augmenting data by generating trajectories with the same actions in different directions, and (2) learning an encoder that enforces invariance between these rotated trajectories with a Siamese framework. We show that our approach outperforms existing RL algorithms on 3-D locomotion agents like Ant, Humanoid and Minitaur."}}
{"id": "UxIh0_DZtXS", "cdate": 1577836800000, "mdate": null, "content": {"title": "Provably Efficient Model-based Policy Adaptation", "abstract": "The high sample complexity of reinforcement learning challenges its use in practice. A promising approach is to quickly adapt pre-trained policies to new environments. Existing methods for this policy adaptation problem typically rely on domain randomization and meta-learning, by sampling from some distribution of target environments during pre-training, and thus face difficulty on out-of-distribution target environments. We propose new model-based mechanisms that are able to make online adaptation in unseen target environments, by combining ideas from no-regret online learning and adaptive control. We prove that the approach learns policies in the target environment that can quickly recover trajectories from the source environment, and establish the rate of convergence in general settings. We demonstrate the benefits of our approach for policy adaptation in a diverse set of continuous control tasks, achieving the performance of state-of-the-art methods with much lower sample complexity."}}
{"id": "HylloR4YDr", "cdate": 1569439384092, "mdate": null, "content": {"title": "Learning Latent Representations for Inverse Dynamics using Generalized Experiences", "abstract": "Many practical robot locomotion tasks require agents to use control policies that can be parameterized by goals. Popular deep reinforcement learning approaches in this direction involve learning goal-conditioned policies or value functions, or Inverse Dynamics Models (IDMs). IDMs map an agent’s current state and desired goal to the required actions. We show that the key to achieving good performance with IDMs lies in learning the information shared between equivalent experiences, so that they can be generalized to unseen scenarios. We design a training process that guides the learning of latent representations to encode this shared information. Using a limited number of environment interactions, our agent is able to efficiently navigate to arbitrary points in the goal space. We demonstrate the effectiveness of our approach in high-dimensional locomotion environments such as the Mujoco Ant, PyBullet Humanoid, and PyBullet Minitaur. We provide quantitative and qualitative results to show that our method clearly outperforms competing baseline approaches."}}
{"id": "oZN9yDO-laX", "cdate": 1514764800000, "mdate": 1631642059443, "content": {"title": "Eye tracking in naturalistic badminton play: comparing visual gaze pattern strategy in world-rank and amateur player", "abstract": "A professional player's expertise rests on the ability to predict action by optimally extracting the opponent's postural cues. Eye tracking (head-mounted system) data in a naturalistic singles badminton play was collected from one professional world-ranked player facing five amateur players (10 serves or 50 trials) and two amateurs playing against four other amateur players each (10 serves or 80 trials). The visual gaze on the opponent body, segregated into 3 areas-of-interest covering the feet, face/torso, and hand/racket of the opponent and the shuttle, was analysed for a) the period just before the serve, b) while receiving the serve and c) the entire rally. The comparative analysis shows the first area-of-interest for professional player as the opponent's feet while executing the serve and the hand/racket when receiving a serve. On the other hand, the amateur players show no particular strategy of fixation location either for the serve task or while facing a serve. The average fixation duration (just before serve) for the professional was 0.96s and for the amateurs it was 1.48s. The findings highlight the differences in the postural cue considered important and the preparatory time in professional and amateur players. We believe, analytical models from dynamic gaze behavior in naturalistic game conditions as applied in this study can be used for enhancing perceptual-cognitive skills during training."}}
{"id": "XEgZAwlsWu", "cdate": 1451606400000, "mdate": 1631642059437, "content": {"title": "How Does a Program Run? A Visual Model Based on Annotating Abstract Syntax Trees", "abstract": "How does a program run? A correct mental model relies on an approach that uses rewriting of programs into canonical forms or juggling with variables, assignment statements and stacks. The rewriting process is, however, quite cumbersome, and the stack method inadequate for understanding functional programming because of the presence of closures. For the last several years, we have been experimenting with a diagrammatic way of teaching how functional and imperative programs run. Programs are drawn as abstract syntax trees and evaluation is explained as an annotation of the tree. Evaluation may also include replicating parts of a tree (e.g., when doing a function call). Each programming language defines a particular evaluation model, and each evaluation model entails a particular way of annotating the tree. Using this method, we have taught many standard topics in the Principles of Programming Languages course: lexical scope, closures, recursion, parameter passing, variable assignment, and continuations. The annotation framework turns out to be an excellent preparation for students attempting to write full-blown interpreters, as done in several popular text books on programming languages. In this paper, we introduce this method of understanding how programming languages run and also report experimental results of using it in a class of approximately 200 students during the last year."}}
{"id": "pfkjOI0ozrx", "cdate": 1420070400000, "mdate": 1631642059442, "content": {"title": "Generation of Quizzes and Solutions Based on Ontologies - A Case for a Music Problem Generator", "abstract": "Generation of problem sets and quizzes forms an important part of education technologies. Although some systems have been built for quiz generation, they mostly focus on abstract logic and mathematical constructs. Knowledge in other domains is relational rather than propositional, and many systems use dedicated knowledge databases. We present a method to present this knowledge in the form of objective question sets and drills. We implement a four-fold approach - ontologies, propositional logic, similarity finding, and hierarchies - as a way to generate quizzes as well as to solve human generated problems of a similar nature. The architecture of this system is such that any knowledgebase can be turned into a vast number of diverse, complex questions. We build this system for an ontology of North Indian Ragas, and also test it on a smaller ontology of animals. We demonstrate an approach to solving human generated questions from the Ontology, and provide a possible sample space of questions that can be generated through this method."}}
{"id": "105OVLiWAeT", "cdate": 1420070400000, "mdate": 1631642059434, "content": {"title": "Decoding (un)Known Opponent's Game Play, a Real-Life Badminton Eye Tracking Study", "abstract": ""}}
