{"id": "H24vpqDnl6", "cdate": 1683882617272, "mdate": null, "content": {"title": "A regularity augmented evolutionary algorithm with dual-space search for multiobjective optimization", "abstract": "The well-known regularity property allows the Pareto optimal solutions of a multiobjective optimization problem (MOP) to be embedded in some latent spaces by the manifold structure of the Pareto optimal set. This paper proposes an efficient regularity augmented evolutionary algorithm (RAEA) for multiobjective optimization, which aims to adopt such latent spaces for use with offspring generations. In this algorithm, a singular value decomposition method is adopted at each iteration to extract such latent space from the population with the regularity property. The enhancements of regularity in RAEA include: (1) an acceleration of convergence by incrementally projecting the dominated solutions into the latent space built with elite solutions (i.e., the non-dominated solutions); and (2) a novel dual-space search strategy (DSS) is developed for the generation of promising offspring solutions by searching in both latent and decision space. The developed algorithm was empirically compared with five well-known multiobjective evolutionary algorithms on several complicated MOP test suites. Experimental results suggest that RAEA outperforms the compared algorithms on these test instances in terms of two commonly-used indicators. Both the effectiveness of the convergence acceleration scheme and the developed dual-space searching strategy are also validated."}}
{"id": "3C9Eqd0hCrr", "cdate": 1663850458038, "mdate": null, "content": {"title": "Beyond Deep Learning: An Evolutionary Feature Engineering Approach to Tabular Data Classification", "abstract": "In recent years, deep learning has achieved impressive performance in the computer vision and natural language processing domains. In the tabular data classification scenario, with the emergence of the transformer architecture, a number of algorithms have been reported to yield better results than conventional tree-based models. Most of these methods attribute the success of deep learning methods to the expressive feature construction capability of neural networks. Nonetheless, in real practice, manually designed high-order features with traditional machine learning methods are still widely used because neural-network-based features can be easy to over-fitting. In this paper, we propose an evolution-based feature engineering algorithm to imitate the manual feature construction process through trial and improvement. Importantly, the evolutionary method provides an opportunity to optimize cross-validation loss, where gradient methods fail to do so. On a large-scale classification benchmark of 119 datasets, the experimental results demonstrate that the proposed method outperforms existing fine-tuned state-of-the-art tree-based and deep-learning-based classification algorithms."}}
{"id": "UifByHdLmmf", "cdate": 1663850215128, "mdate": null, "content": {"title": "Unlearning with Fisher Masking", "abstract": "Machine unlearning aims to revoke some training data after learning in response to requests from users, model developers, and administrators. Most previous methods are based on direct fine tuning, which may neither remove data completely nor retain full performances on the remain data. In this work, we find that, by first masking some important parameters before fine tuning, the performances of unlearning could be significantly improved. We propose a new masking strategy tailored to unlearning based on Fisher information. Experiments on various datasets and network structures show the effectiveness of the method: without any fine tuning, the proposed Fisher masking could unlearn almost completely while maintaining most of the performance on the remain data. It also exhibits stronger stability comparing with other unlearning baselines."}}
{"id": "XdOMXSAvu-B", "cdate": 1601178118434, "mdate": null, "content": {"title": "A Scalable Indicator-Based Evolutionary Algorithm for Large-Scale Multiobjective Optimization", "abstract": "The performance of traditional multiobjective evolutionary algorithms (MOEAs) often deteriorates rapidly as the number of decision variables increases. While some efforts were made to design new algorithms by adapting existing techniques to large-scale single-objective optimization to the MOEA context, the specific difficulties that may arise from large-scale multiobjective optimization have rarely been studied. In this paper, the exclusive challenges along with the increase of the number of variables of a multiobjective optimization problem (MOP) are examined empirically, and the popular benchmarks are categorized into three groups accordingly. Problems in the first category only require MOEAs to have stronger convergence, and can thus be mitigated using techniques employed in large-scale single-objective optimization. Problems that require MOEAs to have stronger diversification but ignore a correlation between position and distance functions are grouped as the second. The rest of the problems that pose a great challenge to the balance between diversification and convergence by considering a correlation between position and distance functions are grouped as the third. While existing large-scale MOEAs perform well on the problems in the first two categories, they suffer a significant loss when applied to those in the third category. To solve large-scale MOPs in this category, we have developed a novel indicator-based algorithm with an enhanced diversification mechanism."}}
{"id": "rQYEugGgO6r", "cdate": 1546300800000, "mdate": null, "content": {"title": "Fuzzy-Classification Assisted Solution Preselection in Evolutionary Optimization.", "abstract": "In evolutionary optimization, the preselection is an efficient operator to improve the search efficiency, which aims to filter unpromising candidate solutions before fitness evaluation. Most existing preselection operators rely on fitness values, surrogate models, or classification models. Basically, the classification based preselection regards the preselection as a classification procedure, i.e., differentiating promising and unpromising candidate solutions. However, the difference between promising and unpromising classes becomes fuzzy as the running process goes on, as all the left solutions are likely to be promising ones. Facing this challenge, this paper proposes a fuzzy classification based preselection (FCPS) scheme, which utilizes the membership function to measure the quality of candidate solutions. The proposed FCPS scheme is applied to two state-of-the-art evolutionary algorithms on a test suite. The experimental results show the potential of FCPS on improving algorithm performance."}}
