{"id": "XZCDc5PAirf", "cdate": 1640995200000, "mdate": 1655389141121, "content": {"title": "Air-Water Communication and Sensing with Light", "abstract": "The ability to communicate and sense across the air-water boundary is essential for efficient exploration and monitoring of the underwater world. Existing wireless solutions for communication and sensing typically focus on a single physical medium and fall short in achieving high-bandwidth communication and accurate sensing across the air-water interface without any relays on the water surface. We study the use of laser light in this context given its ability to effectively pass the air-water boundary. We present a holistic system framework to address practical challenges such as ambient light interference and environmental dynamics. The proposed AmphiLight framework achieves 5 Mbps bi-directional throughput and zero bit error rate with ranges up to 6.1 m in strong ambient light conditions, and connection time improvements between 47.1 % and 29.5% during wave dynamics. Our ongoing effort extends to realizing robust air-water sensing that enables aerial drones to track multiple underwater robots for topology planning and coordination."}}
{"id": "EYAx7pRN4po", "cdate": 1640995200000, "mdate": 1655389141119, "content": {"title": "Editorial: Navigation and Perception for Autonomous Surface Vessels", "abstract": "To generalize obstacle avoidance from ground mobile robots to marine vehicles and to bridge the gap between simulation and reality, \"Robust ASV Navigation Through Ground to Water Cross-Domain Deep Reinforcement Learning\" (Lambert et al, 2021) proposes a navigation method based on a deep reinforcement learning framework for high-level control, integrated with low-level controllers specific to the vehicle. The paper demonstrates the cross-domain generalizability of the proposed method by training a Deep Q Network for a simulated Autonomous Ground Vehicle (AGV) with navigation tasks. It then successfully implements and tests the proposed DRL method on a real AGV as well as an Autonomous Surface Vehicle (ASV) in different scenarios without any re-training. While the paper can be expanded to handle more complex scenarios, e.g., with dynamic obstacles, the paper provides a good methodology for training reinforcement-learning based approaches in domains that are comparatively easier and lower cost for deployments compared to challenging target domains, as the marine one.Deep RL are not the only techniques that can be used for autonomous navigation. The complexity of the issue requires a deep study of the field. Indeed, collision avoidance and safe navigation in environments where other crewed or uncrewed ships sail, are perhaps the biggest challenges for safe operation of autonomous surface vessels. In particular, the coexistence with other crewed ships require that autonomous ve..."}}
{"id": "OAoCJMEStAC", "cdate": 1609459200000, "mdate": 1655389141120, "content": {"title": "Efficient LiDAR-based In-water Obstacle Detection and Segmentation by Autonomous Surface Vehicles in Aquatic Environments", "abstract": "Identifying in-water obstacles is fundamental for safe navigation of Autonomous Surface Vehicles (ASVs). This paper presents a model-free method for segmenting individual in-water objects (e.g., swimmers, buoys, boats) and shorelines from LiDAR sensor data. To reduce the computational requirement, our method first converts the 3D point cloud into a 2D spherical projection image. Then, an algorithm based on the integration of a breadth-first search and a variant of a hierarchical agglomerative clustering segments the points according to different objects. Our method addresses the sparsity and instability of the point cloud in the aquatic domain – a characteristic that makes the methods developed for self-driving cars not directly applicable for in-water obstacle segmentation, as demonstrated in our experiments. Our method is compared with other state-of-the-art approaches and is validated both in simulation and in real-world ASV deployments, with different objects and encountering scenarios. The proposed method is effective in segmenting in-water obstacles not known a priori, in real-time, outperforming other state-of-the art methods."}}
{"id": "L9RNoH6vkGv", "cdate": 1609459200000, "mdate": 1655389141119, "content": {"title": "Droplet: Towards Autonomous Underwater Assembly of Modular Structures", "abstract": ""}}
{"id": "I9NcDoyYRmn", "cdate": 1609459200000, "mdate": 1655389141121, "content": {"title": "GVGExp: Communication-Constrained Multi-Robot Exploration System based on Generalized Voronoi Graphs", "abstract": "This paper presents GVGExp, a recurrent-connectivity exploration strategy for multi-robot systems to discover unknown environments under communication-constrained conditions. A robust multi-robot exploration strategy with communication constraints is important to accomplish several applications, e.g., underwater or planetary exploration. Mainstream multi-robot exploration strategies have considered unlimited communication. In addition, these strategies delegate the resolution of potential path collisions to local planners. In this paper, we explicitly focus on minimizing the number of communication events between robots given the limited bandwidth that can be available in real missions, as well as explicitly minimizing potential path interference between robots. GVGExp incrementally builds a Generalized Voronoi Graph (GVG), which is used by the robots to determine the topology of the environment. We introduce a novel property of the GVG called gate to identify a region (subtree) that is uniquely assigned to each robot, with no overlap, thus minimizing potential path interference. Whenever a robot finishes exploring a region, in a depth-first search fashion, or finds a loop connecting to other parts of the environment, the robot shares information with other robots that are in range to enable coordination. We performed numerous simulations to evaluate our proposed strategy and compared it with other state-of-the-art methods. Experimental results show that GVGExp is able to explore the environments in a relatively short amount of time, significantly reducing communication events and path interference."}}
{"id": "3tfDL8VnS1R", "cdate": 1609459200000, "mdate": 1655389141120, "content": {"title": "Falling Into Place: Drop Assembly of Interlocking Puzzles", "abstract": ""}}
{"id": "pavFT_qySv8", "cdate": 1577836800000, "mdate": null, "content": {"title": "AmphiLight: Direct Air-Water Communication with Laser Light", "abstract": ""}}
{"id": "kkyvcYPccdZ", "cdate": 1577836800000, "mdate": null, "content": {"title": "PuzzleFlex: kinematic motion of chains with loose joints", "abstract": "This paper presents a method of computing free motions of a planar assembly of rigid bodies connected by loose joints. Joints are modeled using local distance constraints, which are then linearized with respect to configuration space velocities, yielding a linear programming formulation that allows analysis of systems with thousands of rigid bodies. Potential applications include analysis of collections of modular robots, structural stability perturbation analysis, tolerance analysis for mechanical systems, and formation control of mobile robots."}}
{"id": "gPnyL8Z7iQ", "cdate": 1577836800000, "mdate": 1655389141122, "content": {"title": "AmphiLight: Direct Air-Water Communication With Laser Light", "abstract": "The underwater world is still largely unexplored yet surveying and monitoring submerged sites is fundamental for many applications, including archaeology, biology, and disaster response [1, 2, 3]. One of the challenges for underwater autonomous deployments is limited communication between assets underwater and in the air. One conventional strategy is to periodically let the underwater vehicle surface to share data [4], which is inefficient due to time not being spent on the task. Another strategy is to deploy a network of buoys at the water surface [5], connected to both the underwater assets (via acoustic transducers) and the ground station (via Wi-Fi). This deployment configuration increases the cost and logistical overhead, limiting the overall scalability of the system."}}
{"id": "earwBETM2e", "cdate": 1577836800000, "mdate": null, "content": {"title": "DeepURL: Deep Pose Estimation Framework for Underwater Relative Localization", "abstract": "In this paper, we propose a real-time deep learning approach for determining the 6D relative pose of Autonomous Underwater Vehicles (AUV) from a single image. A team of autonomous robots localizing themselves in a communication-constrained underwater environment is essential for many applications such as underwater exploration, mapping, multi-robot convoying, and other multi-robot tasks. Due to the profound difficulty of collecting ground truth images with accurate 6D poses underwater, this work utilizes rendered images from the Unreal Game Engine simulation for training. An image-to-image translation network is employed to bridge the gap between the rendered and the real images producing synthetic images for training. The proposed method predicts the 6D pose of an AUV from a single image as 2D image keypoints representing 8 corners of the 3D model of the AUV, and then the 6D pose in the camera coordinates is determined using RANSAC-based PnP. Experimental results in real-world underwater environments (swimming pool and ocean) with different cameras demonstrate the robustness and accuracy of the proposed technique in terms of translation error and orientation error over the state-of-the-art methods. The code is publicly available."}}
