{"id": "rBpvV3oYR68", "cdate": 1617662940254, "mdate": null, "content": {"title": "On the Predictive Risk in Misspecified Quantile Regression", "abstract": "In the present paper we investigate the predictive risk of possibly misspecified quantile regression functions. The in-sample risk is well-known to be an overly optimistic estimate of the predictive risk and we provide two relatively simple (asymptotic) characterizations of the associated bias, also called expected optimism. We propose estimates for the expected optimism and the predictive risk, and establish their uniform consistency under mild conditions. Our results hold for models of moderately growing size and allow the quantile function to be incorrectly specified. Empirical evidence from our estimates is encouraging as it compares favorably with cross-validation."}}
{"id": "MuAhzZ7dxs0", "cdate": 1617662790115, "mdate": null, "content": {"title": " Inference on heterogeneous quantile treatment effects via rank score balancing", "abstract": "Understanding treatment effect heterogeneity in observational studies is of great practical importance to many scientific fields because the same treatment may affect different individuals differently. Quantile regression provides a natural framework for modeling such heterogeneity. In this paper, we propose a new method for inference on heterogeneous quantile treatment effects that incorporates high-dimensional covariates. Our estimator combines a debiased ℓ1-penalized regression adjustment with a quantile-specific covariate balancing scheme. We present a comprehensive study of the theoretical properties of this estimator, including weak convergence of the heterogeneous quantile treatment effect process to the sum of two independent, centered Gaussian processes. We illustrate the finite-sample performance of our approach through Monte Carlo experiments and an empirical example, dealing with the differential effect of mothers' education on infant birth weights."}}
{"id": "Bt9XEvbpSU", "cdate": 1617662526354, "mdate": null, "content": {"title": "Bootstrapping Lp-statistics in high dimensions", "abstract": "This paper considers a new bootstrap procedure to estimate the distribution of high-dimensional ℓp-statistics, i.e. the ℓp-norms of the sum of n independent d-dimensional random vectors with d≫n and p∈[1,∞]. We provide a non-asymptotic characterization of the sampling distribution of ℓp-statistics based on Gaussian approximation and show that the bootstrap procedure is consistent in the Kolmogorov-Smirnov distance under mild conditions on the covariance structure of the data. As an application of the general theory we propose a bootstrap hypothesis test for simultaneous inference on high-dimensional mean vectors. We establish its asymptotic correctness and consistency under high-dimensional alternatives, and discuss the power of the test as well as the size of associated confidence sets. We illustrate the bootstrap and testing procedure numerically on simulated data."}}
{"id": "r1-yIdZOZB", "cdate": 1483228800000, "mdate": null, "content": {"title": "Time-dependent spatially varying graphical models, with application to brain fMRI data analysis", "abstract": "In this work, we present an additive model for space-time data that splits the data into a temporally correlated component and a spatially correlated component. We model the spatially correlated portion using a time-varying Gaussian graphical model. Under assumptions on the smoothness of changes in covariance matrices, we derive strong single sample convergence results, confirming our ability to estimate meaningful graphical structures as they evolve over time. We apply our methodology to the discovery of time-varying spatial structures in human brain fMRI signals."}}
