{"id": "REd4xzw1WB", "cdate": 1709251200000, "mdate": 1706460632577, "content": {"title": "Multiparticle Kalman filter for object localization in symmetric environments", "abstract": ""}}
{"id": "QHsQeKbFZC", "cdate": 1677628800000, "mdate": 1681763360097, "content": {"title": "Extension of Dynamic Mode Decomposition for dynamic systems with incomplete information based on t-model of optimal prediction", "abstract": ""}}
{"id": "cDIZhYHmP6", "cdate": 1672531200000, "mdate": 1681763360007, "content": {"title": "Federated Privacy-preserving Collaborative Filtering for On-Device Next App Prediction", "abstract": "In this study, we propose a novel SeqMF model to solve the problem of predicting the next app launch during mobile device usage. Although this problem can be represented as a classical collaborative filtering problem, it requires proper modification since the data are sequential, the user feedback is distributed among devices and the transmission of users' data to aggregate common patterns must be protected against leakage. According to such requirements, we modify the structure of the classical matrix factorization model and update the training procedure to sequential learning. Since the data about user experience are distributed among devices, the federated learning setup is used to train the proposed sequential matrix factorization model. One more ingredient of the proposed approach is a new privacy mechanism that guarantees the protection of the sent data from the users to the remote server. To demonstrate the efficiency of the proposed model we use publicly available mobile user behavior data. We compare our model with sequential rules and models based on the frequency of app launches. The comparison is conducted in static and dynamic environments. The static environment evaluates how our model processes sequential data compared to competitors. Therefore, the standard train-validation-test evaluation procedure is used. The dynamic environment emulates the real-world scenario, where users generate new data by running apps on devices, and evaluates our model in this case. Our experiments show that the proposed model provides comparable quality with other methods in the static environment. However, more importantly, our method achieves a better privacy-utility trade-off than competitors in the dynamic environment, which provides more accurate simulations of real-world usage."}}
{"id": "WLmPubdI5FX", "cdate": 1672531200000, "mdate": 1696188307066, "content": {"title": "Dynamic Mode Decomposition and Deep Learning for Postharvest Decay Prediction in Apples", "abstract": "The damages and diseases that may occur in apples during the storage and cannot be seen visually at early stages is a significant problem in precision agriculture leading to the loss of the lion share of crop. The difficulty of predicting postharvest degradation of apples while in storage is addressed in this article. For the prediction of postharvest decay zones, we used the dynamic mode decomposition (DMD) method in conjunction with the Mask region-based convolutional neural network (R-CNN) model based on convolutional neural networks (CNNs). For validating this idea, we have designed a small greenhouse equipped with necessary sensors and actuators for simulating storage conditions for apples. We collected a dataset which includes 552 images of apples stored under the extreme temperatures and humidity. For DMD reconstructed images demonstrating the growth dynamics of decay in apples, the proposed approach achieves 0.999 structural similarity index measure (SSIM) and 66.813 peak signal-to-noise ratio (PSNR). Mask R-CNN predicted postharvest decay zones in apples with an average precision (AP) of 83.809% and F1-score with 83.307%. The proposed method is promising for enhancing food storage and postharvest control in precision agriculture since it is based on contactless sensing with video cameras."}}
{"id": "STmnTwfPKZ", "cdate": 1672531200000, "mdate": 1706460632584, "content": {"title": "Feature-Based Pipeline for Improving Unsupervised Anomaly Segmentation on Medical Images", "abstract": "Unsupervised methods for anomaly segmentation are promising for computer-aided diagnosis since they can increase the robustness of medical systems and do not require large annotated datasets. In this work, we propose a simple yet effective two-stage pipeline for improving the performance of existing anomaly segmentation methods. The first stage is used for better anomaly localization and false positive rate reduction. For this stage, we propose the PatchCore3D method, which is based on the PatchCore algorithm and a backbone, pre-trained on 3D medical images. Any existing anomaly segmentation method can be used at the second stage for the precise anomaly segmentation in the region suggested by PatchCore3D. We evaluate PatchCore3D and the proposed pipelines in combination with six top-performing anomaly segmentation methods of different types. We use brain MRI datasets, testing healthy subjects against subjects with brain tumors. Using PatchCore3D pipeline with every considered anomaly segmentation method increases segmentation AUROC almost twice by better anomaly localization."}}
{"id": "H3XNv1MvHXB", "cdate": 1672531200000, "mdate": 1706460632581, "content": {"title": "Memory-efficient particle filter recurrent neural network for object localization", "abstract": "This study proposes a novel memory-efficient recurrent neural network (RNN) architecture specified to solve the object localization problem. This problem is to recover the object states along with its movement in a noisy environment. We take the idea of the classical particle filter and combine it with GRU RNN architecture. The key feature of the resulting memory-efficient particle filter RNN model (mePFRNN) is that it requires the same number of parameters to process environments of different sizes. Thus, the proposed mePFRNN architecture consumes less memory to store parameters compared to the previously proposed PFRNN model. To demonstrate the performance of our model, we test it on symmetric and noisy environments that are incredibly challenging for filtering algorithms. In our experiments, the mePFRNN model provides more precise localization than the considered competitors and requires fewer trained parameters."}}
{"id": "Oh5nigv45PI", "cdate": 1663850377645, "mdate": null, "content": {"title": "NAG-GS: semi-implicit, accelerated and robust stochastic optimizer.", "abstract": "Classical machine learning models such as deep neural networks are usually trained by using Stochastic Gradient Descent-based (SGD) algorithms. The classical SGD can be interpreted as a discretization of the stochastic gradient flow. In this paper we propose a novel, robust and accelerated stochastic optimizer that relies on two key elements: (1) an accelerated Nesterov-like Stochastic Differential Equation (SDE) and (2) its semi-implicit Gauss-Seidel type discretization. The convergence and stability of the obtained method, referred to as NAG-GS, are first studied extensively in the case of the minimization of a quadratic function. This analysis allows us to come up with an optimal step size (or learning rate) in terms of rate of convergence while ensuring the stability of NAG-GS. This is achieved by the careful analysis of the spectral radius of the iteration matrix and the covariance matrix at stationarity with respect to all hyperparameters of our method. We show that NAG-GS is competitive with state-of-the-art methods such as momentum SGD with weight decay and AdamW for the training of machine learning models such as the logistic regression model, the residual networks models on standard computer vision datasets, and Transformers in the frame of the GLUE benchmark."}}
{"id": "Hx8bxbnXv_", "cdate": 1640995200000, "mdate": 1672951958198, "content": {"title": "NAG-GS: Semi-Implicit, Accelerated and Robust Stochastic Optimizers", "abstract": ""}}
{"id": "BPciZfEctUe", "cdate": 1640995200000, "mdate": 1672951958201, "content": {"title": "Survey on Efficient Training of Large Neural Networks", "abstract": ""}}
{"id": "62LPYtCgcyV", "cdate": 1640995200000, "mdate": 1672951958189, "content": {"title": "Memory-Efficient Backpropagation through Large Linear Layers", "abstract": ""}}
