{"id": "pT7zutgLZi", "cdate": 1640995200000, "mdate": 1676001530421, "content": {"title": "Dynamic Relaxations for Online Bipartite Matching", "abstract": "Online bipartite matching (OBM) is a fundamental model underpinning many important applications, including search engine advertisement, website banner and pop-up ads, and ride hailing. We study the..."}}
{"id": "XBnz0GMJT-r", "cdate": 1640995200000, "mdate": 1652731962831, "content": {"title": "Capacity Variation in the Many-to-one Stable Matching", "abstract": "The many-to-one stable matching problem provides the fundamental abstraction of several real-world matching markets such as school choice and hospital-resident allocation. The agents on both sides are often referred to as residents and hospitals. The classical setup assumes that the agents rank the opposite side and that the capacities of the hospitals are fixed. It is known that increasing the capacity of a single hospital improves the residents' final allocation. On the other hand, reducing the capacity of a single hospital deteriorates the residents' allocation. In this work, we study the computational complexity of finding the optimal variation of hospitals' capacities that leads to the best outcome for the residents, subject to stability and a capacity variation constraint. First, we show that the decision problem of finding the optimal capacity expansion is NP-complete and the corresponding optimization problem is inapproximable within a certain factor. This result holds under strict and complete preferences, and even if we allocate extra capacities to disjoint sets of hospitals. Second, we obtain analogous computational complexity results for the problem of capacity reduction. Finally, we study the variants of these problems when the goal is to maximize the size of the final matching under incomplete preference lists."}}
{"id": "Om2NMCpPH55", "cdate": 1618683631247, "mdate": null, "content": {"title": "On the Unreasonable Effectiveness of the Greedy Algorithm: Greedy Adapts to Sharpness", "abstract": "It is well known that the standard greedy algorithm guarantees a worst-case approximation factor of 1-1/e when maximizing a monotone submodular function under a cardinality constraint. However, empirical studies show that its performance is substantially better in practice. This raises a natural question of explaining this improved performance of the greedy algorithm. In this work, we define sharpness for submodular functions as a candidate explanation for this phenomenon. We show that the greedy algorithm provably performs better as the sharpness of the submodular function increases. This improvement ties in closely with the faster convergence rates of first order methods for sharp functions in convex optimization. "}}
{"id": "fGhGDInvfX", "cdate": 1609459200000, "mdate": 1676001530370, "content": {"title": "Preserving Diversity when Partitioning: A Geometric Approach", "abstract": "Diversity plays a crucial role in multiple contexts such as team formation, representation of minority groups and generally when allocating resources fairly. Given a community composed by individuals of different types, we study the problem of partitioning this community such that the global diversity is preserved as much as possible in each subgroup. We consider the diversity metric introduced by Simpson in his influential work that, roughly speaking, corresponds to the inverse probability that two individuals are from the same type when taken uniformly at random, with replacement, from the community of interest. We provide a novel perspective by reinterpreting this quantity in geometric terms. We characterize the instances in which the optimal partition exactly preserves the global diversity in each subgroup. When this is not possible, we provide an efficient polynomial-time algorithm that outputs an optimal partition for the problem with two types. Finally, we discuss further challenges and open questions for the problem that considers more than two types."}}
{"id": "CSFy9XBZgoL", "cdate": 1609459200000, "mdate": 1652731962828, "content": {"title": "Capacity Expansion in the College Admission Problem", "abstract": "In this work, we introduce the problem of jointly allocating a school capacity expansion (given a fixed budget) and finding the best allocation for the students in the expanded market. Given the computational complexity of the problem, we provide an integer quadratically-constrained programming formulation and study its linear reformulations. We also propose two heuristics: A greedy algorithm and an LP-based method. We empirically evaluate the performance of our approaches in a detailed computational study. We observe the practical superiority of the linearized model in comparison with its quadratic counterpart and we outline their computational limits. Finally, we use the Chilean school choice system data to empirically demonstrate the impact of capacity planning under stability conditions. Our results show that each additional school seat can benefit multiple students. In addition, depending on the decision-maker, our methodology can prioritize the assignment of previously unassigned students or improve the assignment of several students through improvement chains."}}
{"id": "6Z1LgZuTs-b", "cdate": 1546300800000, "mdate": null, "content": {"title": "Structured Robust Submodular Maximization: Offline and Online Algorithms", "abstract": "Constrained submodular function maximization has been used in subset selection problems such as selection of most informative sensor locations. While these models have been quite popular, the solut..."}}
{"id": "ZsdQk9UCbJ0", "cdate": 1514764800000, "mdate": null, "content": {"title": "A polyhedral approach to online bipartite matching", "abstract": "We study the i.i.d. online bipartite matching problem, a dynamic version of the classical model where one side of the bipartition is fixed and known in advance, while nodes from the other side appear one at a time as i.i.d. realizations of a uniform distribution, and must immediately be matched or discarded. We consider various relaxations of the polyhedral set of achievable matching probabilities, introduce valid inequalities, and discuss when they are facet-defining. We also show how several of these relaxations correspond to ranking policies and their time-dependent generalizations. We finally present a computational study of these relaxations and policies to determine their empirical performance."}}
{"id": "o_2JyjjXZtu", "cdate": 1451606400000, "mdate": null, "content": {"title": "Additive Consistency of Risk Measures and Its Application to Risk-Averse Routing in Networks", "abstract": "We investigate the use of risk measures and theories of choice to model risk-averse routing and traffic equilibrium on networks with random travel times. We interpret the postulates of these theori..."}}
{"id": "4rW30jmON1D", "cdate": 1451606400000, "mdate": null, "content": {"title": "A Polyhedral Approach to Online Bipartite Matching", "abstract": "We study the i.i.d. online bipartite matching problem, a dynamic version of the classical model where one side of the bipartition is fixed and known in advance, while nodes from the other side appear one at a time as i.i.d. realizations of an underlying distribution, and must immediately be matched or discarded. We consider various relaxations of the set of achievable matching probabilities, introduce star inequalities and their generalizations, and discuss when they are facet-defining. We also show how several of these relaxations correspond to ranking policies and their time-dependent generalizations. We finally present results of a computational study of these relaxations and policies to determine their empirical performance."}}
