{"id": "kcMM8kPPCB0", "cdate": 1601361270164, "mdate": null, "content": {"title": "Acoustic Entropy of the Materials in the Course of Degradation", "abstract": "We report experimental observations on the evolution of acoustic entropy in the course of\ncyclic loading as degradation occurs due to fatigue. The measured entropy is a result of the materials’\nmicrostructural changes that occur as degradation due to cyclic mechanical loading. Experimental\nresults demonstrate that maximum acoustic entropy emanating from materials during the course of\ndegradation remains similar. Experiments are shown for two different types of materials: Aluminum\n6061 (a metallic alloy) and glass/epoxy (a composite laminate). The evolution of the acoustic entropy\ndemonstrates a persistent trend over the course of degradation."}}
{"id": "ZO42vju-cxW", "cdate": 1601361018357, "mdate": null, "content": {"title": "Damage Assessment Using Information Entropy of Individual Acoustic EmissionWaveforms during Cyclic Fatigue Loading", "abstract": "Information entropy measured from acoustic emission (AE) waveforms is shown to be an\nindicator of fatigue damage in a high-strength aluminum alloy. Three methods of measuring the\nAE information entropy, regarded as a direct measure of microstructural disorder, are proposed and\ncompared with traditional damage-related AE features. Several tension–tension fatigue experiments\nwere performed with dogbone samples of aluminum 7075-T6, a commonly used material in aerospace\nstructures. Unlike previous studies in which fatigue damage is measured based on visible crack\ngrowth, this work investigated fatigue damage both prior to and after crack initiation through\nthe use of instantaneous elastic modulus degradation. Results show that one of the three entropy\nmeasurement methods appears to better assess the damage than the traditional AE features, whereas\nthe other two entropies have unique trends that can differentiate between small and large cracks."}}
