{"id": "6vdDp42oLzC", "cdate": 1654348671601, "mdate": null, "content": {"title": "ImageNet-Patch: A Dataset for Benchmarking Machine Learning Robustness against Adversarial Patches", "abstract": "Adversarial patches are optimized contiguous pixel blocks in an input image that cause a  machine-learning model to misclassify it.\nHowever, their optimization is computationally demanding and requires careful hyperparameter tuning.\nTo overcome these issues, we propose ImageNet-Patch, a dataset to benchmark machine-learning models against adversarial patches.\nIt consists of a set of patches optimized to generalize across different models and applied to ImageNet data after preprocessing them with affine transformations.\nThis process enables an approximate yet faster robustness evaluation, leveraging the transferability of adversarial perturbations."}}
{"id": "Y1sWzKW0k4L", "cdate": 1652737772792, "mdate": null, "content": {"title": "Indicators of Attack Failure: Debugging and Improving Optimization of Adversarial Examples", "abstract": "Evaluating robustness of machine-learning models to adversarial examples is a challenging problem. Many defenses have been shown to provide a false sense of robustness by causing gradient-based attacks to fail, and they have been broken under more rigorous evaluations.\nAlthough guidelines and best practices have been suggested to improve current adversarial robustness evaluations, the lack of automatic testing and debugging tools makes it difficult to apply these recommendations in a systematic manner.\nIn this work, we overcome these limitations by: (i) categorizing   attack failures based on how they affect the optimization of gradient-based attacks, while also  unveiling two novel failures affecting many popular attack implementations and past evaluations;\n (ii) proposing six novel \\emph{indicators of failure}, to automatically detect the presence of such failures in the attack optimization process; and (iii) suggesting a systematic protocol to apply the corresponding fixes. \nOur extensive experimental analysis, involving more than 15 models in 3 distinct application domains, shows that our indicators of failure can be used to debug and improve current adversarial robustness evaluations, thereby providing a first concrete step towards automatizing and systematizing them. Our open-source code is available at: https://github.com/pralab/IndicatorsOfAttackFailure."}}
{"id": "Pvhk4ZFnTR", "cdate": 1624022580034, "mdate": null, "content": {"title": "Indicators of Attack Failure: Debugging and Improving Optimization of Adversarial Examples", "abstract": "Evaluating robustness of machine-learning models to adversarial examples is a challenging problem. Many defenses have been shown to provide a false sense of security by causing gradient-based attacks to fail, and they have been broken under more rigorous evaluations.\nAlthough guidelines and best practices have been suggested to improve current adversarial robustness evaluations, the lack of automatic testing and debugging tools makes it difficult to apply these recommendations in a systematic manner.\nIn this work, we overcome these limitations by (i) defining a set of quantitative indicators which unveil common failures in the optimization of gradient-based attacks, and (ii) proposing specific mitigation strategies within a systematic evaluation protocol. \nOur extensive experimental analysis shows that the proposed indicators of failure can be used to visualize, debug and improve current adversarial robustness evaluations, providing a first concrete step towards automatizing and systematizing current adversarial robustness evaluations."}}
{"id": "JdQ2-DTaGF", "cdate": 1621630338976, "mdate": null, "content": {"title": "Indicators of Attack Failure: Debugging and Improving Optimization of Adversarial Examples", "abstract": "Evaluating robustness of machine-learning models to adversarial examples is a challenging problem. Many defenses have been shown to provide a false sense of security by causing gradient-based attacks to fail, and they have been broken under more rigorous evaluations. Although guidelines and best practices have been suggested to improve current adversarial robustness evaluations, the lack of automatic testing and debugging tools makes it difficult to apply these recommendations in a systematic manner. In this work, we overcome these limitations by (i) defining a set of quantitative indicators which unveil common failures in the optimization of gradient-based attacks, and (ii) proposing specific mitigation strategies within a systematic evaluation protocol. Our extensive experimental analysis shows that the proposed indicators of failure can be used to visualize, debug and improve current adversarial robustness evaluations, providing a first concrete step towards automatizing and systematizing current adversarial robustness evaluations."}}
