{"id": "Wcx5k_OO_6P", "cdate": 1650446370370, "mdate": 1650446370370, "content": {"title": "FLYBO: A Unified Benchmark Environment for Autonomous Flying Robots", "abstract": "The use of Micro-Aerial Vehicles (MAVs) equipped with\nodometry- and depth sensors has become predominant for a\nwide variety of challenging industrial applications such as\nthe autonomous exploration (i.e., digital mapping), and inspection (i.e., online surface reconstruction) of unknown facilities. However, despite the ongoing attention these topics\nreceive, autonomous exploration systems still lack common\nevaluation grounds to assess their relative performance in\nterms of data and experimental tools. We address this\ndeficit by introducing FLYBO, the first unified benchmark\nenvironment that focuses on the performance of such flying\nrobots in terms of autonomous exploration and online surface reconstruction. It includes (i) 11 challenging realistic\nindoor- and outdoor datasets of increasing complexity and\nsize, with ground-truth, (ii) a comprehensive benchmark of\n7 of the top-performing autonomous exploration algorithms\nincluding methods without publicly available code. (iii) A\nunified experimental system factorizes the routines shared\nby autonomous planners in order to fairly and accurately\nassess their exploration performance in a controlled environment."}}
{"id": "qa_lJvXlFj", "cdate": 1631099685120, "mdate": null, "content": {"title": "SplatPlanner: Efficient Autonomous Exploration via Permutohedral Frontier Filtering", "abstract": "We address the problem of autonomous\nexploration of unknown environments using a Micro Aerial\nVehicle (MAV) equipped with an active depth sensor. As\nsuch, the task consists in mapping the gradually discovered\nenvironment while planning the envisioned trajectories in\nreal-time, using on-board computation only. To do so, we\npresent SplatPlanner, an end-to-end autonomous planner that\nis based on a novel Permutohedral Frontier Filtering (PFF)\nwhich relies on a combination of highly efficient operations\nstemming from bilateral filtering using permutohedral lattices\nto guide the entire exploration. In particular, our PFF is\ncomputationally linear in input size, nearly parameter-free, and\naggregates spatial information about frontier-neighborhoods\ninto density scores in one single step. Comparative experiments\nmade on simulated environments of increasing complexity\nshow our method consistently outperforms recent state-of-theart methods in terms of computational efficiency, exploration\nspeed and qualitative coverage of scenes. Finally, we also\ndisplay the practical capabilities of our end-to-end system in\na challenging real-flight scenario."}}
{"id": "Dzxz7-Zadz", "cdate": 1580392845381, "mdate": null, "content": {"title": "Patchwork Stereo: Scalable, Structure-Aware 3D Reconstruction in Man-Made Environments", "abstract": "In this paper, we address the problem of Multi-View Stereo (MVS) reconstruction of highly regular man-made scenes from calibrated, wide-baseline views and a sparse Structure-from-Motion (SfM) point cloud. We introduce a novel patch-based formulation via energy minimization which combines top-down segmentation hypotheses using appearance and vanishing line detections, as well as an arrangement of creased planar structures which are extracted automatically through a robust analysis of available SfM points and image features. The method produces a compact piecewise-planar depth map and a mesh which are aligned with the scene’s structure. Experiments show that our approach not only reaches similar levels of accuracy w.r.t state-of-the-art pixel-based methods while using much fewer images, but also produces a much more compact, structure-aware mesh in a considerably shorter runtime by several of orders of magnitude"}}
{"id": "-waoUqlNHF", "cdate": 1580392598833, "mdate": null, "content": {"title": "Towards scalable, multi-view urban modeling using structure priors", "abstract": "In this thesis, we address the problem of 3D reconstruction from a sequence of calibrated street-level photographs with a simultaneous focus on scalability and the use of structure priors in Multi-View Stereo (MVS). \n\nWhile both aspects have been studied broadly, existing scalable MVS approaches do not handle well the ubiquitous structural regularities, yet simple, of man-made environments. On the other hand, structure-aware 3D reconstruction methods are slow and scale poorly with the size of the input sequences and/or may even require additional restrictive information. The goal of this thesis is to reconcile scalability and structureawareness within common MVS grounds using soft, generic priors which encourage: (i) piecewise planarity, (ii) alignment of objects boundaries with image gradients and (iii) with vanishing directions (VDs), and (iv) objects co-planarity. To do so, we present the novel “Patchwork Stereo” framework which integrates photometric stereo from a handful of wide-baseline views and a sparse 3D point cloud combining robust 3D plane extraction and top-down image partitioning from a unified 2D-3D analysis in a principled Markov Random Field energy minimization. \n\nWe evaluate our contributions quantitatively and qualitatively on challenging urban datasets and illustrate results which are at least on par with state-of-the-art methods in terms of geometric structure, but achieved in several orders of magnitude faster paving the way for photo-realistic city-scale modeling.\n\nKeywords: Multi-View Stereo, Structure Priors, 3D Reconstruction, Image-Based Modeling, Scalability, Top-Down Image Segmentation, Urban Modeling."}}
