{"id": "hXsBCVNJu_v", "cdate": 1663850030165, "mdate": null, "content": {"title": "ADVERSARIALLY BALANCED REPRESENTATION FOR CONTINUOUS TREATMENT EFFECT ESTIMATION", "abstract": "Estimating the individual treatment effect (ITE) requires covariate balance among different treatment groups, and machine learning models have shown great promise in learning a balanced representation of covariates.\nIn contrast with binary treatments for which learning such a representation has been widely studied, the more practical yet complicated continuous treatment setting has remained relatively under-explored. Adopting an information-theoretic approach, we introduce a novel mutual information (MI)-based objective for continuous treatment effect estimation. \nLeveraging variational approximation to optimize MI terms in our objective, we propose a method called Adversarial CounterFactual Regression (ACFR). ACFR aligns the representation of covariates through an adversarial game and predicts the potential outcomes using a contribution-constraining hypothesis network. Comparison of ACFR against state-of-the-art methods on semi-synthetic datasets demonstrates its superiority in individual-level metrics."}}
{"id": "71pb65PTfZ-", "cdate": 1640995200000, "mdate": 1668497512319, "content": {"title": "Pan-cancer integrative analysis of whole-genome De novo somatic point mutations reveals 17 cancer types", "abstract": "Background The advent of high throughput sequencing has enabled researchers to systematically evaluate the genetic variations in cancer, identifying many cancer-associated genes. Although cancers in the same tissue are widely categorized in the same group, they demonstrate many differences concerning their mutational profiles. Hence, there is no definitive treatment for most cancer types. This reveals the importance of developing new pipelines to identify cancer-associated genes accurately and re-classify patients with similar mutational profiles. Classification of cancer patients with similar mutational profiles may help discover subtypes of cancer patients who might benefit from specific treatment types. Results In this study, we propose a new machine learning pipeline to identify protein-coding genes mutated in many samples to identify cancer subtypes. We apply our pipeline to 12,270 samples collected from the international cancer genome consortium, covering 19 cancer types. As a result, we identify 17 different cancer subtypes. Comprehensive phenotypic and genotypic analysis indicates distinguishable properties, including unique cancer-related signaling pathways. Conclusions This new subtyping approach offers a novel opportunity for cancer drug development based on the mutational profile of patients. Additionally, we analyze the mutational signatures for samples in each subtype, which provides important insight into their active molecular mechanisms. Some of the pathways we identified in most subtypes, including the cell cycle and the Axon guidance pathways, are frequently observed in cancer disease. Interestingly, we also identified several mutated genes and different rates of mutation in multiple cancer subtypes. In addition, our study on “gene-motif” suggests the importance of considering both the context of the mutations and mutational processes in identifying cancer-associated genes. The source codes for our proposed clustering pipeline and analysis are publicly available at: https://github.com/bcb-sut/Pan-Cancer ."}}
