{"id": "fUIDsRqcUI", "cdate": 1671935435539, "mdate": 1671935435539, "content": {"title": "Bandits with Dynamic Arm-acquisition Costs", "abstract": "We consider a bandit problem where at any time, the decision maker can add new arms to her consideration set. A new arm is queried at a cost from an arm-reservoir containing finitely many arm-types, each characterized by a distinct mean reward. The cost of query reflects in a diminishing probability of the returned arm being optimal, unbeknown to the decision maker; this feature encapsulates defining characteristics of a broad class of operations-inspired online learning problems, e.g., those arising in markets with churn, or those involving allocations subject to costly resource acquisition. The decision maker’s goal is to maximize her cumulative expected payoffs over a sequence of n pulls, oblivious to the statistical properties as well as types of the queried arms. We study two natural modes of endogeneity in the reservoir distribution, and characterize a necessary condition for achievability of sub-linear regret in the problem. We also discuss a UCB-inspired adaptive algorithm that is long-run-average optimal whenever said condition is satisfied, thereby establishing its tightness."}}
{"id": "GyTPiaeLAS", "cdate": 1671935215916, "mdate": 1671935215916, "content": {"title": "Complexity Analysis of a Countable-armed Bandit Problem", "abstract": "We consider a stochastic multi-armed bandit (MAB) problem motivated by “large” action spaces, and endowed with a population of arms containing exactly K arm-types, each characterized by a distinct mean reward. The decision maker is oblivious to the statistical properties of reward distributions as well as the population-level distribution of different arm-types, and is precluded also from observing the type of an arm after play. We study the classical problem of minimizing the expected cumulative regret over a horizon of play n, and propose algorithms that achieve a rate-optimal finite-time instance-dependent regret of O (log n). We also show that the instance- independent (minimax) regret is O ̃ (√n) when K = 2. While the order of regret and complexity of the problem suggests a great degree of similarity to the classical MAB problem, properties of the performance bounds and salient aspects of algorithm design are quite distinct from the latter, as are the key primitives that determine complexity along with the analysis tools needed to study them."}}
{"id": "tQRoZ9nRgM", "cdate": 1652737672857, "mdate": null, "content": {"title": "Dynamic Learning in Large Matching Markets", "abstract": "We study a sequential matching problem faced by \"large\" centralized platforms where \"jobs\" must be matched to \"workers\" subject to uncertainty about worker skill proficiencies. Jobs arrive at discrete times with \"job-types\" observable upon arrival. To capture the \"choice overload\" phenomenon, we posit an unlimited supply of workers where each worker is characterized by a vector of attributes (aka \"worker-types\") drawn from an underlying population-level distribution. The distribution as well as mean payoffs for possible worker-job type-pairs are unobservables and the platform's goal is to sequentially match incoming jobs to workers in a way that maximizes its cumulative payoffs over the planning horizon. We establish lower bounds on the \"regret\" of any matching algorithm in this setting and propose a novel rate-optimal learning algorithm that adapts to aforementioned primitives \"online.\" Our learning guarantees highlight a distinctive characteristic of the problem: achievable performance only has a \"second-order\" dependence on worker-type distributions; we believe this finding may be of interest more broadly."}}
{"id": "rC3zu-OqnII", "cdate": 1621630045573, "mdate": null, "content": {"title": "A Closer Look at the Worst-case Behavior of Multi-armed Bandit Algorithms", "abstract": "One of the key drivers of complexity in the classical (stochastic) multi-armed bandit (MAB) problem is the difference between mean rewards in the top two arms, also known as the instance gap. The celebrated Upper Confidence Bound (UCB) policy is among the simplest optimism-based MAB algorithms that naturally adapts to this gap: for a horizon of play n, it achieves optimal O(log n) regret in instances with \"large\" gaps, and a near-optimal O(\\sqrt{n log n}) minimax regret when the gap can be arbitrarily \"small.\" This paper provides new results on the arm-sampling behavior of UCB, leading to several important insights. Among these, it is shown that arm-sampling rates under UCB are asymptotically deterministic, regardless of the problem complexity. This discovery facilitates new sharp asymptotics and a novel alternative proof for the O(\\sqrt{n log n}) minimax regret of UCB. Furthermore, the paper also provides the first complete process-level characterization of the MAB problem in the conventional diffusion scaling. Among other things, the \"small\" gap worst-case lens adopted in this paper also reveals profound distinctions between the behavior of UCB and Thompson Sampling, such as an \"incomplete learning\" phenomenon characteristic of the latter."}}
{"id": "SnGWccmUrec", "cdate": 1609459200000, "mdate": 1645728658018, "content": {"title": "The Countable-armed Bandit with Vanishing Arms", "abstract": "We consider a bandit problem where at any time, the decision maker can add new arms to her consideration set. A new arm is queried at a cost from an \"arm-reservoir\" containing finitely many \"arm-types,\" each characterized by a distinct mean reward. The cost of query reflects in a diminishing probability of the returned arm being optimal, unbeknown to the decision maker; this feature encapsulates defining characteristics of a broad class of operations-inspired online learning problems, e.g., those arising in markets with churn, or those involving allocations subject to costly resource acquisition. The decision maker's goal is to maximize her cumulative expected payoffs over a sequence of n pulls, oblivious to the statistical properties as well as types of the queried arms. We study two natural modes of endogeneity in the reservoir distribution, and characterize a necessary condition for achievability of sub-linear regret in the problem. We also discuss a UCB-inspired adaptive algorithm that is long-run-average optimal whenever said condition is satisfied, thereby establishing its tightness."}}
{"id": "STvbqq7UHg5", "cdate": 1609459200000, "mdate": 1645728658013, "content": {"title": "From Finite to Countable-Armed Bandits", "abstract": "We consider a stochastic bandit problem with countably many arms that belong to a finite set of types, each characterized by a unique mean reward. In addition, there is a fixed distribution over types which sets the proportion of each type in the population of arms. The decision maker is oblivious to the type of any arm and to the aforementioned distribution over types, but perfectly knows the total number of types occurring in the population of arms. We propose a fully adaptive online learning algorithm that achieves O(log n) distribution-dependent expected cumulative regret after any number of plays n, and show that this order of regret is best possible. The analysis of our algorithm relies on newly discovered concentration and convergence properties of optimism-based policies like UCB in finite-armed bandit problems with \"zero gap,\" which may be of independent interest."}}
{"id": "BIq-95mLreq", "cdate": 1609459200000, "mdate": 1645728658017, "content": {"title": "A Closer Look at the Worst-case Behavior of Multi-armed Bandit Algorithms", "abstract": "One of the key drivers of complexity in the classical (stochastic) multi-armed bandit (MAB) problem is the difference between mean rewards in the top two arms, also known as the instance gap. The celebrated Upper Confidence Bound (UCB) policy is among the simplest optimism-based MAB algorithms that naturally adapts to this gap: for a horizon of play n, it achieves optimal O(log n) regret in instances with \"large\" gaps, and a near-optimal O(\\sqrt{n log n}) minimax regret when the gap can be arbitrarily \"small.\" This paper provides new results on the arm-sampling behavior of UCB, leading to several important insights. Among these, it is shown that arm-sampling rates under UCB are asymptotically deterministic, regardless of the problem complexity. This discovery facilitates new sharp asymptotics and a novel alternative proof for the O(\\sqrt{n log n}) minimax regret of UCB. Furthermore, the paper also provides the first complete process-level characterization of the MAB problem under UCB in the conventional diffusion scaling. Among other things, the \"small\" gap worst-case lens adopted in this paper also reveals profound distinctions between the behavior of UCB and Thompson Sampling, such as an \"incomplete learning\" phenomenon characteristic of the latter."}}
{"id": "C1SAcQIbvT", "cdate": 1577836800000, "mdate": null, "content": {"title": "From Finite to Countable-Armed Bandits", "abstract": "We consider a stochastic bandit problem with countably many arms that belong to a finite set of types, each characterized by a unique mean reward. In addition, there is a fixed distribution over types which sets the proportion of each type in the population of arms. The decision maker is oblivious to the type of any arm and to the aforementioned distribution over types, but perfectly knows the total number of types occurring in the population of arms. We propose a fully adaptive online learning algorithm that achieves O(log n) distribution-dependent expected cumulative regret after any number of plays n, and show that this order of regret is best possible. The analysis of our algorithm relies on newly discovered concentration and convergence properties of optimism-based policies like UCB in finite-armed bandit problems with zero gap, which may be of independent interest."}}
{"id": "vEcE9U71AG6", "cdate": 1546300800000, "mdate": null, "content": {"title": "Stochastic approximation algorithms for rumor source inference on graphs", "abstract": "We revisit the classical problem of identifying the source of rumor in a network, assumed unique, treating as given the network topology and the set of rumor infected nodes. In addition, it is assumed that some partial information about the order in which the nodes were infected, is also available. Such form of information is commonly available to network monitoring agencies. Under this premise, we propose a class of estimators that is agnostic to the underlying stochastic model of rumor spread and further, generalizes other estimators popular in literature, e.g., rumor center, distance center and Jordan center. We also develop an MCMC-based stochastic approximation framework to implement this class of estimators. Results from extensive simulations on the Erdős–Rényi and Barabási–Albert random graph models indicate promising empirical performance and robustness of the proposed estimators to different graph topologies. Our stochastic approximation framework also extends easily to general statistical inference problems on graphs that are of combinatorial nature. In particular, we demonstrate a suitable modification of our framework that makes it amenable to be used for the popular problem of rank aggregation from noisy pairwise comparisons."}}
{"id": "E3X8yloqmK", "cdate": 1546300800000, "mdate": null, "content": {"title": "Capacity expansion of neutral ISPs via content provider participation: The bargaining edge", "abstract": "Many Internet service providers (ISPs) operate under network neutrality regulations that forbid differential QoS or differential pricing. This leads to lower profitability for ISPs. However, increasingly bandwidth-hungry content is making the consumers demand significantly improved ISP infrastructure. With the risk of poor consumer experience on them, ISPs have to invest in their infrastructure, but with limited scope for monetization. Hence, they are asking content providers (CPs) to contribute towards ISP capacity expansion. In this paper, we explore network neutral capacity expansion sponsored by voluntary contributions from CPs. We consider the scenario where CPs contribute to ISP capacity expansion via a voluntary payment. Since ISP capacity expansion can benefit all the CPs, and possibly even the ISP, selfish CPs will determine their contributions strategically. We consider three models for CPs to interact in determining their payments—a cooperative model, a non-cooperative model, and a bargaining model. Our analysis reveals a rather surprising result. We show that the bargaining model leads to a higher investment in the ISP infrastructure than even the cooperative model. This leads us to recommend the creation of transparent platforms for CPs to contribute directly to Internet capacity expansion."}}
