{"id": "xXXaOZptoNY", "cdate": 1640995200000, "mdate": 1682325651084, "content": {"title": "An Optimized Data Analysis on a Real-Time Application of PEM Fuel Cell Design by Using Machine Learning Algorithms", "abstract": "In recent years, machine learning algorithms have been applied in many real-time applications. Crises in the energy sector are the primary challenges experienced today among all countries across the globe, regardless of their economic status. There is a huge demand to acquire and produce environmentally friendly renewable energy and to distribute and utilize it efficiently because of its huge production cost. PEMFC are known for their energy efficiency and comparatively low cost, and can be an alternative energy source. The efficiency of these PEMFC can still be enhanced with the help of advanced technologies like machine learning and artificial intelligence, as they provide an optimal solution to explore the hidden knowledge from the generated data. The proposed model attempts to compare several design techniques with varied humidity levels. To enhance the performance of PEMFC, the various humidification processes were considered during the experimental study. The humidification reduces the heat during energy generation and increases the performance of PEM fuel cell. The humidity levels such as 100%, 50%, and 10% were considered to be tested with the machine learning models. The SVMR, LR, and KNN algorithms were tested and observed with the RMSE value as the evaluation parameters. The observed results show that SVMR has an RMSE rate of 0.0046, the LR method has an RMSE rate of 0.0034, and KNN has an RMSE rate of 0.004. The analysis shows that the LR model provides better accuracy than other models. The LR model enhances the PEMFC performance."}}
{"id": "wHGRSWK-Lps", "cdate": 1640995200000, "mdate": 1682325651097, "content": {"title": "A Robust Approach for Brain Tumor Detection in Magnetic Resonance Images Using Finetuned EfficientNet", "abstract": "A brain tumor is a disorder caused by the growth of abnormal brain cells. The survival rate of a patient affected with a tumor is difficult to determine because they are infrequent and appear in various forms. These tumors can be identified through Magnetic Resonance (MRI) Images, which plays an essential role in determining the tumor site; however, manual detection is a time-consuming and challenging procedure that can cause some errors in results. The adoption of computer-assisted approaches is essential to help in overcoming these constraints. With the advancement of artificial intelligence, deep learning (DL) models are being used in medical imaging to diagnose brain tumors using MR images. In this study, a deep convolutional neural network (CNN) EfficientNet-B0 base model is fine-tuned with our proposed layers to efficiently classify and detect brain tumor images. The image enhancement techniques are used by applying various filters to enhance the quality of the images. Data augmentation methods are applied to increase the data samples for better training of our proposed model. The results show that the proposed fine-tuned state-of-the-art EfficientNet-B0 outperforms other CNN models by achieving the highest classification accuracy, precision, recall, and area under curve values surpassing other state-of-the-art models, with an overall accuracy of 98.87% in terms of classification and detection. Other DL algorithms such as VGG16, InceptionV3, Xception, ResNet50, and InceptionResNetV2 are used for comparative analysis."}}
{"id": "YjzSbAYUh_m", "cdate": 1640995200000, "mdate": 1682325651100, "content": {"title": "Characterization of English Braille Patterns Using Automated Tools and RICA Based Feature Extraction Methods", "abstract": "Braille is used as a mode of communication all over the world. Technological advancements are transforming the way Braille is read and written. This study developed an English Braille pattern identification system using robust machine learning techniques using the English Braille Grade-1 dataset. English Braille Grade-1 dataset was collected using a touchscreen device from visually impaired students of the National Special Education School Muzaffarabad. For better visualization, the dataset was divided into two classes as class 1 (1–13) (a–m) and class 2 (14–26) (n–z) using 26 Braille English characters. A position-free braille text entry method was used to generate synthetic data. N = 2512 cases were included in the final dataset. Support Vector Machine (SVM), Decision Trees (DT) and K-Nearest Neighbor (KNN) with Reconstruction Independent Component Analysis (RICA) and PCA-based feature extraction methods were used for Braille to English character recognition. Compared to PCA, Random Forest (RF) algorithm and Sequential methods, better results were achieved using the RICA-based feature extraction method. The evaluation metrics used were the True Positive Rate (TPR), True Negative Rate (TNR), Positive Predictive Value (PPV), Negative Predictive Value (NPV), False Positive Rate (FPR), Total Accuracy, Area Under the Receiver Operating Curve (AUC) and F1-Score. A statistical test was also performed to justify the significance of the results."}}
{"id": "RfVBL_xQVRB", "cdate": 1640995200000, "mdate": 1682325650808, "content": {"title": "Guest Editorial: Digital Twinning: Integrating AI-ML and Big Data Analytics for Virtual Representation", "abstract": ""}}
{"id": "RRSSclPB_5s", "cdate": 1640995200000, "mdate": 1682325651291, "content": {"title": "A Decade Review on Smart Cities: Paradigms, Challenges and Opportunities", "abstract": "Smart City has been an emerging research domain for Government, Businesses, and researchers in the last few years. The Indian government is also interested and investing lots of funds to develop smart cities. These cities are technology-based and require interdisciplinary research and development for successful implementation. Over the last few decades, various technological interventions have created a tendency to provide smart everyday objects to make human life more comfortable. The emergence of the smart city paradigm is a response to creating a future city that guarantees the well-being and rights of its citizens from the perspective of industrial development: industry, urban planning, environment, and sustainable development. There are several subdomains in the smart city for the research. To work with the different subdomains in a smart city, proper guidance about the background of the smart city is required. This research paper is a guide for the same. This research paper represents a systematic literature review of the smart city domain. This paper carries out a systematic review of research papers published in various well-reputed journals like IEEE, Springer, Elsevier, etc., between 2011 and 2021. This paper will help the government, businesses, and researchers aiming to enhance the smart city concept. Initially, this paper discusses the origin and emergence of this concept, followed by a few definitions and characteristics with the real roadmap and primary supporting pillars of the smart city. This paper discusses a typical architecture having different layers like Sensing, Transportation, Data Management, and Application Layers. There are various supporting technologies and platforms for the smart city; hence implementations are impossible without these technologies and media. This research paper discusses different components of the smart city. A broad literature survey is being done to observe various challenges, opportunities, and future trends in the smart city. This research paper can guide the researchers and provide the research direction in the smart city domain."}}
{"id": "PjXYbvVJlz3", "cdate": 1640995200000, "mdate": 1682325650906, "content": {"title": "Latent Pattern Identification Using Orthogonal-Constraint Coupled Nonnegative Matrix Factorization", "abstract": "The recent advancements and developments in Intelligent Transportation Systems (ITS) lead to the generation of abundant spatio-temporal traffic data. Identifying or understanding the latent patterns present in these spatio-temporal traffic data is very much essential and also challenging due to the fact that there is a chance of obtaining duplicate or similar patterns during the process of common pattern identification. This paper proposes an Orthogonal-Constraint Coupled Nonnegative Matrix Factorization (OC-CNMF) method and studies how to effectively identify the common as well as distinctive patterns that are hidden in the spatio-temporal traffic-related datasets. The distinctiveness of the patterns is achieved by the imposition of the orthogonality constraint in CNMF during the process of factorization. The imposition of the orthogonal constraint helps to ignore similar/duplicate patterns among the identification of the common patterns. We have shown that imposing orthogonality constraint in CNMF improves the convergence performance of the model and is able to identify common as well as distinctive patterns. Also, the performance of the OC-CNMF model is evaluated by comparing it with various performance evaluation measures."}}
{"id": "OV5bzTzhli", "cdate": 1640995200000, "mdate": 1682325650806, "content": {"title": "Optimizing MapReduce Task Scheduling on Virtualized Heterogeneous Environments Using Ant Colony Optimization", "abstract": "Consuming Hadoop MapReduce via virtual infrastructure as a service is becoming common practice as cloud service providers (CSP) offers relevant applications and scalable resources. One of the predominant requirements of cloud users is to improve resource utilization in the virtual cluster during the service period. However, it may not be possible when MapReduce workloads and virtual machines (VM) are highly heterogeneous. Therefore, in this paper, we addressed these heterogeneities and proposed an efficient MapReduce scheduler to improve resource utilization by placing the right combination of the map and reduce tasks in each VM in the virtual cluster. To achieve this, we transformed the MapReduce task scheduling problem into a 2-Dimensional (2D) bin packing model and obtained an optimal schedule using the ant colony optimization (ACO) algorithm. As an added advantage, our proposed ACO based bin packing (ACO-BP) scheduler minimized the makespan for a batch of jobs. To showcase the performance improvement, we compared our proposed scheduler with three existing schedulers that work well in a heterogeneous environment. As expected, results show that ACO-BP significantly outperformed the existing schedulers while dealing with workload and VM level heterogeneities."}}
{"id": "5ZXd4Hr0YKY", "cdate": 1640995200000, "mdate": 1682325651258, "content": {"title": "Digital Twin Model: A Real-Time Emotion Recognition System for Personalized Healthcare", "abstract": "Emotion recognition (ER) in healthcare has drawn substantial attention owing to recent advancements in machine-learning (ML) and deep-learning (DL) techniques. The ER system, along with a digital twin of a person in real time, will facilitate the monitoring, understanding, and improvement of the physical entity’s capabilities, as well as provide constant input to improve quality of life and well-being for personalized healthcare. However, building such ER systems in real time involves technical challenges, such as limited datasets, occlusion and lighting issues, identifying important features, false classification of emotions, and high implementation costs. To resolve this issue, we built a simple, efficient, and adaptable ER system by acquiring and processing images in real time using a web camera. In addition, we propose an end-to-end framework that combines an ER system with a digital twin setup, in which the predicted result can be analyzed and tested prior to providing the best possible personal healthcare treatment before it leads to any life-threatening disease. Our proposed ER system achieved promising results in less training time without compromising the accuracy. Thus, in real time, it will be helpful in healthcare centers to monitor a patient’s health condition, early diagnosis of life-threatening diseases, and to obtain the best and most effective treatment for patients during emergencies."}}
{"id": "0nNhpVW7h7k", "cdate": 1640995200000, "mdate": 1682325651152, "content": {"title": "UzADL: Anomaly detection and localization using graph Laplacian matrix-based unsupervised learning method", "abstract": ""}}
{"id": "wrgJp2zrJKQ", "cdate": 1609459200000, "mdate": 1682325651276, "content": {"title": "A new affinity matrix weighted k-nearest neighbors graph to improve spectral clustering accuracy", "abstract": "Researchers have thought about clustering approaches that incorporate traditional clustering methods and deep learning techniques. These approaches normally boost the performance of clustering. Getting knowledge from large data-sets is quite an interesting task. In this case, we use some dimensionality reduction and clustering techniques. Spectral clustering is gaining popularity recently because of its performance. Lately, numerous techniques have been introduced to boost spectral clustering performance. One of the most significant part of these techniques is to construct a similarity graph. We introduced weighted k-nearest neighbors technique for the construction of similarity graph. Using this new metric for the construction of affinity matrix, we achieved good results as we tested it both on real and artificial data-sets."}}
