{"id": "Bw0BDgiuamZ", "cdate": 1654411334850, "mdate": 1654411334850, "content": {"title": "Predicting the star rating of a business on Yelp using graph convolutional neural networks", "abstract": "Social media platforms have been rising steadily in recent years, influencing consumer spaces as a whole and individual users alike. Users also have the power of influencing the popularity of businesses or products on these platforms, driving the success level of different entities. Hence, understanding users' behavior is useful for businesses that want to cater to users' needs and know what market segment to direct efforts towards. In this paper, we are looking at how the star rating of a business on Yelp is determined by the profile of users who have rated it with a high score on Yelp. We are defining a graph between users on Yelp and businesses they gave high ratings to, and using graph convolutional neural networks to find node embeddings for businesses, by aggregating information from the users they are connected to. We show how a business's star rating can be predicted by aggregating local information about a business's neighborhood in the Yelp graph, as well as information about the business itself. "}}
{"id": "jz9FOpszYV", "cdate": 1640995200000, "mdate": 1675924389857, "content": {"title": "A large dataset of software mentions in the biomedical literature", "abstract": "We describe the CZ Software Mentions dataset, a new dataset of software mentions in biomedical papers. Plain-text software mentions are extracted with a trained SciBERT model from several sources: the NIH PubMed Central collection and from papers provided by various publishers to the Chan Zuckerberg Initiative. The dataset provides sources, context and metadata, and, for a number of mentions, the disambiguated software entities and links. We extract 1.12 million unique string software mentions from 2.4 million papers in the NIH PMC-OA Commercial subset, 481k unique mentions from the NIH PMC-OA Non-Commercial subset (both gathered in October 2021) and 934k unique mentions from 3 million papers in the Publishers' collection. There is variation in how software is mentioned in papers and extracted by the NER algorithm. We propose a clustering-based disambiguation algorithm to map plain-text software mentions into distinct software entities and apply it on the NIH PubMed Central Commercial collection. Through this methodology, we disambiguate 1.12 million unique strings extracted by the NER model into 97600 unique software entities, covering 78% of all software-paper links. We link 185000 of the mentions to a repository, covering about 55% of all software-paper links. We describe in detail the process of building the datasets, disambiguating and linking the software mentions, as well as opportunities and challenges that come with a dataset of this size. We make all data and code publicly available as a new resource to help assess the impact of software (in particular scientific open source projects) on science."}}
{"id": "yUJazUoHqF", "cdate": 1577836800000, "mdate": 1654410071383, "content": {"title": "Unsupervised Pre-training for Biomedical Question Answering", "abstract": ""}}
{"id": "GDEt-x_2Oko", "cdate": 1577836800000, "mdate": 1654410071383, "content": {"title": "Unsupervised Pre-training for Biomedical Question Answering", "abstract": "We explore the suitability of unsupervised representation learning methods on biomedical text -- BioBERT, SciBERT, and BioSentVec -- for biomedical question answering. To further improve unsupervised representations for biomedical QA, we introduce a new pre-training task from unlabeled data designed to reason about biomedical entities in the context. Our pre-training method consists of corrupting a given context by randomly replacing some mention of a biomedical entity with a random entity mention and then querying the model with the correct entity mention in order to locate the corrupted part of the context. This de-noising task enables the model to learn good representations from abundant, unlabeled biomedical text that helps QA tasks and minimizes the train-test mismatch between the pre-training task and the downstream QA tasks by requiring the model to predict spans. Our experiments show that pre-training BioBERT on the proposed pre-training task significantly boosts performance and outperforms the previous best model from the 7th BioASQ Task 7b-Phase B challenge."}}
