{"id": "tYAS1Rpys5", "cdate": 1652737378505, "mdate": null, "content": {"title": "Simulation-guided Beam Search for Neural Combinatorial Optimization", "abstract": "Neural approaches for combinatorial optimization (CO) equip a learning mechanism to discover powerful heuristics for solving complex real-world problems. While neural approaches capable of high-quality solutions in a single shot are emerging, state-of-the-art approaches are often unable to take full advantage of the solving time available to them. In contrast, hand-crafted heuristics perform highly effective search well and exploit the computation time given to them, but contain heuristics that are difficult to adapt to a dataset being solved. With the goal of providing a powerful search procedure to neural CO approaches, we propose simulation-guided beam search (SGBS), which examines candidate solutions within a fixed-width tree search that both a neural net-learned policy and a simulation (rollout) identify as promising. We further hybridize SGBS with efficient active search (EAS), where SGBS enhances the quality of solutions backpropagated in EAS, and EAS improves the quality of the policy used in SGBS. We evaluate our methods on well-known CO benchmarks and show that SGBS significantly improves the quality of the solutions found under reasonable runtime assumptions."}}
{"id": "VM63KmTOplu", "cdate": 1640995200000, "mdate": 1681298094648, "content": {"title": "Neural large neighborhood search for routing problems", "abstract": ""}}
{"id": "FjOPxkE0mi", "cdate": 1640995200000, "mdate": 1681138284593, "content": {"title": "Efficient Active Search for Combinatorial Optimization Problems", "abstract": ""}}
{"id": "9FnE6cQgKh", "cdate": 1640995200000, "mdate": 1651045816137, "content": {"title": "The First AI4TSP Competition: Learning to Solve Stochastic Routing Problems", "abstract": "This paper reports on the first international competition on AI for the traveling salesman problem (TSP) at the International Joint Conference on Artificial Intelligence 2021 (IJCAI-21). The TSP is one of the classical combinatorial optimization problems, with many variants inspired by real-world applications. This first competition asked the participants to develop algorithms to solve a time-dependent orienteering problem with stochastic weights and time windows (TD-OPSWTW). It focused on two types of learning approaches: surrogate-based optimization and deep reinforcement learning. In this paper, we describe the problem, the setup of the competition, the winning methods, and give an overview of the results. The winning methods described in this work have advanced the state-of-the-art in using AI for stochastic routing problems. Overall, by organizing this competition we have introduced routing problems as an interesting problem setting for AI researchers. The simulator of the problem has been made open-source and can be used by other researchers as a benchmark for new AI methods."}}
{"id": "24HL1VwK1h", "cdate": 1640995200000, "mdate": 1681298094639, "content": {"title": "Learning to Solve a Stochastic Orienteering Problem with Time Windows", "abstract": ""}}
{"id": "1O0Z538ZIP-", "cdate": 1640995200000, "mdate": 1681138284724, "content": {"title": "Simulation-guided Beam Search for Neural Combinatorial Optimization", "abstract": ""}}
{"id": "nO5caZwFwYu", "cdate": 1632875525801, "mdate": null, "content": {"title": "Efficient Active Search for Combinatorial Optimization Problems", "abstract": "Recently numerous machine learning based methods for combinatorial optimization problems have been proposed that learn to construct solutions in a sequential decision process via reinforcement learning. While these methods can be easily combined with search strategies like sampling and beam search, it is not straightforward to integrate them into a high-level search procedure offering strong search guidance. Bello et al. (2016) propose active search, which adjusts the weights of a (trained) model with respect to a single instance at test time using reinforcement learning. While active search is simple to implement, it is not competitive with state-of-the-art methods because adjusting all model weights for each test instance is very time and memory intensive. Instead of updating all model weights, we propose and evaluate three efficient active search strategies that only update a subset of parameters during the search. The proposed methods offer a simple way to significantly improve the search performance of a given model and outperform state-of-the-art machine learning based methods on combinatorial problems, even surpassing the well-known heuristic solver LKH3 on the capacitated vehicle routing problem. Finally, we show that (efficient) active search enables learned models to effectively solve instances that are much larger than those seen during training."}}
{"id": "BNAWdzBeEIG", "cdate": 1609459200000, "mdate": 1681915872363, "content": {"title": "Learning a Latent Search Space for Routing Problems using Variational Autoencoders", "abstract": "Methods for automatically learning to solve routing problems are rapidly improving in performance. While most of these methods excel at generating solutions quickly, they are unable to effectively utilize longer run times because they lack a sophisticated search component. We present a learning-based optimization approach that allows a guided search in the distribution of high-quality solutions for a problem instance. More precisely, our method uses a conditional variational autoencoder that learns to map points in a continuous (latent) search space to high-quality, instance-specific routing problem solutions. The learned space can then be searched by any unconstrained continuous optimization method. We show that even using a standard differential evolution search strategy our approach is able to outperform existing purely machine learning based approaches."}}
{"id": "90JprVrJBO", "cdate": 1601308205714, "mdate": null, "content": {"title": "Learning a Latent Search Space for Routing Problems using Variational Autoencoders", "abstract": "Methods for automatically learning to solve routing problems are rapidly improving in performance. While most of these methods excel at generating solutions quickly, they are unable to effectively utilize longer run times because they lack a sophisticated search component. We present a learning-based optimization approach that allows a guided search in the distribution of high-quality solutions for a problem instance. More precisely, our method uses a conditional variational autoencoder that learns to map points in a continuous (latent) search space to high-quality, instance-specific routing problem solutions. The learned space can then be searched by any unconstrained continuous optimization method. We show that even using a standard differential evolution search strategy our approach is able to outperform existing purely machine learning based approaches. "}}
{"id": "SGqwusXkOc", "cdate": 1577836800000, "mdate": 1681298094672, "content": {"title": "Neural Large Neighborhood Search for the Capacitated Vehicle Routing Problem", "abstract": ""}}
