{"id": "YCPmfirAcc", "cdate": 1652737321948, "mdate": null, "content": {"title": "High-dimensional Additive Gaussian Processes under Monotonicity Constraints", "abstract": "We introduce an additive Gaussian process (GP) framework accounting for monotonicity constraints and scalable to high dimensions. Our contributions are threefold. First, we show that our framework enables to satisfy the constraints everywhere in the input space. We also show that more general componentwise linear inequality constraints can be handled similarly, such as componentwise convexity. Second, we propose the additive MaxMod algorithm for sequential dimension reduction. By sequentially maximizing a squared-norm criterion, MaxMod identifies the active input dimensions and refines the most important ones. This criterion can be computed explicitly at a linear cost. Finally, we provide open-source codes for our full framework. We demonstrate the performance and scalability of the methodology in several synthetic examples with hundreds of dimensions under monotonicity constraints as well as on a real-world flood application."}}
{"id": "seT8f81NyA", "cdate": 1640995200000, "mdate": 1681649969213, "content": {"title": "High-dimensional additive Gaussian processes under monotonicity constraints", "abstract": ""}}
{"id": "-NW1gsbHvV", "cdate": 1640995200000, "mdate": 1681649969211, "content": {"title": "Multioutput Gaussian processes with functional data: A study on coastal flood hazard assessment", "abstract": ""}}
{"id": "v7E6dv9ECmM", "cdate": 1609459200000, "mdate": 1681910257715, "content": {"title": "Physically-Inspired Gaussian Process Models for Post-Transcriptional Regulation in Drosophila", "abstract": "The regulatory process of Drosophila is thoroughly studied for understanding a great variety of biological principles. While pattern-forming gene networks are analyzed in the transcription step, post-transcriptional events (e.g., translation, protein processing) play an important role in establishing protein expression patterns and levels. Since the post-transcriptional regulation of Drosophila depends on spatiotemporal interactions between mRNAs and gap proteins, proper physically-inspired stochastic models are required to study the link between both quantities. Previous research attempts have shown that using Gaussian processes (GPs) and differential equations lead to promising predictions when analyzing regulatory networks. Here, we aim at further investigating two types of physically-inspired GP models based on a reaction-diffusion equation where the main difference lies in where the prior is placed. While one of them has been studied previously using protein data only, the other is novel and yields a simple approach requiring only the differentiation of kernel functions. In contrast to other stochastic frameworks, discretizing the spatial space is not required here. Both GP models are tested under different conditions depending on the availability of gap gene mRNA expression data. Finally, their performances are assessed on a high-resolution dataset describing the blastoderm stage of the early embryo of Drosophila melanogaster."}}
{"id": "_ZfDchBleQh", "cdate": 1546300800000, "mdate": null, "content": {"title": "Gaussian Process Modulated Cox Processes under Linear Inequality Constraints", "abstract": "Gaussian process (GP) modulated Cox processes are widely used to model point patterns. Existing approaches require a mapping (link function) between the unconstrained GP and the positive intensity ..."}}
{"id": "MSCqkiPTmq", "cdate": 1546300800000, "mdate": 1681910257739, "content": {"title": "Switched Latent Force Models for Reverse-Engineering Transcriptional Regulation in Gene Expression Data", "abstract": "To survive environmental conditions, cells transcribe their response activities into encoded mRNA sequences in order to produce certain amounts of protein concentrations. The external conditions are mapped into the cell through the activation of special proteins called transcription factors (TFs). Due to the difficult task to measure experimentally TF behaviors, and the challenges to capture their quick-time dynamics, different types of models based on differential equations have been proposed. However, those approaches usually incur in costly procedures, and they present problems to describe sudden changes in TF regulators. In this paper, we present a switched dynamical latent force model for reverse-engineering transcriptional regulation in gene expression data which allows the exact inference over latent TF activities driving some observed gene expressions through a linear differential equation. To deal with discontinuities in the dynamics, we introduce an approach that switches between different TF activities and different dynamical systems. This creates a versatile representation of transcription networks that can capture discrete changes and non-linearities. We evaluate our model on both simulated data and real data (e.g., microaerobic shift in E. coli, yeast respiration), concluding that our framework allows for the fitting of the expression data while being able to infer continuous-time TF profiles."}}
{"id": "9a4mmMf6Sj", "cdate": 1546300800000, "mdate": 1681649969490, "content": {"title": "Approximating Gaussian Process Emulators with Linear Inequality Constraints and Noisy Observations via MC and MCMC", "abstract": ""}}
{"id": "2RV9nL0QtOg", "cdate": 1514764800000, "mdate": 1681649969467, "content": {"title": "Finite-Dimensional Gaussian Approximation with Linear Inequality Constraints", "abstract": ""}}
{"id": "l-ntmbWkidG", "cdate": 1451606400000, "mdate": null, "content": {"title": "Sparse Linear Models Applied to Power Quality Disturbance Classification", "abstract": "The automatic recognition of Power Quality (PQ) disturbances can be seen as a pattern recognition problem, in which different types of waveform distortion are differentiated based on their features. Similar to other quasi-stationary signals, PQ disturbances can be decomposed into time-frequency dependent components by using time-frequency or time-scale dictionaries. Short-time Fourier, Wavelets, and Stockwell transforms are some of the most common dictionaries used in the PQ community. Previous works about PQ disturbance classification have been restricted to the use of one of the above dictionaries. Taking advantage of the theory behind sparse linear models (SLMs), we introduce a sparse method for PQ representation, starting from overcomplete dictionaries. We apply Group Lasso. We employ different types of time-frequency dictionaries to characterize PQ disturbances and evaluate their performance under different pattern recognition algorithms. We show that SLMs promote the sparse basis selection improving the classification accuracy."}}
{"id": "xCSi_wh66bz", "cdate": 1420070400000, "mdate": null, "content": {"title": "Gaussian Processes for Slice-Based Super-Resolution MR Images", "abstract": "Magnetic resonance imaging (MRI) is a medical technique used in radiology to obtain anatomical images of healthy and pathological tissues. Due to hardware limitations and clinical protocols, MRI data are often acquired with low-resolution. For this reason, the scientific community has been developing super-resolution (SR) methodologies in order to enhance spatial resolution through post-processing of 2D multi-slice images. The enhancement of spatial resolution in magnetic resonance (MR) images improves clinical procedures such as tissue segmentation, registration and disease diagnosis. Several methods to perform SR-MR images have been proposed. However, they present different drawbacks: sensitivity to noise, high computational cost, and complex optimization algorithms. In this paper, we develop a supervised learning methodology to perform SR-MR images using a patch-based Gaussian process regression (GPR) method. We compare our approach with nearest-neighbor interpolation, B-splines and a SR-GPR scheme based on nearest-neighbors. We test our SR-GPR algorithm in MRI-T1 and MRI-T2 studies, evaluating the performance through error metrics and morphological validation (tissue segmentation). Results obtained with our methodology outperform the other alternatives for all validation protocols."}}
