{"id": "rkZ7O9WOWH", "cdate": 1514764800000, "mdate": null, "content": {"title": "Perturbation Robust Representations of Topological Persistence Diagrams", "abstract": "Topological methods for data analysis present opportunities for enforcing certain invariances of broad interest in computer vision, including view-point in activity analysis, articulation in shape analysis, and measurement invariance in non-linear dynamical modeling. The increasing success of these methods is attributed to the complementary information that topology provides, as well as availability of tools for computing topological summaries such as persistence diagrams. However, persistence diagrams are multi-sets of points and hence it is not straightforward to fuse them with features used for contemporary machine learning tools like deep-nets. In this paper we present theoretically well-grounded approaches to develop novel perturbation robust topological representations, with the long-term view of making them amenable to fusion with contemporary learning architectures. We term the proposed representation as Perturbed Topological Signatures, which live on a Grassmann manifold and hence can be efficiently used in machine learning pipelines. We explore the use of the proposed descriptor on three applications: 3D shape analysis, view-invariant activity analysis, and non-linear dynamical modeling. We show favorable results in both high-level recognition performance and time-complexity when compared to other baseline methods."}}
{"id": "H14Z0aZd-r", "cdate": 1451606400000, "mdate": null, "content": {"title": "Riemannian Geometric Approaches for Measuring Movement Quality", "abstract": "A growing set of applications in home-based interactive physical therapy require the ability to monitor, inform and assess the quality of everyday movements. Interactive therapy requires both real-time feedback of movement quality, as well as summative feedback of quality over a period of time. Obtaining labeled data from trained experts is the main limitation, since it is both expensive and time consuming. Motivated by recent studies in motor-control, we propose an unsupervised approach that measures movement quality of simple actions by considering the deviation of a trajectory from an ideal movement path in the configuration space. We use two different configuration spaces to demonstrate this idea - the product space S <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup> × S <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup> to model the interaction of two joint angles, and SE(3) × SE(3) to model the movement of two joints, for two different applications in movement quality estimation. We also describe potential applications of these ideas to assess quality in real-time."}}
