{"id": "gt-l9Hu2ndd", "cdate": 1652737625756, "mdate": null, "content": {"title": "Model Preserving Compression for Neural Networks", "abstract": "After training complex deep learning models, a common task is to compress the model to reduce compute and storage demands. When compressing, it is desirable to preserve the original model's per-example decisions (e.g., to go beyond top-1 accuracy or preserve robustness), maintain the network's structure, automatically determine per-layer compression levels, and eliminate the need for fine tuning. No existing compression methods simultaneously satisfy these criteria---we introduce a principled approach that does by leveraging interpolative decompositions. Our approach simultaneously selects and eliminates channels (analogously, neurons), then constructs an interpolation matrix that propagates a correction into the next layer, preserving the network's structure. Consequently, our method achieves good performance even without fine tuning and admits theoretical analysis. Our theoretical generalization bound for a one layer network lends itself naturally to a heuristic that allows our method to automatically choose per-layer sizes for deep networks. We demonstrate the efficacy of our approach with strong empirical performance on a variety of tasks, models, and datasets---from simple one-hidden-layer networks to deep networks on ImageNet.\n"}}
{"id": "g-I_qqceH2n", "cdate": 1652737462206, "mdate": null, "content": {"title": "Communication-efficient distributed eigenspace estimation with arbitrary node failures", "abstract": "We develop an eigenspace estimation algorithm for distributed environments with arbitrary node failures, where a subset of computing nodes can return structurally valid but otherwise arbitrarily chosen responses. Notably, this setting encompasses several important scenarios that arise in distributed computing and data-collection environments such as silent/soft errors, outliers or corrupted data at certain nodes, and adversarial responses. Our estimator builds upon and matches the performance of a recently proposed non-robust estimator up to an additive $\\tilde{O}(\\sigma \\sqrt{\\alpha})$ error, where $\\sigma^2$ is the variance of the existing estimator and $\\alpha$ is the fraction of corrupted nodes."}}
{"id": "Od7OEyf8PcU", "cdate": 1652125708274, "mdate": 1652125708274, "content": {"title": "Fast Matrix Square Roots with Applications to Gaussian Processes and Bayesian Optimization", "abstract": "Matrix square roots and their inverses arise frequently in machine learning, eg, when sampling from high-dimensional Gaussians N (0, K) or “whitening” a vector b against covariance matrix K. While existing methods typically require O (N^ 3) computation, we introduce a highly-efficient quadratic-time algorithm for computing K^{1/2} b, K^{-1/2} b, and their derivatives through matrix-vector multiplication (MVMs). Our method combines Krylov subspace methods with a rational approximation and typically achieves 4 decimal places of accuracy with fewer than 100 MVMs. Moreover, the backward pass requires little additional computation. We demonstrate our method's applicability on matrices as large as 50,000 by 50,000-well beyond traditional methods-with little approximation error. Applying this increased scalability to variational Gaussian processes, Bayesian optimization, and Gibbs sampling results in more powerful models with higher accuracy. In particular, we perform variational GP inference with up to 10,000 inducing points and perform Gibbs sampling on a 25,000-dimensional problem.\n"}}
{"id": "kFPMDX4KN1", "cdate": 1640995200000, "mdate": 1682523018746, "content": {"title": "Linear Time Kernel Matrix Approximation via Hyperspherical Harmonics", "abstract": "We propose a new technique for constructing low-rank approximations of matrices that arise in kernel methods for machine learning. Our approach pairs a novel automatically constructed analytic expansion of the underlying kernel function with a data-dependent compression step to further optimize the approximation. This procedure works in linear time and is applicable to any isotropic kernel. Moreover, our method accepts the desired error tolerance as input, in contrast to prevalent methods which accept the rank as input. Experimental results show our approach compares favorably to the commonly used Nystrom method with respect to both accuracy for a given rank and computational time for a given accuracy across a variety of kernels, dimensions, and datasets. Notably, in many of these problem settings our approach produces near-optimal low-rank approximations. We provide an efficient open-source implementation of our new technique to complement our theoretical developments and experimental results."}}
{"id": "dJ6EXJopUcr", "cdate": 1640995200000, "mdate": 1682523018746, "content": {"title": "The Fast Kernel Transform", "abstract": "Kernel methods are a highly effective and widely used collection of modern machine learning algorithms. A fundamental limitation of virtually all such methods are computations involving the kernel matrix that naively scale quadratically (e.g., matrix-vector multiplication) or cubically (solving linear systems) with the size of the dataset N. We propose the Fast Kernel Transform (FKT), a general algorithm to compute matrix-vector multiplications (MVMs) for datasets in moderate dimensions with quasilinear complexity. Typically, analytically grounded fast multiplication methods require specialized development for specific kernels. In contrast, our scheme is based on auto-differentiation and automated symbolic computations that leverage the analytical structure of the underlying kernel. This allows the FKT to be easily applied to a broad class of kernels, including Gaussian, Matern, and Rational Quadratic covariance functions and Green’s functions, including those of the Laplace and Helmholtz equations. Furthermore, the FKT maintains a high, quantifiable, and controllable level of accuracy—properties that many acceleration methods lack. We illustrate the efficacy and versatility of the FKT by providing timing and accuracy benchmarks with comparisons to adjacent methods, and by applying it to scale the stochastic neighborhood embedding (t-SNE) and Gaussian processes to large real-world datasets."}}
{"id": "YhHJD29YGt6", "cdate": 1640995200000, "mdate": 1682523018749, "content": {"title": "Communication-efficient distributed eigenspace estimation with arbitrary node failures", "abstract": "We develop an eigenspace estimation algorithm for distributed environments with arbitrary node failures, where a subset of computing nodes can return structurally valid but otherwise arbitrarily chosen responses. Notably, this setting encompasses several important scenarios that arise in distributed computing and data-collection environments such as silent/soft errors, outliers or corrupted data at certain nodes, and adversarial responses. Our estimator builds upon and matches the performance of a recently proposed non-robust estimator up to an additive $\\tilde{O}(\\sigma \\sqrt{\\alpha})$ error, where $\\sigma^2$ is the variance of the existing estimator and $\\alpha$ is the fraction of corrupted nodes."}}
{"id": "TBPL4_gfoW", "cdate": 1640995200000, "mdate": 1682523018786, "content": {"title": "Data-Driven Algorithms for Signal Processing with Trigonometric Rational Functions", "abstract": "Rational approximation schemes for reconstructing periodic signals from samples with poorly separated spectral content are described. These methods are automatic and adaptive, requiring no tuning or manual parameter selection. Collectively, they form a framework for fitting trigonometric rational models to data that is robust to various forms of corruption, including additive Gaussian noise, perturbed sampling grids, and missing data. Our approach combines a variant of Prony's method with a modified version of the adaptive Antoulas--Anderson algorithm. Using representations in both frequency and time space, a collection of algorithms is described for adaptively computing with trigonometric rationals. This includes procedures for differentiation, filtering, convolution, and more. A new MATLAB software system based on these algorithms is introduced. Its effectiveness is illustrated with synthetic and practical examples drawn from applications including biomedical monitoring, acoustic denoising, and feature detection."}}
{"id": "tcDnbJTs_P", "cdate": 1609459200000, "mdate": 1682523018785, "content": {"title": "Parallel Skeletonization for Integral Equations in Evolving Multiply-Connected Domains", "abstract": ""}}
{"id": "onDqFG_cJQE", "cdate": 1609459200000, "mdate": 1682523018787, "content": {"title": "Data-driven Algorithms for signal processing with rational functions", "abstract": "Rational approximation schemes for reconstructing periodic signals from samples with poorly separated spectral content are described. These methods are automatic and adaptive, requiring no tuning or manual parameter selection. Collectively, they form a framework for fitting trigonometric rational models to data that is robust to various forms of corruption, including additive Gaussian noise, perturbed sampling grids, and missing data. Our approach combines a variant of Prony's method with a modified version of the AAA algorithm. Using representations in both frequency and time space, a collection of algorithms is described for adaptively computing with trigonometric rationals. This includes procedures for differentiation, filtering, convolution, and more. A new MATLAB software system based on these algorithms is introduced. Its effectiveness is illustrated with synthetic and practical examples drawn from applications including biomedical monitoring, acoustic denoising, and feature detection."}}
{"id": "Wiy56F61s1", "cdate": 1609459200000, "mdate": 1682523018785, "content": {"title": "Communication-Efficient Distributed Eigenspace Estimation", "abstract": ""}}
