{"id": "9NOyrfUBtx1", "cdate": 1639037106359, "mdate": null, "content": {"title": "Signal Domain Learning Approach for Optoacoustic Image Reconstruction from Limited View Data", "abstract": "Multi-spectral optoacoustic tomography (MSOT) relies on optical excitation of tissues with subsequent detection of the generated ultrasound waves. Optimal image quality in MSOT is achieved by detection of signals from a broad tomographic view. However, due to physical constraints and other cost-related considerations, most imaging systems are implemented with probes having limited tomographic coverage around the imaged object, such as linear array transducers often employed for clinical ultrasound (US) imaging. MSOT image reconstruction from limited-view data results in arc-shaped image artifacts and disrupted shape of the vascular structures. Deep learning methods have previously been used to recover MSOT images from incomplete tomographic data, albeit poor performance was attained when training with data from simulations or other imaging modalities. We propose a two-step method consisting of i) style transfer for domain adaptation between simulated and experimental MSOT signals, and ii) supervised training on simulated data to recover missing tomographic signals in realistic clinical data. The method is shown capable of correcting images reconstructed from sub-optimal probe geometries using only signal domain data without the need for training with ground truth (GT) full-view images."}}
{"id": "EuKRMa3xaKA", "cdate": 1620510775505, "mdate": null, "content": {"title": "Sparse Regression Based Structure Learning of Stochastic Reaction Networks from Single Cell Snapshot Time Series", "abstract": "Stochastic chemical reaction networks constitute a model class to quantitatively describe\ndynamics and cell-to-cell variability in biological systems. The topology of these networks\ntypically is only partially characterized due to experimental limitations. Current approaches\nfor refining network topology are based on the explicit enumeration of alternative topologies\nand are therefore restricted to small problem instances with almost complete knowledge.\nWe propose the reactionet lasso, a computational procedure that derives a stepwise sparse\nregression approach on the basis of the Chemical Master Equation, enabling large-scale\nstructure learning for reaction networks by implicitly accounting for billions of topology variants. We have assessed the structure learning capabilities of the reactionet lasso on synthetic data for the complete TRAIL induced apoptosis signaling cascade comprising 70 reactions. We find that the reactionet lasso is able to efficiently recover the structure of\nthese reaction systems, ab initio, with high sensitivity and specificity. With only < 1% false\ndiscoveries, the reactionet lasso is able to recover 45% of all true reactions ab initio among\n> 6000 possible reactions and over 102000 network topologies. In conjunction with information rich single cell technologies such as single cell RNA sequencing or mass cytometry, the reactionet lasso will enable large-scale structure learning, particularly in areas with partial network structure knowledge, such as cancer biology, and thereby enable the detection of\npathological alterations of reaction networks. We provide software to allow for wide applicability of the reactionet lasso."}}
{"id": "vzY9yR-sOmA", "cdate": 1599217033597, "mdate": null, "content": {"title": "Poincaré maps for analyzing complex hierarchies in single-cell data", "abstract": "The need to understand cell developmental processes spawned a plethora of computational\nmethods for discovering hierarchies from scRNAseq data. However, existing techniques are\nbased on Euclidean geometry, a suboptimal choice for modeling complex cell trajectories with\nmultiple branches. To overcome this fundamental representation issue we propose Poincaré\nmaps, a method that harness the power of hyperbolic geometry into the realm of single-cell\ndata analysis. Often understood as a continuous extension of trees, hyperbolic geometry\nenables the embedding of complex hierarchical data in only two dimensions while preserving\nthe pairwise distances between points in the hierarchy. This enables the use of our\nembeddings in a wide variety of downstream data analysis tasks, such as visualization,\nclustering, lineage detection and pseudotime inference. When compared to existing methods\n— unable to address all these important tasks using a single embedding — Poincaré maps\nproduce state-of-the-art two-dimensional representations of cell trajectories on multiple\nscRNAseq datasets."}}
