{"id": "5DUMhowq9IG", "cdate": 1667429156623, "mdate": 1667429156623, "content": {"title": "Bayesian Tracking of Video Graphs Using Joint Kalman Smoothing and Registration", "abstract": "Graph-based representations are becoming increasingly popular for representing and analyzing video data, especially in object tracking and scene understanding applications. Accordingly, an essential tool in this approach is to generate statistical inferences for graphical time series associated with videos. This paper develops a Kalman-smoothing method for estimating graphs from noisy, cluttered, and incomplete data. The main challenge here is to find and preserve the registration of nodes (salient detected objects) across time frames when the data has noise and clutter due to false and missing nodes. First, we introduce a quotient-space representation of graphs that incorporates temporal registration of nodes, and we use that metric structure to impose a dynamical model on graph evolution. Then, we derive a Kalman smoother, adapted to the quotient space geometry, to estimate dense, smooth trajectories of graphs. We demonstrate this framework using simulated data and actual video graphs extracted from the Multiview Extended Video with Activities (MEVA) dataset. This framework successfully estimates graphs despite the noise, clutter, and missed detections."}}
{"id": "U44ZAKNwI3v", "cdate": 1667365262574, "mdate": 1667365262574, "content": {"title": "3D Face Recognition under Expressions, Occlusions, and Pose Variations", "abstract": "We propose a novel geometric framework for analyzing 3D faces, with the specific goals of comparing, matching, and averaging their shapes. Here we represent facial surfaces by radial curves emanating from the nose tips and use elastic shape analysis of these curves to develop a Riemannian framework for analyzing shapes of full facial surfaces. This representation, along with the elastic Riemannian metric, seems natural for measuring facial deformations and is robust to challenges such as large facial expressions (especially those with open mouths), large pose variations, missing parts, and partial occlusions due to glasses, hair, and so on. This framework is shown to be promising from both-empirical and theoretical-perspectives. In terms of the empirical evaluation, our results match or improve upon the state-of-the-art methods on three prominent databases: FRGCv2, GavabDB, and Bosphorus, each posing a different type of challenge. From a theoretical perspective, this framework allows for formal statistical inferences, such as the estimation of missing facial parts using PCA on tangent spaces and computing average shapes."}}
{"id": "HjiEzMQeO6r", "cdate": 1546300800000, "mdate": null, "content": {"title": "Video-Based Action Recognition Using Dimension Reduction of Deep Covariance Trajectories.", "abstract": "Convolutional Neural Networks (CNNs) have been very successful in extracting discriminative features from video data. These deep features can be summarized using covariance descriptors for further analysis. However, due to large number of potential features, the covariance descriptors are often very high dimensional. To facilitate large scale data analysis, we propose a novel, metric-based dimension-reduction technique that reduces large covariances to small ones. Then, we represent videos as trajectories on the space of covariance matrices, or symmetric-positive definite matrices (SPDMs), and use a Riemannian metric on this space to quantify differences across these trajectories. These distance features can then be used for classification of video sequences. We illustrate this comprehensive framework using data from the UCF11 dataset for action recognition, with classification rates that match or outperform state-of-the-art techniques."}}
{"id": "rJVEnaZubr", "cdate": 1514764800000, "mdate": null, "content": {"title": "Temporal Alignment Improves Feature Quality: An Experiment on Activity Recognition With Accelerometer Data", "abstract": "Activity recognition has been receiving significant attention from a variety of research areas such as human performance enhancement, health promotion, and human computer interaction. However, recognizing activities from accelerometer data still remains a challenging problem due to sensitivity to sampling rates, misalignment of data, and increased variability in activities among clinically relevant populations. In order to solve these issues, we adopt methods from functional analysis, which consider non-elastic rate variations in movement. The overall framework factors out temporal variability within activity classes, before leveraging robust machine learning pipelines for a given end-use. The proposed approach has been evaluated on 7 classes of everyday activities with 50 subjects. The results indicate that proposed approach achieves improved performance with the improvements observed in separating similar classes that differ in temporal rates, and also demonstrate higher robustness to change in window lengths. These results suggest that temporal alignment should be considered a core part of activity recognition pipelines."}}
{"id": "rJEQiRWdbB", "cdate": 1514764800000, "mdate": null, "content": {"title": "Elastic Handling of Predictor Phase in Functional Regression Models", "abstract": "Functional variables serve important roles as predictors in a variety of pattern recognition and vision applications. Focusing on a specific subproblem, termed scalar-on-function regression, most current approaches adopt the standard L2 inner product to form a link between functional predictors and scalar responses. These methods may perform poorly when predictor functions contain nuisance phase variability, i.e., predictors are temporally misaligned due to noise. While a simple solution could be to pre-align predictors as a pre-processing step, before applying a regression model, this alignment is seldom optimal from the perspective of regression. We propose a new approach, termed elastic functional regression, where alignment is included in the regression model itself, and is performed in conjunction with the estimation of other model parameters. This model is based on a norm preserving warping of predictors, not the standard time warping of functions, and provides better prediction in situations where the shape or the amplitude of the predictor is more useful than its phase. We demonstrate the effectiveness of this framework using simulated and stock market data."}}
{"id": "rQVVBo4lupB", "cdate": 1483228800000, "mdate": null, "content": {"title": "Numerical Inversion of SRNF Maps for Elastic Shape Analysis of Genus-Zero Surfaces.", "abstract": "Recent developments in elastic shape analysis (ESA) are motivated by the fact that it provides a comprehensive framework for simultaneous registration, deformation, and comparison of shapes. These methods achieve computational efficiency using certain square-root representations that transform invariant elastic metrics into euclidean metrics, allowing for the application of standard algorithms and statistical tools. For analyzing shapes of embeddings of <inline-formula><tex-math notation=\"LaTeX\">$\\mathbf {S}^2$</tex-math></inline-formula> in <inline-formula> <tex-math notation=\"LaTeX\">$\\mathbb {R}^3$</tex-math></inline-formula> , Jermyn et al.  <xref ref-type=\"bibr\" rid=\"ref1\">[1]</xref> introduced square-root normal fields (SRNFs), which transform an elastic metric, with desirable invariant properties, into the <inline-formula><tex-math notation=\"LaTeX\">$\\mathbb {L}^2$</tex-math></inline-formula> metric. These SRNFs are essentially surface normals scaled by square-roots of infinitesimal area elements. A critical need in shape analysis is a method for inverting solutions (deformations, averages, modes of variations, etc.) computed in SRNF space, back to the original surface space for visualizations and inferences. Due to the lack of theory for understanding SRNF maps and their inverses, we take a numerical approach, and derive an efficient multiresolution algorithm, based on solving an optimization problem in the surface space, that estimates surfaces corresponding to given SRNFs. This solution is found to be effective even for complex shapes that undergo significant deformations including bending and stretching, e.g., human bodies and animals. We use this inversion for computing elastic shape deformations, transferring deformations, summarizing shapes, and for finding modes of variability in a given collection, while simultaneously registering the surfaces. We demonstrate the proposed algorithms using a statistical analysis of human body shapes, classification of generic surfaces, and analysis of brain structures."}}
{"id": "Ss854hSgOpr", "cdate": 1483228800000, "mdate": null, "content": {"title": "Elastic Functional Coding of Riemannian Trajectories.", "abstract": "Visual observations of dynamic phenomena, such as human actions, are often represented as sequences of smoothly-varying features. In cases where the feature spaces can be structured as Riemannian manifolds, the corresponding representations become trajectories on manifolds. Analysis of these trajectories is challenging due to non-linearity of underlying spaces and high-dimensionality of trajectories. In vision problems, given the nature of physical systems involved, these phenomena are better characterized on a low-dimensional manifold compared to the space of Riemannian trajectories. For instance, if one does not impose physical constraints of the human body, in data involving human action analysis, the resulting representation space will have highly redundant features. Learning an effective, low-dimensional embedding for action representations will have a huge impact in the areas of search and retrieval, visualization, learning, and recognition. Traditional manifold learning addresses this problem for static points in the euclidean space, but its extension to Riemannian trajectories is non-trivial and remains unexplored. The difficulty lies in inherent non-linearity of the domain and temporal variability of actions that can distort any traditional metric between trajectories. To overcome these issues, we use the framework based on transported square-root velocity fields (TSRVF); this framework has several desirable properties, including a rate-invariant metric and vector space representations. We propose to learn an embedding such that each action trajectory is mapped to a single point in a low-dimensional euclidean space, and the trajectories that differ only in temporal rates map to the same point. We utilize the TSRVF representation, and accompanying statistical summaries of Riemannian trajectories, to extend existing coding methods such as PCA, KSVD and Label Consistent KSVD to Riemannian trajectories or more generally to Riemannian functions. We show that such coding efficiently captures trajectories in applications such as action recognition, stroke rehabilitation, visual speech recognition, clustering and diverse sequence sampling. Using this framework, we obtain state-of-the-art recognition results, while reducing the dimensionality/ complexity by a factor of 100-250x. Since these mappings and codes are invertible, they can also be used to interactively-visualize Riemannian trajectories and synthesize actions."}}
{"id": "SijE3A8e_TS", "cdate": 1483228800000, "mdate": null, "content": {"title": "Spatially Coherent Interpretations of Videos Using Pattern Theory.", "abstract": "Activity interpretation in videos results not only in recognition or labeling of dominant activities, but also in semantic descriptions of scenes. Towards this broader goal, we present a combinatorial approach that assumes availability of algorithms for detecting and labeling objects and basic actions in videos, albeit with some errors. Given these uncertain labels and detected objects, we link them into interpretable structures using the domain knowledge, under the framework of Grenander’s general pattern theory. Here a semantic description is built using basic units, termed generators, that represent either objects or actions. These generators have multiple out-bonds, each associated with different types of domain semantics, spatial constraints, and image evidence. The generators combine, according to a set of pre-defined combination rules that capture domain semantics, to form larger configurations that represent video interpretations. This framework derives its representational power from flexibility in size and structure of configurations. We impose a probability distribution on the configuration space, with inferences generated using a Markov chain Monte Carlo-based simulated annealing process. The primary advantage of the approach is that it handles known challenges—appearance variabilities, errors in object labels, object clutter, simultaneous events, etc—without the need for exponentially-large (labeled) training data. Experimental results demonstrate its ability to successfully provide interpretations under clutter and the simultaneity of events. They show: (1) a performance increase of more than 30 % over other state-of-the-art approaches using more than 5000 video units from the Breakfast Actions dataset, and (2) an overall recall and precision improvement of more than 50 and 100 %, respectively, on the YouCook data set."}}
{"id": "rQ4ZFlSxu6H", "cdate": 1451606400000, "mdate": null, "content": {"title": "Gauge Invariant Framework for Shape Analysis of Surfaces.", "abstract": "This paper describes a novel framework for computing geodesic paths in shape spaces of spherical surfaces under an elastic Riemannian metric. The novelty lies in defining this Riemannian metric directly on the quotient (shape) space, rather than inheriting it from pre-shape space, and using it to formulate a path energy that measures only the normal components of velocities along the path. In other words, this paper defines and solves for geodesics directly on the shape space and avoids complications resulting from the quotient operation. This comprehensive framework is invariant to arbitrary parameterizations of surfaces along paths, a phenomenon termed as gauge invariance. Additionally, this paper makes a link between different elastic metrics used in the computer science literature on one hand, and the mathematical literature on the other hand, and provides a geometrical interpretation of the terms involved. Examples using real and simulated 3D objects are provided to help illustrate the main ideas."}}
{"id": "BkWArTbd-H", "cdate": 1451606400000, "mdate": null, "content": {"title": "Testing Stationarity of Brain Functional Connectivity Using Change-Point Detection in fMRI Data", "abstract": "This paper studies two questions: (1) Does the functional connectivity (FC) in a human brain remain stationary during performance of a task? (2) If it is non-stationary, how can one evaluate and estimate dynamic FC? The framework presented here relies on pre-segmented brain regions to represent instantaneous FC as symmetric, positive-definite matrices (SPDMs), with entries denoting covariances of fMRI signals across regions. The time series of such SPDMs is tested for change point detection using two important ideas: (1) a convenient Riemannian structure on the space of SPDMs for calculating geodesic distances and sample statistics, and (2) a graph-based approach, for testing similarity of distributions, that uses pairwise distances and a minimal spanning tree. This hypothesis test results in a temporal segmentation of observation interval into parts with stationary connectivity and an estimation of graph displaying FC during each such interval. We demonstrate these ideas using fMRI data from HCP database."}}
