{"id": "nOa_NGsRTG", "cdate": 1640995200000, "mdate": 1667403467502, "content": {"title": "Simple but Effective: CLIP Embeddings for Embodied AI", "abstract": ""}}
{"id": "MRFGedEZ3eu", "cdate": 1640995200000, "mdate": 1667403467497, "content": {"title": "A-OKVQA: A Benchmark for Visual Question Answering using World Knowledge", "abstract": "The Visual Question Answering (VQA) task aspires to provide a meaningful testbed for the development of AI models that can jointly reason over visual and natural language inputs. Despite a proliferation of VQA datasets, this goal is hindered by a set of common limitations. These include a reliance on relatively simplistic questions that are repetitive in both concepts and linguistic structure, little world knowledge needed outside of the paired image, and limited reasoning required to arrive at the correct answer. We introduce A-OKVQA, a crowdsourced dataset composed of a diverse set of about 25K questions requiring a broad base of commonsense and world knowledge to answer. In contrast to the existing knowledge-based VQA datasets, the questions generally cannot be answered by simply querying a knowledge base, and instead require some form of commonsense reasoning about the scene depicted in the image. We demonstrate the potential of this new dataset through a detailed analysis of its contents and baseline performance measurements over a variety of state-of-the-art vision-language models. Project page: http://a-okvqa.allenai.org/"}}
{"id": "GnIlKltlfo", "cdate": 1640995200000, "mdate": 1667403467517, "content": {"title": "What's in a Decade? Transforming Faces Through Time", "abstract": "How can one visually characterize people in a decade? In this work, we assemble the Faces Through Time dataset, which contains over a thousand portrait images from each decade, spanning the 1880s to the present day. Using our new dataset, we present a framework for resynthesizing portrait images across time, imagining how a portrait taken during a particular decade might have looked like, had it been taken in other decades. Our framework optimizes a family of per-decade generators that reveal subtle changes that differentiate decade--such as different hairstyles or makeup--while maintaining the identity of the input portrait. Experiments show that our method is more effective in resynthesizing portraits across time compared to state-of-the-art image-to-image translation methods, as well as attribute-based and language-guided portrait editing models. Our code and data will be available at https://facesthroughtime.github.io"}}
{"id": "Pra2KaaCt1", "cdate": 1609459200000, "mdate": 1667403467507, "content": {"title": "Who's Waldo? Linking People Across Text and Images", "abstract": ""}}
{"id": "hjH7HGEU4E", "cdate": 1577836800000, "mdate": 1667403467495, "content": {"title": "An Ethical Highlighter for People-Centric Dataset Creation", "abstract": "Important ethical concerns arising from computer vision datasets of people have been receiving significant attention, and a number of datasets have been withdrawn as a result. To meet the academic need for people-centric datasets, we propose an analytical framework to guide ethical evaluation of existing datasets and to serve future dataset creators in avoiding missteps. Our work is informed by a review and analysis of prior works and highlights where such ethical challenges arise."}}
