{"id": "7wLU_VNg-D7", "cdate": 1514764800000, "mdate": 1631766271533, "content": {"title": "A Stochastic Differential Equation Framework for Guiding Online User Activities in Closed Loop", "abstract": "Recently, there is a surge of interest in using point processes to model continuous-time user activities. This framework has resulted in novel models and improved performance in diverse application..."}}
{"id": "WaK_DFVEaz", "cdate": 1483228800000, "mdate": 1631766271529, "content": {"title": "Detecting Changes in Dynamic Events Over Networks", "abstract": "Large volumes of networked streaming event data are becoming increasingly available in a wide variety of applications such as social network analysis, Internet traffic monitoring, and health care analytics. Streaming event data are discrete observations occurring in continuous time, and the precise time interval between two events carries substantial information about the dynamics of the underlying systems. How does one promptly detect changes in these dynamic systems using these streaming event data? In this paper, we propose a novel change-point detection framework for multidimensional event data over networks. We cast the problem into a sequential hypothesis test, and we derive the likelihood ratios for point processes, which are computed efficiently via an expectation-maximization (EM) like algorithm that is parameter free and can be computed in a distributed manner. We derive a highly accurate theoretical characterization of the falsealarm rate, and we show that the method can provide weak signal detection by aggregating local statistics over time and networks. Finally, we demonstrate the good performance of our algorithm on numerical examples and real-world datasets from Twitter and Memetracker."}}
{"id": "i8DIjwOgoE", "cdate": 1451606400000, "mdate": 1631766271528, "content": {"title": "Steering Opinion Dynamics in Information Diffusion Networks", "abstract": "Recently, there is a surge of interest in using point processes to model continuous-time user activities. This framework has resulted in novel models and improved performance in diverse applications. However, most previous works focus on the \"open loop\" setting where learned models are used for predictive tasks. Typically, we are interested in the \"closed loop\" setting where a policy needs to be learned to incorporate user feedbacks and guide user activities to desirable states. Although point processes have good predictive performance, it is not clear how to use them for the challenging closed loop activity guiding task. In this paper, we propose a framework to reformulate point processes into stochastic differential equations, which allows us to extend methods from stochastic optimal control to address the activity guiding problem. We also design an efficient algorithm, and show that our method guides user activities to desired states more effectively than the state of the art."}}
