{"id": "oxl6thXiYOk", "cdate": 1672531200000, "mdate": 1679921169952, "content": {"title": "In Quest of Ground Truth: Learning Confident Models and Estimating Uncertainty in the Presence of Annotator Noise", "abstract": ""}}
{"id": "9FUqGumxLo", "cdate": 1640995200000, "mdate": 1679921170150, "content": {"title": "FLECS-CGD: A Federated Learning Second-Order Framework via Compression and Sketching with Compressed Gradient Differences", "abstract": ""}}
{"id": "m-SAWQFAl9", "cdate": 1609459200000, "mdate": 1677950024870, "content": {"title": "Inexact model: a framework for optimization and variational inequalities", "abstract": ""}}
{"id": "RaZK9ghtv7P", "cdate": 1609459200000, "mdate": 1652649078303, "content": {"title": "An Accelerated Second-Order Method for Distributed Stochastic Optimization", "abstract": "We consider centralized distributed algorithms for general stochastic convex optimization problems which we approximate by a finite-sum minimization problem with summands distributed among computational nodes. We exploit statistical similarity between the summands and the whole sum to construct a distributed accelerated cubic-regularized Newton’s method that achieves lower communication complexity bound for this setting and improves upon existing upper bound. Further, we use this algorithm to obtain convergence rate bounds for the original stochastic optimization problem and compare our bounds with the existing ones in several regimes when the goal is to minimize the number of communication rounds and improve the parallelization when increasing the number of workers."}}
{"id": "Cq4BAEmB_N", "cdate": 1546300800000, "mdate": 1652129273856, "content": {"title": "Gradient Methods for Problems with Inexact Model of the Objective", "abstract": "We consider optimization methods for convex minimization problems under inexact information on the objective function. We introduce inexact model of the objective, which as a particular cases includes inexact oracle [16] and relative smoothness condition [36]. We analyze gradient method which uses this inexact model and obtain convergence rates for convex and strongly convex problems. To show potential applications of our general framework we consider three particular problems. The first one is clustering by electorial model introduced in [41]. The second one is approximating optimal transport distance, for which we propose a Proximal Sinkhorn algorithm. The third one is devoted to approximating optimal transport barycenter and we propose a Proximal Iterative Bregman Projections algorithm. We also illustrate the practical performance of our algorithms by numerical experiments."}}
