{"id": "BFLNoVWkag5", "cdate": 1646223667390, "mdate": null, "content": {"title": "A Piece-wise Polynomial Filtering Approach for Graph Neural Networks", "abstract": "Graph Neural Networks (GNNs) exploit signals from node features and the input graph topology to improve node classification task performance. Recently proposed GNNs work across a variety of homophilic and heterophilic graphs. Among these, models relying on polynomial graph filters have shown promise. We observe that polynomial filter models, in several practical instances, need to learn a reasonably high degree polynomials without facing any over-smoothing effects. We find that existing methods, due to their designs, either have limited efficacy or can be enhanced further. We present a spectral method to learn a bank of filters using a piece-wise polynomial approach, where each filter acts on a different subsets of the eigen spectrum. The approach requires eigendecomposition for a few eigenvalues at extremes (i.e., low and high ends of the spectrum) and offers flexibility to learn sharper and complex shaped frequency responses with low-degree polynomials. We theoretically and empirically show that our proposed model learns a better filter, thereby improving classification accuracy. Our model achieves performance gains of up to ~6% over the state-of-the-art (SOTA) models."}}
{"id": "wO3MM4lztk", "cdate": 1640995200000, "mdate": 1681650639501, "content": {"title": "Landmarks and Regions: A Robust Approach to Data Extraction", "abstract": ""}}
{"id": "tzHNJpj5vGA", "cdate": 1640995200000, "mdate": 1681650639654, "content": {"title": "Jigsaw: Large Language Models meet Program Synthesis", "abstract": ""}}
{"id": "onFRc_CpfFy", "cdate": 1640995200000, "mdate": 1681650430140, "content": {"title": "A Piece-Wise Polynomial Filtering Approach for Graph Neural Networks", "abstract": ""}}
{"id": "RLWPEAnxrH", "cdate": 1640995200000, "mdate": 1681650639447, "content": {"title": "Landmarks and regions: a robust approach to data extraction", "abstract": ""}}
{"id": "fJIrkNKGBNI", "cdate": 1632875650286, "mdate": null, "content": {"title": "Effective Polynomial Filter Adaptation for Graph Neural Networks", "abstract": "Graph Neural Networks (GNNs) exploit signals from node features and the input graph topology to improve node classification task performance. However, these models tend to perform poorly on heterophilic graphs, where connected nodes have different labels. Recently proposed GNNs work across graphs having varying levels of homophily. Among these, models relying on polynomial graph filters have shown promise. We observe that solutions to these polynomial graph filter models are also solutions to an overdetermined system of equations. It suggests that in some instances, the model needs to learn a reasonably high order polynomial. On investigation, we find the proposed models ineffective at learning such polynomials due to their designs. To mitigate this issue, we perform an eigendecomposition of the graph and propose to learn multiple adaptive polynomial filters acting on different subsets of the spectrum. We theoretically and empirically show that our proposed model learns a better filter, thereby improving classification accuracy. We study various aspects of our proposed model including, dependency on the number of eigencomponents utilized, latent polynomial filters learned, and performance of the individual polynomials on the node classification task. We further show that our model is scalable by evaluating over large graphs. Our model achieves performance gains of up to 10% over the state-of-the-art models and outperforms existing polynomial filter-based approaches in general."}}
{"id": "zyRPy5KrN6", "cdate": 1615225935792, "mdate": null, "content": {"title": "GLAM: Graph Learning by Modeling Affinity to Labeled Nodes for Graph Neural Networks", "abstract": "We propose GLAM, a semi-supervised graph learning method for cases when there are no graphs available. This approach learns a graph as a convex combination of the unsupervised k-Nearest Neighbor graph and a supervised label-affinity graph. The latter graph directly captures all the nodes' label-affinity with the labeled nodes, i.e., how likely a node has the same label as the labeled nodes. Our experiments show that GLAM gives close to or better performance (up to $\\sim$1.5\\%), while being simpler and faster (up to 70x) to train, than state-of-the-art graph learning methods. We also demonstrate the importance of individual components and contrast them with the state-of-the-art methods."}}
{"id": "vAQF3kKskbn", "cdate": 1609459200000, "mdate": 1652935376882, "content": {"title": "Jigsaw: Large Language Models meet Program Synthesis", "abstract": "Large pre-trained language models such as GPT-3, Codex, and Google's language model are now capable of generating code from natural language specifications of programmer intent. We view these developments with a mixture of optimism and caution. On the optimistic side, such large language models have the potential to improve productivity by providing an automated AI pair programmer for every programmer in the world. On the cautionary side, since these large language models do not understand program semantics, they offer no guarantees about quality of the suggested code. In this paper, we present an approach to augment these large language models with post-processing steps based on program analysis and synthesis techniques, that understand the syntax and semantics of programs. Further, we show that such techniques can make use of user feedback and improve with usage. We present our experiences from building and evaluating such a tool jigsaw, targeted at synthesizing code for using Python Pandas API using multi-modal inputs. Our experience suggests that as these large language models evolve for synthesizing code from intent, jigsaw has an important role to play in improving the accuracy of the systems."}}
{"id": "piVsq8jos1", "cdate": 1609459200000, "mdate": 1681650430103, "content": {"title": "Simple Truncated SVD based Model for Node Classification on Heterophilic Graphs", "abstract": ""}}
{"id": "VAfl1aly7T", "cdate": 1609459200000, "mdate": 1681650430204, "content": {"title": "A Piece-wise Polynomial Filtering Approach for Graph Neural Networks", "abstract": ""}}
