{"id": "ZmC8oafY08", "cdate": 1687845138866, "mdate": 1687845138866, "content": {"title": "Adaptive Discounting of Implicit Language Models in RNN-Transducers", "abstract": "RNN-Transducer (RNN-T) models have become synonymous with streaming end-to-end ASR systems. While they perform competitively on a number of evaluation categories, rare words pose a serious challenge to RNN-T models. One main reason for the degradation in performance on rare words is that the language model (LM) internal to RNN-Ts can be-come overconfident and lead to hallucinated predictions that are acoustically inconsistent with the underlying speech. To address this issue, we propose a lightweight adaptive LM dis-counting technique ADAPTLMD, that can be used with any RNN-T architecture without requiring any external resources or additional parameters. ADAPTLMD uses a two-pronged approach: 1. Randomly mask the prediction network output to encourage the RNN-T to not be overly reliant on it’s outputs. 2. Dynamically choose when to discount the implicit LM (ILM) based on rarity of recently predicted tokens and divergence between ILM and implicit acoustic model (IAM) scores. Comparing ADAPTLMD to a competitive RNN-T baseline, we obtain up to 4% and 14% relative reductions in overall WER and rare word PER, respectively, on a conversational, code-mixed Hindi-English ASR task. "}}
{"id": "T2Ncx_PN2K", "cdate": 1663850352971, "mdate": null, "content": {"title": "In-Situ Text-Only Adaptation of Speech Models with Low-Overhead Speech Imputations", "abstract": "Fast and accurate adaptation of automatic speech recognition (ASR) systems using only text data in the target domain is a problem of long-standing practical relevance. Text-only adaptation was easy in traditional cascaded ASR systems with completely decoupled acoustic and language models. Recently, the RNNTransducer (RNN-T) has emerged as a default ASR model because of its high accuracy, low latency, and capability of supporting streaming input. However text-only adaptation of the RNN-T model is significantly more challenging due to its tight integration of acoustic and language models and end-to-end training. Existing recent approaches for text-only adaptation of RNN-Ts, either entail significant modification to the network or introduce high latency during decoding. We propose a new approach (TOLSTOI) that imputes speech representations internal to a baseline RNN-T, starting from text-only inputs, and performs in-situ adaptation that results in higher adaptation accuracy without any runtime overheads during decoding. Our imputation model is a function of the labeled data and trained parameters of the ASR model, and that we show, is more effective in controlling catastrophic forgetting compared to existing methods. We establish the effectiveness of TOLSTOI using three target domains and two ASR models of varying complexity. We yield up to 35% relative reduction in word error rate with text-only adaptation while forgetting the least compared to existing adaptation approaches. Our method is easy to implement and can be harnessed on existing RNN-T models without requiring ASR model training from scratch."}}
{"id": "cnutOGKrz7f", "cdate": 1663850342055, "mdate": null, "content": {"title": "Soft Sampling for Efficient Training of Deep Neural Networks on Massive Data", "abstract": "We investigate soft sampling which is a simple yet effective approach for efficient training of large-scale deep neural network models when dealing with massive data. Soft sampling selects a subset uniformly at random with replacement from the full data set in each epoch. First, we derive a theoretical convergence guarantee for soft sampling on non-convex objective functions and give the convergence rate. Next, we analyze the data coverage and occupancy properties of soft sampling from the perspective of the coupon collector's problem. And finally, we evaluate soft sampling on various machine learning tasks using various network architectures and demonstrate its effectiveness. Compared to existing coreset-based data selection methods, soft sampling offers a better accuracy-efficiency trade-off. Especially on real-world industrial scale data sets, soft sampling can achieve significant speedup and competitive performance with almost no additional computing cost."}}
{"id": "khZfOUaAmLp", "cdate": 1640995200000, "mdate": 1682329561458, "content": {"title": "Partitioned Gradient Matching-based Data Subset Selection for Compute-Efficient Robust ASR Training", "abstract": ""}}
{"id": "3fsvvpRx_8N", "cdate": 1640995200000, "mdate": 1648683959596, "content": {"title": "Adaptive Discounting of Implicit Language Models in RNN-Transducers", "abstract": "RNN-Transducer (RNN-T) models have become synonymous with streaming end-to-end ASR systems. While they perform competitively on a number of evaluation categories, rare words pose a serious challenge to RNN-T models. One main reason for the degradation in performance on rare words is that the language model (LM) internal to RNN-Ts can become overconfident and lead to hallucinated predictions that are acoustically inconsistent with the underlying speech. To address this issue, we propose a lightweight adaptive LM discounting technique AdaptLMD, that can be used with any RNN-T architecture without requiring any external resources or additional parameters. AdaptLMD uses a two-pronged approach: 1) Randomly mask the prediction network output to encourage the RNN-T to not be overly reliant on it's outputs. 2) Dynamically choose when to discount the implicit LM (ILM) based on rarity of recently predicted tokens and divergence between ILM and implicit acoustic model (IAM) scores. Comparing AdaptLMD to a competitive RNN-T baseline, we obtain up to 4% and 14% relative reductions in overall WER and rare word PER, respectively, on a conversational, code-mixed Hindi-English ASR task."}}
{"id": "pFDIPvat6f", "cdate": 1609459200000, "mdate": 1648683959604, "content": {"title": "Low Resource ASR: The Surprising Effectiveness of High Resource Transliteration", "abstract": "Cross-lingual transfer of knowledge from high-resource languages to low-resource languages is an important research problem in automatic speech recognition (ASR). We propose a new strategy of transfer learning by pretraining using large amounts of speech in the high-resource language but with its text transliterated to the target low-resource language. This simple mapping of scripts explicitly encourages increased sharing between the output spaces of both languages and is surprisingly effective even when the high-resource and low-resource languages are from unrelated language families. The utility of our proposed technique is more evident in very low-resource scenarios, where better initializations are more beneficial. We evaluate our technique on a transformer ASR architecture and the state-of-the-art wav2vec2.0 ASR architecture, with English as the high-resource language and six languages as low-resource targets. With access to 1 hour of target speech, we obtain relative WER reductions of up to 8.2% compared to existing transfer-learning approaches."}}
{"id": "ULyYp-uhhgR", "cdate": 1609459200000, "mdate": null, "content": {"title": "Optimizing Interpretation Generation in Natural Language Query Answering for Real Time End Users", "abstract": "Natural Language Querying over Database is gaining popularity across different use cases. Most common of them is to democratize the process of data analysis and querying of backend data to naive end users especially business users, obviating the need of knowing back end query language. Natural Language Query answering systems have thus seen widespread usage in industry too where business users want to search their own data to make business decisions. However, a common challenge faced by any natural language query answering system is generation of precise interpretations. The research community although tries to handle the problem via asking clarification questions back to the user, in industry setup this remains an ineffective solution due to various practical usage limitations. For example, it is not fair to assume any end user will be aware of the correct option to answer these clarification questions. Moreover, involving clarification questions and user feedbacks makes the system unusable by one shot API calls, which is the most intuitive usage among common use cases in industry like automated report generation. In this paper, we investigate practical ways to address the problem of precise interpretation generation. We propose novel algorithms to make use of existing technologies like Functional Partitioning of Ontology and Lazy Inclusion to solve this problem. We take our previous state-of-the-art paper ATHENA and further extend it to include our proposed methods. We test with 3 benchmark ontologies to empirically demonstrate the huge improvement over state-of-the-art results by factors of at least 400% in number of interpretation generation and also in the computation time."}}
{"id": "CYySS2YdQg3", "cdate": 1609459200000, "mdate": 1648683959604, "content": {"title": "Multilingual and code-switching ASR challenges for low resource Indian languages", "abstract": "Recently, there is increasing interest in multilingual automatic speech recognition (ASR) where a speech recognition system caters to multiple low resource languages by taking advantage of low amounts of labeled corpora in multiple languages. With multilingualism becoming common in today's world, there has been increasing interest in code-switching ASR as well. In code-switching, multiple languages are freely interchanged within a single sentence or between sentences. The success of low-resource multilingual and code-switching ASR often depends on the variety of languages in terms of their acoustics, linguistic characteristics as well as the amount of data available and how these are carefully considered in building the ASR system. In this challenge, we would like to focus on building multilingual and code-switching ASR systems through two different subtasks related to a total of seven Indian languages, namely Hindi, Marathi, Odia, Tamil, Telugu, Gujarati and Bengali. For this purpose, we provide a total of ~600 hours of transcribed speech data, comprising train and test sets, in these languages including two code-switched language pairs, Hindi-English and Bengali-English. We also provide a baseline recipe for both the tasks with a WER of 30.73% and 32.45% on the test sets of multilingual and code-switching subtasks, respectively."}}
{"id": "4VB5-UrYMCV", "cdate": 1609459200000, "mdate": 1648683959859, "content": {"title": "Representation based meta-learning for few-shot spoken intent recognition", "abstract": "Spoken intent detection has become a popular approach to interface with various smart devices with ease. However, such systems are limited to the preset list of intents-terms or commands, which restricts the quick customization of personal devices to new intents. This paper presents a few-shot spoken intent classification approach with task-agnostic representations via meta-learning paradigm. Specifically, we leverage the popular representation-based meta-learning learning to build a task-agnostic representation of utterances, that then use a linear classifier for prediction. We evaluate three such approaches on our novel experimental protocol developed on two popular spoken intent classification datasets: Google Commands and the Fluent Speech Commands dataset. For a 5-shot (1-shot) classification of novel classes, the proposed framework provides an average classification accuracy of 88.6% (76.3%) on the Google Commands dataset, and 78.5% (64.2%) on the Fluent Speech Commands dataset. The performance is comparable to traditionally supervised classification models with abundant training samples."}}
{"id": "-P9ep1n4oYY", "cdate": 1609459200000, "mdate": null, "content": {"title": "Bootstrapping Chatbot Interfaces to Databases", "abstract": "In this paper, we present an automated technique for creating a chatbot interface to databases. To the best of our knowledge, our technique is the first one for bootstrapping chatbots for question answering on relational databases. Our method leverages the natural language classifiers present in industrial chatbot platforms for natural language to structure query translation. We use our framework to create usable chatbots starting from the databases in a short time. We instantiated several chatbots in different domains and demonstrate the usefulness of it."}}
