{"id": "qXhygdQJMH", "cdate": 1640995200000, "mdate": 1668056539424, "content": {"title": "Visual Recipe Flow: A Dataset for Learning Visual State Changes of Objects with Recipe Flows", "abstract": "We present a new multimodal dataset called Visual Recipe Flow, which enables us to learn each cooking action result in a recipe text. The dataset consists of object state changes and the workflow of the recipe text. The state change is represented as an image pair, while the workflow is represented as a recipe flow graph (r-FG). The image pairs are grounded in the r-FG, which provides the cross-modal relation. With our dataset, one can try a range of applications, from multimodal commonsense reasoning and procedural text generation."}}
{"id": "nwJvJBRq1x", "cdate": 1640995200000, "mdate": 1668056539419, "content": {"title": "Edge-Selective Feature Weaving for Point Cloud Matching", "abstract": "This paper tackles the problem of accurately matching the points of two 3D point clouds. Most conventional methods improve their performance by extracting representative features from each point via deep-learning-based algorithms. On the other hand, the correspondence calculation between the extracted features has not been examined in depth, and non-trainable algorithms (e.g. the Sinkhorn algorithm) are frequently applied. As a result, the extracted features may be forcibly fitted to a non-trainable algorithm. Furthermore, the extracted features frequently contain stochastically unavoidable errors, which degrades the matching accuracy. In this paper, instead of using a non-trainable algorithm, we propose a differentiable matching network that can be jointly optimized with the feature extraction procedure. Our network first constructs graphs with edges connecting the points of each point cloud and then extracts discriminative edge features by using two main components: a shared set-encoder and an edge-selective cross-concatenation. These components enable us to symmetrically consider two point clouds and to extract discriminative edge features, respectively. By using the extracted discriminative edge features, our network can accurately calculate the correspondence between points. Our experimental results show that the proposed network can significantly improve the performance of point cloud matching. Our code is available at https://github.com/yanarin/ESFW"}}
{"id": "hE0UKp3Pj7", "cdate": 1640995200000, "mdate": 1668056539419, "content": {"title": "CEA++'22: 1st International Workshop on Multimedia for Cooking, Eating, and related APPlications", "abstract": "The International Workshop on Multimedia for Cooking, Eating, and related APPlications is the successor of the former CEA workshop series. The former CEA series started in 2009. 13 years later, we are witnessing various food-related applications enabled by emerging deep learning technologies and related hardware. Based on such a background, the organizing committee of CEA decided to renew the workshop and extend the scope to accept broader topics, especially industrial applications. This overview introduces the aim of the CEA++'22 workshop, and the list of papers presented in the workshop."}}
{"id": "YaJ2FXz2MN", "cdate": 1640995200000, "mdate": 1668056539419, "content": {"title": "Recipe Generation from Unsegmented Cooking Videos", "abstract": "This paper tackles recipe generation from unsegmented cooking videos, a task that requires agents to (1) extract key events in completing the dish and (2) generate sentences for the extracted events. Our task is similar to dense video captioning (DVC), which aims at detecting events thoroughly and generating sentences for them. However, unlike DVC, in recipe generation, recipe story awareness is crucial, and a model should output an appropriate number of key events in the correct order. We analyze the output of the DVC model and observe that although (1) several events are adoptable as a recipe story, (2) the generated sentences for such events are not grounded in the visual content. Based on this, we hypothesize that we can obtain correct recipes by selecting oracle events from the output events of the DVC model and re-generating sentences for them. To achieve this, we propose a novel transformer-based joint approach of training event selector and sentence generator for selecting oracle events from the outputs of the DVC model and generating grounded sentences for the events, respectively. In addition, we extend the model by including ingredients to generate more accurate recipes. The experimental results show that the proposed method outperforms state-of-the-art DVC models. We also confirm that, by modeling the recipe in a story-aware manner, the proposed model output the appropriate number of events in the correct order."}}
{"id": "TYGK3NL9_C", "cdate": 1640995200000, "mdate": 1668056539423, "content": {"title": "Cross-modal Representation Learning for Understanding Manufacturing Procedure", "abstract": "Assembling, biochemical experiments, and cooking are representatives that create a new value from multiple materials through multiple processes. If a machine can computationally understand such manufacturing tasks, we will have various options of human-machine collaboration on those tasks, from video scene retrieval to robots that act for on behalf of humans. As one form of such understanding, this paper introduces a series of our studies that aim to associate visual observation of the processes and the procedural texts that instruct such processes. In those studies, captioning is the key task, where input is image sequence or video clips and our methods are still state-of-the-arts. Through the explanation of such techniques, we overview machine learning technologies that deal with the contextual information of manufacturing tasks."}}
{"id": "RYnu9GkM12d", "cdate": 1640995200000, "mdate": 1668056539418, "content": {"title": "Learning by Breaking: Food Fracture Anticipation for Robotic Food Manipulation", "abstract": ""}}
{"id": "JvXPxmbt2v", "cdate": 1640995200000, "mdate": 1668056539421, "content": {"title": "Visual Recipe Flow: A Dataset for Learning Visual State Changes of Objects with Recipe Flows", "abstract": "Keisuke Shirai, Atsushi Hashimoto, Taichi Nishimura, Hirotaka Kameko, Shuhei Kurita, Yoshitaka Ushiku, Shinsuke Mori. Proceedings of the 29th International Conference on Computational Linguistics. 2022."}}
{"id": "ktHKpsbsxx", "cdate": 1632875465683, "mdate": null, "content": {"title": "WeaveNet: A Differentiable Solver for Non-linear Assignment Problems", "abstract": "Assignment, a task to match a limited number of elements, is a fundamental problem in informatics. Traditionally, non-linear assignment is discussed as a combinatorial optimization problem with its calculation complexity. On the other hand, it is often a sub-problem of image processing tasks, such as 3D point cloud matching. This paper proposes WeaveNet, a differentiable solver for diverse non-linear assignment problems. Traditional graph convolutional networks (GCNs) suffer from an over-smoothing problem when characterizing nodes with their relationship. WeaveNet overcomes this problem by forwarding edge-wise features at each layer rather than aggregated node features.\nTo deal with the exponentially large input space of combinatorial optimization problems, we designed WeaveNet to be highly parameter efficient while characterizing edges through stacked set-encoder with cross-concatenation operations. Experimental results show that WeaveNet approximates two strongly NP-hard variants of stable matching in a comparative performance with the gold standard hand-crafted algorithms under the limited size of problem instances. We have also confirmed that it can boost 3D point cloud matching performance significantly."}}
{"id": "bDP7I2fYwLj", "cdate": 1621629840630, "mdate": null, "content": {"title": "WeaveNet for Approximating Assignment Problems", "abstract": "Assignment, a task to match a limited number of elements, is a fundamental problem in informatics. \nMany assignment problems have no exact solvers due to their NP-hardness or incomplete input, and their approximation algorithms have been studied for a long time. However, individual practical applications have various objective functions and prior assumptions, which usually differ from academic studies. This gap hinders applying the algorithms to real problems despite their theoretically ensured performance. \nIn contrast, a learning-based method can be a promising solution to fill the gap. To open a new vista for real-world assignment problems, we propose a novel neural network architecture, WeaveNet. Its core module, feature weaving layer, is stacked to model frequent communication between elements in a parameter-efficient way for solving the combinatorial problem of assignment.\nTo evaluate the model, we approximated one of the most popular non-linear assignment problems, stable matching with two different strongly NP-hard settings. The experimental results showed its impressive performance among the learning-based baselines. Furthermore, we achieved better or comparative performance to the state-of-the-art algorithmic method, depending on the size of problem instances."}}
{"id": "2rAiDBJgR_", "cdate": 1621629840630, "mdate": null, "content": {"title": "WeaveNet for Approximating Assignment Problems", "abstract": "Assignment, a task to match a limited number of elements, is a fundamental problem in informatics. \nMany assignment problems have no exact solvers due to their NP-hardness or incomplete input, and their approximation algorithms have been studied for a long time. However, individual practical applications have various objective functions and prior assumptions, which usually differ from academic studies. This gap hinders applying the algorithms to real problems despite their theoretically ensured performance. \nIn contrast, a learning-based method can be a promising solution to fill the gap. To open a new vista for real-world assignment problems, we propose a novel neural network architecture, WeaveNet. Its core module, feature weaving layer, is stacked to model frequent communication between elements in a parameter-efficient way for solving the combinatorial problem of assignment.\nTo evaluate the model, we approximated one of the most popular non-linear assignment problems, stable matching with two different strongly NP-hard settings. The experimental results showed its impressive performance among the learning-based baselines. Furthermore, we achieved better or comparative performance to the state-of-the-art algorithmic method, depending on the size of problem instances."}}
