{"id": "BzfWp17tJs", "cdate": 1640995200000, "mdate": 1682320336643, "content": {"title": "Actor-Critic based Improper Reinforcement Learning", "abstract": "We consider an improper reinforcement learning setting where a learner is given $M$ base controllers for an unknown Markov decision process, and wishes to combine them optimally to produce a potentially new controller that can outperform each of the base ones. This can be useful in tuning across controllers, learnt possibly in mismatched or simulated environments, to obtain a good controller for a given target environment with relatively few trials. Towards this, we propose two algorithms: (1) a Policy Gradient-based approach; and (2) an algorithm that can switch between a simple Actor-Critic (AC) based scheme and a Natural Actor-Critic (NAC) scheme depending on the available information. Both algorithms operate over a class of improper mixtures of the given controllers. For the first case, we derive convergence rate guarantees assuming access to a gradient oracle. For the AC-based approach we provide convergence rate guarantees to a stationary point in the basic AC case and to a global optimum in the NAC case. Numerical results on (i) the standard control theoretic benchmark of stabilizing an cartpole; and (ii) a constrained queueing task show that our improper policy optimization algorithm can stabilize the system even when the base policies at its disposal are unstable."}}
{"id": "mW_hwZ-Hgo", "cdate": 1609459200000, "mdate": 1682344386113, "content": {"title": "Decentralized, Hybrid MAC Design with Reduced State Information Exchange for Low-Delay IoT Applications", "abstract": "We consider a system of several collocated nodes sharing a time slotted wireless channel, and seek a MAC (medium access control) that (i) provides low mean delay, (ii) has distributed control (i.e., there is no central scheduler), and (iii) does not require explicit exchange of state information or control signals. The design of such MAC protocols must keep in mind the need for contention access at light traffic, and scheduled access in heavy traffic, leading to the long-standing interest in hybrid, adaptive MACs. Working in the discrete time setting, for the distributed MAC design, we consider a practical information structure where each node has local information and some common information obtained from overhearing. In this setting, \"ZMAC\" is an existing protocol that is hybrid and adaptive. We approach the problem via two steps (1) We show that it is sufficient for the policy to be \"greedy\" and \"exhaustive\". Limiting the policy to this class reduces the problem to obtaining a queue switching policy at queue emptiness instants. (2) Formulating the delay optimal scheduling as a POMDP (partially observed Markov decision process), we show that the optimal switching rule is Stochastic Largest Queue (SLQ). Using this theory as the basis, we then develop a practical distributed scheduler, QZMAC, which is also tunable. We implement QZMAC on standard off-the-shelf TelosB motes and also use simulations to compare QZMAC with the full-knowledge centralized scheduler, and with ZMAC. We use our implementation to study the impact of false detection while overhearing the common information, and the efficiency of QZMAC. Our simulation results show that the mean delay with QZMAC is close that of the full-knowledge centralized scheduler."}}
{"id": "jXc0QPPvfJ", "cdate": 1609459200000, "mdate": 1682344386089, "content": {"title": "Implementing QZMAC (a Decentralized Delay Optimal MAC) over 6TiSCH under the Contiki OS in an IEEE 802.15.4 Network", "abstract": "Motivated by the emerging delay-sensitive applications of the Internet of Things (IoT), there has been a resurgence of interest in developing medium access control (MAC) protocols in a time-slotted framework. The resource-constrained, ad-hoc nature of wireless networks typical of the IoT also forces the amount of control information exchanged across the network - required to make scheduling decisions - to a minimum. In a previous article we proposed a protocol called QZMAC that (i) provides provably low mean delay, (ii) has distributed control(i.e., there is no central scheduler), and (iii) does not require explicit exchange of state information or control signals. In the present article, we implement and demonstrate the performance of QZMAC on a test bed consisting of CC2420 based Crossbow telosB motes, running the 6TiSCH communication stack on the Contiki operating system over the 2.4GHz ISM band. QZMAC achieves its near-optimal delay performance using a clever combination of polling and contention modes. We demonstrate the polling and the contention modes of QZMAC separately. We use an Adaptive Synchronization Technique in our implementation which we also demonstrate. Our network shows good delay performance even in the presence of heavy interference from ambient WiFi networks."}}
{"id": "avX9jLoNSj", "cdate": 1609459200000, "mdate": 1682320336644, "content": {"title": "Improper Learning with Gradient-based Policy Optimization", "abstract": "We consider an improper reinforcement learning setting where a learner is given $M$ base controllers for an unknown Markov decision process, and wishes to combine them optimally to produce a potentially new controller that can outperform each of the base ones. This can be useful in tuning across controllers, learnt possibly in mismatched or simulated environments, to obtain a good controller for a given target environment with relatively few trials.   \\par We propose a gradient-based approach that operates over a class of improper mixtures of the controllers. We derive convergence rate guarantees for the approach assuming access to a gradient oracle. The value function of the mixture and its gradient may not be available in closed-form; however, we show that we can employ rollouts and simultaneous perturbation stochastic approximation (SPSA) for explicit gradient descent optimization. Numerical results on (i) the standard control theoretic benchmark of stabilizing an inverted pendulum and (ii) a constrained queueing task show that our improper policy optimization algorithm can stabilize the system even when the base policies at its disposal are unstable\\footnote{Under review. Please do not distribute.}."}}
{"id": "sluohAoBBhe", "cdate": 1577836800000, "mdate": null, "content": {"title": "Throughput Optimal Decentralized Scheduling with Single-bit State Feedback for a Class of Queueing Systems", "abstract": "Motivated by medium access control for resource-challenged wireless Internet of Things (IoT), we consider the problem of queue scheduling with reduced queue state information. In particular, we consider a time-slotted scheduling model with $N$ sensor nodes, with pair-wise dependence, such that Nodes $i$ and $i + 1,~0 < i < N$ cannot transmit together. We develop new throughput-optimal scheduling policies requiring only the empty-nonempty state of each queue that we term Queue Nonemptiness-Based (QNB) policies. We propose a Policy Splicing technique to combine scheduling policies for small networks in order to construct throughput-optimal policies for larger networks, some of which also aim for low delay. For $N = 3,$ there exists a sum-queue length optimal QNB scheduling policy. We show, however, that for $N > 4,$ there is no QNB policy that is sum-queue length optimal over all arrival rate vectors in the capacity region. We then extend our results to a more general class of interference constraints that we call cluster-of-cliques (CoC) conflict graphs. We consider two types of CoC networks, namely, Linear Arrays of Cliques (LAoC) and Star-of-Cliques (SoC) networks. We develop QNB policies for these classes of networks, study their stability and delay properties, and propose and analyze techniques to reduce the amount of state information to be disseminated across the network for scheduling. In the SoC setting, we propose a throughput-optimal policy that only uses information that nodes in the network can glean by sensing activity (or lack thereof) on the channel. Our throughput-optimality results rely on two new arguments: a Lyapunov drift lemma specially adapted to policies that are queue length-agnostic, and a priority queueing analysis for showing strong stability."}}
{"id": "patnKUE0t79", "cdate": 1577836800000, "mdate": 1682344386197, "content": {"title": "Price Volatility in Electricity Markets: A Stochastic Control Perspective", "abstract": "It is well known that highly volatile control laws, while theoretically optimal for certain systems, are undesirable from an engineering perspective, being generally deleterious to the controlled system. In this article we are concerned with the temporal volatility of the control process of the regulator in discrete time Linear Quadratic Regulators (LQRs). Our investigation in this paper unearths a surprising connection between the cost functional which an LQR is tasked with minimizing and the temporal variations of its control laws. We first show that optimally controlling the system always implies high levels of control volatility, i.e., it is impossible to reduce volatility in the optimal control process without sacrificing cost. We also show that, akin to communication systems, every LQR has a $Capacity~Region$ associated with it, that dictates and quantifies how much cost is achievable at a given level of control volatility. This additionally establishes the fact that no admissible control policy can simultaneously achieve low volatility and low cost. We then employ this analysis to explain the phenomenon of temporal price volatility frequently observed in deregulated electricity markets."}}
{"id": "0brhQpdn508", "cdate": 1577836800000, "mdate": 1682344386139, "content": {"title": "Reduced-State, Optimal Scheduling for Decentralized Medium Access Control of a Class of Wireless Networks", "abstract": "Motivated by medium access control for resource-challenged wireless Internet of Things (IoT) networks, we consider the problem of queue scheduling with reduced queue state information. In particular, we consider a time-slotted scheduling model with N wireless links, such that links i and i + 1, 1 ≤ i ≤ N - 1 cannot transmit together. Our aim in this paper is to study throughput-optimal, and even delay optimal, scheduling policies that require only the empty-nonempty state of the packet queues associated with these links (Queue Nonemptiness Based, or QNB, policies). We focus on Maximum Size Matching (MSM) policies, and provide an analysis of all the QNB-MSM policies for N = 3, thereby comparing their performance, and revisiting a delay optimal scheduling result. Our study shows that, while scheduling a maximum size matching would seem intuitive, there are important performance differences between different QNB-MSM policies. Further, it is not necessary for a QNB policy to be MSM for it to be throughput optimal. We develop a new Policy Splicing technique to combine scheduling policies for small networks to construct throughput-optimal policies for larger networks, some of which also aim for low delay. For N = 3 there exists a QNB-MSM policy that is sum-queue optimal over the entire stability region. We show, however, that for N ≥ 4, there is no QNB scheduling policy that is sum-queue length optimal over all arrival rate vectors in the capacity region. Our throughput-optimality results rely on two new arguments: a Lyapunov drift lemma specially adapted to policies that are queue length-agnostic, and a priority queueing analysis for showing strong stability. We then extend our results to a more general class of interference constraints that we call cluster-of-cliques (CoC) conflict graphs. We consider two types of CoC networks, namely, Linear Arrays of Cliques (LAoC) and Star-of-Cliques (SoC) networks. We develop QNB policies for these classes of networks, study their stability and delay properties, and propose and analyze techniques to reduce the amount of state information to be disseminated across the network for scheduling."}}
{"id": "0J9ut6J5pK", "cdate": 1577836800000, "mdate": 1682320336646, "content": {"title": "Explicit Best Arm Identification in Linear Bandits Using No-Regret Learners", "abstract": "We study the problem of best arm identification in linearly parameterised multi-armed bandits. Given a set of feature vectors $\\mathcal{X}\\subset\\mathbb{R}^d,$ a confidence parameter $\\delta$ and an unknown vector $\\theta^*,$ the goal is to identify $\\arg\\max_{x\\in\\mathcal{X}}x^T\\theta^*$, with probability at least $1-\\delta,$ using noisy measurements of the form $x^T\\theta^*.$ For this fixed confidence ($\\delta$-PAC) setting, we propose an explicitly implementable and provably order-optimal sample-complexity algorithm to solve this problem. Previous approaches rely on access to minimax optimization oracles. The algorithm, which we call the \\textit{Phased Elimination Linear Exploration Game} (PELEG), maintains a high-probability confidence ellipsoid containing $\\theta^*$ in each round and uses it to eliminate suboptimal arms in phases. PELEG achieves fast shrinkage of this confidence ellipsoid along the most confusing (i.e., close to, but not optimal) directions by interpreting the problem as a two player zero-sum game, and sequentially converging to its saddle point using low-regret learners to compute players' strategies in each round. We analyze the sample complexity of PELEG and show that it matches, up to order, an instance-dependent lower bound on sample complexity in the linear bandit setting. We also provide numerical results for the proposed algorithm consistent with its theoretical guarantees."}}
{"id": "o5JpYgW9btP", "cdate": 1546300800000, "mdate": null, "content": {"title": "Towards Optimal and Efficient Best Arm Identification in Linear Bandits", "abstract": "We give a new algorithm for best arm identification in linearly parameterised bandits in the fixed confidence setting. The algorithm generalises the well-known LUCB algorithm of Kalyanakrishnan et al. (2012) by playing an arm which minimises a suitable notion of geometric overlap of the statistical confidence set for the unknown parameter, and is fully adaptive and computationally efficient as compared to several state-of-the methods. We theoretically analyse the sample complexity of the algorithm for problems with two and three arms, showing optimality in many cases. Numerical results indicate favourable performance over other algorithms with which we compare."}}
{"id": "svwQmI80Ymh", "cdate": 1514764800000, "mdate": null, "content": {"title": "Reduced-State, Optimal Medium Access Control for Wireless Data Collection Networks", "abstract": "Motivated by medium access control for resource-challenged wireless sensor networks whose main purpose is data collection, we consider the problem of queue scheduling with reduced queue state information. In particular, we consider a model with N sensor nodes, with pair-wise dependence, such that nodes i and i+1, 1 ≤ i ≤ N-1 cannot transmit together. For N=3, 4, and 5, we develop new throughput-optimal scheduling policies requiring only the empty-nonempty state of each queue, and also revisit previously proposed policies to rigorously establish their throughput-and delay-optimality. For N=3, there exists a sum-queue length optimal scheduling policy that requires only the empty-nonempty state of each queue. We show, however, that for N ≥ 4, there is no scheduling policy that uses only the empty-nonempty states of the queues and is sum-queue length optimal uniformly over all arrival rate vectors. We then extend our results to a more general class of interference constraints, namely, a star of cliques. Our throughput-optimality results rely on two new arguments: a Lyapunov drift lemma specially adapted to policies that are queue length-agnostic, and a priority queueing analysis for showing strong stability. Our study throws up some counterintuitive conclusions: 1) knowledge of queue length information is not necessary to achieve optimal throughput/delay performance for a large class of interference networks, 2) it is possible to perform throughput-optimal scheduling by merely knowing whether queues in the network are empty or not, and 3) it is also possible to be throughput-optimal by not always scheduling the maximum possible number of nonempty queues. We also show the results of numerical experiments on the performance of queue length agnostic scheduling vs. queue length aware scheduling, on several interference networks."}}
