{"id": "iEptjwrp-3", "cdate": 1640995200000, "mdate": 1664998604175, "content": {"title": "Flexible Example-Based Program Synthesis on Tree-Structured Function Compositions", "abstract": "We introduce a flexible program synthesis system whose task is to predict function compositions that transform given inputs to their corresponding given outputs. We process input lists in a sequential manner, allowing the system to generalize to a wide range of input lengths. We separate the operator and the operand in the lambda functions of the used higher order functions to achieve significantly wider numeric parameter ranges compared to the previous works. The evaluations show that this approach is competitive with state-of-the-art systems, while it is much more flexible in terms of the input length, the parameters of the lambda functions, and the integer range of the inputs and outputs. We extend the system to handle tree-structured function compositions by introducing two additional functions (zip_with, copy) and the ability to represent unfinished function compositions during the synthesis process. The extended system achieves state-of-the-art results while synthesizing complex function compositions with multiple forks. We believe that flexibility in these aspects is an important step towards solving real-world problems with example-based program synthesis."}}
{"id": "BqJpxFW9E4", "cdate": 1640995200000, "mdate": 1664998604185, "content": {"title": "Generating Algorithmic Patterns from Semi-structured Input Using a Transition-Based Neural Network", "abstract": "Synthesizing program code from natural language is a challenging task as natural language utterances tend to be ambiguous and require substantial prior knowledge to interpret. Recent solutions approach these difficulties in different ways. Some models do not constrain their inputs and operate with a large variety of sentences, but tend to be less accurate. Others limit the space of possible inputs, requiring them to meet a fixed structure which makes them more similar to code than language. This paper offers a middle ground between these approaches. We train a transition-based neural network on descriptions of programming tasks generated by using context-free grammar and templates. We show that the model is able to generalize and can solve synthesis problems described in natural language."}}
{"id": "S8kTewxCTrL", "cdate": 1609459200000, "mdate": 1682318524764, "content": {"title": "Using Machine Learning to Identify Methods Violating Immutability", "abstract": "A characteristic example of logic errors is the problem of poorly written Java methods that render immutable objects mutable by exposing member variables. These variables can then be used to modify or delete the underlying data regardless of class invariants, leading to serious problems such as data corruption or loss. In this paper, we offer a solution for identifying such functions by implementing a machine learning-based static code analyzer. We use a Recurrent Neural Network, trained on examples that were generated with a context-free grammar, to inspect and classify Java methods that return arrays of primitive or collections of non-primitive types. Every example can be classified as “exposes class”, “does not expose class”, or, if there is insufficient information, “cannot be decided”. The trained model is capable of classifying previously unseen code snippets with good accuracy."}}
{"id": "JrgeS9Ig5n7", "cdate": 1609459200000, "mdate": null, "content": {"title": "Flexcoder: Practical Program Synthesis with Flexible Input Lengths and Expressive Lambda Functions", "abstract": ""}}
{"id": "D1a3uWv9Pci", "cdate": 1609459200000, "mdate": 1632136988060, "content": {"title": "Detecting and Fixing Nonidiomatic Snippets in Python Source Code with Deep Learning", "abstract": "We present an algorithm to find nonidiomatic snippets in Python source code and replace them with cleaner and more performant alternatives. The algorithm is divided into three subtasks: (i) the snippets are localized, then for each snippet (ii) the type of the nonidiomatic pattern, and (iii) the key variables are determined. The subtasks of localizing patterns and extracting variables are solved as Sequence Tagging tasks with LSTM networks. Determining the nonidiomatic pattern type is a classification problem, which we solve by training a feedforward neural network. We evaluate the process on a dataset containing more than 13 000 programs coded by students."}}
{"id": "sGEbhsMxaZ", "cdate": 1388534400000, "mdate": null, "content": {"title": "Recommending Missing Symbols of Augmentative and Alternative Communication by Means of Explicit Semantic Analysis", "abstract": "For people constrained to picture based communication, the expression of interest in a question answering (QA) or information retrieval (IR)scenario is highly limited. Traditionally, alternative and augmentative communication (AAC) methods (such as gestures and communication boards) are utilised. But only few systems allow users to produce whole utterances or sentences that consist of multiple words; work to generate them automatically is a promising direction in the big data context.In this paper, we provide a dedicated access method for the open-domain QA and IR context. We propose a method for the user to search for additional symbols to be added to the communication board in real-time while using access to big data sources and context based filtering when the desired symbol is missing. The user can select a symbol that is associated with the desired concept and the system searches for images on the Internet - here, in Wikipedia - with the purpose of retrieving an appropriate symbol or picture. Querying for candidates is performed by estimating semantic relatedness between text fragments using explicit semantic analysis (ESA)."}}
{"id": "kRhABizqk9R", "cdate": 1388534400000, "mdate": null, "content": {"title": "Towards a Smart Wearable Tool to Enable People with SSPI to Communicate by Sentence Fragments", "abstract": "The ability to communicate with others is of paramount importance for mental well-being. In this paper, we describe an interaction system to reduce communication barriers for people with severe speech and physical impairments (SSPI) such as cerebral palsy. The system consists of two main components: (i) the head-mounted human-computer interaction (HCI) part consisting of smart glasses with gaze trackers and text-to-speech functionality (which implement a communication board and the selection tool), and (ii) a natural language processing pipeline in the backend in order to generate complete sentences from the symbols on the board. We developed the components to provide a smooth interaction between the user and the system thereby including gaze tracking, symbol selection, symbol recognition, and sentence generation. Our results suggest that such systems can dramatically increase communication efficiency of people with SSPI."}}
{"id": "uqIQuYFTVb", "cdate": 1356998400000, "mdate": null, "content": {"title": "Wikifying Novel Words to Mixtures of Wikipedia Senses by Structured Sparse Coding", "abstract": "We extend the scope of Wikification to novel words by relaxing two premises of Wikification: (i) we wikify without using the surface form of the word (ii) to a mixture of Wikipedia senses instead of a single sense. We identify two types of “novel” words: words where the connection between their surface form and their meaning is broken (e.g., a misspelled word), and words where there is no meaning to connect to—the meaning itself is also novel. We propose a method capable of wikifying both types of novel words while also dealing with the inherently large-scale disambiguation problem. We show that the method can disambiguate between up to 1,000 Wikipedia senses, and it can explain words with novel meaning as a mixture of other, possibly related senses. This mixture representation compares favorably to the widely used bag of words representation."}}
{"id": "N4wjQrgFq3A", "cdate": 1356998400000, "mdate": null, "content": {"title": "Explaining Unintelligible Words by Means of their Context", "abstract": ""}}
{"id": "6sNjsOlwvR_", "cdate": 1325376000000, "mdate": null, "content": {"title": "Automated Word Puzzle Generation via Topic Dictionaries", "abstract": "We propose a general method for automated word puzzle generation. Contrary to previous approaches in this novel field, the presented method does not rely on highly structured datasets obtained with serious human annotation effort: it only needs an unstructured and unannotated corpus (i.e., document collection) as input. The method builds upon two additional pillars: (i) a topic model, which induces a topic dictionary from the input corpus (examples include e.g., latent semantic analysis, group-structured dictionaries or latent Dirichlet allocation), and (ii) a semantic similarity measure of word pairs. Our method can (i) generate automatically a large number of proper word puzzles of different types, including the odd one out, choose the related word and separate the topics puzzle. (ii) It can easily create domain-specific puzzles by replacing the corpus component. (iii) It is also capable of automatically generating puzzles with parameterizable levels of difficulty suitable for, e.g., beginners or intermediate learners."}}
