{"id": "zzVYzkihbS", "cdate": 1672531200000, "mdate": 1674992894630, "content": {"title": "Short Text Clustering in Continuous Time Using Stacked Dirichlet-Hawkes Process with Inverse Cluster Frequency Prior", "abstract": "Traditional models for short text clustering ignore the time information associated with the text documents. However, existing works have shown that temporal characteristics of streaming documents are significant features for clustering. In this paper we propose a stacked Dirichlet-Hawkes process with inverse cluster frequency prior as a simple but effective solution for the task of short text clustering using temporal features in continuous time. Based on the classical formulation of the Dirichlet-Hawkes process, our model provides an elegant, theoretically grounded and interpretable solution while performing at par with recent state of the art models in short text clustering."}}
{"id": "qad0NFqXZ9", "cdate": 1672531200000, "mdate": 1674992894692, "content": {"title": "Tutorial on Semantic Automation for Data Discovery", "abstract": "Data discovery is a multi-dimensional field encompassing information extraction, information retrieval, exploratory data analysis, visualization and recommendations among other things. Data Marketplaces are platforms where users discover and shop for data products. These products themselves are produced by modern data stacks governed by frameworks like Data Fabric. Knowledge Graphs and semantic technologies already form a core part of Data Fabric and hence could be leveraged for data discovery. In this tutorial, we’ll present state of the art semantic technologies that enable automation of various tasks in data discovery. In particular, we’ll focus on data enrichment, datasets search and recommendations, and explorations within a dataset."}}
{"id": "DN3_Ft9gKu", "cdate": 1672531200000, "mdate": 1674992894694, "content": {"title": "xEM: Explainable Entity Matching in Customer 360", "abstract": "Entity matching in Customer 360 is the task of determining if multiple records represent the same real world entity. Entities are typically people, organizations, locations, and events represented as attributed nodes in a graph, though they can also be represented as records in relational data. While probabilistic matching engines and artificial neural network models exist for this task, explaining entity matching has received less attention. In this demo, we present our Explainable Entity Matching (xEM) system and discuss the different AI/ML considerations that went into its implementation."}}
{"id": "HIXMEvTHbM9", "cdate": 1647562076067, "mdate": null, "content": {"title": "Document Structure aware Relational Graph Convolutional Networks for Ontology Population", "abstract": "Ontologies comprising of concepts, their attributes, and relationships are used in many knowledge based AI systems. While there have been efforts towards populating domain specific ontologies, we examine the role of document structure in learning ontological relationships between concepts in any document corpus. Inspired by ideas from hypernym discovery and explainability, our method performs about 15 points more accurate than a stand-alone R-GCN model for this task."}}
{"id": "SreWy4pf0kq", "cdate": 1640995200000, "mdate": 1645255975314, "content": {"title": "Fine Grained Classification of Personal Data Entities with Language Models", "abstract": "Fine grained entity classification is the task of assigning context-specific, fine grained labels to entities extracted in an NLP Pipeline. Before the advent of language models, several artificial neural network models were proposed for this task. We revisit these models and compare them with BERT-based models for the specific task of classifying Personal Data Entities (PDE). We observe that using side information from rule-based annotators improves neural model performance on this task and can complement language models."}}
{"id": "TMtCDQecvMa", "cdate": 1609459200000, "mdate": 1626453973991, "content": {"title": "Document Structure aware Relational Graph Convolutional Networks for Ontology Population", "abstract": "Ontologies comprising of concepts, their attributes, and relationships are used in many knowledge based AI systems. While there have been efforts towards populating domain specific ontologies, we examine the role of document structure in learning ontological relationships between concepts in any document corpus. Inspired by ideas from hypernym discovery and explainability, our method performs about 15 points more accurate than a stand-alone R-GCN model for this task."}}
{"id": "OfbzROiZyN", "cdate": 1609459200000, "mdate": 1626453974024, "content": {"title": "Towards Automated Evaluation of Explanations in Graph Neural Networks", "abstract": "Explaining Graph Neural Networks predictions to end users of AI applications in easily understandable terms remains an unsolved problem. In particular, we do not have well developed methods for automatically evaluating explanations, in ways that are closer to how users consume those explanations. Based on recent application trends and our own experiences in real world problems, we propose automatic evaluation approaches for GNN Explanations."}}
{"id": "Ghip-cxGjzK", "cdate": 1609459200000, "mdate": 1626453974066, "content": {"title": "Data Augmentation for Fairness in Personal Knowledge Base Population", "abstract": "Cold start knowledge base population (KBP) is the problem of populating a knowledge base from unstructured documents. While neural networks have led to improvements in the different tasks that are part of KBP, the overall F1 of the end-to-end system remains quite low. This problem is more acute in personal knowledge bases, which present additional challenges with regard to data protection, fairness and privacy. In this work, we use data augmentation to populate a more complete personal knowledge base from the TACRED dataset. We then use explainability techniques and representative set sampling to show that the augmented knowledge base is more fair and diverse as well."}}
{"id": "9RTzYfJFSlF", "cdate": 1609459200000, "mdate": 1626453974100, "content": {"title": "Reimagining GNN Explanations with ideas from Tabular Data", "abstract": "Explainability techniques for Graph Neural Networks still have a long way to go compared to explanations available for both neural and decision decision tree-based models trained on tabular data. Using a task that straddles both graphs and tabular data, namely Entity Matching, we comment on key aspects of explainability that are missing in GNN model explanations."}}
{"id": "1qTm_HIbkOA", "cdate": 1609459200000, "mdate": 1639634439437, "content": {"title": "Similar Cases Recommendation using Legal Knowledge Graphs", "abstract": "A legal knowledge graph constructed from court cases, judgments, laws and other legal documents can enable a number of applications like question answering, document similarity, and search. While the use of knowledge graphs for distant supervision in NLP tasks is well researched, using knowledge graphs for downstream graph tasks like node similarity presents challenges in selecting node types and their features. In this demo, we describe our solution for predicting similar nodes in a case graph derived from our legal knowledge graph."}}
