{"id": "w-s5PE3Ao7e", "cdate": 1609459200000, "mdate": 1636611301620, "content": {"title": "Event Argument Extraction via a Distance-Sensitive Graph Convolutional Network", "abstract": "Event argument extraction (EAE) is a challenging task due to that some event arguments are far away from event triggers. Recently there have been many works using dependency trees to capture long-range dependencies between event triggers and event arguments. However, not all information in the dependency trees are useful for the EAE task. In this paper, we propose a Distance-Sensitive Graph Convolutional Network (DSGCN) for the EAE task. Our model can not only capture long-range dependencies via the graph convolution over the dependency trees, but also keep the information relevant to EAE via our designed distance-sensitive attention. Furthermore, dependency relation type information is utilized to enrich the representation of each word to further distinguish the roles of event arguments playing in an event. Experiment results on the ACE 2005 English dataset show that the proposed model achieves superior performance than the peer state-of-the-art methods."}}
{"id": "isBDUK34daT", "cdate": 1609459200000, "mdate": 1636611292340, "content": {"title": "Online Collaborative Localization", "abstract": "Can fingerprinting-based localization benefit from simultaneous observations from different users? This article provides an affirmative answer to this question. Existing fingerprinting schemes work in a kind of stand-alone mode, as they localize a user merely based on her own observations about surrounding environments. However, we argue the existence of scenarios where multiple users request for localization services simultaneously. If they are not far apart, their observations are actually distributed versions of the same environment, which can be exploited to calibrate underlying localization systems. In this article, we propose an online collaborative localization (OCLoc) scheme to boost received signal strength (RSS) fingerprinting in scenarios with multiple requesting users. The basic idea of OCLoc is based on the fact of distance attenuated radio propagations. For two users, their received signals from the same access point (AP) can be used to infer who is closer to this AP. We exploit such information for online collaboration and propose a series of operations to calibrate reference points (RPs) from distributed versions of radio attenuation observations. By integrating user calibration and fingerprint distance, we define a new ranking measure for reselecting and weighting candidate RPs to output the final location. Experiments on field measurements validate the effectiveness of such online collaborations in terms of greatly reduced localization errors."}}
{"id": "L7Pt5Yntp5T", "cdate": 1609459200000, "mdate": 1636611301755, "content": {"title": "A Novel Greedy FluidSpread Algorithm With Equilibrium Temperature for Influence Diffusion in Social Networks", "abstract": "Maximizing positive influenced users (MPIU) is one of the most important and classic problems in social networks. In this article, we propose an effective solution to the problem of MPIU with positive top- <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> influence, namely, Greedy FluidSpread Algorithm with Equilibrium Temperature (GFAET). In this article, the behavior of the users, such as the interactions and relationships of each user, and the content of a topic are modeled to the user interest vector and the topic distribution vector, respectively, to calculate the information acceptance probability. The influence diffusion process in social network is modeled as a fluid dynamics system and the attitude of the user is modeled as the fluid temperature. Newton's law of cooling and fluid dynamics theory is utilized to obtain a more accurate value of equilibrium temperature. Important users are then greedily selected in this system. Extensive experiments demonstrate that our GFAET significantly outperforms other traditional methods in terms of positive influence spread on both artificially generated and real-trace network datasets."}}
{"id": "Dc2W53TxM-", "cdate": 1609459200000, "mdate": 1636611301756, "content": {"title": "Topics, Sentiments, and Emotions Triggered by COVID-19-Related Tweets from IRAN and Turkey Official News Agencies", "abstract": "There is no doubt that the COVID-19 epidemic posed the most significant challenge to all governments globally since January 2020. People have to readapt after the epidemic to daily life with the absence of an effective vaccine for a long time. The epidemic has led to society division and uncertainty. With such issues, governments have to take efficient procedures to fight the epidemic. In this paper, we analyze and discuss two official news agencies’ tweets of Iran and Turkey by using sentiment- and semantic analysis-based unsupervised learning approaches. The main topics, sentiments, and emotions that accompanied the agencies’ tweets are identified and compared. The results are analyzed from the perspective of psychology, sociology, and communication."}}
{"id": "-EVN_zcTlZ", "cdate": 1609459200000, "mdate": 1636611294739, "content": {"title": "Fusion of latent categorical prediction and sequential prediction for session-based recommendation", "abstract": "Session-based recommendation is to predict the next item for an anonymous item sequence. Most of recent neural models have focused on how to learn sessions’ sequential representations based on the assumption that items can be projected into a single latent embedding space to describe their latent attributes. In this paper, we argue that an item can also be described by some latent categorical abstractions. To examine our argument, we first mine items’ latent categorical distributions via random walk on an item graph constructed from sessions. We design a new neural model which consists of two prediction modules: One is to learn a session’s latent categorical representation; The other is to learn a session’s sequential representation. Each module independently makes a next item prediction, and their predictions are fused as the final recommendation result. Experiments on three public datasets validate that our model achieves performance improvements over the recent state-of-the-art algorithms."}}
{"id": "pRJfHxHMRI", "cdate": 1577836800000, "mdate": 1636611298954, "content": {"title": "Local matrix approximation via automatic anchor selection and asymmetric neighbor inclusion based on feature divergence measure", "abstract": "Due to the ever-increasing users and items, the global matrix factorization (MF) over a large yet sparse user-item rating matrix no longer suffices for accurate rating approximations. This paper studies the problem of how to obtain many local matrices for improving the global rating approximation via averaging local MF results. In our scheme, we propose to use a feature divergence measure to compute the asymmetric distances in between users and items. To obtain local matrix approximation, we first propose to use a density-based clustering algorithm to automatically select a number of user-item pairs as anchors for self-adapting different datasets. Next for each anchor, we recruit its neighboring users and items with small feature divergences to the anchor, thus forming each local matrix. A kernel-based approach is then applied for local matrix approximation and a weighted averaging is used to obtain the global matrix rating approximations. Our experiments on the three real-world datasets show that the proposed solution can outperform the state-of-the-art schemes in terms of lower approximation errors and higher coverage ratios."}}
{"id": "dDAiZ-6lj4", "cdate": 1577836800000, "mdate": 1636611301761, "content": {"title": "Energy management for cost minimization in green heterogeneous networks", "abstract": "Highlights • Analyze the energy management problem in green heterogeneous networks. • Propose a solution consisting of spatial–temporal resource allocation. • Conduct simulations to confirm the superiority of the proposed scheme. Abstract With the fast development of cyber–physical systems, mobile applications and traffic demands have been significantly increasing in this decade. Likewise, the concerns about the electricity consumption impacts on environments and the energy costs of wireless networks have also been growing greatly. In this paper, we study the problem of energy cost minimization in a heterogeneous networks with hybrid energy supplies, where the network architecture consists of radio access part and wireless backhaul links. Owing to the diversities of mobile traffic and renewable energy, the energy cost minimization problem involves both temporal and spatial dimensional optimization. We decompose the whole problem into four sub-problems and correspondingly our proposed solution consists of four parts: At first, we obtain estimated average energy consumption profiles for all base stations based on the temporal traffic statistics; Second, we formulate the green energy allocation optimization in the temporal domain to minimize energy cost for each BS. Third, given the allocated green energy and practical user distribution in each slot, we propose a centralized and a distributed user association algorithm to minimize total energy cost in the spatial dimension. Fourth, based on the actual user association scheme, we readjust the green energy allocation for each BS to further improve green energy utilization. Simulation results show that our proposed solution can significantly reduce the total energy cost, compared with the recent peer algorithms."}}
{"id": "_KsjEmbprDS", "cdate": 1577836800000, "mdate": 1636611294248, "content": {"title": "Local ranking and global fusion for personalized recommendation", "abstract": "Highlights • Propose a local ranking and global fusion framework for top-n recommendation. • Propose a pairwise gap-aware BPR to distinguish pairwise preferences for learning-to-rank. • Propose a group-aware and order-scoring decision fusion for obtaining final ranking lists. • Validate the superiority of the proposed LRGF over the state-of-the-art schemes. Abstract Most of top-n personalized recommendation algorithms perform a kind of global learning-to-rank based on the original user–item rating matrix, yet with an implicit presumption of a unified feature space for all users (all items). However, we argue that such a presumption is a limiting factor for better recommendation, because features learned in a global space could be too coarse-grained. As such, ranking a recommendation list against a unified space might be dominated by only a few significant aspects of users’ interests. In this paper, we propose a novel local ranking and global fusion (LRGF) framework for personalized recommendation, which allows using multiple fine-grained feature spaces for learning-to-rank. In LRGF, we first adopt two-stage random walk on the established user graph and item graph for selecting those mostly related users and items, so as to form multiple local user–item groups. Next, we propose a pairwise gap-aware Bayesian personalized ranking to obtain local ranking lists for each local user–item group. Finally, a global decision fusion is proposed to obtain the final top-n recommendation list for each user only from her local ranking lists. Experiments on the three real-world datasets show that the proposed LRGF outperforms the state-of-the-art schemes in terms of higher mean average precision and normalized discounted cumulative gain."}}
{"id": "KxEKgd_e_71", "cdate": 1577836800000, "mdate": 1636611301791, "content": {"title": "Learning sequential and general interests via a joint neural model for session-based recommendation", "abstract": "Session-based recommendation is to predict the next action of a user based on his current behavior session. Recent studies have focused on designing recurrent neural networks to capture representation of users sequential behaviors from a large number of anonymous sessions. Although these neural models have greatly improved recommendation performance compared with traditional approaches, they have overemphasized the sequential information of sessions, that is, the order of items in each browsing session. We argue that besides the order of items, the set of items in each session can also reflect the general interests of current session and can also be exploited to augment recommendations. To this end, this paper proposes a joint neural model, called SGINM, for jointly learning sequential and general interests of each session for session-based recommendation. In SGINM, we design an attentive recurrent neural network which not only captures self-adaptive weighed representation of each subsequence in a session but also learns a global representation for the whole session. Furthermore, the SGINM adopts a multi-layer neural network with residual connections to learn the general interests of each session. The SGINM uses a softmax layer to jointly decode the two types of interests and output a ranking vector of recommended items for each new session. The proposed model has been extensively experimented with the benchmark datasets from the RecSys Challenge 2015 and CIKM Cup 2016. Compared with the state-of-the-art models, the proposed SGINM achieves better recommendation performance in terms of higher predicative accuracy and mean reciprocal rank in almost all experiment cases."}}
{"id": "JQpehli3cTa", "cdate": 1577836800000, "mdate": 1636611303933, "content": {"title": "An End-to-end Topic-Enhanced Self-Attention Network for Social Emotion Classification", "abstract": "Social emotion classification is to predict the distribution of different emotions evoked by an article among its readers. Prior studies have shown that document semantic and topical features can help improve classification performance. However, how to effectively extract and jointly exploit such features have not been well researched. In this paper, we propose an end-to-end topic-enhanced self-attention network (TESAN) that jointly encodes document semantics and extracts document topics. In particular, TESAN first constructs a neural topic model to learn topical information and generates a topic embedding for a document. We then propose a topic-enhanced self-attention mechanism to encode semantic and topical information into a document vector. Finally, a fusion gate is used to compose the document representation for emotion classification by integrating the document vector and the topic embedding. The entire TESAN is trained in an end-to-end manner. Experimental results on three public datasets reveal that TESAN outperforms the state-of-the-art schemes in terms of higher classification accuracy and higher average Pearson correlation coefficient. Furthermore, the TESAN is computation efficient and can generate more coherent topics."}}
