{"id": "qmuWHw1Gjd8", "cdate": 1672531200000, "mdate": 1682080643391, "content": {"title": "An Efficient Learning-Based Solver for Two-Stage DC Optimal Power Flow with Feasibility Guarantees", "abstract": "In this paper, we consider the scenario-based two-stage stochastic DC optimal power flow (OPF) problem for optimal and reliable dispatch when the load is facing uncertainty. Although this problem is a linear program, it remains computationally challenging to solve due to the large number of scenarios needed to accurately represent the uncertainties. To mitigate the computational issues, many techniques have been proposed to approximate the second-stage decisions so they can dealt more efficiently. The challenge of finding good policies to approximate the second-stage decisions is that these solutions need to be feasible, which has been difficult to achieve with existing policies. To address these challenges, this paper proposes a learning method to solve the two-stage problem in a more efficient and optimal way. A technique called the gauge map is incorporated into the learning architecture design to guarantee the learned solutions' feasibility to the network constraints. Namely, we can design policies that are feed forward functions that only output feasible solutions. Simulation results on standard IEEE systems show that, compared to iterative solvers and the widely used affine policy, our proposed method not only learns solutions of good quality but also accelerates the computation by orders of magnitude."}}
{"id": "PLktTKDVl1", "cdate": 1672531200000, "mdate": 1682080643642, "content": {"title": "Solving Differential-Algebraic Equations in Power Systems Dynamics with Neural Networks and Spatial Decomposition", "abstract": "The dynamics of the power system are described by a system of differential-algebraic equations. Time-domain simulations are used to understand the evolution of the system dynamics. These simulations can be computationally expensive due to the stiffness of the system which requires the use of finely discretized time-steps. By increasing the allowable time-step size, we aim to accelerate such simulations. In this paper, we use the observation that even though the individual components are described using both algebraic and differential equations, their coupling only involves algebraic equations. Following this observation, we use Neural Networks (NNs) to approximate the components' state evolution, leading to fast, accurate, and numerically stable approximators, which enable larger time-steps. To account for effects of the network on the components and vice-versa, the NNs take the temporal evolution of the coupling algebraic variables as an input for their prediction. We initially estimate this temporal evolution and then update it in an iterative fashion using the Newton-Raphson algorithm. The involved Jacobian matrix is calculated with Automatic Differentiation and its size depends only on the network size but not on the component dynamics. We demonstrate this NN-based simulator on the IEEE 9-bus test case with 3 generators."}}
{"id": "vgtxMaLYDNm", "cdate": 1640995200000, "mdate": 1682080643771, "content": {"title": "Computationally Efficient Safe Reinforcement Learning for Power Systems", "abstract": "We propose a computationally efficient approach to safe reinforcement learning (RL) for frequency regulation in power systems with high levels of variable renewable energy resources. The approach draws on set-theoretic control techniques to craft a neural network-based control policy that is guaranteed to satisfy safety-critical state constraints, without needing to solve a model predictive control or projection problem in real time. By exploiting the properties of robust controlled-invariant polytopes, we construct a novel, closed-form \"safety-filter\" that enables end-to-end safe learning using any policy gradient-based RL algorithm. We then apply the safety filter in conjunction with the deep deterministic policy gradient (DDPG) algorithm to regulate frequency in a modified 9-bus power system, and show that the learned policy is more cost-effective than robust linear feedback control techniques while maintaining the same safety guarantee. We also show that the proposed paradigm outperforms DDPG augmented with constraint violation penalties."}}
{"id": "vP-Eu3efxwq", "cdate": 1640995200000, "mdate": 1682080643613, "content": {"title": "Equilibrium-Independent Stability Analysis for Distribution Systems with Lossy Transmission Lines", "abstract": "Power distribution systems are becoming much more active with increased penetration of distributed energy resources. Because of the intermittent nature of these resources, the stability of distribution systems under large disturbances and time-varying conditions is becoming a key issue in practical operations. Because the transmission lines in distribution systems are lossy, standard approaches in power system stability analysis do not readily apply and the understanding of transient stability remains open even for simplified models.   This paper proposes a novel equilibrium-independent transient stability analysis of distribution systems with lossy lines. We certify network-level stability by breaking the network into subsystems, and by looking at the equilibrium-independent passivity of each subsystem, the network stability is certified through a diagonal stability property of the interconnection matrix. This allows the analysis scale to large networked systems with time-varying equilibria. The proposed method gracefully extrapolates between lossless and lossy systems, and provides a simple yet effective approach to optimize control efforts with guaranteed stability regions. Case studies verify that the proposed method is much less conservative than existing approaches and also scales to large systems."}}
{"id": "uc72CN1x_E", "cdate": 1640995200000, "mdate": 1682080643521, "content": {"title": "Data-Driven Modeling of Aggregate Flexibility Under Uncertain and Non-Convex Device Models", "abstract": ""}}
{"id": "uSbwvYW6_yt", "cdate": 1640995200000, "mdate": 1682080643375, "content": {"title": "Equilibrium-Independent Stability Analysis for Distribution Systems With Lossy Transmission Lines", "abstract": "Power distribution systems are becoming much more active with increased penetration of distributed energy resources. Because of the intermittent nature of these resources, the stability of distribution systems under large disturbances and time-varying conditions is becoming a key issue in practical operations. Because the transmission lines in distribution systems are lossy, standard approaches in power system stability analysis do not readily apply. In this letter, the stability of lossy distribution systems is certified by breaking the network into subsystems. By looking at the equilibrium-independent passivity of each subsystem, the stability of the whole network is implied by the diagonal stability of the interconnection matrix. This analysis scales to large networked systems with time-varying equilibria. The proposed method gracefully extrapolates between lossless and lossy systems, and provides a simple yet effective approach to optimize control efforts with guaranteed stability regions. Case studies verify that the proposed method is much less conservative than existing approaches."}}
{"id": "sioU51dt2M", "cdate": 1640995200000, "mdate": 1682080643490, "content": {"title": "Decentralized Safe Reinforcement Learning for Voltage Control", "abstract": "Inverter-based distributed energy resources provide the possibility for fast time-scale voltage control by quickly adjusting their reactive power. The power-electronic interfaces allow these resources to realize almost arbitrary control law, but designing these decentralized controllers is nontrivial. Reinforcement learning (RL) approaches are becoming increasingly popular to search for policy parameterized by neural networks. It is difficult, however, to enforce that the learned controllers are safe, in the sense that they may introduce instabilities into the system.This paper proposes a safe learning approach for voltage control. We prove that the system is guaranteed to be exponentially stable if each controller satisfies certain Lipschitz constraints. The set of Lipschitz bound is optimized to enlarge the search space for neural network controllers. We explicitly engineer the structure of neural network controllers such that they satisfy the Lipschitz constraints by design. A decentralized RL framework is constructed to train local neural network controller at each bus in a model-free setting."}}
{"id": "n9XEANfQce", "cdate": 1640995200000, "mdate": 1682080643407, "content": {"title": "Safe and Efficient Model Predictive Control Using Neural Networks: An Interior Point Approach", "abstract": "Model predictive control (MPC) provides a useful means for controlling systems with constraints, but suffers from the computational burden of repeatedly solving an optimization problem in real time. Offline (explicit) solutions for MPC attempt to alleviate real time computational challenges using either multiparametric programming or machine learning. The multiparametric approaches are typically applied to linear or quadratic MPC problems, while learning-based approaches can be more flexible and are less memory-intensive. Existing learning-based approaches offer significant speedups, but the challenge becomes ensuring constraint satisfaction while maintaining good performance. In this paper, we provide a neural network parameterization of MPC policies that explicitly encodes the constraints of the problem. By exploring the interior of the MPC feasible set in an unsupervised learning paradigm, the neural network finds better policies faster than projectionbased methods and exhibits substantially shorter solve times. We use the proposed policy to solve a robust MPC problem, and demonstrate the performance and computational gains on a standard test system."}}
{"id": "l_lyWxD421w", "cdate": 1640995200000, "mdate": 1682080643379, "content": {"title": "A Convex Neural Network Solver for DCOPF With Generalization Guarantees", "abstract": "The dc optimal power flow (DCOPF) problem is a fundamental problem in power systems operations and planning. With high penetration of uncertain renewable resources in power systems, DCOPF needs to be solved repeatedly for a large amount of scenarios, which can be computationally challenging. As an alternative to iterative solvers, neural networks are often trained and used to solve DCOPF. These approaches can offer orders of magnitude reduction in computational time, but they cannot guarantee generalization, and small training error does not imply small testing errors. In this work, we propose a novel algorithm for solving DCOPF that guarantees the generalization performance. First, by utilizing the convexity of the DCOPF problem, we train an input convex neural network. Second, we construct the training loss based on Karush–Kuhn–Tucker optimality conditions. By combining these two techniques, the trained model has provable generalization properties, where small training error implies small testing errors. In experiments, our algorithm significantly outperforms other machine learning methods."}}
{"id": "a9ajCsNv05J", "cdate": 1640995200000, "mdate": 1682080643847, "content": {"title": "Optimal Inverter-Based Resources Placement in Low-Inertia Power Systems", "abstract": "An increase in the integration of Inverter Based Resources (IBRs) to the electric grid, will lead to a corresponding decrease in the amount of connected synchronous generators, resulting in a decline in the available rotational inertia system-wide. This can lead to pronounced frequency deviations when there are disturbances and faults in the grid. This decline in available rotational inertia can be compensated for by fast acting IBRs participating in frequency response services, by rapidly injecting into or removing power from the grid. Currently, there are still relative small number of sizable IBRs in the grid. Therefore, the placement of the IBRs in the system, as well as the inverter configuration type and controller, will have a material impact on the frequency response of the grid. In this work, we present an optimal placement algorithm that maximizes the benefits of utilizing IBRs in providing frequency response services. That is, we minimize the overall system frequency deviation while using a minimal amount of electric power injection from the IBRs. The proposed algorithm uses the resistance distance to place the IBRs at nodes that are central to the rest of the nodes in the network thus minimizing the distance of power flow. The proposed greedy algorithm achieves a near optimal performance and relies on the supermodularity of the resistance distances. We validate the performance of the placement algorithm on three IEEE test systems of varying sizes, by comparing its performance to an exhaustive search algorithm. We further evaluate the performance of the placed IBRs on an IEEE test system, to determine their impact on frequency stability. The IBRs are configured in a grid-forming mode and equipped with a model predictive control (MPC)-based inverter power control."}}
