{"id": "UrpLOJzjBuF", "cdate": 1672531200000, "mdate": 1682318048200, "content": {"title": "Label Information Enhanced Fraud Detection against Low Homophily in Graphs", "abstract": "Node classification is a substantial problem in graph-based fraud detection. Many existing works adopt Graph Neural Networks (GNNs) to enhance fraud detectors. While promising, currently most GNN-based fraud detectors fail to generalize to the low homophily setting. Besides, label utilization has been proved to be significant factor for node classification problem. But we find they are less effective in fraud detection tasks due to the low homophily in graphs. In this work, we propose GAGA, a novel Group AGgregation enhanced TrAnsformer, to tackle the above challenges. Specifically, the group aggregation provides a portable method to cope with the low homophily issue. Such an aggregation explicitly integrates the label information to generate distinguishable neighborhood information. Along with group aggregation, an attempt towards end-to-end trainable group encoding is proposed which augments the original feature space with the class labels. Meanwhile, we devise two additional learnable encodings to recognize the structural and relational context. Then, we combine the group aggregation and the learnable encodings into a Transformer encoder to capture the semantic information. Experimental results clearly show that GAGA outperforms other competitive graph-based fraud detectors by up to 24.39% on two trending public datasets and a real-world industrial dataset from Anonymous. Even more, the group aggregation is demonstrated to outperform other label utilization methods (e.g., C&S, BoT/UniMP) in the low homophily setting."}}
{"id": "Sj_8RRx-1ve", "cdate": 1640995200000, "mdate": 1682318048201, "content": {"title": "A Difference Standardization Method for Mutual Transfer Learning", "abstract": "In many real-world applications, mutual transfer learning is the paradigm that each data domain can potentially be a source or target domain. This is quite different from transfer learning tasks wh..."}}
{"id": "QSwESMYfrQO", "cdate": 1640995200000, "mdate": 1682318048244, "content": {"title": "Fast and scalable learning of sparse changes in high-dimensional graphical model structure", "abstract": ""}}
{"id": "7Jj2-ttwh-", "cdate": 1640995200000, "mdate": 1682318048353, "content": {"title": "TKGAT: Graph attention network for knowledge-enhanced tag-aware recommendation system", "abstract": ""}}
{"id": "kSF46zuPPa", "cdate": 1609459200000, "mdate": 1682318048127, "content": {"title": "Cascade and Fusion: A Deep Learning Approach for Camouflaged Object Sensing", "abstract": "The demand for the sensor-based detection of camouflage objects widely exists in biological research, remote sensing, and military applications. However, the performance of traditional object detection algorithms is limited, as they are incapable of extracting informative parts from low signal-to-noise ratio features. To address this problem, we propose Camouflaged Object Detection with Cascade and Feedback Fusion (CODCEF), a deep learning framework based on an RGB optical sensor that leverages a cascaded structure with Feedback Partial Decoders (FPD) instead of a traditional encoder–decoder structure. Through a selective fusion strategy and feedback loop, FPD reduces the loss of information and the interference of noises in the process of feature interweaving. Furthermore, we introduce Pixel Perception Fusion (PPF) loss, which aims to pay more attention to local pixels that might become the edges of an object. Experimental results on an edge device show that CODCEF achieved competitive results compared with 10 state-of-the-art methods."}}
{"id": "0R6dwx5F2H", "cdate": 1609459200000, "mdate": 1682318048249, "content": {"title": "Scalable Estimator for Multi-task Gaussian Graphical Models Based in an IoT Network", "abstract": "Recently, the Internet of Things (IoT) receives significant interest due to its rapid development. But IoT applications still face two challenges: heterogeneity and large scale of IoT data. Therefore, how to efficiently integrate and process these complicated data becomes an essential problem. In this article, we focus on the problem that analyzing variable dependencies of data collected from different edge devices in the IoT network. Because data from different devices are heterogeneous and the variable dependencies can be characterized into a graphical model, we can focus on the problem that jointly estimating multiple, high-dimensional, and sparse Gaussian Graphical Models for many related tasks (edge devices). This is an important goal in many fields. Many IoT networks have collected massive multi-task data and require the analysis of heterogeneous data in many scenarios. Past works on the joint estimation are non-distributed and involve computationally expensive and complex non-smooth optimizations. To address these problems, we propose a novel approach: Multi-FST. Multi-FST can be efficiently implemented on a cloud-server-based IoT network. The cloud server has a low computational load and IoT devices use asynchronous communication with the server, leading to efficiency. Multi-FST shows significant improvement, over baselines, when tested on various datasets."}}
{"id": "FyXUape6HjC", "cdate": 1577836800000, "mdate": 1668782337068, "content": {"title": "An OpenCV-based Framework for Table Information Extraction", "abstract": "Portable Document Format (PDF), as one of the most popular file format, is especially useful for educational documents such as text books, articles, or papers in which we can preserve the original graphic appearance and conveniently share online. Detecting and extracting information from tables in PDF files can provide a plethora of structural data to construct educational knowledge graphs. However, most of the existing methods rely on PDF parsing tools and natural language processing techniques, which generally require training samples and are frail in handling cross-page tables. In light of this, in this paper, we propose a novel OpenCV-based framework to extract the metadata and specific values from PDF tables. Specifically, we first highlight the visual outline of the tables. Then, we locate tables using horizontal and vertical lines and get the coordinates of tabular frames in each PDF page. Once the tables are successfully detected, for each table, we detect the cross-page scenarios and use the Optical Character Recognition (OCR) engine to extract the specific values in each table cell. Differing from other machine learning based methods, the proposed method can achieve table information extraction accurately without labeled data. We conduct extensive experiments on real-world PDF files. The results demonstrate that our approach can effectively deal with cross-page tables and only need 6.12 seconds on average to process a table."}}
{"id": "7j-M5WX_I1c", "cdate": 1577836800000, "mdate": 1667576670411, "content": {"title": "Differential Network Learning Beyond Data Samples", "abstract": "Learning the differential statistical dependency network between two contexts is essential for many real-life applications, mostly in the high dimensional low sample regime. In this paper, we propose a novel differential network estimator that allows integrating various sources of knowledge beyond data samples. The proposed estimator is scalable to a large number of variables and achieves a sharp asymptotic convergence rate. Empirical experiments on extensive simulated data and four real-world applications (one on neuroimaging and three from functional genomics) show that our approach achieves improved differential network estimation and provides better supports to downstream tasks like classification. Our results highlight significant benefits of integrating group, spatial and anatomic knowledge during differential genetic network identification and brain connectome change discovery."}}
{"id": "6hB6VbQptRf", "cdate": 1577836800000, "mdate": 1682318048254, "content": {"title": "Quadratic Sparse Gaussian Graphical Model Estimation Method for Massive Variables", "abstract": "We consider the problem of estimating a sparse Gaussian Graphical Model with a special graph topological structure and more than a million variables. Most previous scalable estimators still contain expensive calculation steps (e.g., matrix inversion or Hessian matrix calculation) and become infeasible in high-dimensional scenarios, where p (number of variables) is larger than n (number of samples). To overcome this challenge, we propose a novel method, called Fast and Scalable Inverse Covariance Estimator by Thresholding (FST). FST first obtains a graph structure by applying a generalized threshold to the sample covariance matrix. Then, it solves multiple block-wise subproblems via element-wise thresholding. By using matrix thresholding instead of matrix inversion as the computational bottleneck, FST reduces its computational complexity to a much lower order of magnitude (O(p2)). We show that FST obtains the same sharp convergence rate O(√(log max{p, n}/n) as other state-of-the-art methods. We validate the method empirically, on multiple simulated datasets and one real-world dataset, and show that FST is two times faster than the four baselines while achieving a lower error rate under both Frobenius-norm and max-norm."}}
{"id": "ISnn2Zjqb90", "cdate": 1546300800000, "mdate": 1682318048123, "content": {"title": "Sparse and Low-Rank Tensor Regression via Parallel Proximal Method", "abstract": "Recently, tensor data (or multidimensional array) have been generated in many modern applications, such as functional magnetic resonance imaging (fMRI) in neuroscience and videos in video analysis. Many efforts are made in recent years to predict the relationship between tensor features and univariate responses. However, previously proposed methods either lose structural information within tensor data or have prohibitively expensive time costs, especially for large-scale data with high-order structures. To address such problems, we propose the Sparse and Low-rank Tensor Regression (SLTR) model. Our model enforces sparsity and low-rankness of the tensor coefficient by directly applying $\\ell_1$ norm and tensor nuclear norm, such that it preserves structural information of the tensor. To make the solving procedure scalable and efficient, SLTR makes use of the proximal gradient method, which can be easily implemented parallelly. We evaluate SLTR on several simulated datasets and one video action recognition dataset. Experiment results show that, compared with previous models, SLTR can obtain a better solution with much fewer time costs. Moreover, our model's predictions exhibit meaningful interpretations on the video dataset."}}
