{"id": "eLvWaly5CTv", "cdate": 1682321857995, "mdate": 1682321857995, "content": {"title": "Estimating Energy Consumption of a PHEV using Vehicle and On-board Navigation Data", "abstract": "This paper presents a novel approach for predicting the energy consumption of a plug-in hybrid electric vehicle (PHEV). We propose to estimate energy consumption strategy from data via regression applied to trip recordings. Descriptors of the trip elements are obtained from both recordings and statistics provided by a GPS navigation system. Trips are then split into elementary units corresponding to an homogeneous driving context. For each trip element, the optimal energy consumption strategy is computed via (expensive) dynamic programming simulations. Here, data analysis is used so as to identify descriptors of this trip element that are relevant to predict the energy consumption. Then, a polynomial model is fit to the data so as to estimate, for each new trip element, the optimal energy consumption strategy from the expected driving condition, rather than using dynamic programming. Our approach distinguishes itself by the fact that road context, driver style, road slope and auxiliary electrical power are taken into account to estimate the energy consumption of a PHEV. The accuracy of the prediction process is evaluated over test data, and demonstrates the interest of our approach in predicting energy consumption."}}
{"id": "yI7savUZAAA", "cdate": 1672531200000, "mdate": 1695985763721, "content": {"title": "Learning calibrated belief functions from conformal predictions", "abstract": "We consider the problem of supervised classification. We focus on the problem of calibrating the classifier’s outputs. We show that the p-values provided by Inductive Conformal Prediction (ICP) can..."}}
{"id": "LrwUEs9bUWX", "cdate": 1672531200000, "mdate": 1681718035069, "content": {"title": "Cautious weighted random forests", "abstract": ""}}
{"id": "KAKJEvHmOJ", "cdate": 1672531200000, "mdate": 1695985763711, "content": {"title": "Self Learning using Venn-Abers predictors", "abstract": "In supervised learning problems, it is common to have a lot of unlabeled data, but little labeled data. It is then desirable to leverage the unlabeled data to improve the learning procedure. One way to do this is to have a model predict “pseudolabels” for the unlabeled data, so as to use them for learning. In self-learning, the pseudo-labels are provided by the very same model to which they are fed. As these pseudo-labels are by nature uncertain and only partially reliable, it is then natural to model this uncertainty and take it into account in the learning process, if only to robustify the self-learning procedure. This paper describes such an approach, where we use Venn-Abers Predictors to produce calibrated credal labels so as to quantify the pseudo-labeling uncertainty. These labels are then included in the learning process by optimizing an adapted loss. Experiments show that taking into account pseudo-label uncertainty both robustifies the self-learning procedure and allows it to converge faster in general."}}
{"id": "ICOjcWPRdCy", "cdate": 1672531200000, "mdate": 1695985763728, "content": {"title": "Robust Consumption Planning from Uncertain Power Demand Predictions", "abstract": "A plug-in hybrid electric vehicle (PHEV) satisfies the driver’s power demand with two types of energy potentials: fuel and electrical energy provided by a battery. Classically, the battery consumption is planned over a trip to minimize the expected fuel consumption. A cautious driver will save battery potential to cross restricted areas (with desired low or even zero fuel consumption) without the fuel engine. This paper proposes an approach to minimize energy consumption while controlling the risk of a PHEV falling short of battery potential when crossing a restricted area. We use a nonlinear Gaussian process, trained on real vehicle data, for predicting the vehicle consumption. We take into account prediction uncertainty by ensuring that the driver’s highest power demand will be satisfied with a high probability. The interest of the approach is demonstrated by a simulated trip around Paris."}}
{"id": "DSIJnhg5kgw", "cdate": 1672531200000, "mdate": 1708525735571, "content": {"title": "Cautious Decision-Making for Tree Ensembles", "abstract": "Cautious classifiers are designed to make indeterminate decisions when the uncertainty on the input data or the model output is too high, so as to reduce the risk of making wrong decisions. In this paper, we propose two cautious decision-making procedures, by aggregating trees providing probability intervals constructed via the imprecise Dirichlet model. The trees are aggregated in the belief functions framework, by maximizing the lower expected discounted utility, so as to achieve a good compromise between model accuracy and determinacy. They can be regarded as generalizations of the two classical aggregation strategies for tree ensembles, i.e., averaging and voting. The efficiency and performance of the proposed procedures are tested on random forests and illustrated on three UCI datasets."}}
{"id": "m43sG-nRq1", "cdate": 1640995200000, "mdate": 1695985763725, "content": {"title": "Forêts aléatoires prudentes : une nouvelle stratégie de décision et quelques expériences", "abstract": ""}}
{"id": "egn665FZ20f", "cdate": 1640995200000, "mdate": 1681718035082, "content": {"title": "Vehicle consumption estimation via calibrated Gaussian Process regression", "abstract": "This paper proposes to use Gaussian process regression to predict the consumption of a plug-in electric hybrid vehicle from low-quality data. We specify background knowledge regarding new operating points and information regarding the noise process. This makes it possible to adapt the original (naive’) model. Experiments realized using dynamic and energetic models simulated electrified vehicle show the interest of our approach in order to improve robustness against scarce and noisy data."}}
{"id": "GEbacpuvwu", "cdate": 1640995200000, "mdate": 1695985763721, "content": {"title": "Explications contrefactuelles pour les forêts aléatoires prudentes", "abstract": ""}}
{"id": "EGw_OV_jsq3", "cdate": 1640995200000, "mdate": 1681718035112, "content": {"title": "A Robust Bayesian Estimation Approach for the Imprecise Plackett-Luce Model", "abstract": "Learning to rank has become an important part in the fields of machine learning and statistical learning. Rankings are indeed present in many applications, including cognitive psychology, recommender systems, sports tournament or automated algorithm choices. Rankings are however prone to subjectivity (when provided by users) and to incompleteness (when a contestant is missing, or users only report partial preferences). Robust or cautious approaches may overcome such issues. In this paper, we develop a Bayesian robust approach for a commonly used parametric model, the Plackett-Luce (PL) model. This allows us to obtain interval-valued parameter estimates for the strength parameter of the Plackett-Luce model. We illustrate our method with both synthetic and real data to show the usefulness of skeptic inference."}}
