{"id": "lv8BR5EwFC", "cdate": 1640995200000, "mdate": 1683534624531, "content": {"title": "Facial Tic Detection in Untrimmed Videos of Tourette Syndrome Patients", "abstract": "Tourette Syndrome (TS) is a behavior disorder that onsets in childhood and is characterized by the expression of involuntary movements and sounds commonly referred to as tics. Behavioral therapy is the first-line treatment for patients with TS, and it helps patients raise awareness about tic occurrence as well as develop tic inhibition strategies. However, the limited availability of therapists and the difficulties for in-home follow up work limits its effectiveness. An automatic tic detection system that is easy to deploy could alleviate the difficulties of home-therapy by providing feedback to the patients while exercising tic awareness. In this work, we propose a novel architecture (T-Net) for automatic tic detection and classification from untrimmed videos. T-Net combines temporal detection and segmentation and operates on features that are interpretable to a clinician. We compare T-Net to several state-of-the-art systems working on deep features extracted from the raw videos and T-Net achieves comparable performance in terms of average precision while relying on interpretable features needed in clinical practice."}}
{"id": "hqeE3EgCuO2", "cdate": 1640995200000, "mdate": 1683534624534, "content": {"title": "Facial Tic Detection in Untrimmed Videos of Tourette Syndrome Patients", "abstract": "Tourette Syndrome (TS) is a behavioral disorder that onsets in childhood and is characterized by the expression of involuntary movements and sounds commonly referred to as tics. Behavioral therapy is the first-line treatment for patients with TS, and it helps patients raise awareness about tic occurrence as well as develop tic inhibition strategies. However, the limited availability of therapists and the difficulties for in-home follow up work limits its effectiveness. An automatic tic detection system that is easy to deploy could alleviate the difficulties of home-therapy by providing feedback to the patients while exercising tic awareness. In this work, we propose a novel architecture (T-Net) for automatic tic detection and classification from untrimmed videos. T-Net combines temporal detection and segmentation and operates on features that are interpretable to a clinician. We compare T-Net to several state-of-the-art systems working on deep features extracted from the raw videos and T-Net achieves comparable performance in terms of average precision while relying on interpretable features needed in clinical practice."}}
{"id": "XiLJu_YwXHo", "cdate": 1640995200000, "mdate": 1683534624752, "content": {"title": "The Fastest $\\ell _{1, \\infty }$ℓ1, ∞ Prox in the West", "abstract": "Proximal operators are of particular interest in optimization problems dealing with non-smooth objectives because in many practical cases they lead to optimization algorithms whose updates can be computed in closed form or very efficiently. A well-known example is the proximal operator of the vector <inline-formula><tex-math notation=\"LaTeX\">$\\ell _1$</tex-math></inline-formula> norm, which is given by the soft-thresholding operator. In this paper we study the proximal operator of the mixed <inline-formula><tex-math notation=\"LaTeX\">$\\ell _{1,\\infty }$</tex-math></inline-formula> matrix norm and show that it can be computed in closed form by applying the well-known soft-thresholding operator to each column of the matrix. However, unlike the vector <inline-formula><tex-math notation=\"LaTeX\">$\\ell _1$</tex-math></inline-formula> norm case where the threshold is constant, in the mixed <inline-formula><tex-math notation=\"LaTeX\">$\\ell _{1,\\infty }$</tex-math></inline-formula> norm case each column of the matrix might require a different threshold and all thresholds depend on the given matrix. We propose a general iterative algorithm for computing these thresholds, as well as two efficient implementations that further exploit easy to compute lower bounds for the mixed norm of the optimal solution. Experiments on large-scale synthetic and real data indicate that the proposed methods can be orders of magnitude faster than state-of-the-art methods."}}
{"id": "F5jt4Sld_WM", "cdate": 1577836800000, "mdate": 1683534624772, "content": {"title": "Representation Learning on Visual-Symbolic Graphs for Video Understanding", "abstract": "Events in natural videos typically arise from spatio-temporal interactions between actors and objects and involve multiple co-occurring activities and object classes. To capture this rich visual and semantic context, we propose using two graphs: (1) an attributed spatio-temporal visual graph whose nodes correspond to actors and objects and whose edges encode different types of interactions, and (2) a symbolic graph that models semantic relationships. We further propose a graph neural network for refining the representations of actors, objects and their interactions on the resulting hybrid graph. Our model goes beyond current approaches that assume nodes and edges are of the same type, operate on graphs with fixed edge weights and do not use a symbolic graph. In particular, our framework: a) has specialized attention-based message functions for different node and edge types; b) uses visual edge features; c) integrates visual evidence with label relationships; and d) performs global reasoning in the semantic space. Experiments on challenging video understanding tasks, such as temporal action localization on the Charades dataset, show that the proposed method leads to state-of-the-art performance."}}
{"id": "AEKzRYjs34x", "cdate": 1577836800000, "mdate": 1683534624781, "content": {"title": "A finite rate of innovation approach for the estimation of a stream of decaying exponentials", "abstract": "In this paper we describe a novel approach for sparse signal estimation from low-pass filtered observations. Motivated by applications in neuroscience, we consider the problem of retrieving the time instants of a train of pulses where the shape of the pulse is a causal decaying exponential. Our approach builds upon recent results on continuous sparse signal recovery using the finite rate of innovation framework. Our results show that our method achieves near to optimal performance in terms of signal recovery on synthetically generated data. We then explore its potential application to neural activity inference from calcium imaging fluorescence traces, and propose an algorithm based on the proposed estimation method that is applicable to real calcium fluorescence signals of arbitrary length."}}
{"id": "qRzUqHRRaH", "cdate": 1546300800000, "mdate": 1683534624562, "content": {"title": "The fastest 𝓁1, ∞ prox in the west", "abstract": "Proximal operators are of particular interest in optimization problems dealing with non-smooth objectives because in many practical cases they lead to optimization algorithms whose updates can be computed in closed form or very efficiently. A well-known example is the proximal operator of the vector $\\ell_1$ norm, which is given by the soft-thresholding operator. In this paper we study the proximal operator of the mixed $\\ell_{1,\\infty}$ matrix norm and show that it can be computed in closed form by applying the well-known soft-thresholding operator to each column of the matrix. However, unlike the vector $\\ell_1$ norm case where the threshold is constant, in the mixed $\\ell_{1,\\infty}$ norm case each column of the matrix might require a different threshold and all thresholds depend on the given matrix. We propose a general iterative algorithm for computing these thresholds, as well as two efficient implementations that further exploit easy to compute lower bounds for the mixed norm of the optimal solution. Experiments on large-scale synthetic and real data indicate that the proposed methods can be orders of magnitude faster than state-of-the-art methods."}}
{"id": "BYUjzfXtVBk", "cdate": 1546300800000, "mdate": 1683534624526, "content": {"title": "Joint Holographic Detection and Reconstruction", "abstract": "Lens-free holographic imaging is important in many biomedical applications, as it offers a wider field of view, more mechanical robustness and lower cost than traditional microscopes. In many cases, it is important to be able to detect biological objects, such as blood cells, in microscopic images. However, state-of-the-art object detection methods are not designed to work on holographic images. Typically, the hologram must first be reconstructed into an image of the specimen, given a priori knowledge of the distance between the specimen and sensor, and standard object detection methods can then be used to detect objects in the reconstructed image. This paper describes a method for detecting objects directly in holograms while jointly reconstructing the image. This is achieved by assuming a sparse convolutional model for the objects being imaged and modeling the diffraction process responsible for generating the recorded hologram. This paper also describes an unsupervised method for training the convolutional templates, shows that the proposed method produces promising results for detecting white blood cells in holographic images, and demonstrates that the proposed object detection method is robust to errors in estimated focal depth."}}
{"id": "71KslG2JrOB", "cdate": 1546300800000, "mdate": 1683534624753, "content": {"title": "Neural Message Passing on Hybrid Spatio-Temporal Visual and Symbolic Graphs for Video Understanding", "abstract": "Events in natural videos typically arise from spatio-temporal interactions between actors and objects and involve multiple co-occurring activities and object classes. To capture this rich visual and semantic context, we propose using two graphs: (1) an attributed spatio-temporal visual graph whose nodes correspond to actors and objects and whose edges encode different types of interactions, and (2) a symbolic graph that models semantic relationships. We further propose a graph neural network for refining the representations of actors, objects and their interactions on the resulting hybrid graph. Our model goes beyond current approaches that assume nodes and edges are of the same type, operate on graphs with fixed edge weights and do not use a symbolic graph. In particular, our framework: a) has specialized attention-based message functions for different node and edge types; b) uses visual edge features; c) integrates visual evidence with label relationships; and d) performs global reasoning in the semantic space. Experiments on challenging video understanding tasks, such as temporal action localization on the Charades dataset, show that the proposed method leads to state-of-the-art performance."}}
{"id": "j-WLKWieZH3", "cdate": 1514764800000, "mdate": 1683534624806, "content": {"title": "Sampling at Unknown Locations: Uniqueness and Reconstruction Under Constraints", "abstract": "Traditional sampling results assume that the sample locations are known. Motivated by simultaneous localization and mapping (SLAM) and structure from motion (SfM), we investigate sampling at unknown locations. Without further constraints, the problem is often hopeless. For example, we recently showed that, for polynomial and bandlimited signals, it is possible to find two signals, arbitrarily far from each other, that fit the measurements. However, we also showed that this can be overcome by adding constraints to the sample positions. In this paper, we show that these constraints lead to a uniform sampling of a composite of functions. Furthermore, the formulation retains the key aspects of the SLAM and SfM problems, whilst providing uniqueness, in many cases. We demonstrate this by studying two simple examples of constrained sampling at unknown locations. In the first, we consider sampling a periodic bandlimited signal composite with an unknown linear function. We derive the sampling requirements for uniqueness and present an algorithm that recovers both the bandlimited signal and the linear warping. Furthermore, we prove that, when the requirements for uniqueness are not met, the cases of multiple solutions have measure zero. For our second example, we consider polynomials sampled such that the sampling positions are constrained by a rational function. We previously proved that, if a specific sampling requirement is met, uniqueness is achieved. In addition, we present an alternate minimization scheme for solving the resulting non-convex optimization problem. Finally, fully reproducible simulation results are provided to support our theoretical analysis."}}
{"id": "8OoITP2W1p", "cdate": 1514764800000, "mdate": 1683534624444, "content": {"title": "Sampling Continuous-Time Sparse Signals: A Frequency-Domain Perspective", "abstract": "We address the problem of sampling and reconstruction of sparse signals with finite rate of innovation. We derive general conditions under which perfect reconstruction is possible for sampling kernels satisfying Strang-Fix conditions. Previous results on the subject consider two particular cases; when the kernel is able to reproduce (complex) exponentials, or when it has the polynomial reproduction property. In this paper, we extend such analysis to the case where both properties could be found in the sampling kernel and show that the former two situations can be regarded as special cases. As a result of our analysis, we provide general conditions under which perfect recovery in the noiseless case is possible. In practice, a given sampling kernel might not satisfy Strang-Fix conditions. When dealing with arbitrary sampling kernels, we propose a unified view for sampling and reconstruction in the frequency domain. Our formulation generalizes previous approaches and provides new insights for devising optimal reconstruction schemes. We also propose a novel algorithm for denoising treating the problem as a particular instance of structured low-rank approximation. Finally, we provide some numerical experiments and a comparison between different state-of-the-art methods showing the improved estimation performance of the proposed approach."}}
