{"id": "0gccw3tTXwR", "cdate": 1665285245894, "mdate": null, "content": {"title": "Biological Cartography: Building and Benchmarking Representations of Life", "abstract": "The continued scaling of genetic perturbation technologies combined with high-dimensional assays (microscopy and RNA-sequencing) has enabled genome-scale reverse-genetics experiments that go beyond single-endpoint measurements of growth or lethality. Datasets emerging from these experiments can be combined to construct “maps of biology”, in which perturbation readouts are placed in unified, relatable embedding spaces to capture known biological relationships and discover new ones. Construction of maps involves many technical choices in both experimental and computational protocols, motivating the design of benchmark procedures by which to evaluate map quality in a systematic, unbiased manner.\n\nIn this work, we propose a framework for the steps involved in map building and demonstrate key classes of benchmarks to assess the quality of a map. We describe univariate benchmarks assessing perturbation quality and multivariate benchmarks assessing recovery of known biological relationships from large-scale public data sources. We demonstrate the application and interpretation of these benchmarks through example maps of scRNA-seq and phenomic imaging data."}}
{"id": "MGWzBsVVF6", "cdate": 1665285242703, "mdate": null, "content": {"title": "MolE: a molecular foundation model for drug discovery", "abstract": "Models that accurately predict properties based on chemical structure are valuable tools in drug discovery. However, for many properties, public and private training sets are typically small, and it is difficult for the models to generalize well outside of the training data. Recently, large language models have addressed this problem by using self-supervised pretraining on large unlabeled datasets, followed by fine-tuning on smaller, labeled datasets. In this paper, we report MolE, a molecular foundation model that adapts the DeBERTa architecture to be used on molecular graphs together with a two-step pretraining strategy. The first step of pretraining is a self-supervised approach focused on learning chemical structures, and the second step is a massive multi-task approach to learn biological information. We show that fine-tuning pretrained MolE achieves state-of-the-art results on 9 of the 22 ADMET tasks included in the Therapeutic Data Commons."}}
{"id": "Zg2m40OCdt", "cdate": 1649354792180, "mdate": 1649354792180, "content": {"title": "WILDS: A Benchmark of in-the-Wild Distribution Shifts", "abstract": "Distribution shifts -- where the training distribution differs from the test distribution -- can substantially degrade the accuracy of machine learning (ML) systems deployed in the wild. Despite their ubiquity in the real-world deployments, these distribution shifts are under-represented in the datasets widely used in the ML community today. To address this gap, we present WILDS, a curated benchmark of 10 datasets reflecting a diverse range of distribution shifts that naturally arise in real-world applications, such as shifts across hospitals for tumor identification; across camera traps for wildlife monitoring; and across time and location in satellite imaging and poverty mapping. On each dataset, we show that standard training yields substantially lower out-of-distribution than in-distribution performance. This gap remains even with models trained by existing methods for tackling distribution shifts, underscoring the need for new methods for training models that are more robust to the types of distribution shifts that arise in practice. To facilitate method development, we provide an open-source package that automates dataset loading, contains default model architectures and hyperparameters, and standardizes evaluations. Code and leaderboards are available at this https URL."}}
{"id": "CVoNiyoXs6", "cdate": 1649354630437, "mdate": 1649354630437, "content": {"title": "Identification of potential treatments for COVID-19 through artificial intelligence-enabled phenomic analysis of human cells infected with SARS-CoV-2", "abstract": "To identify potential therapeutic stop-gaps for SARS-CoV-2, we evaluated a library of 1,670 approved and reference compounds in an unbiased, cellular image-based screen for their ability to suppress the broad impacts of the SARS-CoV-2 virus on phenomic profiles of human renal cortical epithelial cells using deep learning. In our assay, remdesivir is the only antiviral tested with strong efficacy, neither chloroquine nor hydroxychloroquine have any beneficial effect in this human cell model, and a small number of compounds not currently being pursued clinically for SARS-CoV-2 have efficacy. We observed weak but beneficial class effects of β-blockers, mTOR/PI3K inhibitors and Vitamin D analogues and a mild amplification of the viral phenotype with β-agonists."}}
{"id": "J__jL18xHf-", "cdate": 1649354513342, "mdate": 1649354513342, "content": {"title": "Functional immune mapping with deep-learning enabled phenomics applied to immunomodulatory and COVID-19 drug discovery", "abstract": "Development of accurate disease models and discovery of immune-modulating drugs is challenged by the immune system’s highly interconnected and context-dependent nature. Here we apply deep-learning-driven analysis of cellular morphology to develop a scalable “phenomics” platform and demonstrate its ability to identify dose-dependent, high-dimensional relationships among and between immunomodulators, toxins, pathogens, genetic perturbations, and small and large molecules at scale. High-throughput screening on this platform demonstrates rapid identification and triage of hits for TGF-β- and TNF-α-driven phenotypes. We deploy the platform to develop phenotypic models of active SARS-CoV-2 infection and of COVID-19-associated cytokine storm, surfacing compounds with demonstrated clinical benefit and identifying several new candidates for drug repurposing. The presented library of images, deep learning features, and compound screening data from immune profiling and COVID-19 screens serves as a deep resource for immune biology and cellular-model drug discovery with immediate impact on the COVID-19 pandemic."}}
{"id": "1snUiKndwDi", "cdate": 1649353222530, "mdate": 1649353222530, "content": {"title": "RXRX1: AN IMAGE SET FOR CELLULAR MORPHOLOGICAL VARIATION ACROSS MANY EXPERIMENTAL BATCHES", "abstract": "High-throughput screening techniques are commonly used in many fields of biology. However, it is well known that non-biological artifacts arising from variability in the technical execution of different experimental batches confound high-throughput screens measurements. These batch effects obscure biological conclusions, and it is therefore necessary to account for them. While a number of techniques have been proposed, to our knowledge there is not a publicly available biological dataset designed specifically for the systematic study of batch effect correction. To this end we announce the release of RxRx1, a set of 125,514 high-resolution fluorescence microscopy images of human cells under 1,108 genetic perturbations in 51 experimental batches across four cell types. Visual inspection of the images by batch makes it clear that the set indeed demonstrates significant batch effects. In this paper we describe the image set in detail. We also propose a classification task designed to study batch effect correction on these images, and provide some baseline results for the task. Our goal in releasing this image set is to encourage researchers across various disciplines to develop effective methods for removing batch effects that generalize well to unseen experimental batches and to share these methods with the scientific community."}}
