{"id": "GJK1JJ-TWLK", "cdate": 1623634071271, "mdate": 1623634071271, "content": {"title": "Using transcriptomic hidden variables to infer context-specific genotype effects in the brain", "abstract": "Deciphering the environmental contexts at which genetic effects are most prominent is central for making full use of GWAS results in follow-up experiment design and treatment development. However, measuring a large number of environmental factors at high granularity might not always be feasible. Instead, here we propose extracting cellular embedding of environmental factors from gene expression data by using latent variable (LV) analysis and taking these LVs as environmental proxies in detecting gene-by-environment (GxE) interaction effects on gene expression, i.e., GxE expression quantitative trait loci (eQTLs). Applying this approach to two largest brain eQTL datasets (n = 1,100), we show that LVs and GxE eQTLs in one dataset replicate well in the other dataset. Combining the two samples via meta-analysis, 895 GxE eQTLs are identified. On average, GxE effect explains an additional ∼4% variation in expression of each gene that displays a GxE effect. Ten of these 52 genes are associated with cell-type-specific eQTLs, and the remaining genes are multi-functional. Furthermore, after substituting LVs with expression of transcription factors (TF), we found 91 TF-specific eQTLs, which demonstrates an important use of our brain GxE eQTLs."}}
{"id": "h4D26YswMA2", "cdate": 1623633991576, "mdate": 1623633991576, "content": {"title": "Deep learning of immune cell differentiation", "abstract": "Although we know many sequence-specific transcription factors (TFs), how the DNA sequence of cis-regulatory elements is decoded and orchestrated on the genome scale to determine immune cell differentiation is beyond our grasp. Leveraging a granular atlas of chromatin accessibility across 81 immune cell types, we asked if a convolutional neural network (CNN) could learn to infer cell type-specific chromatin accessibility solely from regulatory DNA sequences. With a tailored architecture and an ensemble approach to CNN parameter interpretation, we show that our trained network (“AI-TAC”) does so by rediscovering ab initio the binding motifs for known regulators and some unknown ones. Motifs whose importance is learned virtually as functionally important overlap strikingly well with positions determined by chromatin immunoprecipitation for several TFs. AI-TAC establishes a hierarchy of TFs and their interactions that drives lineage specification and also identifies stage-specific interactions, like Pax5/Ebf1 vs. Pax5/Prdm1, or the role of different NF-κB dimers in different cell types. AI-TAC assigns Spi1/Cebp and Pax5/Ebf1 as the drivers necessary for myeloid and B lineage fates, respectively, but no factors seemed as dominantly required for T cell differentiation, which may represent a fall-back pathway. Mouse-trained AI-TAC can parse human DNA, revealing a strikingly similar ranking of influential TFs and providing additional support that AI-TAC is a generalizable regulatory sequence decoder. Thus, deep learning can reveal the regulatory syntax predictive of the full differentiative complexity of the immune system."}}
{"id": "mgpFGdicf0y", "cdate": 1623633832134, "mdate": 1623633832134, "content": {"title": "An xQTL map integrates the genetic architecture of the human brain's transcriptome and epigenome", "abstract": "We report a multi-omic resource generated by applying quantitative trait locus (xQTL) analyses to RNA sequence, DNA\nmethylation and histone acetylation data from the dorsolateral prefrontal cortex of 411 older adults who have all three data types.\nWe identify SNPs significantly associated with gene expression, DNA methylation and histone modification levels. Many of these\nSNPs influence multiple molecular features, and we demonstrate that SNP effects on RNA expression are fully mediated by\nepigenetic features in 9% of these loci. Further, we illustrate the utility of our new resource, xQTL Serve, by using it to prioritize\nthe cell type(s) most affected by an xQTL. We also reanalyze published genome wide association studies using an xQTL-weighted\nanalysis approach and identify 18 new schizophrenia and 2 new bipolar susceptibility variants, which is more than double the\nnumber of loci that can be discovered with a larger blood-based expression eQTL resource."}}
{"id": "aOE_KvsxN1", "cdate": 1577836800000, "mdate": 1681712004130, "content": {"title": "Deconvolving the contributions of cell-type heterogeneity on cortical gene expression", "abstract": "Author summary Gene expression data generated from a tissue sample reflects an average gene expression profile across heterogeneous populations of cells. Because composition of constituent cell-types can vary across individuals (due to technical or biological factors), differential gene expression analysis requires estimating and adjusting for such cellular heterogeneity. While many deconvolution algorithms for estimating cellular composition from tissue gene expression data have been tested extensively in blood, their performance when applied to brain tissue is unclear. To address this gap, we generated an immunohistochemistry (IHC) dataset for five major cell-types from brain, in order to apply and then assess deconvolution algorithms for application to brain gene expression datasets. We show that these algorithms can indeed produce informative estimates of constituent cell-type proportions. Further, we show that adjusting for estimated cell-type proportions across individuals when conducting differential gene expression analysis is important in reducing false associations."}}
{"id": "WkY5uQ_MFh", "cdate": 1514764800000, "mdate": null, "content": {"title": "Multimodal Brain Parcellation Based on Functional and Anatomical Connectivity.", "abstract": "Brain parcellation is often a prerequisite for network analysis due to the statistical challenges, computational burdens, and interpretation difficulties arising from the high dimensionality of neuroimaging data. Predominant approaches are largely unimodal with functional magnetic resonance imaging (fMRI) being the primary modality used. These approaches thus neglect other brain attributes that relate to brain organization. In this article, we propose an approach for integrating fMRI and diffusion MRI data. Our approach introduces a nonlinear mapping between the connectivity values of two modalities, and adaptively balances their weighting based on their voxel-wise test–retest reliability. An efficient region level extension that additionally incorporates structural information on gyri and sulci is further presented. To validate, we compare multimodal parcellations with unimodal parcellations and existing atlases on the human connectome project data. We show that multimodal parcellations achieve higher reproducibility, comparable/higher functional homogeneity, and comparable/higher left out data likelihood. The boundaries of multimodal parcels are observed to align to those based on cytoarchitecture, and subnetworks extracted from multimodal parcels matched well with established brain systems. Our results thus show that multimodal information improves brain parcellation."}}
{"id": "VlYiBBapej", "cdate": 1514764800000, "mdate": 1681712004706, "content": {"title": "Multimodal Brain Parcellation Based on Functional and Anatomical Connectivity", "abstract": "Brain parcellation is often a prerequisite for network analysis due to the statistical challenges, computational burdens, and interpretation difficulties arising from the high dimensionality of neuroimaging data. Predominant approaches are largely unimodal with functional magnetic resonance imaging (fMRI) being the primary modality used. These approaches thus neglect other brain attributes that relate to brain organization. In this article, we propose an approach for integrating fMRI and diffusion MRI data. Our approach introduces a nonlinear mapping between the connectivity values of two modalities, and adaptively balances their weighting based on their voxel-wise test–retest reliability. An efficient region level extension that additionally incorporates structural information on gyri and sulci is further presented. To validate, we compare multimodal parcellations with unimodal parcellations and existing atlases on the human connectome project data. We show that multimodal parcellations achieve higher reproducibility, comparable/higher functional homogeneity, and comparable/higher left out data likelihood. The boundaries of multimodal parcels are observed to align to those based on cytoarchitecture, and subnetworks extracted from multimodal parcels matched well with established brain systems. Our results thus show that multimodal information improves brain parcellation."}}
{"id": "jkgAwoTN4h", "cdate": 1483228800000, "mdate": 1681712004248, "content": {"title": "Multimodal Brain Subnetwork Extraction Using Provincial Hub Guided Random Walks", "abstract": ""}}
{"id": "c8mLRxhjjFF", "cdate": 1483228800000, "mdate": null, "content": {"title": "Multimodal Brain Subnetwork Extraction Using Provincial Hub Guided Random Walks.", "abstract": "Community detection methods have been widely used for studying the modular structure of the brain. However, few of these methods exploit the intrinsic properties of brain networks other than modularity to tackle the pronounced noise in neuroimaging data. We propose a random walker (RW) based approach that reflects how regions of a brain subnetwork tend to be inter-linked by a provincial hub. By using provincial hubs to guide seed setting, RW provides the exact posterior probability of a brain region belonging to each given subnetwork, which mitigates forced hard assignments of brain regions to subnetworks as is the case in most existing methods. We further present an extension that enables multimodal integration for exploiting complementary information from functional Magnetic Resonance Imaging (fMRI) and diffusion MRI (dMRI) data. On synthetic data, our approach achieves higher accuracy in subnetwork extraction than unimodal and existing multimodal approaches. On real data from the Human Connectome Project (HCP), our estimated subnetworks match well with established brain systems and attain higher inter-subject reproducibility."}}
{"id": "uiGx7wlBTk", "cdate": 1451606400000, "mdate": null, "content": {"title": "Stable Overlapping Replicator Dynamics for Brain Community Detection.", "abstract": "A fundamental means for understanding the brain's organizational structure is to group its spatially disparate regions into functional subnetworks based on their interactions. Most community detection techniques are designed for generating partitions, but certain brain regions are known to interact with multiple subnetworks. Thus, the brain's underlying subnetworks necessarily overlap. In this paper, we propose a technique for identifying overlapping subnetworks from weighted graphs with statistical control over false node inclusion. Our technique improves upon the replicator dynamics formulation by incorporating a graph augmentation strategy to enable subnetwork overlaps, and a graph incrementation scheme for merging subnetworks that might be falsely split by replicator dynamics due to its stringent mutual similarity criterion in defining subnetworks. To statistically control for inclusion of false nodes into the detected subnetworks, we further present a procedure for integrating stability selection into our subnetwork identification technique. We refer to the resulting technique as stable overlapping replicator dynamics (SORD). Our experiments on synthetic data show significantly higher accuracy in subnetwork identification with SORD than several state-of-the-art techniques. We also demonstrate higher test-retest reliability in multiple network measures on the Human Connectome Project data. Further, we illustrate that SORD enables identification of neuroanatomically-meaningful subnetworks and network hubs."}}
{"id": "ky4EgEysotZ", "cdate": 1451606400000, "mdate": 1681712004372, "content": {"title": "Modularity Reinforcement for Improving Brain Subnetwork Extraction", "abstract": "Functional subnetwork extraction is commonly employed to study the brain’s modular structure. However, reliable extraction from functional magnetic resonance imaging (fMRI) data remains challenging. As representations of brain networks, brain graph estimates are typically noisy due to the pronounced noise in fMRI data. Also, confounds, such as region size bias, motion artifacts, and signal dropout, introduce region-specific bias in connectivity, e.g. a node in a signal dropout area tends to display lower connectivity. The traditional approach of global thresholding might thus remove relevant edges that have low connectivity due to confounds, resulting in erroneous subnetwork extraction. In this paper, we present a modularity reinforcement strategy that deals with the above two challenges. Specifically, we propose a local thresholding scheme that accounts for region-specific connectivity bias when pruning noisy edges. From the resulting thresholded graph, we derive a node similarity measure by comparing the adjacency structure of each node, i.e. its connection fingerprint, with that of other nodes. Drawing on the intuition that nodes belonging to the same subnetwork should have similar connection fingerprints, we refine the brain graph with this similarity measure to reinforce its modularity structure. On synthetic data, our strategy achieves higher accuracy in subnetwork extraction compared to using standard brain graph estimates. On real data, subnetworks extracted with our strategy attain higher overlaps with well-established brain systems and higher subnetwork reproducibility across a range of graph densities. Our results thus demonstrate that modularity reinforcement with our strategy provides a clear gain in subnetwork extraction."}}
