{"id": "wDQ38SWMU_V", "cdate": 1680307200000, "mdate": 1682325740972, "content": {"title": "Stream reasoning with DatalogMTL", "abstract": ""}}
{"id": "sQSUphxZcx", "cdate": 1672531200000, "mdate": 1682325740861, "content": {"title": "Finite Materialisability of Datalog Programs with Metric Temporal Operators", "abstract": ""}}
{"id": "rCtDTKgxyMz", "cdate": 1663850390522, "mdate": null, "content": {"title": "The Minimal Feature Removal Problem in Neural Networks", "abstract": "We present the \\emph{minimal feature removal problem} for neural networks, a combinatorial problem which has interesting potential applications for improving interpretability and robustness of neural network predictions. For a given input to a trained neural network, our aim is to compute a smallest set of input features so that the model prediction changes when these features are disregarded by setting them to a given uninformative baseline value. While computing such minimal subsets of features is computationally intractable in general for fully-connected neural networks, we show that the problem becomes solvable in polynomial time by a greedy algorithm under mild assumptions on the network's activation functions.  We then show that our tractability result extends seamlessly to more advanced neural network architectures such as  convolutional and graph neural networks. Our experiments on standard datasets show favourable performance of our greedy algorithm in practice."}}
{"id": "zvFMtRtk_rh", "cdate": 1640995200000, "mdate": 1682325740858, "content": {"title": "MeTeoR: Practical Reasoning in Datalog with Metric Temporal Operators", "abstract": "DatalogMTL is an extension of Datalog with operators from metric temporal logic which has received significant attention in recent years. It is a highly expressive knowledge representation language that is well-suited for applications in temporal ontology-based query answering and stream processing. Reasoning in DatalogMTL is, however, of high computational complexity, making implementation challenging and hindering its adoption in applications. In this paper, we present a novel approach for practical reasoning in DatalogMTL which combines materialisation (a.k.a. forward chaining) with automata-based techniques. We have implemented this approach in a reasoner called MeTeoR and evaluated its performance using a temporal extension of the Lehigh University Benchmark and a benchmark based on real-world meteorological data. Our experiments show that MeTeoR is a scalable system which enables reasoning over complex temporal rules and datasets involving tens of millions of temporal facts."}}
{"id": "o0TUuV0gnZk", "cdate": 1640995200000, "mdate": 1682325740860, "content": {"title": "The delay and window size problems in rule-based stream reasoning", "abstract": ""}}
{"id": "mSUrgePpub", "cdate": 1640995200000, "mdate": 1682325740859, "content": {"title": "MeTeoR: Practical Reasoning in Datalog with Metric Temporal Operators", "abstract": "DatalogMTL is an extension of Datalog with operators from metric temporal logic which has received significant attention in recent years. It is a highly expressive knowledge representation language that is well-suited for applications in temporal ontology-based query answering and stream processing. Reasoning in DatalogMTL is, however, of high computational complexity, making implementation challenging and hindering its adoption in applications. In this paper, we present a novel approach for practical reasoning in DatalogMTL which combines materialisation (a.k.a. forward chaining) with automata-based techniques. We have implemented this approach in a reasoner called MeTeoR and evaluated its performance using a temporal extension of the Lehigh University Benchmark and a benchmark based on real-world meteorological data. Our experiments show that MeTeoR is a scalable system which enables reasoning over complex temporal rules and datasets involving tens of millions of temporal facts."}}
{"id": "h7lUMWLPHS", "cdate": 1640995200000, "mdate": 1682325740993, "content": {"title": "Seminaive Materialisation in DatalogMTL", "abstract": "DatalogMTL is an extension of Datalog with metric temporal operators that has found applications in temporal ontology-based data access and query answering, as well as in stream reasoning. Practical algorithms for DatalogMTL are reliant on materialisation-based reasoning, where temporal facts are derived in a forward chaining manner in successive rounds of rule applications. Current materialisation-based procedures are, however, based on a naive evaluation strategy, where the main source of inefficiency stems from redundant computations. In this paper, we propose a materialisation-based procedure which, analogously to the classical seminaive algorithm in Datalog, aims at minimising redundant computation by ensuring that each temporal rule instance is considered at most once during the execution of the algorithm. Our experiments show that our optimised seminaive strategy for DatalogMTL is able to significantly reduce materialisation times."}}
{"id": "gPeAHXKwr5", "cdate": 1640995200000, "mdate": 1682325740974, "content": {"title": "Augmenting Message Passing by Retrieving Similar Graphs", "abstract": "Graph Neural Networks~(GNNs) are effective tools for graph representation learning. Most GNNs rely on a recursive neighborhood aggregation scheme, named message passing, thereby their theoretical expressive power is limited to the first order Weisfeiler-Lehman test (1-WL). Motivated by the success of retrieval-based models and off-the-shelf high-performance retrieval systems, we propose a non-parametric and model-agnostic scheme called GraphRetrieval to boost existing GNN models. In GraphRetrieval, similar training graphs associated with their ground-truth labels are retrieved as an enhancement to be jointly utilized with the input graph representation to complete various graph property predictive tasks. In particular, to effectively \"absorb\" useful information from retrieved graphs and \"ignore\" possible noise, we introduce an adapter based on self-attention to explicitly learn the interaction between an input graph and its retrieved similar graphs. By experimenting with three classic GNN models on 12 different datasets, we have demonstrated GraphRetrieval is able to bring substantial improvements to existing GNN models without comprising the model size and the prediction efficiency. Our work also firstly validates the feasibility and effectiveness of retrieved-enhanced graph neural networks."}}
{"id": "fUYDKqqmFMV", "cdate": 1640995200000, "mdate": 1682325740860, "content": {"title": "Explainable GNN-Based Models over Knowledge Graphs", "abstract": "Graph Neural Networks (GNNs) are often used to learn transformations of graph data. While effective in practice, such approaches make predictions via numeric manipulations so their output cannot be..."}}
{"id": "XyBdi2faDac", "cdate": 1640995200000, "mdate": 1682325740858, "content": {"title": "Faithful Approaches to Rule Learning", "abstract": "Rule learning involves developing machine learning models that can be applied to a set of logical facts to predict additional facts, as well as providing methods for extracting from the learned mod..."}}
