{"id": "yvS5d25LGhu", "cdate": 1681752441264, "mdate": 1681752441264, "content": {"title": "On Existence of Truthful Fair Cake Cutting Mechanism", "abstract": "We study the fair division problem on divisible heterogeneous resources (the cake cutting problem) with strategic agents, where each agent can manipulate his/her private valuation in order to receive a better allocation. A (direct-revelation) mechanism takes agents' reported valuations as input and outputs an allocation that satisfies a given fairness requirement. A natural and fundamental open problem, first raised by [Chen et al., 2010] and subsequently raised by [Procaccia, 2013] [Aziz and Ye, 2014] [Branzei and Miltersen, 2015] [Menon and Larson, 2017] [Bei et al., 2017] [Bei et al., 2020], etc., is whether there exists a deterministic, truthful and envy-free (or even proportional) cake cutting mechanism. In this paper, we resolve this open problem by proving that there does not exist a deterministic, truthful and proportional cake cutting mechanism, even in the special case where all of the following hold: 1) there are only two agents; 2) agents' valuations are piecewise-constant; 3) agents are hungry. The impossibility result extends to the case where the mechanism is allowed to leave some part of the cake unallocated.\nWe also present a truthful and envy-free mechanism when each agent's valuation is piecewise-constant and monotone. However, if we require Pareto-optimality, we show that truthful is incompatible with approximate proportionality for any positive approximation ratio under this setting.\nTo circumvent this impossibility result, motivated by the kind of truthfulness possessed by the I-cut-you-choose protocol, we propose a weaker notion of truthfulness: the proportional risk-averse truthfulness. We show that several well-known algorithms do not have this truthful property. We propose a mechanism that is proportionally risk-averse truthful and envy-free, and a mechanism that is proportionally risk-averse truthful that always outputs allocations with connected pieces."}}
{"id": "C5jDWzrZak", "cdate": 1621629813833, "mdate": null, "content": {"title": "Wisdom of the Crowd Voting: Truthful Aggregation of Voter Information and Preferences", "abstract": "We consider two-alternative elections where voters' preferences depend on a state variable that is not directly observable. Each voter receives a private signal that is correlated to the state variable. As a special case, our model captures the common scenario where voters can be categorized into three types: those who always prefer one alternative, those who always prefer the other, and those contingent voters whose preferences depends on the state.  In this setting, even if every voter is a contingent voter, agents voting according to their private information need not result in the adoption of the universally preferred alternative, because the signals can be systematically biased.\n\nWe present a mechanism that elicits and aggregates the private signals from the voters, and outputs the alternative that is favored by the majority.  In particular, voters truthfully reporting their signals forms a strong Bayes Nash equilibrium (where no coalition of voters can deviate and receive a better outcome)."}}
{"id": "HkZ6EEG_-H", "cdate": 1483228800000, "mdate": null, "content": {"title": "Cake Cutting: Envy and Truth", "abstract": "We study envy-free cake cutting with strategic agents, where each agent may manipulate his private information in order to receive a better allocation. We focus on piecewise constant utility functions and consider two scenarios: the general setting without any restriction on the allocations and the restricted setting where each agent has to receive a connected piece. We show that no deterministic truthful envy-free mechanism exists in the connected piece scenario, and the same impossibility result for the general setting with some additional mild assumptions on the allocations. Finally, we study a large market model where the economy is replicated and demonstrate that truth-telling converges to a Nash equilibrium."}}
{"id": "rJNYCCg_bS", "cdate": 1325376000000, "mdate": null, "content": {"title": "Optimal Proportional Cake Cutting with Connected Pieces", "abstract": "We consider the classic cake cutting problem where one allocates a divisible cake to n participating agents. Among all valid divisions, fairness and efficiency (a.k.a. social welfare) are the most critical criteria to satisfy and optimize, respectively. We study computational complexity of computing an efficiency optimal division given the conditions that the allocation satisfies proportional fairness and assigns each agent a connected piece. For linear valuation functions, we give a polynomial time approximation scheme to compute an efficiency optimal allocation. On the other hand, we show that the problem is NP-hard to approximate within a factor of Ω(1/√n) for general piecewise constant functions, and is NP-hard to compute for normalized functions."}}
