{"id": "Y7dmyZNDu8Y", "cdate": 1672531200000, "mdate": 1680136067534, "content": {"title": "Unsupervised 3D Object Learning through Neuron Activity aware Plasticity", "abstract": ""}}
{"id": "RBWcsF14A2c", "cdate": 1672531200000, "mdate": 1680136067536, "content": {"title": "Heterogeneous Neuronal and Synaptic Dynamics for Spike-Efficient Unsupervised Learning: Theory and Design Principles", "abstract": ""}}
{"id": "QIRtAqoXwj", "cdate": 1663850357453, "mdate": null, "content": {"title": "Heterogeneous Neuronal and Synaptic Dynamics for Spike-Efficient Unsupervised Learning: Theory and Design Principles", "abstract": "This paper shows that the heterogeneity in neuronal and synaptic dynamics reduces the spiking activity of a Recurrent Spiking Neural Network (RSNN) while improving prediction performance, enabling spike-efficient (unsupervised) learning.\nWe analytically show that the diversity in neurons' integration/relaxation dynamics improves an RSNN's ability to learn more distinct input patterns (higher memory capacity), leading to improved classification and prediction performance. We further prove that heterogeneous Spike-Timing-Dependent-Plasticity (STDP) dynamics of synapses reduce spiking activity but preserve memory capacity. The analytical results motivate Heterogeneous RSNN design using Bayesian optimization to determine heterogeneity in neurons and synapses to improve $\\mathcal{E}$, defined as the ratio of spiking activity and memory capacity. The empirical results on time series classification and prediction tasks show that optimized HRSNN increases performance and reduces spiking activity compared to a homogeneous RSNN."}}
{"id": "mXPoBtnpMnuy", "cdate": 1663850253024, "mdate": null, "content": {"title": "Unsupervised 3D Object Learning through Neuron Activity aware Plasticity", "abstract": "We present an unsupervised deep learning model for 3D object classification. Conventional Hebbian learning, a well-known unsupervised model, suffers from loss of local features leading to reduced performance for tasks with complex geometric objects. We present a deep network with a novel Neuron Activity Aware (NeAW) Hebbian learning rule that dynamically switches the neurons to be governed by Hebbian learning or anti-Hebbian learning, depending on its activity. We analytically show that NeAW Hebbian learning relieves the bias in neuron activity, allowing more neurons to attend to the representation of the 3D objects. Empirical results show that the NeAW Hebbian learning outperforms other variants of Hebbian learning and shows higher accuracy over fully supervised models when training data is limited."}}
{"id": "oIAX49eIcX", "cdate": 1640995200000, "mdate": 1680136067533, "content": {"title": "μDARTS: Model Uncertainty-Aware Differentiable Architecture Search", "abstract": ""}}
{"id": "katl2mPdj3a", "cdate": 1640995200000, "mdate": 1680136067572, "content": {"title": "XMD: An Expansive Hardware-telemetry based Malware Detector to enhance Endpoint Detection", "abstract": ""}}
{"id": "i-eDQx6qcjk", "cdate": 1640995200000, "mdate": 1680136067553, "content": {"title": "Heterogeneous Recurrent Spiking Neural Network for Spatio-Temporal Classification", "abstract": ""}}
{"id": "vEYEhpnnCt_", "cdate": 1609459200000, "mdate": 1680136067575, "content": {"title": "A Fully Spiking Hybrid Neural Network for Energy-Efficient Object Detection", "abstract": ""}}
{"id": "tB57BsXKawp", "cdate": 1609459200000, "mdate": 1680136067548, "content": {"title": "A Fully Spiking Hybrid Neural Network for Energy-Efficient Object Detection", "abstract": ""}}
{"id": "sFl-GR4KtV", "cdate": 1609459200000, "mdate": 1680136067547, "content": {"title": "Optimal Selection of EEG Electrodes Using Interval Type-2 Fuzzy-Logic-Based Semiseparating Signaling Game", "abstract": ""}}
