{"id": "PNarVyXuLtV", "cdate": 1640995200000, "mdate": 1670813556751, "content": {"title": "Batched Mean-Variance Bandits", "abstract": "The issue of exploration-related risk has been the focus of recent research on bandit decision making in addition to the cumulative rewards given the ubiquity of uncertainty in sequential decision making. Whereas most existing risk-averse sequential decision making algorithms are fully-sequential assume that the player can switch actions at every time step, batched policies, under which players need to specify which actions to take in batches, are more relevant in real-time applications such as stock investments and experimental trials because the rewards and risks involved are often not immediately observable right after actions are taken. Despite such relevance, the effect of batched policies on risk-averse bandits has not been well studied. Using the common mean-variance risk measure as the risk criteria, we prove that O(log n) batches suffice to help the batched bandit algorithm attain the optimal instance-dependent regret upper bound of O(log n), where n is the length of time horizon. We also empirically demonstrate the effectiveness of our algorithms over different bandit instances, thereby providing insight on balancing risk and return for batched policies in multi-armed bandits. Finally, we point out several research directions for future work starting from our analysis."}}
{"id": "4Pmj5WN641H", "cdate": 1577836800000, "mdate": null, "content": {"title": "Achieving Outcome Fairness in Machine Learning Models for Social Decision Problems", "abstract": "Effective complements to human judgment, artificial intelligence techniques have started to aid human decisions in complicated social decision problems across the world. Automated machine learning/deep learning(ML/DL) classification models, through quantitative modeling, have the potential to improve upon human decisions in a wide range of decision problems on social resource allocation such as Medicaid and Supplemental Nutrition Assistance Program(SNAP, commonly referred to as Food Stamps). However, given the limitations in ML/DL model design, these algorithms may fail to leverage various factors for decision making, resulting in improper decisions that allocate resources to individuals who may not be in the most need of such resource. In view of such an issue, we propose in this paper the strategy of fairgroups, based on the legal doctrine of disparate impact, to improve fairness in prediction outcomes. Experiments on various datasets demonstrate that our fairgroup construction method effectively boosts the fairness in automated decision making, while maintaining high prediction accuracy."}}
{"id": "Skerzp4KPS", "cdate": 1569438989469, "mdate": null, "content": {"title": "Adaptive Data Augmentation with Deep Parallel Generative Models", "abstract": "Data augmentation(DA) is a useful technique to enlarge the size of the training set and prevent overfitting for different machine learning tasks when training data is scarce. However, current data augmentation techniques rely heavily on human design and domain knowledge, and existing automated approaches are yet to fully exploit the latent features in the training dataset. In this paper we propose an adaptive DA strategy based on generative models, where the training set adaptively enriches itself with sample images automatically constructed from deep generative models trained in parallel. We demonstrate by experiments that our data augmentation strategy, with little model-specific considerations, can be easily adapted to cross-domain deep learning/machine learning tasks such as image classification and image inpainting, while significantly improving model performance in both tasks. "}}
{"id": "Sklsts5H_E", "cdate": 1553472386714, "mdate": null, "content": {"title": "Deep Generative Inpainting with Comparative Sample Augmentation", "abstract": "Recent advancements in deep learning techniques such as Convolutional Neural Networks(CNN) and Generative Adversarial Networks(GAN) have achieved breakthroughs in the problem of semantic image inpainting, the task of reconstructing missing pixels in given images. While much more effective than conventional approaches, deep learning models require large datasets and great computational resources for training, and inpainting quality varies considerably when training data vary in size and diversity. To address these problems, we present in this paper a inpainting strategy of \\textit{Comparative Sample Augmentation}, which enhances the quality of training set by filtering out irrelevant images and constructing additional images using information about the surrounding regions of the images to be inpainted. Experiments on multiple datasets demonstrate that our method extends the applicability of deep inpainting models to training sets with varying sizes, while maintaining inpainting quality as measured by qualitative and quantitative metrics for a large class of deep models, with little need for model-specific consideration."}}
{"id": "HkxHFj5BdV", "cdate": 1553472381306, "mdate": null, "content": {"title": "Parallel Recurrent Data Augmentation for GAN training with Limited and Diverse Data", "abstract": "The need for large amounts of training image data with clearly defined features is a major obstacle to applying generative adversarial networks(GAN) on image generation where training data is limited but diverse, since insufficient latent feature representation in the already scarce data often leads to instability and mode collapse during GAN training. To overcome the hurdle of limited data when applying GAN to limited datasets, we propose in this paper the strategy of \\textit{parallel recurrent data augmentation}, where the GAN model progressively enriches its training set with sample images constructed from GANs trained in parallel at consecutive training epochs. Experiments on a variety of small yet diverse datasets demonstrate that our method, with little model-specific considerations, produces images of better quality as compared to the images generated  without such strategy. The source code and generated images of this paper will be made public after review. "}}
{"id": "uR2g65Pl7u", "cdate": 1546300800000, "mdate": null, "content": {"title": "Achieving Fairness in Determining Medicaid Eligibility through Fairgroup Construction", "abstract": "Effective complements to human judgment, artificial intelligence techniques have started to aid human decisions in complicated social problems across the world. In the context of United States for instance, automated ML/DL classification models offer complements to human decisions in determining Medicaid eligibility. However, given the limitations in ML/DL model design, these algorithms may fail to leverage various factors for decision making, resulting in improper decisions that allocate resources to individuals who may not be in the most need. In view of such an issue, we propose in this paper the method of \\textit{fairgroup construction}, based on the legal doctrine of \\textit{disparate impact}, to improve the fairness of regressive classifiers. Experiments on American Community Survey dataset demonstrate that our method could be easily adapted to a variety of regressive classification models to boost their fairness in deciding Medicaid Eligibility, while maintaining high levels of classification accuracy."}}
{"id": "HyMuaiAqY7", "cdate": 1538087872417, "mdate": null, "content": {"title": "Deli-Fisher GAN: Stable and Efficient Image Generation With Structured Latent Generative Space", "abstract": "Generative Adversarial Networks (GANs) are powerful tools for realistic image generation. However, a major drawback of GANs is that they are especially hard to train, often requiring large amounts of data and long training time. In this paper we propose the Deli-Fisher GAN, a GAN that generates photo-realistic images by enforcing structure on the latent generative space using similar approaches in \\cite{deligan}. The structure of the latent space we consider in this paper is modeled as a mixture of Gaussians, whose parameters are learned in the training process. Furthermore, to improve stability and efficiency, we use the Fisher Integral Probability Metric as the divergence measure in our GAN model, instead of the Jensen-Shannon divergence. We show by experiments that the Deli-Fisher GAN performs better than DCGAN, WGAN, and the Fisher GAN as measured by inception score."}}
