{"id": "0gouO5saq6K", "cdate": 1652737852189, "mdate": null, "content": {"title": "Multi-Game Decision Transformers", "abstract": "A longstanding goal of the field of AI is a method for learning a highly capable, generalist agent from diverse experience. In the subfields of vision and language, this was largely achieved by scaling up transformer-based models and training them on large, diverse datasets. Motivated by this progress, we investigate whether the same strategy can be used to produce generalist reinforcement learning agents. Specifically, we show that a single transformer-based model – with a single set of weights – trained purely offline can play a suite of up to 46 Atari games simultaneously at close-to-human performance. When trained and evaluated appropriately, we find that the same trends observed in language and vision hold, including scaling of performance with model size and rapid adaptation to new games via fine-tuning. We compare several approaches in this multi-game setting, such as online and offline RL methods and behavioral cloning, and find that our Multi-Game Decision Transformer models offer the best scalability and performance. We release the pre-trained models and code to encourage further research in this direction."}}
{"id": "VdvDlnnjzIN", "cdate": 1623124465784, "mdate": null, "content": {"title": "Brax - A Differentiable Physics Engine for Large Scale Rigid Body Simulation", "abstract": "We present Brax, an open source library for \\textbf{r}igid \\textbf{b}ody simulation with a focus on performance and parallelism on accelerators, written in JAX.  We present results on a suite of tasks inspired by the existing reinforcement learning literature, but remade in our engine.  Additionally, we provide reimplementations of PPO, SAC, ES, and direct policy optimization in JAX that compile alongside our environments, allowing the learning algorithm and the environment processing to occur on the same device, and to scale seamlessly on accelerators.  Finally, we include notebooks that facilitate training of performant policies on common MuJoCo-like tasks in minutes."}}
{"id": "PghuCwnjF6y", "cdate": 1601308253742, "mdate": null, "content": {"title": "TaskSet: A Dataset of Optimization Tasks", "abstract": "We present TaskSet, a dataset of tasks for use in training and evaluating optimizers. TaskSet is unique in its size and diversity, containing over a thousand tasks ranging from image classification with fully connected or convolutional neural networks, to variational autoencoders, to non-volume preserving flows on a variety of datasets. As an example application of such a dataset we explore meta-learning an ordered list of hyperparameters to try sequentially. By learning this hyperparameter list from data generated using TaskSet we achieve large speedups in sample efficiency over random search. Next we use the diversity of the TaskSet and our method for learning hyperparameter lists to empirically explore the generalization of these lists to new optimization tasks in a variety of settings including ImageNet classification with Resnet50 and LM1B language modeling with transformers. As part of this work we have opensourced code for all tasks, as well as ~29 million training curves for these problems and the corresponding hyperparameters."}}
{"id": "MCe-j2-mVnA", "cdate": 1601308252078, "mdate": null, "content": {"title": "Overcoming barriers to the training of effective learned optimizers", "abstract": "In this work we focus on general-purpose learned optimizers capable of training a wide variety of problems with no user-specified hyperparameters. We introduce a new, neural network parameterized, hierarchical optimizer with access to additional features such as validation loss to enable automatic regularization. Most learned optimizers have been trained on only a single task, or a small number of tasks. We train our optimizers on thousands of tasks, making use of orders of magnitude more compute, resulting in optimizers that generalize better to unseen tasks. The learned optimizers not only perform well, but learn behaviors that are distinct from existing first order optimizers. For instance, they generate update steps that have implicit regularization and adapt as the problem hyperparameters (e.g. batch size) or architecture (e.g. neural network width) change. Finally, these learned optimizers show evidence of being useful for out of distribution tasks such as training themselves from scratch."}}
{"id": "Bye1qEBlLH", "cdate": 1567802502647, "mdate": null, "content": {"title": "Learning to Predict Without Looking Ahead: World Models Without Forward Prediction", "abstract": "Much of model-based reinforcement learning involves learning a model of an agent's world, and training an agent to leverage this model to perform a task more efficiently. While these models are demonstrably useful for agents, every naturally occurring model of the world of which we are aware---e.g., a brain---arose as the byproduct of competing evolutionary pressures for survival, not minimization of a supervised forward-predictive loss via gradient descent.  That useful models can arise out of the messy and slow optimization process of evolution suggests that forward-predictive modeling can arise as a side-effect of optimization under the right circumstances. Crucially, this optimization process need not explicitly be a forward-predictive loss. In this work, we introduce a modification to traditional reinforcement learning which we call observational dropout, whereby we limit the agents ability to observe the real environment at each timestep. In doing so, we can coerce an agent into learning a world model to fill in the observation gaps during reinforcement learning. We show that the emerged world model, while not explicitly trained to predict the future, can help the agent learn key skills required to perform well in its environment. Dynamics of the emerged world models can be visualized at https://worldanon.github.io/"}}
{"id": "BkVp6oWdZr", "cdate": 1546300800000, "mdate": null, "content": {"title": "Understanding and correcting pathologies in the training of learned optimizers", "abstract": "Deep learning has shown that learned functions can dramatically outperform hand-designed functions on perceptual tasks. Analogously, this suggests that learned optimizers may similarly outperform c..."}}
{"id": "HJxwAo09KQ", "cdate": 1538087886521, "mdate": null, "content": {"title": "Learned optimizers that outperform on wall-clock and validation loss", "abstract": "Deep learning has shown that learned functions can dramatically outperform hand-designed functions on perceptual tasks. Analogously, this suggests that learned update functions may similarly outperform current hand-designed optimizers, especially for specific tasks. However, learned optimizers are notoriously difficult to train and have yet to demonstrate wall-clock speedups over hand-designed optimizers, and thus are rarely used in practice. Typically, learned optimizers are trained by truncated backpropagation through an unrolled optimization process. The resulting gradients are either strongly biased (for short truncations) or have exploding norm (for long truncations). In this work we propose a training scheme which overcomes both of these difficulties, by dynamically weighting two unbiased gradient estimators for a variational loss on optimizer performance. This allows us to train neural networks to perform optimization faster than well tuned first-order methods. Moreover, by training the optimizer against validation loss, as opposed to training loss, we are able to use it to train models which generalize better than those trained by first order methods. We demonstrate these results on problems where our learned optimizer trains convolutional networks in a fifth of the wall-clock time compared to tuned first-order methods, and with an improvement"}}
{"id": "Bk0FWVcgx", "cdate": null, "mdate": null, "content": {"title": "Topology and Geometry of Half-Rectified Network Optimization", "abstract": "The loss surface of deep neural networks has recently attracted interest \nin the optimization and machine learning communities as a prime example of \nhigh-dimensional non-convex problem. Some insights were recently gained using spin glass \nmodels and mean-field approximations, but at the expense of strongly simplifying the nonlinear nature of the model.\n\nIn this work, we do not make any such approximation and study conditions \non the data distribution and model architecture that prevent the existence \nof bad local minima. Our theoretical work quantifies and formalizes two \nimportant folklore facts: (i) the landscape of deep linear networks has a radically different topology \nfrom that of deep half-rectified ones, and (ii) that the energy landscape \nin the non-linear case is fundamentally controlled by the interplay between the smoothness of the data distribution and model over-parametrization. Our main theoretical contribution is to prove that half-rectified single layer networks are asymptotically connected, and we provide explicit bounds that reveal the aforementioned interplay.\n\nThe conditioning of gradient descent is the next challenge we address. \nWe study this question through the geometry of the level sets, and we introduce\nan algorithm to efficiently estimate the regularity of such sets on large-scale networks. \nOur empirical results show that these level sets remain connected throughout \nall the learning phase, suggesting a near convex behavior, but they become \nexponentially more curvy as the energy level decays, in accordance to what is observed in practice with \nvery low curvature attractors."}}
