{"id": "aif41VuK_jM", "cdate": 1577836800000, "mdate": null, "content": {"title": "Learning alternative ways of performing a task", "abstract": "Highlights • Learning from experts requires learning from small and only positive examples. • We present an inductive approach for learning multiple models of tasks. • It can learn from few and only positive examples. • Traditional machine learning techniques are not useful in such scenarios. • Small set of meaningful examples is enough to obtain these models. Abstract A common way of learning to perform a task is to observe how it is carried out by experts. However, it is well known that for most tasks there is no unique way to perform them. This is especially noticeable the more complex the task is because factors such as the skill or the know-how of the expert may well affect the way she solves the task. In addition, learning from experts also suffers of having a small set of training examples generally coming from several experts (since experts are usually a limited and expensive resource), being all of them positive examples (i.e. examples that represent successful executions of the task). Traditional machine learning techniques are not useful in such scenarios, as they require extensive training data. Starting from very few executions of the task presented as activity sequences, we introduce a novel inductive approach for learning multiple models, with each one representing an alternative strategy of performing a task. By an iterative process based on generalisation and specialisation, we learn the underlying patterns that capture the different styles of performing a task exhibited by the examples. We illustrate our approach on two common activity recognition tasks: a surgical skills training task and a cooking domain. We evaluate the inferred models with respect to two metrics that measure how well the models represent the examples and capture the different forms of executing a task showed by the examples. We compare our results with the traditional process mining approach and show that a small set of meaningful examples is enough to obtain patterns that capture the different strategies that are followed to solve the tasks."}}
{"id": "r4KKPPCcpE72", "cdate": 1483228800000, "mdate": null, "content": {"title": "A framework for modelling the biomechanical behaviour of the human liver during breathing in real time using machine learning", "abstract": "Highlights • Machine learning (ML) to model the liver biomechanical behaviour during breathing. • ML is much faster than the popular FEM, allowing real-time soft tissue modelling. • Modelling scheme able to predict deformation for a new load and a new liver. • ML regression models were used: three tree-based methods and two simpler ones. • Good prediction performance was obtained: all samples with an error under 1 mm. Abstract Progress in biomechanical modelling of human soft tissue is the basis for the development of new clinical applications capable of improving the diagnosis and treatment of some diseases (e.g. cancer), as well as the surgical planning and guidance of some interventions. The finite element method (FEM) is one of the most popular techniques used to predict the deformation of the human soft tissue due to its high accuracy. However, FEM has an associated high computational cost, which makes it difficult its integration in real-time computer-aided surgery systems. An alternative for simulating the mechanical behaviour of human organs in real time comes from the use of machine learning (ML) techniques, which are much faster than FEM. This paper assesses the feasibility of ML methods for modelling the biomechanical behaviour of the human liver during the breathing process, which is crucial for guiding surgeons during interventions where it is critical to track this deformation (e.g. some specific kind of biopsies) or for the accurate application of radiotherapy dose to liver tumours. For this purpose, different ML regression models were investigated, including three tree-based methods (decision trees, random forests and extremely randomised trees) and other two simpler regression techniques (dummy model and linear regression). In order to build and validate the ML models, a labelled data set was constructed from modelling the deformation of eight ex-vivo human livers using FEM. The best prediction performance was obtained using extremely randomised trees, with a mean error of 0.07 mm and all the samples with an error under 1 mm. The achieved results lay the foundation for the future development of some real-time software capable of simulating the human liver deformation during the breathing process during clinical interventions. Previous article in issue Next article in issue"}}
{"id": "cyxtBWSuPx", "cdate": 1483228800000, "mdate": null, "content": {"title": "A finite element-based machine learning approach for modeling the mechanical behavior of the breast tissues under compression in real-time", "abstract": "Highlights • Machine Learning (ML) models were used to simulate in real-time the biomechanical behavior of the breast. • Three ML models were trained with data from Finite Element (FE) simulations. • Four experiments were designed to validate and study the models' performance. • The mean error in the prediction of the nodal displacements was under 3 mm. • The time needed for breast compression prediction was under 0.5 s. Abstract This work presents a data-driven method to simulate, in real-time, the biomechanical behavior of the breast tissues in some image-guided interventions such as biopsies or radiotherapy dose delivery as well as to speed up multimodal registration algorithms. Ten real breasts were used for this work. Their deformation due to the displacement of two compression plates was simulated off-line using the finite element (FE) method. Three machine learning models were trained with the data from those simulations. Then, they were used to predict in real-time the deformation of the breast tissues during the compression. The models were a decision tree and two tree-based ensemble methods (extremely randomized trees and random forest). Two different experimental setups were designed to validate and study the performance of these models under different conditions. The mean 3D Euclidean distance between nodes predicted by the models and those extracted from the FE simulations was calculated to assess the performance of the models in the validation set. The experiments proved that extremely randomized trees performed better than the other two models. The mean error committed by the three models in the prediction of the nodal displacements was under 2 mm, a threshold usually set for clinical applications. The time needed for breast compression prediction is sufficiently short to allow its use in real-time ( < 0.2 s). Previous article in issue Next article in issue"}}
{"id": "JqkQhtsHIiz", "cdate": 1483228800000, "mdate": null, "content": {"title": "Low-level Event Detection System for Minimally-Invasive Surgery Training", "abstract": "We present an event detection system in a laparoscopic surgery domain, as part of a more ambitious supervision by observation project. The system, which only requires the incorporation of two cameras in a laparoscopic training box, integrates several computer vision and machine learning techniques to detect the states and movements of the elements involved in the exercise. We compare the states detected by the system with the hand-labelled ground truth, using an exercise of the domain as example. We show that the system is able to detect the events accurately."}}
{"id": "HGEWTLnj0tH", "cdate": 1483228800000, "mdate": null, "content": {"title": "Knowledge Extraction from Task Narratives", "abstract": "One of the major difficulties in activity recognition stems from the lack of a model of the world where activities and events are to be recognised. When the domain is fixed and repetitive we can manually include this information using some kind of ontology or set of constraints. On many occasions, however, there are many new situations for which only some knowledge is common and many other domain-specific relations have to be inferred. Humans are able to do this from short descriptions in natural language, describing the scene or the particular task to be performed. In this paper we apply a tool that extracts situation models and rules from natural language description to a series of exercises in a surgical domain, in which we want to identify the sequence of events that are not possible, those that are possible (but incorrect according to the exercise) and those that correspond to the exercise or plan expressed by the description in natural language. The preliminary results show that a large amount of valuable knowledge can be extracted automatically, which could be used to express domain knowledge and exercises description in languages such as event calculus that could help bridge these high-level descriptions with the low-level events that are recognised from videos."}}
{"id": "j3NbZ5wPen2", "cdate": 1451606400000, "mdate": null, "content": {"title": "Machine Learning for Modeling the Biomechanical Behavior of Human Soft Tissue", "abstract": "An accurate modeling of the biomechanical properties of human soft tissue is crucial in many clinical applications, such as, radiotherapy administration or surgery. The finite element method (FEM) is the usual choice to carry out such modeling due to its high accuracy. However, FEM is computationally very costly, and hence, its application in real-time or even off-line with short delays are still challenges to overcome. This paper proposes a framework based on Machine Learning to learn FEM modeling, thus having a tool able to yield results that may be sufficiently fast for clinical applications. In particular, the use of ensembles of Decision Trees has shown its suitability in modeling the behavior of the liver and the breast."}}
{"id": "VBRkX9Go8D", "cdate": 1420070400000, "mdate": null, "content": {"title": "Methodology based on genetic heuristics for in-vivo characterizing the patient-specific biomechanical behavior of the breast tissues", "abstract": "Highlights • Genetic heuristics were used to in-vivo model the breast biomechanical behavior. • An iterative search was used to optimize the elastic constants of the model. • Phantom images of the breast were used to compare the internal tissue distribution. • The accuracy of the estimated model was achieved with an error of less than 10%. Abstract This paper presents a novel methodology to in-vivo estimate the elastic constants of a constitutive model proposed to characterize the mechanical behavior of the breast tissues. An iterative search algorithm based on genetic heuristics was constructed to in-vivo estimate these parameters using only medical images, thus avoiding invasive measurements of the mechanical response of the breast tissues. For the first time, a combination of overlap and distance coefficients were used for the evaluation of the similarity between a deformed MRI of the breast and a simulation of that deformation. The methodology was validated using breast software phantoms for virtual clinical trials, compressed to mimic MRI-guided biopsies. The biomechanical model chosen to characterize the breast tissues was an anisotropic neo-Hookean hyperelastic model. Results from this analysis showed that the algorithm is able to find the elastic constants of the constitutive equations of the proposed model with a mean relative error of about 10%. Furthermore, the overlap between the reference deformation and the simulated deformation was of around 95% showing the good performance of the proposed methodology. This methodology can be easily extended to characterize the real biomechanical behavior of the breast tissues, which means a great novelty in the field of the simulation of the breast behavior for applications such as surgical planing, surgical guidance or cancer diagnosis. This reveals the impact and relevance of the presented work. Previous article in issue Next article in issue"}}
{"id": "kiMbyPwfRlj", "cdate": 1388534400000, "mdate": null, "content": {"title": "Machine learning for predicting astigmatism in patients with keratoconus after intracorneal ring implantation", "abstract": "This work proposes a new approach based on Machine Learning to predict astigmatism in patients with kera-toconus (KC) after ring implantation. KC is a non-inflamatory, progressive thinning disorder of the cornea, resulting in a protusion, myopia and irregular astigmatism. The intracorneal ring implantation surgery has become a suitable technique to deal with keratoconus without the need of a corneal transplant. Two machine learning (ML) classifiers based on artificial neural network and a decision tree were used in this work. Artificial neural networks performed better than decision trees, achieving an absolute mean error lower than 2 diopters in a validation data set. An analysis of the most relevant features was also carried out."}}
{"id": "haO7n7mZnIF", "cdate": 1388534400000, "mdate": null, "content": {"title": "Markerless monocular tracking system for guided external eye surgery", "abstract": "This paper presents a novel markerless monocular tracking system aimed at guiding ophthalmologists during external eye surgery. This new tracking system performs a very accurate tracking of the eye by detecting invariant points using only textures that are present in the sclera, i.e., without using traditional features like the pupil and/or cornea reflections, which remain partially or totally occluded in most surgeries. Two known algorithms that compute invariant points and correspondences between pairs of images were implemented in our system: Scalable Invariant Feature Transforms (SIFT) and Speed Up Robust Features (SURF). The results of experiments performed on phantom eyes show that, with either algorithm, the developed system tracks a sphere at a 360° rotation angle with an error that is lower than 0.5%. Some experiments have also been carried out on images of real eyes showing promising behavior of the system in the presence of blood or surgical instruments during real eye surgery. Previous article in issue Next article in issue"}}
{"id": "dS0byPxsyVR", "cdate": 1388534400000, "mdate": null, "content": {"title": "Genetic algorithms for estimating the biomechanical behavior of breast tissues", "abstract": "The accuracy of the patient-specific biomechanical models of the breast is a major concern for applications related with simulation, surgical guidance or cancer diagnosis. Being able to predict the localization of a lesion depends on the realism of the selected model. However, obtaining a realistic model of the breast tissues is not straightforward since the biomechanical parameters of the breast internal tissues vary significantly from one patient to another. This paper presents an iterative search algorithm which is able to obtain the parameters of a proposed biomechanical model. A methodology based on genetic algorithms was used in order to estimate the biomechanical model of the breast tissues. The similarity between the estimated model and the real model presents an overlap of about 94% and a maximum average distance below 1mm. This algorithm can be easily translated to real cases."}}
