{"id": "pteb3cqo-qp", "cdate": 1451606400000, "mdate": 1693711983089, "content": {"title": "Optical Characteristics of Solution Processed MoO2/ZnO Quantum Dots Based Thin Film Transitor", "abstract": "The present work reports the ultra-violet (UV) and electrical characteristics of solution processed MoO2/ZnO Quantum Dot (QD) based thin film transistor, ZnO QDs thin films are deposited using low-cost solution processing over the Al2O3/p-Si substrates. A very thick layer of Al2O3 (250 nm) is deposited using e-beam evaporation (10-6 mbar). MoO2 is deposited using the thermal evaporation over the ZnO thin film and the achieved thickness is of 25nm. Top and bottom Al contacts were deposited using thermal evaporation and of 50nm and 80nm respectively. Device is characterized in the form of back gate ZnO Thin film transistor (TFT), illuminated from the front side. The UV detection property of the device is performed under the illumination of UV lamp (Puv = 650μW) with wavelength of 365nm. The results obtained with the Vds versus Ids plot shows the significant improvement in the drain current with UV exposure."}}
{"id": "dBR8U_tLCz", "cdate": 1451606400000, "mdate": 1693711983089, "content": {"title": "Electrical and optical characteristics of CdSe Quantum Dot based Schottky diode", "abstract": "This article reports the synthesis, fabrication, and characterization of low-cost solution processed CdSe Quantum Dot (QD) based Schottky diode. The CdSe QDs are deposited on the ZnO QDs film over n-Si <;100> substrate using solution processing technique. The ZnO QD deposited over the n-Si substrate acting as an Electron Transport Layer (ETL). Further, the Schottky junction is fabricated between CdSe QDs and Palladium (Pd) deposited using electron beam evaporation. The size of CdSe QDs is achieved to be ~4.84nm less than the Bohr's radius (~5.6nm) of CdSe. The responsivity and EQE of 0.075 A/W and 18.6% respectively are achieved at a wavelength of 500nm at 5V applied bias. The built-in potential, carrier density, and width of the depletion region at zero applied bias are calculated to be 0.52 V, ~1.70×10 <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">17</sup> cm <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">-3</sup> , and ~33.3 nm respectively. The barrier height is found to be 0.78eV with a reverse saturation current of 1.54×10 <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">-8</sup> A. Further, the time response characteristics of the device show very fast response with the visible light for a rise time and fall time of ~20ms."}}
{"id": "bDJxJd4uwd", "cdate": 1451606400000, "mdate": 1693711983089, "content": {"title": "Area optimization of two-stage amplifier using modified particle swarm optimization algorithm", "abstract": "Modern era cannot be consider without an electronics circuits. If Signal strength at the receiving antenna is very weak then there must be required a device that increase the strength of the received signal (power), known as Amplifier. Output of an amplifier is always stronger than its input. So amplifiers are the simplest yet one of the most important parts of electronic circuits. This is why the designing of amplifiers is crucial in analog circuit designing. This paper investigated to minimize the area of a two stage amplifier using modified particle swarm optimization (MPSO) method considering other constraints. The total transistor area obtain using MPSO in this paper is 2.61×10 <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">-10</sup>  m <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</sup>  and it is the best of my knowledge, also the power dissipation is much lesser, 1492 μW. Obtained values are verified by the CADENCE simulator and validated. The results proved that the use of modified particle swarm optimization made it possible to achieve better results."}}
{"id": "_nOH1xnnI8", "cdate": 1451606400000, "mdate": 1693711983091, "content": {"title": "Electrical and Optical Characteristics of Pd/ZnO Quantum Dots Based Schottky Photodiode on n-Si", "abstract": "The article reports fabrication and characterization of low-cost solution-processed ZnO Quantum dots (QDs) Schottky photodiode. The Thin film of ZnO QDs (100nm) was deposited via a sol-gel route on n-Si substrate and annealed at 250°C. The Schottky barrier of 0.63eV is formed between the ZnO QDs and Pd metal deposited using shadow mask technique through e-beam evaporation under very high vacuum of 10-6 tor. We have achieved the rectification ratio of 3.97x103, responsivity of 1.2 A/W and detectivity of 4.33x1012 cmHz1/2W-1 at -3 volts applied bias and under the illuminated power density of 80µW/cm2 at 367 nm. Further, the Schottky junction has also been characterized by ideality factor (2.93) and series resistance (361Ω)."}}
