{"id": "Bk-_-eZ_Zr", "cdate": 1388534400000, "mdate": null, "content": {"title": "Semantical Clustering of Morphologically Related Chinese Words", "abstract": "A Chinese character embedded in different compound words may carry different meanings. In this paper, we aim at semantical clustering of a given family of morphologically related Chinese words. In Experiment 1, we employed linguistic features at the word, syntactic, semantic, and contextual levels in aggregated computational linguistics methods to handle the clustering task. In Experiment 2, we recruited adults and children to perform the clustering task. Experimental results indicate that our computational model achieved a similar level of performance as children."}}
{"id": "rkfpW6xd-H", "cdate": 1325376000000, "mdate": null, "content": {"title": "Applications of GPC Rules and Character Structures in Games for Learning Chinese Characters", "abstract": "We demonstrate applications of psycholinguistic and sublexical information for learning Chinese characters. The knowledge about the grapheme-phoneme conversion (GPC) rules of languages has been shown to be highly correlated to the ability of reading alphabetic languages and Chinese. We build and will demo a game platform for strengthening the association of phonological components in Chinese characters with the pronunciations of the characters. Results of a preliminary evaluation of our games indicated significant improvement in learners' response times in Chinese naming tasks. In addition, we construct a Web-based open system for teachers to prepare their own games to best meet their teaching goals. Techniques for decomposing Chinese characters and for comparing the similarity between Chinese characters were employed to recommend lists of Chinese characters for authoring the games. Evaluation of the authoring environment with 20 subjects showed that our system made the authoring of games more effective and efficient."}}
{"id": "H1-iXaxdbB", "cdate": 1230768000000, "mdate": null, "content": {"title": "Capturing Errors in Written Chinese Words", "abstract": "A collection of 3208 reported errors of Chinese words were analyzed. Among which, 7.2% involved rarely used character, and 98.4% were assigned common classifications of their causes by human subjects. In particular, 80% of the errors observed in writings of middle school students were related to the pronunciations and 30% were related to the compositions of words. Experimental results show that using intuitive Web-based statistics helped us capture only about 75% of these errors. In a related task, the Web-based statistics are useful for recommending incorrect characters for composing test items for \"incorrect character identification\" tests about 93% of the time."}}
{"id": "HyEtBoe_-B", "cdate": 1199145600000, "mdate": null, "content": {"title": "Using Structural Information for Identifying Similar Chinese Characters", "abstract": "Chinese characters that are similar in their pronunciations or in their internal structures are useful for computer-assisted language learning and for psycholinguistic studies. Although it is possible for us to employ image-based methods to identify visually similar characters, the resulting computational costs can be very high. We propose methods for identifying visually similar Chinese characters by adopting and extending the basic concepts of a proven Chinese input method--Cangjie. We present the methods, illustrate how they work, and discuss their weakness in this paper."}}
{"id": "SJZ3NCgOWS", "cdate": 820454400000, "mdate": null, "content": {"title": "Controlling State-Space Abstraction in Bayesian Networks", "abstract": "Controlling State-Space Abstraction in Bayesian Networks Chao-Lin Liu Many applications require computational systems to respond to queries by a particular deadline. Failure to meet the deadlines may render the returned solution useless. Moreover, the deadlines of such time-critical applications are often uncertain at system design time. Anytime algorithms have been suggested to cope with these challenges by trading the quality of the solutions for the reactiveness of the systems at run time [ 13. We have introduced an anytime evaluation algorithm [2] for a formalism commonly used in uncertain reasoning: Bayesian networks. Empirical results indicate that approximations of good quality can be obtained within a much shorter time than would be required to directly evaluate the networks by exact algorithms. Also the quality of the approximation improves with the allocated computational time on average. This page is copyrighted by AAAI. All rights reserved. Your use of this site constitutes acceptance of all of AAAI's terms and conditions and privacy policy."}}
