{"id": "cjKU3McE2s", "cdate": 1667342432195, "mdate": 1667342432195, "content": {"title": "Bayesian Deep Basis Fitting for Depth Completion with Uncertainty", "abstract": "In this work we investigate the problem of uncertainty estimation for image-guided depth completion. We extend Deep Basis Fitting (DBF) for depth completion within a Bayesian evidence framework to provide calibrated per-pixel variance. The DBF approach frames the depth completion problem in terms of a network that produces a set of low-dimensional depth bases and a differentiable least squares fitting module that computes the basis weights using the sparse depths. By adopting a Bayesian treatment, our Bayesian Deep Basis Fitting (BDBF) approach is able to 1) predict high-quality uncertainty estimates and 2) enable depth completion with few or no sparse measurements. We conduct controlled experiments to compare BDBF against commonly used techniques for uncertainty estimation under various scenarios. Results show that our method produces better uncertainty estimates with accurate depth prediction."}}
{"id": "vsLDeevINx", "cdate": 1667342409923, "mdate": 1667342409923, "content": {"title": "LLOL: Low-Latency Odometry for Spinning Lidars", "abstract": "In this paper, we present a low-latency odometry system designed for spinning lidars. Many existing lidar odometry methods wait for an entire sweep from the lidar before processing the data. This introduces a large delay between the first laser firing and its pose estimate. To reduce this latency, we treat the spinning lidar as a streaming sensor and process packets as they arrive. This effectively distributes expensive operations across time, resulting in a very fast and lightweight system with much higher throughput and lower latency. Our open-source implementation is available at \\url{this https URL}."}}
{"id": "-gzqKVfcOJm", "cdate": 1667342378813, "mdate": 1667342378813, "content": {"title": "DSOL: A Fast Direct Sparse Odometry Scheme", "abstract": "In this paper, we describe Direct Sparse Odometry Lite (DSOL), an improved version of Direct Sparse Odometry (DSO). We propose several algorithmic and implementation enhancements which speed up computation by a significant factor (on average 5x) even on resource constrained platforms. The increase in speed allows us to process images at higher frame rates, which in turn provides better results on rapid motions. Our open-source implementation is available at this https URL.\n"}}
{"id": "OiTsIDFFmA", "cdate": 1667342312504, "mdate": 1667342312504, "content": {"title": "depth completion via deep basis fitting", "abstract": "In this paper we consider the task of image-guided depth completion where our system must infer the depth at every pixel of an input image based on the image content and a sparse set of depth measurements. We propose a novel approach that builds upon the strengths of modern deep learning techniques and classical optimization algorithms and significantly improves performance. The proposed method replaces the final 1×1 convolutional layer employed in most depth completion networks with a least squares fitting module which computes weights by fitting the implicit depth bases to the given sparse depth measurements. In addition, we show how our proposed method can be naturally extended to a multi-scale formulation for improved self-supervised training. We demonstrate through extensive experiments on various datasets that our approach achieves consistent improvements over state-of-the-art baseline methods with small computational overhead."}}
{"id": "sNS8HFRRNtu", "cdate": 1640995200000, "mdate": 1668617819605, "content": {"title": "Challenges and Opportunities for Autonomous Micro-UAVs in Precision Agriculture", "abstract": "Mobile robots such as unmanned ground vehicles (UGVs) and unmanned aerial vehicles (UAVs) are increasingly used for precision agriculture. While UGVs have larger payload capabilities and longer operation time, they are limited to 2-D space. This makes UAVs better suited for tasks that require fast coverage, harsh terrain traversal, and high altitude or multilevel operation. However, it remains a challenging task to develop a reliable yet fully autonomous UAV system that can actively extract actionable information in large-scale cluttered agricultural environments. Such a system will have to estimate its own poses, build a map of the environment, navigate through obstacles, and act to gather information with limited onboard computation and battery life. In this survey, we first review recent advances in UAV hardware and software, ranging from novel platforms and sensors to state-of-the-art autonomous navigation, object detection and segmentation, robot localization, and mapping algorithms related to agriculture. We then provide a list of challenges in each field and potential opportunities for the broader adoption of UAVs in precision agriculture."}}
{"id": "nd7KcLb3jkx", "cdate": 1640995200000, "mdate": 1668617819631, "content": {"title": "LLOL: Low-Latency Odometry for Spinning Lidars", "abstract": "In this paper, we present a low-latency odometry system designed for spinning lidars. Many existing lidar odometry methods wait for an entire sweep from the lidar before processing the data. This introduces a large delay between the first laser firing and its pose estimate. To reduce this latency, we treat the spinning lidar as a streaming sensor and process packets as they arrive. This effectively distributes expensive operations across time, resulting in a very fast and lightweight system with a much higher throughput and lower latency. Our open source implementation is available at https://github.com/versatran01/llol."}}
{"id": "iSdlCBZXT0k", "cdate": 1640995200000, "mdate": 1668617819615, "content": {"title": "DSOL: A Fast Direct Sparse Odometry Scheme", "abstract": "In this paper, we describe Direct Sparse Odometry Lite (DSOL), an improved version of Direct Sparse Odometry (DSO). We propose several algorithmic and implementation enhancements which speed up computation by a significant factor (on average 5x) even on resource constrained platforms. The increase in speed allows us to process images at higher frame rates, which in turn provides better results on rapid motions. Our open-source implementation is available at https://github.com/versatran01/dsol."}}
{"id": "czjZVV4PzP", "cdate": 1609459200000, "mdate": 1668617819606, "content": {"title": "Bayesian Deep Basis Fitting for Depth Completion with Uncertainty", "abstract": "In this work we investigate the problem of uncertainty estimation for image-guided depth completion. We extend Deep Basis Fitting (DBF) [54] for depth completion within a Bayesian evidence framework to provide calibrated perpixel variance. The DBF approach frames the depth completion problem in terms of a network that produces a set of low-dimensional depth bases and a differentiable least squares fitting module that computes the basis weights using the sparse depths. By adopting a Bayesian treatment, our Bayesian Deep Basis Fitting (BDBF) approach is able to 1) predict high-quality uncertainty estimates and 2) enable depth completion with few or no sparse measurements. We conduct controlled experiments to compare BDBF against commonly used techniques for uncertainty estimation under various scenarios. Results show that our method produces better uncertainty estimates with accurate depth prediction."}}
{"id": "0kE7nH1TDx", "cdate": 1609459200000, "mdate": 1668617819625, "content": {"title": "Large-scale Autonomous Flight with Real-time Semantic SLAM under Dense Forest Canopy", "abstract": "Semantic maps represent the environment using a set of semantically meaningful objects. This representation is storage-efficient, less ambiguous, and more informative, thus facilitating large-scale autonomy and the acquisition of actionable information in highly unstructured, GPS-denied environments. In this letter, we propose an integrated system that can perform large-scale autonomous flights and real-time semantic mapping in challenging under-canopy environments. We detect and model tree trunks and ground planes from LiDAR data, which are associated across scans and used to constrain robot poses as well as tree trunk models. The autonomous navigation module utilizes a multi-level planning and mapping framework and computes dynamically feasible trajectories that lead the UAV to build a semantic map of the user-defined region of interest in a computationally and storage efficient manner. A drift-compensation mechanism is designed to minimize the odometry drift using semantic SLAM outputs in real time, while maintaining planner optimality and controller stability. This leads the UAV to execute its mission accurately and safely at scale. Code is released at: https://github.com/KumarRobotics/kr_autonomous_flight and https://github.com/KumarRobotics/sloam."}}
{"id": "xnEhlwU0xm", "cdate": 1577836800000, "mdate": 1668617819621, "content": {"title": "Depth Completion via Deep Basis Fitting", "abstract": "In this paper we consider the task of image-guided depth completion where our system must infer the depth at every pixel of an input image based on the image content and a sparse set of depth measurements. We propose a novel approach that builds upon the strengths of modern deep learning techniques and classical optimization algorithms and significantly improves performance. The proposed method replaces the final 1 × 1 convolutional layer employed in most depth completion networks with a least squares fitting module which computes weights by fitting the implicit depth bases to the given sparse depth measurements. In addition, we show how our proposed method can be naturally extended to a multi-scale formulation for improved self-supervised training. We demonstrate through extensive experiments on various datasets that our approach achieves consistent improvements over state-of-the-art baseline methods with small computational overhead."}}
