{"id": "vlN87i3tIvR", "cdate": 1640995200000, "mdate": 1679913027014, "content": {"title": "Who Is Your Right Mixup Partner in Positive and Unlabeled Learning", "abstract": ""}}
{"id": "iRXHGXpI0J", "cdate": 1640995200000, "mdate": 1679913027157, "content": {"title": "Weakly-supervised Text Classification with Wasserstein Barycenters Regularization", "abstract": ""}}
{"id": "IVryzkgoUXF", "cdate": 1640995200000, "mdate": 1679913027030, "content": {"title": "Approximate posterior inference for Bayesian models: black-box expectation propagation", "abstract": ""}}
{"id": "GVPoh3qsrn", "cdate": 1640995200000, "mdate": 1679913027159, "content": {"title": "Learning with Partial Labels from Semi-supervised Perspective", "abstract": ""}}
{"id": "NH29920YEmj", "cdate": 1632875423524, "mdate": null, "content": {"title": "Who Is Your Right Mixup Partner in Positive and Unlabeled Learning", "abstract": "Positive and Unlabeled (PU) learning targets inducing a binary classifier from weak training datasets of positive and unlabeled instances, which arise in many real-world applications. In this paper, we propose a novel PU learning method, namely Positive and unlabeled learning with Partially Positive Mixup (P3Mix), which simultaneously benefits from data augmentation and supervision correction with a heuristic mixup technique. To be specific, we take inspiration from the directional boundary deviation phenomenon observed in our preliminary experiments, where the learned PU boundary tends to deviate from the fully supervised boundary towards the positive side. For the unlabeled instances with ambiguous predictive results, we select their mixup partners from the positive instances around the learned PU boundary, so as to transform them into augmented instances near to the boundary yet with more precise supervision. Accordingly, those augmented instances may push the learned PU boundary towards the fully supervised boundary, thereby improving the classification performance. Comprehensive experimental results demonstrate the effectiveness of the heuristic mixup technique in PU learning and show that P3Mix can consistently outperform the state-of-the-art PU learning methods."}}
{"id": "NB_qj_Piz2Y", "cdate": 1609459200000, "mdate": 1679913027050, "content": {"title": "Semi-Supervised Text Classification with Balanced Deep Representation Distributions", "abstract": ""}}
{"id": "IGiU4Gtbc_", "cdate": 1609459200000, "mdate": 1679913026960, "content": {"title": "Detecting the Fake Candidate Instances: Ambiguous Label Learning with Generative Adversarial Networks", "abstract": ""}}
{"id": "t1HwqSmWDtj", "cdate": 1577836800000, "mdate": 1679913026966, "content": {"title": "Semantics-assisted Wasserstein Learning for Topic and Word Embeddings", "abstract": ""}}
{"id": "gFd2o5-Drn3", "cdate": 1577836800000, "mdate": 1679913026960, "content": {"title": "Learning with Noisy Partial Labels by Simultaneously Leveraging Global and Local Consistencies", "abstract": ""}}
{"id": "iDQzzVmoj92", "cdate": 1546300800000, "mdate": 1679913027177, "content": {"title": "Topic representation: Finding more representative words in topic models", "abstract": ""}}
