{"id": "sw2z7oDaKZG", "cdate": 1640995200000, "mdate": 1683880442778, "content": {"title": "A group comparison in fMRI data using a semiparametric model under shape invariance", "abstract": ""}}
{"id": "pg6wSqdtXj", "cdate": 1640995200000, "mdate": 1683880442772, "content": {"title": "Low-rank, Orthogonally Decomposable Tensor Regression With Application to Visual Stimulus Decoding of fMRI Data", "abstract": "We consider the problem of fitting a generalized linear model with a three-dimensional image covariate, such as one obtained by functional magnetic resonance imaging (fMRI). A major challenge for f..."}}
{"id": "kdpxpnFbBT", "cdate": 1640995200000, "mdate": 1683880442765, "content": {"title": "Kernel Methods for Radial Transformed Compositional Data with Many Zeros", "abstract": "Compositional data analysis with a high proportion of zeros has gained increasing popularity, especially in chemometrics and human gut microbiomes research. Statistical analyses of this type of dat..."}}
{"id": "1_oTCvWzcxr", "cdate": 1640995200000, "mdate": 1683880442770, "content": {"title": "Learning High Dimensional Multi-response Linear Models with Non-oracular Quantum Search", "abstract": "This paper studies linear regression models for high dimensional multi-response data with a hybrid quantum computing algorithm. We propose an intuitively appealing estimation method based on identifying the linearly independent columns in the coefficient matrix. Our method relaxes the low rank constraint in the existing literature and allows the rank to diverge with dimensions. The linearly independent columns are selected by a novel non-oracular quantum search (NQS) algorithm which is significantly faster than classical search methods implemented on electronic computers. Besides, NQS achieves a near optimal computational complexity as existing quantum search algorithms but does not require any oracle information of the solution state. We prove the proposed estimation procedure enjoys desirable theoretical properties. Intensive numerical experiments are also conducted to demonstrate the finite sample performance of the proposed method, and a comparison is made with some popular competitors. The results show that our method outperforms all of the alternative methods under various circumstances."}}
{"id": "Rk9TlwdeL4", "cdate": 1483228800000, "mdate": 1683880442865, "content": {"title": "Tracking concept drift using a constrained penalized regression combiner", "abstract": ""}}
{"id": "mGnSmHL4Hcq", "cdate": 1420070400000, "mdate": 1683880442771, "content": {"title": "A Nonparametric Kernel Approach to Interval-Valued Data Analysis", "abstract": "This article concerns datasets in which variables are in the form of intervals, which are obtained by aggregating information about variables from a larger dataset. We propose to view the observed ..."}}
{"id": "7HEAfDFwiZl", "cdate": 1356998400000, "mdate": 1683880442792, "content": {"title": "Statistical inference and visualization in scale-space using local likelihood", "abstract": ""}}
{"id": "3SIH609GBAN", "cdate": 1325376000000, "mdate": 1683880442890, "content": {"title": "A resampling approach for interval-valued data regression", "abstract": "We consider interval-valued data that frequently appear with advanced technologies in current data collection processes. Interval-valued data refer to the data that are observed as ranges instead of ..."}}
{"id": "bxTH9nHhDhj", "cdate": 1262304000000, "mdate": 1683880442866, "content": {"title": "Analysis of dependence among size, rate and duration in internet flows", "abstract": "In this paper we examine rigorously the evidence for dependence among data size, transfer rate and duration in Internet flows. We emphasize two statistical approaches for studying dependence, including Pearson's correlation coefficient and the extremal dependence analysis method. We apply these methods to large data sets of packet traces from three networks. Our major results show that Pearson's correlation coefficients between size and duration are much smaller than one might expect. We also find that correlation coefficients between size and rate are generally small and can be strongly affected by applying thresholds to size or duration. Based on Transmission Control Protocol connection startup mechanisms, we argue that thresholds on size should be more useful than thresholds on duration in the analysis of correlations. Using extremal dependence analysis, we draw a similar conclusion, finding remarkable independence for extremal values of size and rate."}}
{"id": "6_1EQGQl-j", "cdate": 1199145600000, "mdate": 1683880442821, "content": {"title": "SiZer analysis for the comparison of regression curves", "abstract": ""}}
