{"id": "VC2EKXCz3x", "cdate": 1672531200000, "mdate": 1702519267910, "content": {"title": "MCG-MNER: A Multi-Granularity Cross-Modality Generative Framework for Multimodal NER with Instruction", "abstract": "Multimodal named entity recognition (MNER) is an essential task of vision and language, which aims to locate named entities and classify them to the predefined categories using visual scenarios. However, existing MNER studies often suffer from bias issues with fine-grained visual cue fusion, which may produce noisy coarse-grained visual cues for MNER. To accurately capture text-image relations and better refine multimodal representations, we propose a novel instruction-based Multi-granularity Cross-modality Generative framework for MNER, namely MCG-MNER. Concretely, we introduce a multi-granularity relation propagation to infer visual clues relevant to text. Then, we propose a method to jnject multi-granularity visual information into cross-modality interaction and fusion to learn a unified representation. Finally, we integrate task-specific instructions and answers for MCG-MNER. Comprehensive experimental results on three benchmark datasets, such as Twitter2015, Twitter2017 and WikiDiverse, demonstrate the superiority of our proposed method over several state-of-the-art MNER methods. We will publicly release our codes for future studies."}}
{"id": "N24F-m-C-S5", "cdate": 1672531200000, "mdate": 1702519267918, "content": {"title": "Multi-grained Aspect Fusion for Review Response Generation", "abstract": "Review response generation (RRG) aims to automatically generate responses to customer reviews. Responding to reviews in a right manner is important to online customer experience. However, most previous research on RRG focused on exploring coarse review information and ignored fine-grain aspects within reviews, especially those with negative sentiment. As a result, the generated responses are usually not targeted to users’ real concerns in their reviews. To this end, we proposed a multi-grained aspect fusion model (MGAF) model to improve the targeting of generated responses. In particular, we first enhance the targeting ability by performing sentence-level aspect selection and response script learning. Then we integrate aspect-level keywords with sentiment information to further improve the diversity of generated responses. Experimental results on both Chinese and English datasets show that our proposed model outperforms the state-of-the-art models available, demonstrating the importance of fusing multi-grained aspect information for targeted response generation."}}
{"id": "4qaMP83fF4c", "cdate": 1672531200000, "mdate": 1702519267933, "content": {"title": "Discourse-Aware Causal Emotion Entailment", "abstract": "Causal Emotion Entailment (CEE) aims to identify the corresponding causal utterances for a target emotional utterance in conversations. Most previous research has focused on the use of sequential encoding to model conversational contexts, without fully considering the interaction effects between different utterances. In this paper, we explore the significance of discourse parsing in addressing these interactions, and propose a new model called discourse-aware model (DAM) to tackle the CEE task. Concretely, we use a multi-task learning framework to jointly model CEE and discourse parsing to fuse rich discourse information. In addition, we use a graph neural network to further enhance our CEE model by explicitly encoding discourse and other discourse-related structure features. The results on the benchmark corpus show that the DAM outperforms the state-of-the-art systems in the literature. This suggests that the discourse structure may contain a potential link between emotional utterances and their corresponding cause expressions. We will release the codes of this paper to facilitate future research ( https://github.com/Sakurakdx/DAM )."}}
{"id": "iWxP44UTo4", "cdate": 1640995200000, "mdate": 1702519267909, "content": {"title": "Neural Coupled Sequence Labeling for Heterogeneous Annotation Conversion", "abstract": "Supervised statistical models rely on large-scale high-quality labeled data, which is important for model training but expensive to construct. Therefore, instead of constructing new dataset, researchers have attempted to make full use of various existing heterogeneous datasets to boost model performance, considering it is ubiquitous that the same task may have multiple annotated data following different and incompatible annotation guidelines. Representative methods include the guide-feature method which use the knowledge projected from the source-side to the target-side as extra features for target model guidance, and the multi-task learning (MTL) method which simultaneously train on multiple heterogeneous annotations with shared parameters to gain resource-share knowledge. Though effective, the guide-feature method fails to directly use the source-side data as training data, and the MTL method ignores the implicit mappings between heterogeneous datasets. Compared with the above methods, directly converting the heterogeneous datasets into homogeneous datasets for target model training is a more straightforward and effective way to fully exploit heterogeneous resources. In this work, we propose a neural coupled sequence labeling model for heterogeneous annotation conversion. First, for each token, we map a given one-side tag into a set of bundled tags by concatenating the tag with all the possible tags at the other side. Then, we build a neural coupled model over the bundled tag space. Finally, we convert heterogeneous annotations into homogeneous annotations by performing constraint decoding on the coupled model. We also propose a pruning strategy to address the oversize issue of the bundled tag space, which improves efficiency without hurting model performance.Experiments for part-of-speech (POS) tagging, word segmentation (WS), and WS&POS tagging tasks show that our proposed neural coupled model consistently outperforms several benchmark models for all the three tasks by large margin."}}
{"id": "dACPBllS0v6", "cdate": 1640995200000, "mdate": 1702519267935, "content": {"title": "Discourse-Aware Emotion Cause Extraction in Conversations", "abstract": "Emotion Cause Extraction in Conversations (ECEC) aims to extract the utterances which contain the emotional cause in conversations. Most prior research focuses on modelling conversational contexts with sequential encoding, ignoring the informative interactions between utterances and conversational-specific features for ECEC. In this paper, we investigate the importance of discourse structures in handling utterance interactions and conversationspecific features for ECEC. To this end, we propose a discourse-aware model (DAM) for this task. Concretely, we jointly model ECEC with discourse parsing using a multi-task learning (MTL) framework and explicitly encode discourse structures via gated graph neural network (gated GNN), integrating rich utterance interaction information to our model. In addition, we use gated GNN to further enhance our ECEC model with conversation-specific features. Results on the benchmark corpus show that DAM outperform the state-of-theart (SOTA) systems in the literature. This suggests that the discourse structure may contain a potential link between emotional utterances and their corresponding cause expressions. It also verifies the effectiveness of conversationalspecific features. The codes of this paper will be available on GitHub."}}
{"id": "TXvI3tY6dvm", "cdate": 1640995200000, "mdate": 1702519267909, "content": {"title": "MuCPAD: A Multi-Domain Chinese Predicate-Argument Dataset", "abstract": "Yahui Liu, Haoping Yang, Chen Gong, Qingrong Xia, Zhenghua Li, Min Zhang. Proceedings of the 2022 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. 2022."}}
{"id": "MJp5yih4rYI", "cdate": 1640995200000, "mdate": 1702519267917, "content": {"title": "MuCPAD: A Multi-Domain Chinese Predicate-Argument Dataset", "abstract": "During the past decade, neural network models have made tremendous progress on in-domain semantic role labeling (SRL). However, performance drops dramatically under the out-of-domain setting. In order to facilitate research on cross-domain SRL, this paper presents MuCPAD, a multi-domain Chinese predicate-argument dataset, which consists of 30,897 sentences and 92,051 predicates from six different domains. MuCPAD exhibits three important features. 1) Based on a frame-free annotation methodology, we avoid writing complex frames for new predicates. 2) We explicitly annotate omitted core arguments to recover more complete semantic structure, considering that omission of content words is ubiquitous in multi-domain Chinese texts. 3) We compile 53 pages of annotation guidelines and adopt strict double annotation for improving data quality. This paper describes in detail the annotation methodology and annotation process of MuCPAD, and presents in-depth data analysis. We also give benchmark results on cross-domain SRL based on MuCPAD."}}
{"id": "GIcbxtMFmc4", "cdate": 1640995200000, "mdate": 1687835929991, "content": {"title": "Mining Word Boundaries in Speech as Naturally Annotated Word Segmentation Data", "abstract": "Chinese word segmentation (CWS) models have achieved very high performance when the training data is sufficient and in-domain. However, the performance drops drastically when shifting to cross-domain and low-resource scenarios due to data sparseness issues. Considering that constructing large-scale manually annotated data is time-consuming and labor-intensive, in this work, we for the first time propose to mine word boundary information from pauses in speech to efficiently obtain large-scale CWS naturally annotated data. We present a simple yet effective complete-then-train method to utilize these natural annotations from speech for CWS model training. Extensive experiments demonstrate that the CWS performance in cross-domain and low-resource scenarios can be significantly improved by leveraging our naturally annotated data extracted from speech."}}
{"id": "qNg9f1FWiuO", "cdate": 1609459200000, "mdate": 1687835280337, "content": {"title": "An In-depth Study on Internal Structure of Chinese Words", "abstract": "Unlike English letters, Chinese characters have rich and specific meanings. Usually, the meaning of a word can be derived from its constituent characters in some way. Several previous works on syntactic parsing propose to annotate shallow word-internal structures for better utilizing character-level information. This work proposes to model the deep internal structures of Chinese words as dependency trees with 11 labels for distinguishing syntactic relationships. First, based on newly compiled annotation guidelines, we manually annotate a word-internal structure treebank (WIST) consisting of over 30K multi-char words from Chinese Penn Treebank. To guarantee quality, each word is independently annotated by two annotators and inconsistencies are handled by a third senior annotator. Second, we present detailed and interesting analysis on WIST to reveal insights on Chinese word formation. Third, we propose word-internal structure parsing as a new task, and conduct benchmark experiments using a competitive dependency parser. Finally, we present two simple ways to encode word-internal structures, leading to promising gains on the sentence-level syntactic parsing task."}}
{"id": "78yEqb6egf", "cdate": 1609459200000, "mdate": 1687835280339, "content": {"title": "An In-depth Study on Internal Structure of Chinese Words", "abstract": "Chen Gong, Saihao Huang, Houquan Zhou, Zhenghua Li, Min Zhang, Zhefeng Wang, Baoxing Huai, Nicholas Jing Yuan. Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers). 2021."}}
