{"id": "zhj0_4eK-DS", "cdate": 1672531200000, "mdate": 1683756479712, "content": {"title": "Scheduling DNNs on Edge Servers", "abstract": "Deep neural networks (DNNs) have been widely used in various video analytic tasks. These tasks demand real-time responses. Due to the limited processing power on mobile devices, a common way to support such real-time analytics is to offload the processing to an edge server. This paper examines how to speed up the edge server DNN processing for multiple clients. In particular, we observe batching multiple DNN requests significantly speeds up the processing time. Based on this observation, we first design a novel scheduling algorithm to exploit the batching benefits of all requests that run the same DNN. This is compelling since there are only a handful of DNNs and many requests tend to use the same DNN. Our algorithms are general and can support different objectives, such as minimizing the completion time or maximizing the on-time ratio. We then extend our algorithm to handle requests that use different DNNs with or without shared layers. Finally, we develop a collaborative approach to further improve performance by adaptively processing some of the requests or portions of the requests locally at the clients. This is especially useful when the network and/or server is congested. Our implementation shows the effectiveness of our approach under different request distributions (e.g., Poisson, Pareto, and Constant inter-arrivals)."}}
{"id": "c8yRxKKvjN", "cdate": 1672531200000, "mdate": 1682002083174, "content": {"title": "Policy Optimization with Robustness Certificates", "abstract": "We present a reinforcement learning (RL) framework in which the learned policy comes with a machine-checkable certificate of provable adversarial robustness. Our approach, called CAROL, learns a model of the environment. In each learning iteration, it uses the current version of this model and an external abstract interpreter to construct a differentiable signal for provable robustness. This signal is used to guide learning, and the abstract interpretation used to construct it directly leads to the robustness certificate returned at convergence. We give a theoretical analysis that bounds the worst-case accumulative reward of CAROL. We also experimentally evaluate CAROL on four MuJoCo environments with continuous state and action spaces. On these tasks, CAROL learns policies that, when contrasted with policies from the state-of-the-art robust RL algorithms, exhibit: (i) markedly enhanced certified performance lower bounds; and (ii) comparable performance under empirical adversarial attacks."}}
{"id": "NzuTlR1uWz", "cdate": 1640995200000, "mdate": 1682357858023, "content": {"title": "Safe Neurosymbolic Learning with Differentiable Symbolic Execution", "abstract": "We study the problem of learning verifiably safe parameters for programs that use neural networks as well as symbolic, human-written code. Such neurosymbolic programs arise in many safety-critical domains. However, because they need not be differentiable, it is hard to learn their parameters using existing gradient-based approaches to safe learning. Our method, Differentiable Symbolic Execution (DSE), samples control flow paths in a program, symbolically constructs worst-case \"safety loss\" along these paths, and backpropagates the gradients of these losses through program operations using a generalization of the REINFORCE estimator. We evaluate the method on a mix of synthetic tasks and real-world benchmarks. Our experiments show that DSE significantly outperforms the state-of-the-art DiffAI method on these tasks."}}
{"id": "C0aFq9DpRTy", "cdate": 1640995200000, "mdate": 1682357858081, "content": {"title": "Safe Neurosymbolic Learning with Differentiable Symbolic Execution", "abstract": "We study the problem of learning worst-case-safe parameters for programs that use neural networks as well as symbolic, human-written code. Such neurosymbolic programs arise in many safety-critical domains. However, because they can use nondifferentiable operations, it is hard to learn their parameters using existing gradient-based approaches to safe learning. Our approach to this problem, Differentiable Symbolic Execution (DSE), samples control flow paths in a program, symbolically constructs worst-case \"safety losses\" along these paths, and backpropagates the gradients of these losses through program operations using a generalization of the REINFORCE estimator. We evaluate the method on a mix of synthetic tasks and real-world benchmarks. Our experiments show that DSE significantly outperforms the state-of-the-art DiffAI method on these tasks."}}
{"id": "ZtyvT0aHNBP", "cdate": 1633706939247, "mdate": null, "content": {"title": "Safe Neurosymbolic Learning with Differentiable Symbolic Execution", "abstract": "We study the problem of learning verifiably safe parameters for programs that use neural networks as well as symbolic, human-written code. Such neurosymbolic programs arise in many safety-critical domains. However, because they need not be differentiable, they cannot be learned using existing approaches to integrating learning and verification. Our method, Differentiable Symbolic Execution (DSE), learns such programs by sampling code paths using symbolic execution, constructing gradients of a worst-case ``safety loss'' along these paths, and then backpropagating these gradients through program operations using a generalization of the reinforce estimator. We evaluate the method on a mix of synthetic tasks and real-world control and navigation benchmarks. Our experiments show that DSE significantly outperforms the state-of-the-art DiffAI method on these tasks.  "}}
{"id": "NYBmJN4MyZ", "cdate": 1632875472907, "mdate": null, "content": {"title": "Safe Neurosymbolic Learning with Differentiable Symbolic Execution", "abstract": "We study the problem of learning verifiably safe parameters for programs that use neural networks as well as symbolic, human-written code. Such neurosymbolic programs arise in many safety-critical domains. However, because they need not be differentiable, it is hard to learn their parameters using existing gradient-based approaches to safe learning. Our method, Differentiable Symbolic Execution (DSE), samples control flow paths in a program, symbolically constructs worst-case \"safety loss\" along these paths, and backpropagates the gradients of these losses through program operations using a generalization of the REINFORCE estimator. We evaluate the method on a mix of synthetic tasks and real-world benchmarks. Our experiments show that DSE significantly outperforms the state-of-the-art DiffAI method on these tasks.  "}}
{"id": "ziDEciVgULo", "cdate": 1514764800000, "mdate": 1668590066790, "content": {"title": "Understanding the behavioral differences between american and german users: A data-driven study", "abstract": "Given that the USA and Germany are the most populous countries in North America and Western Europe, understanding the behavioral differences between American and German users of online social networks is essential. In this work, we conduct a data-driven study based on the Yelp Open Dataset. We demonstrate the behavioral characteristics of both American and German users from different aspects, i.e., social connectivity, review styles, and spatiotemporal patterns. In addition, we construct a classification model to accurately recognize American and German users according to the behavioral data. Our model achieves high classification performance with an F1-score of 0.891 and AUC of 0.949."}}
{"id": "xJZ9GBWX65", "cdate": 1514764800000, "mdate": 1682357858327, "content": {"title": "Sensing People's Time Management Behaviors: A Study Using Wearable Devices", "abstract": "Nowadays, people spend more and more time with their smart-phones. They want to make good use of smartphones to achieve an efficient time management. However, many people fail to control the time spent on smartphones effectively and end up with a low task completion rate. We design a time management APP targeted to analyze the time management task completion. In this way, a clear picture of the reasons for a low task completion rate is drawn by us, which could be very useful to help people better manage their time and complete their tasks."}}
{"id": "7Tykkc1ipGJ", "cdate": 1514764800000, "mdate": 1682357858166, "content": {"title": "Accelerating Mobile Applications at the Network Edge with Software-Programmable FPGAs", "abstract": "Recently, Edge Computing has emerged as a new computing paradigm dedicated for mobile applications for performance enhancement and energy efficiency purposes. Specifically, it benefits today's interactive applications on power-constrained devices by offloading compute-intensive tasks to the edge nodes which is in close proximity. Meanwhile, Field Programmable Gate Array (FPGA) is well known for its excellence in accelerating compute-intensive tasks such as deep learning algorithms in a high performance and energy efficiency manner due to its hardware-customizable nature. In this paper, we make the first attempt to leverage and combine the advantages of these two, and proposed a new network-assisted computing model, namely FPGA-based edge computing. As a case study, we choose three computer vision (CV)-based interactive mobile applications, and implement their backend computation parts on FPGA. By deploying such application-customized accelerator modules for computation offloading at the network edge, we experimentally demonstrate that this approach can effectively reduce response time for the applications and energy consumption for the entire system in comparison with traditional CPU-based edge/cloud offloading approach."}}
