{"id": "7sS1fTM_xZ", "cdate": 1665069636084, "mdate": null, "content": {"title": "Participatory Systems for Personalized Prediction", "abstract": "Machine learning models often request personal information from users to assign more accurate predictions across a heterogeneous population. Personalized models are not built to support \\emph{informed consent}: users cannot \"opt-out\" of providing personal data, nor understand the effects of doing so. In this work, we introduce a family of personalized prediction models called \\emph{participatory systems} that support informed consent. Participatory systems are interactive prediction models that let users opt into reporting additional personal data at prediction time, and inform them about how their data will improve their predictions. We present a model-agnostic approach for supervised learning tasks where personal data is encoded as \"group\" attributes (e.g., sex, age group, HIV status). Given a pool of user-specified models, our approach can create a variety of participatory systems that differ in their training requirements and opportunities for informed consent. We conduct a comprehensive empirical study of participatory systems in clinical prediction tasks and compare them to common approaches for personalization.  Our results show that our approach can produce participatory systems that exhibit large improvements in privacy, fairness, and performance at the population and group levels."}}
{"id": "vWBiWZK0c3", "cdate": 1664881704605, "mdate": null, "content": {"title": "Participatory Systems for Personalized Prediction", "abstract": "Machine learning models often request personal information from users to assign more accurate predictions across a heterogeneous population. Personalized models are not built to support \\emph{informed consent}: users cannot \"opt-out\" of providing personal data, nor understand the effects of doing so. In this work, we introduce a family of personalized prediction models called \\emph{participatory systems} that support informed consent. Participatory systems are interactive prediction models that let users opt into reporting additional personal data at prediction time, and inform them about how their data will improve their predictions. We present a model-agnostic approach for supervised learning tasks where personal data is encoded as \"group\" attributes (e.g., sex, age group, HIV status). Given a pool of user-specified models, our approach can create a variety of participatory systems that differ in their training requirements and opportunities for informed consent. We conduct a comprehensive empirical study of participatory systems in clinical prediction tasks and compare them to common approaches for personalization.  Our results show that our approach can produce participatory systems that exhibit large improvements in privacy, fairness, and performance at the population and group levels."}}
{"id": "DiKXr4PR-5G", "cdate": 1631965710670, "mdate": 1631965710670, "content": {"title": "Deep Parametric Time-to-Event Regression with Time-Varying Covariates", "abstract": "Time-to-event regression in healthcare and other domains, such as predictive maintenance, require working with time-series (or time-varying) data such as continuously monitored vital signs, electronic health records, or sensor readings. In such scenarios, the event-time distribution may have temporal dependencies at different time scales that are not easily captured by classical survival models that assume training data points to be independent. In this paper, we describe a fully parametric approach to model censored time-to-event outcomes with time varying covariates. It involves learning representations of the input temporal data using Recurrent Neural Networks such as LSTMs and GRUs, followed by describing the conditional event distribution as a fixed mixture of parametric distributions. The use of the recurrent neural networks allows the learned representations to model long-term dependencies in the input data while jointly estimating the Time-to-Event. We benchmark our approach on MIMIC III: a large, publicly available dataset collected from Intensive Care Unit (ICU) patients, focusing on predicting duration of their ICU stays and their short term life expectancy, and we demonstrate competitive performance of the proposed approach compared to established time-to-event regression models."}}
{"id": "yNFvKqGYpuTV", "cdate": 1577836800000, "mdate": null, "content": {"title": "Deep Survival Machines: Fully Parametric Survival Regression and Representation Learning for Censored Data with Competing Risks.", "abstract": "We describe a new approach to estimating relative risks in time-to-event prediction problems with censored data in a fully parametric manner. Our approach does not require making strong assumptions of constant proportional hazard of the underlying survival distribution, as required by the Cox-proportional hazard model. By jointly learning deep nonlinear representations of the input covariates, we demonstrate the benefits of our approach when used to estimate survival risks through extensive experimentation on multiple real world datasets with different levels of censoring. We further demonstrate advantages of our model in the competing risks scenario. To the best of our knowledge, this is the first work involving fully parametric estimation of survival times with competing risks in the presence of censoring."}}
{"id": "xITgL-gKxWP", "cdate": 1577836800000, "mdate": null, "content": {"title": "Interpretable subgroup discovery in treatment effect estimation with application to opioid prescribing guidelines", "abstract": "The dearth of prescribing guidelines for physicians is one key driver of the current opioid epidemic in the United States. In this work, we analyze medical and pharmaceutical claims data to draw insights on characteristics of patients who are more prone to adverse outcomes after an initial synthetic opioid prescription. Toward this end, we propose a generative model that allows discovery from observational data of subgroups that demonstrate an enhanced or diminished causal effect due to treatment. Our approach models these sub-populations as a mixture distribution, using sparsity to enhance interpretability, while jointly learning nonlinear predictors of the potential outcomes to better adjust for confounding. The approach leads to human interpretable insights on discovered subgroups, improving the practical utility for decision support."}}
{"id": "-D6G5RxdZtt", "cdate": 1577836800000, "mdate": null, "content": {"title": "Latent Bayesian Inference for Robust Earnings Estimates", "abstract": "We consider the problem of aggregating predictions or measurements from a set of human forecasters, models, sensors or other instruments which may be subject to bias or miscalibration and random heteroscedastic noise. We propose a Bayesian consensus estimator that adjusts for miscalibration and noise and show that this estimator is unbiased and asymptotically more efficient than naive alternatives. We further propose a Hierarchical Bayesian Model that leverages our proposed estimator and apply it to two real world forecasting challenges that require consensus estimates from error prone individual estimates: forecasting influenza like illness (ILI) weekly percentages and forecasting annual earnings of public companies. We demonstrate that our approach is effective at mitigating bias and error and results in more accurate forecasts than existing consensus models."}}
{"id": "gSx6C8PGhtnS", "cdate": 1546300800000, "mdate": null, "content": {"title": "Dynamically Personalized Detection of Hemorrhage.", "abstract": "Rapid detection of hemorrhage is of major interest to the critical care community, enabling clinicians to take swift actions to mitigate adverse outcomes. In this paper, we describe a model that al..."}}
{"id": "C9LqAaFx_Rg", "cdate": 1546300800000, "mdate": null, "content": {"title": "Interpretable Subgroup Discovery in Treatment Effect Estimation with Application to Opioid Prescribing Guidelines", "abstract": "The dearth of prescribing guidelines for physicians is one key driver of the current opioid epidemic in the United States. In this work, we analyze medical and pharmaceutical claims data to draw insights on characteristics of patients who are more prone to adverse outcomes after an initial synthetic opioid prescription. Toward this end, we propose a generative model that allows discovery from observational data of subgroups that demonstrate an enhanced or diminished causal effect due to treatment. Our approach models these sub-populations as a mixture distribution, using sparsity to enhance interpretability, while jointly learning nonlinear predictors of the potential outcomes to better adjust for confounding. The approach leads to human-interpretable insights on discovered subgroups, improving the practical utility for decision support"}}
{"id": "drJncii1Lx", "cdate": 1420070400000, "mdate": null, "content": {"title": "An Entity Resolution approach to isolate instances of Human Trafficking online.", "abstract": "Human trafficking is a challenging law enforcement problem, and a large amount of such activity manifests itself on various online forums. Given the large, heterogeneous and noisy structure of this data, building models to predict instances of trafficking is an even more convolved a task. In this paper we propose and entity resolution pipeline using a notion of proxy labels, in order to extract clusters from this data with prior history of human trafficking activity. We apply this pipeline to 5M records from backpage.com and report on the performance of this approach, challenges in terms of scalability, and some significant domain specific characteristics of our resolved entities."}}
{"id": "VLcZ5fVt1P", "cdate": 1420070400000, "mdate": null, "content": {"title": "An Entity Resolution approach to isolate instances of Human Trafficking online", "abstract": "Human trafficking is a challenging law enforcement problem, and a large amount of such activity manifests itself on various online forums. Given the large, heterogeneous and noisy structure of this data, building models to predict instances of trafficking is an even more convolved a task. In this paper we propose and entity resolution pipeline using a notion of proxy labels, in order to extract clusters from this data with prior history of human trafficking activity. We apply this pipeline to 5M records from backpage.com and report on the performance of this approach, challenges in terms of scalability, and some significant domain specific characteristics of our resolved entities."}}
