{"id": "cwFikahd13J", "cdate": 1680307200000, "mdate": 1681739930002, "content": {"title": "Optimizing Cross-Line Dispatching for Minimum Electric Bus Fleet", "abstract": "Recent years have witnessed the increasing popularity of electric buses (e-buses) around the globe due to their environment friendly nature. However, various factors, such as the prohibitive purchasing costs and the scarcity of large-scale charging facilities, hinder the wider adoption of e-buses. Thus, to effectively cut the cost of building and maintaining urban e-bus systems, we optimize the dispatching strategy for urban e-bus systems to satisfy public transportation demands with the minimum e-bus fleet. Specifically, we propose to systematically exploit at city-scale cross-line dispatching, a smart dispatching strategy allowing one bus to serve multiple bus lines when necessary. Technically, we construct a novel and generalizable graph-theoretic model for urban e-bus systems integrating e-buses non-negligible charging time, the spatio-temporal constraints of bus trips, and various other real-world factors. We prove that it is NP-hard, and has no <inline-formula><tex-math notation=\"LaTeX\">$(2-\\epsilon)$</tex-math></inline-formula> -approximation algorithm. Next, we propose a polynomial-time algorithm solving the problem with a guaranteed approximation ratio. Furthermore, we conduct extensive experiments on a large-scale real-world bus dataset from Shenzhen, China, which validate the effectiveness of our algorithms. As shown by our experimental results, to serve 300 bus lines, our dispatching strategy needs 38.2% less e-buses than the one currently used in practice."}}
{"id": "cLx3kbl2AI", "cdate": 1652737464735, "mdate": null, "content": {"title": "Context-Based Dynamic Pricing with Partially Linear Demand Model", "abstract": "In today’s data-rich environment, context-based dynamic pricing has gained much attention. To model the demand as a function of price and context, the existing literature either adopts a parametric  model or a non-parametric model. The former is easier to implement but may suffer from model mis-specification, whereas the latter is more robust but does not leverage many structural properties of the underlying problem. This paper combines these two approaches by studying the context-based dynamic pricing with online learning, where the unknown expected demand admits a semi-parametric partially linear structure. Specifically, we consider two demand models, whose expected demand at price $p$ and context $x \\in \\mathbb{R}^d$ is given by $bp+g(x)$ and $ f(p)+ a^\\top x$ respectively. We assume that $g(x)$ is $\\beta$-H{\\\"o}lder continuous in the first model, and $f(p)$ is $k$th-order smooth with an additional parameter $\\delta$ in the second model. For both models, we design an efficient online learning algorithm with provable regret upper bounds, and establish matching lower bounds. This enables us to characterize the statistical complexity for the two learning models, whose optimal regret rates are $\\widetilde \\Theta(\\sqrt T \\vee T^{\\frac{d}{d+2\\beta}})$ and $\\widetilde \\Theta(\\sqrt T \\vee (\\delta T^{k+1})^{\\frac{1}{2k+1}})$ respectively. The numerical results demonstrate that our learning algorithms are more effective than benchmark algorithms, and also reveal the effects of parameters $d$, $\\beta$ and $\\delta$ on the algorithm's empirical regret, which are consistent with our theoretical findings. "}}
{"id": "LTyPNPjolpj", "cdate": 1609459200000, "mdate": 1681739929994, "content": {"title": "Towards Minimum Fleet for Ridesharing-Aware Mobility-on-Demand Systems", "abstract": "The rapid development of information and communication technologies has given rise to mobility-on-demand (MoD) systems (e.g., Uber, Didi) that have fundamentally revolutionized urban transportation. One common feature of today's MoD systems is the integration of ridesharing due to its cost-efficient and environment-friendly natures. However, a fundamental unsolved problem for such systems is how to serve people's heterogeneous transportation demands with as few vehicles as possible. Naturally, solving such minimum fleet problem is essential to reduce the vehicles on the road to improve transportation efficiency. Therefore, we investigate the fleet minimization problem in ridesharing-aware MoD systems. We use graph-theoretic methods to construct a novel order graph capturing the complicated inter-order shareability, each order's spatial-temporal features, and various other real-world factors. We then formulate the problem as a tree cover problem over the order graph, which differs from the traditional coverage problems. Theoretically, we prove the problem is NP-hard, and propose a polynomial-time algorithm with a guaranteed approximation ratio. Besides, we address the online fleet minimization problem, where orders arrive in an online manner. Finally, extensive experiments on a city-scale dataset from Shenzhen, containing 21 million orders from June 1st to 30th, 2017, validate the effectiveness of our algorithms."}}
