{"id": "aiNefwzm05", "cdate": 1640995200000, "mdate": 1679930948812, "content": {"title": "Simple and near-optimal algorithms for hidden stratification and multi-group learning", "abstract": ""}}
{"id": "OeEbbkLpa-", "cdate": 1640995200000, "mdate": 1679930948851, "content": {"title": "Targeted active learning for probabilistic models", "abstract": ""}}
{"id": "5Re03X8Iigi", "cdate": 1621629860323, "mdate": null, "content": {"title": "Bayesian decision-making under misspecified priors with applications to meta-learning", "abstract": "Thompson sampling and other Bayesian sequential decision-making algorithms are among the most popular approaches to tackle explore/exploit trade-offs in (contextual) bandits.  The choice of prior in these algorithms offers flexibility to encode domain knowledge but can also lead to poor performance when misspecified.  In this paper, we demonstrate that performance degrades gracefully with misspecification.  We prove that the expected reward accrued by Thompson sampling (TS) with a misspecified prior differs by at most $\\tilde{O}(H^2 \\epsilon)$ from TS with a well-specified prior, where $\\epsilon$ is the total-variation distance between priors and $H$ is the learning horizon.  \n\nOur bound does not require the prior to have any parametric form.  For priors with bounded support, our bound is independent of the cardinality or structure of the action space, and we show that it is tight up to universal constants in the worst case.\n\nBuilding on our sensitivity analysis, we establish generic PAC guarantees for algorithms in the recently studied Bayesian meta-learning setting and derive corollaries for various families of priors.  Our results generalize along two axes: (1) they apply to a broader family of Bayesian decision-making algorithms, including a Monte-Carlo implementation of the knowledge gradient algorithm (KG), and (2) they apply to Bayesian POMDPs, the most general Bayesian decision-making setting, encompassing contextual bandits as a special case. Through numerical simulations, we illustrate how prior misspecification and the deployment of one-step look-ahead (as in KG) can impact the convergence of meta-learning in multi-armed and contextual bandits with structured and correlated priors."}}
{"id": "zc8vr4-_l9", "cdate": 1609459200000, "mdate": 1679930948878, "content": {"title": "Bayesian decision-making under misspecified priors with applications to meta-learning", "abstract": ""}}
{"id": "y58WObLIen", "cdate": 1609459200000, "mdate": 1679930948738, "content": {"title": "Contrastive Estimation Reveals Topic Posterior Information to Linear Models", "abstract": ""}}
{"id": "tORKiraAfhg", "cdate": 1609459200000, "mdate": 1679930948889, "content": {"title": "Simple and near-optimal algorithms for hidden stratification and multi-group learning", "abstract": ""}}
{"id": "gShgiBWeicN", "cdate": 1609459200000, "mdate": 1679930948885, "content": {"title": "Bayesian decision-making under misspecified priors with applications to meta-learning", "abstract": ""}}
{"id": "eSJ9DlZsuV", "cdate": 1609459200000, "mdate": 1679930948944, "content": {"title": "Contrastive learning, multi-view redundancy, and linear models", "abstract": ""}}
{"id": "IG3jEGLN0jd", "cdate": 1601308057886, "mdate": null, "content": {"title": "Contrastive estimation reveals topic posterior information to linear models", "abstract": "Contrastive learning is an approach to representation learning that utilizes naturally occurring similar and dissimilar pairs of data points to find useful embeddings of data. In the context of document classification under topic modeling assumptions, we prove that contrastive learning is capable of recovering a representation of documents that reveals their underlying topic posterior information to linear models. We apply this procedure in a semi-supervised setup and demonstrate empirically that linear classifiers with these representations perform well in document classification tasks with very few training examples."}}
{"id": "uxIb_8Juc68", "cdate": 1577836800000, "mdate": 1679930949000, "content": {"title": "Expressivity of expand-and-sparsify representations", "abstract": ""}}
