{"id": "kjh1XzaoZI", "cdate": 1709251200000, "mdate": 1710829429712, "content": {"title": "Universal screen-shooting robust image watermarking with channel-attention in DCT domain", "abstract": ""}}
{"id": "q1VdH6ZgH2", "cdate": 1706745600000, "mdate": 1710829429720, "content": {"title": "Robust Image Hashing in Encrypted Domain", "abstract": "In recent decades, a large number of robust image hashing methods have been designed for image authentication. However, existing hashing methods generate hash sequences from the plaintext images. To protect the privacy of image content, we propose a robust image hashing method for encrypted images in this article. In our method, the hash sequence of an image can be extracted from its encrypted version without decryption, and the obtained hash sequence is consistent with that extracted from the corresponding plaintext image. To achieve this, the plaintext image is encrypted using Paillier cryptosystem. Then, according to the homomorphism, hash sequence can be extracted using Walsh-Hadamard transform (WHT) and histogram statistic. For application, a general framework for image authentication in encrypted domain is also presented, including three main entities, i.e., image owner, cloud server and authentication user. An image can be efficiently authenticated by the cloud server without disclosing the image content of the image owner. Compared with typical hashing methods that designed for plaintext domain, our method achieves satisfactory privacy-preserving performance, and also has better performances of image authentication, i.e., robustness and discrimination."}}
{"id": "DsLkpayHjL", "cdate": 1706745600000, "mdate": 1710829429698, "content": {"title": "Progressive Histogram Modification for JPEG Reversible Data Hiding", "abstract": "With the development of social network, a large number of private JPEG images are stored in social cloud platform. Correspondingly, the platform embeds user ID or authentication labels to manage these privacy images, preventing them from being arbitrarily accessed or tampered by illegal persons. However, data embedding in JPEG domain inevitably produces irreversible modifications to DCT coefficients, thus resulting in obvious or even serious distortion in the host JPEG images. To address this problem, this paper proposes an efficient JPEG reversible data hiding (RDH) method by constructing progressive two-dimensional histogram mappings. We firstly design distortion function to calculate the cost of each DCT frequency band, and then sort them to build histogram mapping containing a series of coefficient pairs. Subsequently, a progressive mapping mechanism is introduced to maintain most of AC coefficients unchanged. According to the given capacity, this mechanism can adaptively generate an optimum two-dimensional histogram mapping to embed secret messages. Our scheme can achieve an effective balance among embedding capacity, visual quality of the marked image and file size expansion, while keeping high cost-performance complexity. Extensive experiments demonstrate that our method outperforms existing JPEG RDH schemes in terms of visual quality and file size increment of the marked image, and provides an efficient solution for the confidentiality and security access problem of sensitive private image in cloud environment."}}
{"id": "jhoXg6Kv_8", "cdate": 1704067200000, "mdate": 1710829429689, "content": {"title": "iSCMIS:Spatial-Channel Attention Based Deep Invertible Network for Multi-Image Steganography", "abstract": "Multi-image steganography refers to a stegano- graphic method where a user tries to hide multiple confidential images within a single cover image, and all confidential images can be correspondingly recovered perfectly by the recipient. Multi-image steganography essentially belongs to a high-capacity image steganographic scheme, but such high hiding capacity may easily cause severe contour shadows or color distortion of steganographic images, resulting in a significant reduction in anti-steganalysis capability. To address the above problem, this article designs a deep invertible neural network by introducing spatial-channel joint attention mechanism, in which the confidential image hiding and recovery can be regarded as a pair of coupled invertible processes. Specifically, a series of simple invertible networks having the same structure are firstly used to construct a cascaded deep invertible neural network framework, in which multiple confidential images can be sequentially embedded into a single cover image through a series of flexible cascaded iterative operations. Subsequently, spatial-channel joint attention module is designed to re-construct invertible network model, which can guide the embedding of secret information into more secure image regions. Accordingly, this joint attention mechanism can effectively address the problem of visual quality and security degradation of steganographic images due to high embedding capacity. Extensive experiments demonstrate that our scheme can obtain superior performance over different large-scale image sets, and outperforms state-of-the art methods with higher visual quality and stronger anti-steganalysis capability."}}
{"id": "coWUNUAeULg", "cdate": 1704067200000, "mdate": 1710829429670, "content": {"title": "Print-Camera Resistant Image Watermarking With Deep Noise Simulation and Constrained Learning", "abstract": "In this article, an effective print-camera (P-C) resistant image watermarking scheme is proposed. To achieve watermark robustness, most of existing works try to simulate P-C noise by a sophisticated math model. However, the diversity of P-C noises in the real world is ignored, and the watermarked image may not attain a good balance between high robustness and low distortion. To address the problem, we construct an efficient end-to-end network architecture for watermark embedding and extraction. To be specific, a deep noise simulation network (NSN) is designed to simulate the fusion process of real P-C noises, which can help to generate high-robust watermarked image. Also, a multitask loss function based on just-noticeable-difference (JND) is proposed to conduct constrained learning for residual image containing watermark information, thus, the distortion of generated watermarked image can be significantly reduced. Experimental results show that our scheme can achieve high robustness against P-C process while maintaining a satisfactory watermark capacity and visual quality of watermarked image."}}
{"id": "Ve-xE5C8wj", "cdate": 1704067200000, "mdate": 1710829429479, "content": {"title": "Two-dimensional histogram-based reversible contrast enhancement using bi-histogram equalization", "abstract": ""}}
{"id": "F2ee1TS3A9", "cdate": 1704067200000, "mdate": 1710829429696, "content": {"title": "Image Manipulation Localization Using Spatial-Channel Fusion Excitation and Fine-Grained Feature Enhancement", "abstract": "The purpose of image manipulation detection is to classify and locate tampered regions in digital images. Most existing manipulation localization methods usually rely on certain tampering traces hidden in manipulated images. This dependency, however, may damage the generalization and postprocessing capabilities of the detection model because the tampered content in the image may be weakened by postprocessing operations. To address the aforementioned problem, we propose a new image manipulation localization scheme by introducing spatial–channel fusion excitation and fine-grained feature enhancement (FFE). We first design a feature enhancement module to enhance fine-grained features in red green blue (RGB) streams, which can improve the localization accuracy of tampering regions by capturing different-scale local and global information of images. Furthermore, a fusion excitation strategy is introduced to efficiently fuse features from both spatial and channel domains. Our fusion strategy can simultaneously process image spatial and channel information, significantly enhancing the model’s differentiation capability between tampered and nontampered regions. Extensive experiments demonstrate that the proposed method can provide effective localization capability for multiscale manipulation regions over different image sets and outperform most of the state-of-the-art schemes in terms of detection accuracy, generalization, and robustness."}}
{"id": "fQATuM4Ych", "cdate": 1701388800000, "mdate": 1710829429728, "content": {"title": "Quality guided reversible data hiding with contrast enhancement", "abstract": ""}}
{"id": "20Ya9JBATi", "cdate": 1701388800000, "mdate": 1710829429677, "content": {"title": "Reversible PRNU anonymity for device privacy protection based on data hiding", "abstract": ""}}
{"id": "yEONllTqlQB", "cdate": 1698796800000, "mdate": 1710829429884, "content": {"title": "Diversified Cover Selection for Image Steganography", "abstract": "This paper proposes a new cover selection method for steganography. We focus on the scenario that the available images for selection contain diversified sources, i.e., nature images and metaverse images. For the scenario, we design a targeted strategy to evaluate the suitability for steganography of a candidate image, which selects images according to the undetectability against steganalytic tools symmetrically. Firstly, steganalytic features of the candidate images are extracted. Then, the features are fed on a steganalytic classifier, and the possibility of carrying secret data is calculated for cover selection. As a result, the selected images are the best candidates to resist steganalysis. Experimental results show that our method performs better than existing cover selection schemes when checked by steganalytic tools."}}
