{"id": "zcT0I5qTI9Q", "cdate": 1640995200000, "mdate": 1682348900939, "content": {"title": "A Study on Representation Transfer for Few-Shot Learning", "abstract": "Few-shot classification aims to learn to classify new object categories well using only a few labeled examples. Transferring feature representations from other models is a popular approach for solving few-shot classification problems. In this work we perform a systematic study of various feature representations for few-shot classification, including representations learned from MAML, supervised classification, and several common self-supervised tasks. We find that learning from more complex tasks tend to give better representations for few-shot classification, and thus we propose the use of representations learned from multiple tasks for few-shot classification. Coupled with new tricks on feature selection and voting to handle the issue of small sample size, our direct transfer learning method offers performance comparable to state-of-art on several benchmark datasets."}}
{"id": "ErX-xMSek2", "cdate": 1632875684200, "mdate": null, "content": {"title": "A Study on Representation Transfer for Few-Shot Learning", "abstract": "Few-shot classification aims to learn to classify new object categories well using only a few labeled examples. Transfering feature representations from other models is a popular approach for solving few-shot classification problems.In this work we perform a systematic study of various feature representations for few-shot classification, including representations learned from MAML, supervised classification, and several common self-supervised tasks. We find that learning from more complex tasks tend to give better representations for few-shot classification, and thus we propose the use of representations learned from multiple tasks for few-shot classification. Coupled with new tricks on feature selection and voting to handle the issue of small sample size, our direct transfer learning method offers performance comparable to state-of-art on several benchmark datasets.  \n"}}
{"id": "-J33HTHwVb", "cdate": 1623130118060, "mdate": null, "content": {"title": "Convolutional neural networks for figure extraction in historical technical documents", "abstract": "We present a method of extracting figures and images from the pages of scanned documents, especially from technical research articles. Our approach is novel in two key ways. First, we treat this as a computer vision problem, and train convolutional neural networks to recognize figures in scanned pages. Second, we generate our training data from 'born-digital' structured documents, allowing us to automatically produce labels for our training set using PDF figure extractors. This avoids the otherwise tedious task of hand-labelling thousands of document pages. Our convolutional neural networks achieve precision and recall of close to 85% in identifying figures from a test set consisting of modern journal papers and conference proceedings, and obtain precision and recall above 80% on an application data set comprised of historical technical documents scanned from the Bell Labs Records. Our results show that models trained on digital documents transfer very well to historical scans. Finally, it is easy to extend our models to identify other document elements such as tables and captions.\n"}}
{"id": "ryxW804FPH", "cdate": 1569439304880, "mdate": null, "content": {"title": "ADAPTING PRETRAINED LANGUAGE MODELS FOR LONG DOCUMENT CLASSIFICATION", "abstract": "Pretrained language models (LMs) have shown excellent results in achieving human like performance on many language tasks. However, the most powerful LMs have one significant drawback: a fixed-sized input. With this constraint, these LMs are unable to utilize the full input of long documents. In this paper, we introduce a new framework to handle documents of arbitrary lengths. We investigate the addition of a recurrent mechanism to extend the input size and utilizing attention to identify the most discriminating segment of the input. We perform extensive validating experiments on patent and Arxiv datasets, both of which have long text. We demonstrate our method significantly outperforms state-of-the-art results reported in recent literature."}}
{"id": "lHB2oHM85Rp", "cdate": 1546300800000, "mdate": 1682348900945, "content": {"title": "A Direct Approach to Robust Deep Learning Using Adversarial Networks", "abstract": "Deep neural networks have been shown to perform well in many classical machine learning problems, especially in image classification tasks. However, researchers have found that neural networks can be easily fooled, and they are surprisingly sensitive to small perturbations imperceptible to humans. Carefully crafted input images (adversarial examples) can force a well-trained neural network to provide arbitrary outputs. Including adversarial examples during training is a popular defense mechanism against adversarial attacks. In this paper we propose a new defensive mechanism under the generative adversarial network~(GAN) framework. We model the adversarial noise using a generative network, trained jointly with a classification discriminative network as a minimax game. We show empirically that our adversarial network approach works well against black box attacks, with performance on par with state-of-art methods such as ensemble adversarial training and adversarial training with projected gradient descent."}}
{"id": "jxozDATRON", "cdate": 1546300800000, "mdate": 1682348900945, "content": {"title": "A Direct Approach to Robust Deep Learning Using Adversarial Networks", "abstract": "Deep neural networks have been shown to perform well in many classical machine learning problems, especially in image classification tasks. However, researchers have found that neural networks can be easily fooled, and they are surprisingly sensitive to small perturbations imperceptible to humans. Carefully crafted input images (adversarial examples) can force a well-trained neural network to provide arbitrary outputs. Including adversarial examples during training is a popular defense mechanism against adversarial attacks. In this paper we propose a new defensive mechanism under the generative adversarial network (GAN) framework. We model the adversarial noise using a generative network, trained jointly with a classification discriminative network as a minimax game. We show empirically that our adversarial network approach works well against black box attacks, with performance on par with state-of-art methods such as ensemble adversarial training and adversarial training with projected gradient descent."}}
{"id": "7s6bJWgK04", "cdate": 1546300800000, "mdate": 1682348900946, "content": {"title": "DyMo: Dynamic Monitoring of Large-Scale LTE-Multicast Systems", "abstract": "LTE evolved Multimedia Broadcast/Multicast Service (eMBMS) is an attractive solution for video delivery to very large groups in crowded venues. However, the deployment and management of eMBMS systems are challenging, due to the lack of real-time feedback from the user equipments (TIEs). Therefore, we present the Dynamic Monitoring (DyMo) system for low-overhead feedback collection. DyMo leverages eMBMS for broadcasting stochastic group instructions to all UEs. These instructions indicate the reporting rates as a function of the observed quality of service (QoS). This simple feedback mechanism collects very limited QoS reports from the TIEs. The reports are used for network optimization, thereby ensuring high QoS to the TIEs. We present the design aspects of DyMo and evaluate its performance analytically and via extensive simulations. Specifically, we show that DyMo infers the optimal eMBMS settings with extremely low overhead while meeting strict QoS requirements under different TIE mobility patterns and presence of network component failures. For instance, DyMo can detect the eMBMS signal-to-noise ratio experienced by the 0.1th percentile of the TIEs with a root mean square error of 0.05% with only 5 to 10 reports per second regardless of the number of TIEs."}}
{"id": "S1lIMn05F7", "cdate": 1538087950450, "mdate": null, "content": {"title": "A Direct Approach to Robust Deep Learning Using Adversarial Networks", "abstract": "Deep neural networks have been shown to perform well in many classical machine learning problems, especially in image classification tasks. However, researchers have found that neural networks can be easily fooled, and they are surprisingly sensitive to small perturbations imperceptible to humans.  Carefully crafted input images (adversarial examples) can force a well-trained neural network to provide arbitrary outputs.  Including adversarial examples during training is a popular defense mechanism against adversarial attacks. In this paper we propose a new defensive mechanism under the generative adversarial network~(GAN) framework. We model the adversarial noise using a generative network, trained jointly with a classification discriminative network as a minimax game. We show empirically that our adversarial network approach works well against black box attacks, with performance on par with state-of-art methods such as ensemble adversarial training and adversarial training with projected gradient descent.\n"}}
{"id": "sHX-rTvdwr", "cdate": 1483228800000, "mdate": null, "content": {"title": "A Sparse Coding Approach to Household Electricity Demand Forecasting in Smart Grids", "abstract": "With the gradual deployment of smart meters in many cities around the world, new opportunities arise in reducing energy usage and improving consumers’ information and control on their electricity consumption. Central to the provision of these newer services is the ability to accurately forecast the electricity demand of individual households. Compared with load forecasting at the city level and larger system aggregates, load forecasting for individual households is a much harder problem as the loads are much more stochastic and volatile. In this paper, we study the use of sparse coding for modeling and forecasting these individual household electricity loads. The proposed methods are tested on a data set of 5000 households in a joint project with electric power board of Chattanooga, for the period from September 2011 to August 2013. We obtain 10% improvements in the accuracy of forecasting next-day total load and next-week total load when we add sparse code features in ridge regression in this difficult problem. We also evaluate more classical forecasting methods on this forecasting problem, including autoregressive integrated moving average and Holt-Winters smoothing."}}
{"id": "keAg3g5UEOa", "cdate": 1483228800000, "mdate": 1682348900943, "content": {"title": "DyMo: Dynamic Monitoring of Large Scale LTE-Multicast Systems", "abstract": "LTE evolved Multimedia Broadcast/Multicast Service (eMBMS) is an attractive solution for video delivery to very large groups in crowded venues. However, deployment and management of eMBMS systems is challenging, due to the lack of realtime feedback from the User Equipment (UEs). Therefore, we present the Dynamic Monitoring (DyMo) system for low-overhead feedback collection. DyMo leverages eMBMS for broadcasting Stochastic Group Instructions to all UEs. These instructions indicate the reporting rates as a function of the observed Quality of Service (QoS). This simple feedback mechanism collects very limited QoS reports from the UEs. The reports are used for network optimization, thereby ensuring high QoS to the UEs. We present the design aspects of DyMo and evaluate its performance analytically and via extensive simulations. Specifically, we show that DyMo infers the optimal eMBMS settings with extremely low overhead, while meeting strict QoS requirements under different UE mobility patterns and presence of network component failures. For instance, DyMo can detect the eMBMS Signal-to-Noise Ratio (SNR) experienced by the 0.1% percentile of the UEs with Root Mean Square Error (RMSE) of 0.05% with only 5 to 10 reports per second regardless of the number of UEs."}}
