{"id": "Uf5hiVXmR8", "cdate": 1640995200000, "mdate": 1668074100519, "content": {"title": "Learning the Dynamics of Visual Relational Reasoning via Reinforced Path Routing", "abstract": "Reasoning is a dynamic process. In cognitive theories, the dynamics of reasoning refers to reasoning states over time after successive state transitions. Modeling the cognitive dynamics is of utmost importance to simulate human reasoning capability. In this paper, we propose to learn the reasoning dynamics of visual relational reasoning by casting it as a path routing task. We present a reinforced path routing method that represents an input image via a structured visual graph and introduces a reinforcement learning based model to explore paths (sequences of nodes) over the graph based on an input sentence to infer reasoning results. By exploring such paths, the proposed method represents reasoning states clearly and characterizes state transitions explicitly to fully model the reasoning dynamics for accurate and transparent visual relational reasoning. Extensive experiments on referring expression comprehension and visual question answering demonstrate the effectiveness of our method."}}
{"id": "LzVSIwsz2Up", "cdate": 1640995200000, "mdate": 1683428051088, "content": {"title": "A Self-supervised Strategy for the Robustness of VQA Models", "abstract": "In visual question answering (VQA), most existing models suffer from language biases which make models not robust. Recently, many approaches have been proposed to alleviate language biases by generating samples for the VQA task. These methods require the model to distinguish original samples from synthetic samples, to ensure that the model fully understands two modalities of both visual and linguistic information rather than just predicts answers based on language biases. However, these models are still not sensitive enough to changes of key information in questions. To make full use of the key information in questions, we design a self-supervised strategy to make the nouns of questions be focused for enhancing the robustness of VQA models. Its auxiliary training process, predicting answers for synthetic samples generated by masking the last noun in questions, alleviates the negative influence of language biases. Experiments conducted on VQA-CP v2 and VQA v2 datasets show that our method achieves better results than other VQA models."}}
{"id": "EuynHP0yfs", "cdate": 1640995200000, "mdate": 1683428051090, "content": {"title": "Synthesizing Counterfactual Samples for Overcoming Moment Biases in Temporal Video Grounding", "abstract": "Moment bias is a critical issue in temporal video grounding (TVG), where models often exploit superficial correlations between language queries and moment locations as shortcuts to predict temporal boundaries. In this paper, we propose a model-agnostic counterfactual samples synthesizing method to overcome moment biases by endowing TVG models with sensitivity to linguistic and visual variations. The models with sensitivity sufficiently utilize linguistic information and focus on important video clips rather than fixed patterns, therefore are not dominated by moment biases. Specifically, we synthesize counterfactual samples by masking important words in queries or deleting important frames in videos for training TVG models. During training, we penalize the model if it makes similar predictions on counterfactual samples and original samples to encourage the model to perceive linguistic and visual variations. Experiment results on two datasets (i.e., Charades-CD and ActivityNet-CD) demonstrate the effectiveness of our method."}}
{"id": "-GoaAh3lPSw", "cdate": 1609459200000, "mdate": 1668046539152, "content": {"title": "Partial tracking method based on siamese network", "abstract": "Robust object tracking is still a challenging task in the field of computer vision and has application value in many fields such as automatic driving, human–computer interaction and robot visual navigation. More and more researchers are devoted to researching more accurate object tracking methods. How to better deal with occlusion and deformation has always been the difficult challenges in the object tracking field, and the existing methods cannot solve these problems well. In this regard, we propose a novel, effective and portable module called part-based tracking and assembly (PTA), which is added to the fully convolutional siamese networks to divide the exemplar feature map into several parts. Each part is separately tracked, and then the tracking results of all parts are assembled to obtain the final tracking results. And the experiments on several popular tracking benchmarks show our variant trackers with the PTA module that operate at almost the same tracking speed with the original trackers and achieve superior tracking performance. Moreover, the tracking accuracy is significantly improved on the data with occlusion, deformation and background clutter. Compared with some real-time tracking methods, our variant trackers with the PTA module can achieve the state-of-the-art performance."}}
