{"id": "WkZexE69Cn", "cdate": 1672531200000, "mdate": 1693638537210, "content": {"title": "Instance-Aware Repeat Factor Sampling for Long-Tailed Object Detection", "abstract": "We propose an embarrassingly simple method -- instance-aware repeat factor sampling (IRFS) to address the problem of imbalanced data in long-tailed object detection. Imbalanced datasets in real-world object detection often suffer from a large disparity in the number of instances for each class. To improve the generalization performance of object detection models on rare classes, various data sampling techniques have been proposed. Repeat factor sampling (RFS) has shown promise due to its simplicity and effectiveness. Despite its efficiency, RFS completely neglects the instance counts and solely relies on the image count during re-sampling process. However, instance count may immensely vary for different classes with similar image counts. Such variation highlights the importance of both image and instance for addressing the long-tail distributions. Thus, we propose IRFS which unifies instance and image counts for the re-sampling process to be aware of different perspectives of the imbalance in long-tailed datasets. Our method shows promising results on the challenging LVIS v1.0 benchmark dataset over various architectures and backbones, demonstrating their effectiveness in improving the performance of object detection models on rare classes with a relative $+50\\%$ average precision (AP) improvement over counterpart RFS. IRFS can serve as a strong baseline and be easily incorporated into existing long-tailed frameworks."}}
{"id": "vWulDw3YrC", "cdate": 1640995200000, "mdate": 1681689817923, "content": {"title": "Object Detection for Autonomous Dozers", "abstract": "We introduce a new type of autonomous vehicle - an autonomous dozer that is expected to complete construction site tasks in an efficient, robust, and safe manner. To better handle the path planning for the dozer and ensure construction site safety, object detection plays one of the most critical components among perception tasks. In this work, we first collect the construction site data by driving around our dozers. Then we analyze the data thoroughly to understand its distribution. Finally, two well-known object detection models are trained, and their performances are benchmarked with a wide range of training strategies and hyperparameters."}}
{"id": "TdlOc1ekXrW", "cdate": 1640995200000, "mdate": 1681689817911, "content": {"title": "PseudoProp: Robust Pseudo-Label Generation for Semi-Supervised Object Detection in Autonomous Driving Systems", "abstract": "Semi-supervised object detection methods are widely used in autonomous driving systems, where only a fraction of objects are labeled. To propagate information from the labeled objects to the unlabeled ones, pseudo-labels for unlabeled objects must be generated. Although pseudo-labels have proven to improve the performance of semi-supervised object detection significantly, the applications of image-based methods to video frames result in numerous miss or false detections using such generated pseudo-labels. In this paper, we propose a new approach, Pseudo-Prop, to generate robust pseudo-labels by leveraging motion continuity in video frames. Specifically, PseudoProp uses a novel bidirectional pseudo-label propagation approach to compensate for misdetection. A feature-based fusion technique is also used to suppress inference noise. Extensive experiments on the large-scale Cityscapes dataset demonstrate that our method outperforms the state-of-the-art semi-supervised object detection methods by 7.4% on mAP <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">75</sup> ."}}
{"id": "BOO4w83Vz79", "cdate": 1640995200000, "mdate": 1648671823337, "content": {"title": "PseudoProp: Robust Pseudo-Label Generation for Semi-Supervised Object Detection in Autonomous Driving Systems", "abstract": "Semi-supervised object detection methods are widely used in autonomous driving systems, where only a fraction of objects are labeled. To propagate information from the labeled objects to the unlabeled ones, pseudo-labels for unlabeled objects must be generated. Although pseudo-labels have proven to improve the performance of semi-supervised object detection significantly, the applications of image-based methods to video frames result in numerous miss or false detections using such generated pseudo-labels. In this paper, we propose a new approach, PseudoProp, to generate robust pseudo-labels by leveraging motion continuity in video frames. Specifically, PseudoProp uses a novel bidirectional pseudo-label propagation approach to compensate for misdetection. A feature-based fusion technique is also used to suppress inference noise. Extensive experiments on the large-scale Cityscapes dataset demonstrate that our method outperforms the state-of-the-art semi-supervised object detection methods by 7.4% on mAP75."}}
{"id": "qtsK-kL3k8", "cdate": 1577836800000, "mdate": 1681689818010, "content": {"title": "DA-cGAN: A Framework for Indoor Radio Design Using a Dimension-Aware Conditional Generative Adversarial Network", "abstract": "A novel \"physics-free\" approach of designing indoor radio dot layout for a floor plan is introduced by formulating it as an image-to-image translation problem and solved with customized dimension-aware conditional generative adversarial networks (DA-cGANs). The proposed model generates a desirable radio heatmap and its respective radio dot layout from a given floor plan with wall types, physical dimension, and macro-cell interference, by learning from the accumulated indoor radio designs by human experts. Considering the nature of radio propagation, two new loss functions and a two-stage training strategy are proposed for the generator to learn the right direction of signal propagation and precise dot locations, in addition to a sectional analysis for dealing with large floor plans. Experimental results show that the new model is effectively generating acceptable dot layout designs and that dimension-awareness is a key enabler for this type of prediction."}}
{"id": "XH24wjohkLq", "cdate": 1483228800000, "mdate": 1681689818032, "content": {"title": "Joint transmission and cooperative spectrum sensing scheduling optimization in multi-channel dynamic spectrum access networks", "abstract": "Dynamic spectrum access (DSA) for secondary networks has the potential to improve spectrum utilization and thus mitigate the problem of spectrum scarcity by finding spectrum opportunities and exploiting them efficiently. A key factor in DSA networks with multiple channels and multiple users is to establish efficient spectrum sensing and transmission schedules. Multi-user cooperative spectrum sensing reduces the sensing time, thus increasing transmission throughput. At the same time, it may remove transmission opportunities for users participating in the sensing, thereby decreasing the throughput. Furthermore, in a multi-channel network, where the users experience different channel qualities, the problem of designing optimal sensing and transmission schedules becomes more complex. Sensing schedule indicates to each user the channel that it must sense at different sensing moments, and transmission schedules indicates which user should use a found opportunity. In this paper, we explore this problem and then investigate optimal ways to find a joint sensing and transmission schedule. We propose three joint sensing-transmission strategies. Within each one of them, several solutions striking a balance between throughput performance, memory usage, and computational complexity are proposed. Due to the complex nature of optimal solutions, we also propose different heuristics. Simulation results show that the proposed heuristics perform well and thus can be employed in practical scenarios."}}
{"id": "O63iPHzc8DC", "cdate": 1451606400000, "mdate": 1681689817979, "content": {"title": "Traffic-aware backoff design for IEEE 802.11(ac)", "abstract": ""}}
{"id": "6SnfXk4eDa", "cdate": 1451606400000, "mdate": 1681689817987, "content": {"title": "Robust Cooperative Spectrum Sensing Scheduling Optimization in Multi-Channel Dynamic Spectrum Access Networks", "abstract": ""}}
{"id": "zh7n0GVimKX", "cdate": 1420070400000, "mdate": 1681689818006, "content": {"title": "Prediction of Erlang-2 Distributed Primary User Traffic for Dynamic Spectrum Access", "abstract": ""}}
{"id": "k1pYPGAPTF", "cdate": 1420070400000, "mdate": 1681689817990, "content": {"title": "Traffic-Aware Spectrum Sharing Protocols", "abstract": "Author(s): Liu, Chun-Hao | Advisor(s): Cabric, Danijela | Abstract: Current radio frequency (RF) spectrum is shown to be highly underutilized in both spatial and temporal domain. One potential solution to improve the spectrum utilization is through cognitive radio (CR). Traditional CR approach adopts the sense-and-transmit strategy to exploit more transmission opportunities. After CR senses the RF channel, it will utilize this channel as long as it is not occupied by licensed users. However, there are some limitations using this approach. First, if the licensed users appear while CR is transmitting on the same channel, the collision occurs. Second, if the licensed users stop transmitting and CR does not detect this opportunity, the throughput loss occurs.In this dissertation, we focus on studying the statistical properties of the licensed channel bands, and explore the approaches to exploit the traﬃc knowledge to improve the traditional CR strategy. The statistical knowledge of the busy/idle period on the licensed channel allows CR to switch to better channels to increase throughput. To this end, our goal is to develop traﬃc-aware spectrum sharing protocols. As a ﬁrst step, we proposed a traﬃc classiﬁer to classify the distribution for the idle/busy period using less number of observations and extended to the cases where there is no perfect knowledge of traﬃc parameters and periods. We also proposed a traﬃc prediction algorithm based on Markov chain derivation and estimated traﬃc parameters, and we analyzed the impact of estimation errors on the prediction accuracy. Based on this result, we furtherdesigned spectrum sharing protocols with multi-channel sensing strategies for CRusers. The CR users are scheduled for their transmission and cooperative sensingstrategies in order to achieve maximal user throughput. We proposed to solvethe scheduling optimization problem with four low-complexity strategies, i.e.,sequential, parallel, sequential-parallel, and iterative-parallel sensing strategies.The optimal sensing order for sequential strategy was derived, and we also pro-posed several heuristics to further reduce the computation complexity for otherstrategies. Furthermore, this protocol is designed to be robust to both channeland traﬃc uncertainties."}}
