{"id": "Vv2ywummifp", "cdate": 1640995200000, "mdate": 1707379353841, "content": {"title": "Fundamental Limits of Personalized Federated Linear Regression with Data Heterogeneity", "abstract": "Federated learning is a nascent framework for collaborative machine learning over networks of devices with local data and local model updates. Data heterogeneity across the devices is one of the challenges confronting this emerging field. Personalization is a natural approach to simultaneously utilize information from the other users’ data and take data heterogeneity into account. In this work, we study the linear regression problem where the data across users are generated from different regression vectors. We present an information-theoretic lower bound of the minimax expected excess risk of personalized linear models. We show an upper bound that matches the lower bound within constant factors. The results characterize the effect of data heterogeneity on learning performance and the trade-off between sample size, problem difficulty, and distribution discrepancy, suggesting that the discrepancy-to-difficulty ratio is the key factor governing the effectiveness of heterogeneous data."}}
{"id": "Grf3cpFde5", "cdate": 1546300800000, "mdate": 1707379353858, "content": {"title": "An Exponentially Growing Nubot System Without State Changes", "abstract": "Self-assembly is the process in which simple units assemble into complex structures without explicit external control. The nubot model was proposed to describe self-assembly systems involving active components capable of changing internal states and moving relative to each other. A major difference between the nubot model and many previous self-assembly models is its ability to perform exponential growth. Several previous works focused on restricting the nubot model while preserving exponential growth. In this work, we construct a nubot system which performs exponential growth without any state changes. All nubots stay in fixed internal states throughout the growth process. This construction not only improves the previous optimal construction, but also demonstrates new trade-offs between different types of rules in the nubot system."}}
