{"id": "KtDdr1zUE_1", "cdate": 1652737784205, "mdate": null, "content": {"title": "Capturing Graphs with Hypo-Elliptic Diffusions", "abstract": "Convolutional layers within graph neural networks operate by aggregating information about local neighbourhood structures; one common way to encode such substructures is through random walks. The distribution of these random walks evolves according to a diffusion equation defined using the graph Laplacian. We extend this approach by leveraging classic mathematical results about hypo-elliptic diffusions. This results in a novel tensor-valued graph operator, which we call the hypo-elliptic graph Laplacian. We provide theoretical guarantees and efficient low-rank approximation algorithms. In particular, this gives a structured approach to capture long-range dependencies on graphs that is robust to pooling. Besides the attractive theoretical properties, our experiments show that this method competes with graph transformers on datasets requiring long-range reasoning but scales only linearly in the number of edges as opposed to quadratically in nodes."}}
{"id": "dx4b7lm8jMM", "cdate": 1601308373116, "mdate": null, "content": {"title": "Seq2Tens: An Efficient Representation of Sequences by Low-Rank Tensor Projections", "abstract": "Sequential data such as time series, video, or text can be challenging to analyse as the ordered structure gives rise to complex dependencies. At the heart of this is non-commutativity, in the sense that reordering the elements of a sequence can completely change its meaning. We use a classical mathematical object -- the free algebra -- to capture this non-commutativity. To address the innate computational complexity of this algebra, we use compositions of low-rank tensor projections. This yields modular and scalable building blocks that give state-of-the-art performance on standard benchmarks such as multivariate time series classification, mortality prediction and generative models for video."}}
{"id": "ZVMMW6_niDh", "cdate": 1577836800000, "mdate": null, "content": {"title": "Bayesian Learning from Sequential Data using Gaussian Processes with Signature Covariances", "abstract": "We develop a Bayesian approach to learning from sequential data by using Gaussian processes (GPs) with so-called signature kernels as covariance functions. This allows to make sequences of differen..."}}
