{"id": "awYcp2Nof48", "cdate": 1672531200000, "mdate": 1696014495974, "content": {"title": "Dialect and Variant Identification as a Multi-Label Classification Task: A Proposal Based on Near-Duplicate Analysis", "abstract": ""}}
{"id": "GET9NET_q1A", "cdate": 1640995200000, "mdate": 1687965058389, "content": {"title": "Refining an Almost Clean Translation Memory Helps Machine Translation", "abstract": "Shivendra Bhardwa, David Alfonso-Hermelo, Philippe Langlais, Gabriel Bernier-Colborne, Cyril Goutte, Michel Simard. Proceedings of the 15th biennial conference of the Association for Machine Translation in the Americas (Volume 1: Research Track). 2022."}}
{"id": "ChyjB6fc2H", "cdate": 1624406706440, "mdate": 1624406706440, "content": {"title": "On the learning curve attrition bias in additive factor modeling", "abstract": "Learning curves are a crucial tool to accurately measure learners skills and give meaningful feedback in intelligent tutoring systems. Here we discuss various ways of building learning curves from empirical data for the Additive Factor model (AFM) and highlight their limitations. We focus on the impact of student attrition, a.k.a. attrition bias. We propose a new way to build learning curves, by combining empirical observations and AFM predictions. We validate this proposition on simulated data, and test it on real datasets."}}
{"id": "-6RT43aMil3", "cdate": 1624405750223, "mdate": 1624405750223, "content": {"title": "Accurate semantic textual similarity for cleaning noisy parallel corpora using semantic machine translation evaluation metric: The NRC supervised submissions to the Parallel Corpus Filtering task", "abstract": "We present our semantic textual similarity ap- proach in filtering a noisy web crawled paral- lel corpus using YiSi—a novel semantic ma- chine translation evaluation metric. The sys- tems mainly based on this supervised approach perform well in the WMT18 Parallel Corpus Filtering shared task (4th place in 100-million- word evaluation, 8th place in 10-million-word evaluation, and 6th place overall, out of 48 submissions). In fact, our best performing system—NRC-yisi-bicov is one of the only four submissions ranked top 10 in both evaluations. Our submitted systems also in- clude some initial filtering steps for scaling down the size of the test corpus and a fi- nal redundancy removal step for better seman- tic and token coverage of the filtered corpus. In this paper, we also describe our unsuc- cessful attempt in automatically synthesizing a noisy parallel development corpus for tuning the weights to combine different parallelism and fluency features."}}
{"id": "SXTCqkRp4tq", "cdate": 1609459200000, "mdate": 1639941846837, "content": {"title": "N-gram and Neural Models for Uralic Language Identification: NRC at VarDial 2021", "abstract": "Gabriel Bernier-Colborne, Serge Leger, Cyril Goutte. Proceedings of the Eighth Workshop on NLP for Similar Languages, Varieties and Dialects. 2021."}}
{"id": "NsneIajYHhg", "cdate": 1609459200000, "mdate": 1639941933986, "content": {"title": "N-gram and Neural Models for Uralic Language Identification: NRC at VarDial 2021", "abstract": "Gabriel Bernier-Colborne, Serge Leger, Cyril Goutte. Proceedings of the Eighth Workshop on NLP for Similar Languages, Varieties and Dialects. 2021."}}
{"id": "cI2LWA0eBy8", "cdate": 1595426919757, "mdate": null, "content": {"title": "Improving Cuneiform Language Identification with BERT", "abstract": "We describe the systems developed by the National Research Council Canada for the Cuneiform Language Identification (CLI) shared task at the 2019 VarDial evaluation campaign. We compare a state-of-the-art baseline relying on character n-grams and a traditional statistical classifier, a voting ensemble of classifiers, and a deep learning approach using a Transformer network. We describe how these systems were trained, and analyze the impact of some preprocessing and model estimation decisions. The deep neural network achieved 77% accuracy on the test data, which turned out to be the best performance at the CLI evaluation, establishing a new state-of-the-art for cuneiform language identification."}}
{"id": "gszlJnWgr5o", "cdate": 1577836800000, "mdate": 1639941843421, "content": {"title": "Challenges in Neural Language Identification: NRC at VarDial 2020", "abstract": "Gabriel Bernier-Colborne, Cyril Goutte. Proceedings of the 7th Workshop on NLP for Similar Languages, Varieties and Dialects. 2020."}}
{"id": "YqReOxrDc7w", "cdate": 1577836800000, "mdate": 1636735374589, "content": {"title": "Human or Neural Translation?", "abstract": "Shivendra Bhardwaj, David Alfonso Hermelo, Phillippe Langlais, Gabriel Bernier-Colborne, Cyril Goutte, Michel Simard. Proceedings of the 28th International Conference on Computational Linguistics. 2020."}}
{"id": "PRXlniWah3U", "cdate": 1577836800000, "mdate": 1639941848517, "content": {"title": "Confident Learning Curves in Additive Factor Modeling", "abstract": ""}}
