{"id": "EM6fUEj2Ny3", "cdate": 1577836800000, "mdate": null, "content": {"title": "Multiview learning for understanding functional multiomics", "abstract": "The molecular mechanisms and functions in complex biological systems currently remain elusive. Recent high-throughput techniques, such as next-generation sequencing, have generated a wide variety of multiomics datasets that enable the identification of biological functions and mechanisms via multiple facets. However, integrating these large-scale multiomics data and discovering functional insights are, nevertheless, challenging tasks. To address these challenges, machine learning has been broadly applied to analyze multiomics. This review introduces multiview learning—an emerging machine learning field—and envisions its potentially powerful applications to multiomics. In particular, multiview learning is more effective than previous integrative methods for learning data’s heterogeneity and revealing cross-talk patterns. Although it has been applied to various contexts, such as computer vision and speech recognition, multiview learning has not yet been widely applied to biological data—specifically, multiomics data. Therefore, this paper firstly reviews recent multiview learning methods and unifies them in a framework called multiview empirical risk minimization (MV-ERM). We further discuss the potential applications of each method to multiomics, including genomics, transcriptomics, and epigenomics, in an aim to discover the functional and mechanistic interpretations across omics. Secondly, we explore possible applications to different biological systems, including human diseases (e.g., brain disorders and cancers), plants, and single-cell analysis, and discuss both the benefits and caveats of using multiview learning to discover the molecular mechanisms and functions of these systems."}}
{"id": "sTwEz_UXT6", "cdate": 1514764800000, "mdate": null, "content": {"title": "Multiple-Swarm Ensembles: Improving the Predictive Power and Robustness of Predictive Models and Its Use in Computational Biology", "abstract": "Machine learning is an integral part of computational biology, and has already shown its use in various applications, such as prognostic tests. In the last few years in the non-biological machine learning community, ensembling techniques have shown their power in data mining competitions such as the Netflix challenge; however, such methods have not found wide use in computational biology. In this work, we endeavor to show how ensembling techniques can be applied to practical problems, including problems in the field of bioinformatics, and how they often outperform other machine learning techniques in both predictive power and robustness. Furthermore, we develop a methodology of ensembling, Multi-Swarm Ensemble (MSWE) by using multiple particle swarm optimizations and demonstrate its ability to further enhance the performance of ensembles."}}
{"id": "pIn25mBtuT", "cdate": 1514764800000, "mdate": null, "content": {"title": "A Manifold Learning Based Approach to Reveal the Functional Linkages across Multiple Gene Networks", "abstract": "The coordination of functional genomics is a critical and complex process in biological systems, especially across different phenotypes or organism states (e.g., time, disease, organism). Understanding how the interactions of various genomic functions relate to these states remains a challenge. To address this, we have developed a machine learning method, ManiNetCluster, which integrates and simultaneously clusters multiple gene networks to identify cross-phenotype functional gene modules, revealing the genomic functional linkages. Particularly, this method extended the manifold learning to match local and nonlinear structures among networks for maximizing the functional connectivities. For example, we showed that ManiNetCluster significantly better aligns orthologous genes from cross-species gene expression datasets than the linear state-of-art methods. As a demonstration, we have applied our method to temporal gene co-expression networks of an algal day/night cycling transcriptome. This demonstration confirmed i) the validity of our clustering method, and ii) revealed the day-night linkages of photosynthetic functions, providing novel insights of temporal genomic functional coordination in bioproduction."}}
{"id": "5_7IqLE8gT2", "cdate": 1514764800000, "mdate": null, "content": {"title": "Interpretable Machine Learning Approach Reveals Developmental Gene Expression Biomarkers for Cancer Patient Outcomes at Early Stages", "abstract": "Understanding the molecular mechanisms underlying early cancer development is still a challenge. To address this, we developed an interpretable, data-driven machine learning approach to identify the gene biomarkers that predict the clinical outcomes of early cancer patients. As a demonstration, we applied this approach into large-scale pan-cancer datasets including TCGA to find out how effective it would be at identifying the developmental gene expression biomarkers across tumor stages for various cancer types. Results confirmed that artificial neural network prediction embedding nonlinear feature selection outperforms other classifiers. Moreover, and more relevant to the goal of machine learning interpretable classifiers, we found that early cancer patient groups clustered by the biomarkers selected have significantly more survival differences than ones by early TNM stages, suggesting that this method identified novel early cancer molecular biomarkers. Furthermore, using lung cancer as a study case, we leveraged the hierarchical architectures of neural network to identify the developmental regulatory networks controlling the expression of early cancer biomarkers, providing mechanistic insights of functional genomics driving the onset of cancer development. Finally, we reported the drugs targeting early cancer biomarkers, revealing potential genomic medicine affecting the early cancer development."}}
{"id": "0tbZXVFE5Mo", "cdate": 1451606400000, "mdate": null, "content": {"title": "DREISS: Using State-Space Models to Infer the Dynamics of Gene Expression Driven by External and Internal Regulatory Networks", "abstract": "Author Summary The dynamics of a biological system can be controlled by its own internal mechanisms and external perturbations. To gain intuition on this, we may draw a comparison with a mass hanging from a spring. The mass will move naturally by itself but its dynamics is also affected by one’s pulling it. That is, the dynamics of the mass is governed by the effect of the external perturbations superimposed on the internal mechanism of the spring (i.e. Hooke’s law). Similarly, given a group of genes, their temporal gene expression dynamics can be controlled by both transcription factors inside the group and external regulatory factors. Therefore, it is useful to identify the expression dynamics that are exclusively controlled by internal or external factors and compare them across various systems. While state-space models have been widely used to decouple the internal and external effects in physical systems, such as the mass and spring, typical biological systems do not have enough time samples to infer all the model’s parameters, and applications of state-space models were not very effective in these instances. Hence, we developed a general-purpose computational method by integrating state-space models and dimensionality reduction to identify temporal gene expression patterns driven by internal and external regulatory networks. We applied our method to the embryonic developmental datasets in the worm and fly (and also in a human cancer context). We successfully identified the temporal expression dynamics of cross-species conserved genes that were driven by conserved and species-specific regulatory networks."}}
{"id": "NDcM4XRJR20", "cdate": 1420070400000, "mdate": null, "content": {"title": "Loregic: A Method to Characterize the Cooperative Logic of Regulatory Factors", "abstract": "Author Summary Gene expression is controlled by various gene regulatory factors. Those factors work cooperatively forming a complex regulatory circuit genome wide. Corruptions of regulatory cooperativity may lead to abnormal gene expression activity such as cancer. Traditional experimental methods, however, can only identify small-scale regulatory activity. Thus, to systematically understand the cooperativity between and among different types of regulatory factors, we need the efficient and systematic computational methods. Regulatory circuits have been suggested to behave analogously to the electronic circuits in which a wide variety of electronic elements work coordinately to function correctly. Recently, an increasing amount of next generation sequencing data provides a great resource to study regulatory activity. Thus, we developed a general-purpose computational method using logic-circuit models from electronics and applied it to a human leukemia dataset, identifying the genome-wide cooperativity of transcription factors and microRNAs."}}
{"id": "4cc6yymvzwz", "cdate": 1388534400000, "mdate": null, "content": {"title": "Comparative analysis of regulatory information and circuits across distant species Open", "abstract": "A map of genome-wide binding locations of 165 human, 93 worm and 52 fly transcription-regulatory factors (almost 50% presented for the first time) from diverse cell types, developmental stages, or conditions reveals that gene-regulatory properties previously observed for individual factors may be general principles of metazoan regulation that are well preserved."}}
{"id": "ciu3mOdaeR0", "cdate": 1356998400000, "mdate": null, "content": {"title": "Comparative network analysis of gene co-expression networks reveals the conserved and species-specific functions of cell-wall related genes between Arabidopsis and Poplar", "abstract": "In this study, we established a computational framework of comparative network analysis to identify the conserved and species-specific functions of cell-wall (CW) related genes [1, 2], an important gene family related to plant bio-fuel productions across multiple tissue types between Arabidopsis and Poplar. The co-expressed genes are believed to coordinate in transcription so that they may have similar functions [3, 4]. Also, a comparative analysis across species for gene co-expression networks (GCNs) provides a systematic way to understand genomic conserved or species-specific functions [5]. Therefore, to understand the functions of CW genes in different tissue types, we integrated and compared the network characteristics of CW genes across GCNs from different tissue types including leaf, flower and shoot for Arabidopsis and Poplar [6]. First, by aligning the gene co-expression sub-networks associated with CW genes between two plants for each tissue type, we grouped the tissue types based on the alignment of the CW genes along with their neighboring orthologous genes. For those tissues with good alignments, it suggests that CW genes coordinate in a similar way for both plants, which may have involved in the conserved functions. For the tissues with poor alignments, however, CW genes may take part in species-specific functions. The gene ontology enrichment and signaling pathways of their co-expressed neighboring genes were identified to provide new insight for cell wall biology. Second, since the genes with high network centralities of a GCN, so called \"hub\" genes, are believed to have key functions [7], we investigated the network centralities for the CW genes between two plants to understand their functions in a global network point of view. The network centralities of GCN that we used are clustering coefficient (CC) for measuring gene's local cliqueness, and eigenvector centrality (EC) for measuring gene's global influence over the entire network. Besides finding hub genes for each tissue type within and across two plants, we also identified the conserved hub genes and tissue-specific hub genes in either local or global fashion. The CW genes that happen to become hub were particularly of interest to study. If many CW genes are global hubs in certain tissues, it implies that cell wall related activities may interact with the whole plant in those tissues, but if local hubs, they may coordinate with certain local activities only. Finally, we used the genomic variation data to identify the species-specific SNPs, especially in the promoter regions of the CW co-expressed neighboring genes across tissues, and associate them with corresponding species-specific functions. In summary, our comparative network analysis framework studied gene co-expression networks for the cell wall related genes across different tissue types in Arabidopsis and Poplar, and identified their conserved and species-specific functions and variations. This framework can also be used to study other gene families along with their functions across multiple species."}}
{"id": "weUnqnIxh9t", "cdate": 1325376000000, "mdate": null, "content": {"title": "Eigen-Genomic System Dynamic-Pattern Analysis (ESDA): Modeling mRNA Degradation and Self-Regulation", "abstract": "High-throughput methods systematically measure the internal state of the entire cell, but powerful computational tools are needed to infer dynamics from their raw data. Therefore, we have developed a new computational method, Eigen-genomic System Dynamic-pattern Analysis (ESDA), which uses systems theory to infer dynamic parameters from a time series of gene expression measurements. As many genes are measured at a modest number of time points, estimation of the system matrix is underdetermined and traditional approaches for estimating dynamic parameters are ineffective; thus, ESDA uses the principle of dimensionality reduction to overcome the data imbalance. Since degradation rates are naturally confounded by self-regulation, our model estimates an effective degradation rate that is the difference between self-regulation and degradation. We demonstrate that ESDA is able to recover effective degradation rates with reasonable accuracy in simulation. We also apply ESDA to a budding yeast data set, and find that effective degradation rates are normally slower than experimentally measured degradation rates. Our results suggest that either self-regulation is widespread in budding yeast and that self-promotion dominates self-inhibition, or that self-regulation may be rare and that experimental methods for measuring degradation rates based on transcription arrest may severely overestimate true degradation rates in healthy cells."}}
{"id": "As6FWWithL1", "cdate": 1199145600000, "mdate": null, "content": {"title": "Latch Modeling for Statistical Timing Analysis", "abstract": "Latch based circuits are widely adopted in high performance circuits. But there is a lack of accurate latch models for doing timing analysis. In this paper, we propose a new latch delay model in the context of SSTA based on a new perspective of latch timing. The proposed latch model also takes into account the external timing variations such as data slew. The new latch model is integrated into SSTA by considering the timing analysis of both the combinational logic network and the clock distribution network simultaneously. The experimental results show that ignoring accurate latch modeling may lead to large errors (e.g., 50% at PDF peak)."}}
