{"id": "GTde0BIHMGB", "cdate": 1652737546518, "mdate": null, "content": {"title": "Order-Invariant Cardinality Estimators Are Differentially Private", "abstract": "  We consider privacy in the context of streaming algorithms for cardinality estimation.\n    We show that a large class of algorithms all satisfy $\\epsilon$-differential privacy, \n    so long as (a) the algorithm is combined with a simple \n    down-sampling procedure, and (b) the input stream cardinality  \n    is $\\Omega(k/\\epsilon)$. Here, $k$ is a certain parameter of the sketch\n    that is always at most the sketch size in bits, but is typically much smaller.\n    We also show that, even with no modification, algorithms in our\n    class satisfy $(\\epsilon, \\delta)$-differential privacy,\n    where $\\delta$ falls exponentially with the stream cardinality. \n    Our analysis applies to essentially all popular cardinality estimation\n    algorithms, and substantially generalizes and tightens privacy bounds from earlier works. \n    Our approach is faster and exhibits a better utility-space\n    tradeoff than prior art."}}
{"id": "rJEJZDbdWr", "cdate": 1514764800000, "mdate": null, "content": {"title": "Optimal Subsampling with Influence Functions", "abstract": "Subsampling is a common and often effective method to deal with the computational challenges of large datasets. However, for most statistical models, there is no well-motivated approach for drawing a non-uniform subsample. We show that the concept of an asymptotically linear estimator and the associated influence function leads to asymptotically optimal sampling probabilities for a wide class of popular models. This is the only tight optimality result for subsampling we are aware of as other methods only provide probabilistic error bounds or optimal rates. Furthermore, for linear regression models, which have well-studied procedures for non-uniform subsampling, we empirically show our optimal influence function based method outperforms previous approaches even when using approximations to the optimal probabilities."}}
{"id": "Bk-P44ZdZB", "cdate": 1514764800000, "mdate": null, "content": {"title": "Count-Min: Optimal Estimation and Tight Error Bounds using Empirical Error Distributions", "abstract": "The Count-Min sketch is an important and well-studied data summarization method. It can estimate the count of any item in a stream using a small, fixed size data sketch. However, the accuracy of the Count-Min sketch depends on characteristics of the underlying data. This has led to a number of count estimation procedures which work well in one scenario but perform poorly in others. A practitioner is faced with two basic, unanswered questions. Given an estimate, what is its error? Which estimation procedure should be chosen when the data is unknown? We provide answers to these questions. We derive new count estimators, including a provably optimal estimator, which best or match previous estimators in all scenarios. We also provide practical, tight error bounds at query time for all estimators and methods to tune sketch parameters using these bounds. The key observation is that the full distribution of errors in each counter can be empirically estimated from the sketch itself. By first estimating this distribution, count estimation becomes a statistical estimation and inference problem with a known error distribution. This provides both a principled way to derive new and optimal estimators as well as a way to study the error and properties of existing estimators."}}
{"id": "B1VzTN-dbS", "cdate": 1451606400000, "mdate": null, "content": {"title": "Towards Optimal Cardinality Estimation of Unions and Intersections with Sketches", "abstract": "Estimating the cardinality of unions and intersections of sets is a problem of interest in OLAP. Large data applications often require the use of approximate methods based on small sketches of the data. We give new estimators for the cardinality of unions and intersection and show they approximate an optimal estimation procedure. These estimators enable the improved accuracy of the streaming MinCount sketch to be exploited in distributed settings. Both theoretical and empirical results demonstrate substantial improvements over existing methods."}}
{"id": "ByE6sVWubH", "cdate": 1388534400000, "mdate": null, "content": {"title": "Streamed approximate counting of distinct elements: beating optimal batch methods", "abstract": "Counting the number of distinct elements in a large dataset is a common task in web applications and databases. This problem is difficult in limited memory settings where storing a large hash table table is intractable. This paper advances the state of the art in probabilistic methods for estimating the number of distinct elements in a streaming setting New streaming algorithms are given that provably beat the \"optimal\" errors for Min-count and HyperLogLog while using the same sketch. This paper also contributes to the understanding and theory of probabilistic cardinality estimation introducing the concept of an area cutting process and the martingale estimator. These ideas lead to theoretical analyses of both old and new sketches and estimators and show the new estimators are optimal for several streaming settings while also providing accurate error bounds that match those obtained via simulation. Furthermore, the area cutting process provides a geometric intuition behind all methods for counting distinct elements which are not affected by duplicates. This intuition leads to a new sketch, Discrete Max-count, and the analysis of a class of sketches, self-similar area cutting decompositions that have attractive properties and unbiased estimators for both streaming and non-streaming settings. Together, these contributions lead to multi-faceted advances in sketch construction, cardinality and error estimation, the theory, and intuition for the problem of approximate counting of distinct elements for both the streaming and non-streaming cases."}}
{"id": "Hy-24j-dWr", "cdate": 1262304000000, "mdate": null, "content": {"title": "An Analysis of the Convergence of Graph Laplacians", "abstract": "Existing approaches to analyzing the asymptotics of graph Laplacians typically assume a well-behaved kernel function with smoothness assumptions. We remove the smoothness assumption and generalize the analysis of graph Laplacians to include previously unstudied graphs including kNN graphs. We also introduce a kernel-free framework to analyze graph constructions with shrinking neighborhoods in general and apply it to analyze locally linear embedding (LLE). We also describe how, for a given limit operator, desirable properties such as a convergent spectrum and sparseness can be achieved by choosing the appropriate graph construction."}}
