{"id": "b8SwOxZQ2kj", "cdate": 1675970196685, "mdate": null, "content": {"title": "PDEBENCH: AN EXTENSIVE BENCHMARK FOR SCI- ENTIFIC MACHINE LEARNING", "abstract": "Despite some impressive progress in machine learning-based modeling of physical systems, there is still a lack of benchmarks for Scientific ML that are easy to use yet challenging and representative of a wide range of problems. We introduce PDEBENCH, a benchmark suite of time-dependent simulation tasks based on Partial Differential Equations (PDEs). PDEBENCH comprises both code and\ndata to benchmark the performance of novel machine learning models against classical numerical simulations and ML baselines. Our proposed set of benchmark problems contribute the following features: (1) A much wider range of PDEs compared to existing benchmarks, ranging from relatively common examples to more realistic problems; (2) much larger ready-to-use datasets compared to prior work, comprising multiple simulation runs across a large number of initial and boundary conditions and PDE parameters; (3) more extensible source codes with user-friendly APIs for data generation and obtaining baselines of popular machine learning models (FNO, U-Net, PINN, Gradient-Based Inverse Method).\nPDEBENCH allows users to extend the benchmark freely for their own purposes using a standardized API and to compare the performance of new models to existing baseline methods. We also propose new evaluation metrics in order to provide a more holistic understanding of model performance in the context of Scientific ML."}}
{"id": "dh_MkX0QfrK", "cdate": 1654269541432, "mdate": null, "content": {"title": "PDEBench: An Extensive Benchmark for Scientific Machine Learning", "abstract": "Machine learning-based modeling of physical systems has experienced increased interest in recent years. Despite some impressive progress, there is still a lack of benchmarks for Scientific ML that are easy to use but still challenging and repre- sentative of a wide range of problems. We introduce PDEBENCH, a benchmark suite of time-dependent simulation tasks based on Partial Differential Equations (PDEs). PDEBENCH comprises both code and data to benchmark the performance of novel machine learning models against both classical numerical simulations and machine learning baselines. Our proposed set of benchmark problems con- tribute the following unique features: (1) A much wider range of PDEs compared to existing benchmarks, ranging from relatively common examples to more real- istic and difficult problems; (2) much larger ready-to-use datasets compared to prior work, comprising multiple simulation runs across a larger number of ini- tial and boundary conditions and PDE parameters; (3) more extensible source codes with user-friendly APIs for data generation and baseline results with popular machine learning models (FNO, U-Net, PINN, Gradient-Based Inverse Method). PDEBENCH allows researchers to extend the benchmark freely for their own pur- poses using a standardized API and to compare the performance of new models to existing baseline methods. We also propose new evaluation metrics with the aim to provide a more holistic understanding of learning methods in the context of Scientific ML. With those metrics we identify tasks which are challenging for recent ML methods and propose these tasks as future challenges for the community. The code is available at https://github.com/pdebench/PDEBench."}}
{"id": "bD6M9oZo77d", "cdate": 1640995200000, "mdate": 1682492621562, "content": {"title": "PDEBENCH: An Extensive Benchmark for Scientific Machine Learning", "abstract": "Machine learning-based modeling of physical systems has experienced increased interest in recent years. Despite some impressive progress, there is still a lack of benchmarks for Scientific ML that are easy to use but still challenging and representative of a wide range of problems. We introduce PDEBench, a benchmark suite of time-dependent simulation tasks based on Partial Differential Equations (PDEs). PDEBench comprises both code and data to benchmark the performance of novel machine learning models against both classical numerical simulations and machine learning baselines. Our proposed set of benchmark problems contribute the following unique features: (1) A much wider range of PDEs compared to existing benchmarks, ranging from relatively common examples to more realistic and difficult problems; (2) much larger ready-to-use datasets compared to prior work, comprising multiple simulation runs across a larger number of initial and boundary conditions and PDE parameters; (3) more extensible source codes with user-friendly APIs for data generation and baseline results with popular machine learning models (FNO, U-Net, PINN, Gradient-Based Inverse Method). PDEBench allows researchers to extend the benchmark freely for their own purposes using a standardized API and to compare the performance of new models to existing baseline methods. We also propose new evaluation metrics with the aim to provide a more holistic understanding of learning methods in the context of Scientific ML. With those metrics we identify tasks which are challenging for recent ML methods and propose these tasks as future challenges for the community. The code is available at https://github.com/pdebench/PDEBench."}}
{"id": "MEwSy1l9q3", "cdate": 1640995200000, "mdate": 1682492602411, "content": {"title": "Bayesian Physics Informed Neural Networks for Data Assimilation and Spatio-Temporal Modelling of Wildfires", "abstract": "We apply the Physics Informed Neural Network (PINN) to the problem of wildfire fire-front modelling. We use the PINN to solve the level-set equation, which is a partial differential equation that models a fire-front through the zero-level-set of a level-set function. The result is a PINN that simulates a fire-front as it propagates through the spatio-temporal domain. We show that popular optimisation cost functions used in the literature can result in PINNs that fail to maintain temporal continuity in modelled fire-fronts when there are extreme changes in exogenous forcing variables such as wind direction. We thus propose novel additions to the optimisation cost function that improves temporal continuity under these extreme changes. Furthermore, we develop an approach to perform data assimilation within the PINN such that the PINN predictions are drawn towards observations of the fire-front. Finally, we incorporate our novel approaches into a Bayesian PINN (B-PINN) to provide uncertainty quantification in the fire-front predictions. This is significant as the standard solver, the level-set method, does not naturally offer the capability for data assimilation and uncertainty quantification. Our results show that, with our novel approaches, the B-PINN can produce accurate predictions with high quality uncertainty quantification on real-world data."}}
{"id": "JmKcViL_U7", "cdate": 1577836800000, "mdate": 1682492602410, "content": {"title": "A Universal Splitting Estimator for the Performance Evaluation of Wireless Communications Systems", "abstract": "We propose a unified rare-event estimator for the performance evaluation of wireless communication systems. The estimator is derived from the well-known multilevel splitting algorithm. In its original form, the splitting algorithm cannot be applied to the simulation and estimation of time-independent problems, because splitting requires an underlying continuous-time Markov process whose trajectories can be split. We tackle this problem by embedding the static problem of interest within a continuous-time Markov process, so that the target time-independent distribution becomes the distribution of the Markov process at a given time instant. The main feature of the proposed multilevel splitting algorithm is its large scope of applicability. For illustration, we show how the same algorithm can be applied to the problem of estimating the cumulative distribution function (CDF) of sums of random variables (RVs), the CDF of partial sums of ordered RVs, the CDF of ratios of RVs, and the CDF of weighted sums of Poisson RVs. We investigate the computational efficiency of the proposed estimator via a number of simulation studies and find that it compares favorably with existing estimators."}}
{"id": "Z7KZ_kth9qS", "cdate": 1546300800000, "mdate": 1682321809742, "content": {"title": "Fast and accurate computation of the distribution of sums of dependent log-normals", "abstract": ""}}
{"id": "XFsWqy0v2a", "cdate": 1546300800000, "mdate": 1682492602402, "content": {"title": "A Universal Splitting Estimator for the Performance Evaluation of Wireless Communications Systems", "abstract": "We propose a unified rare-event estimator for the performance evaluation of wireless communication systems. The estimator is derived from the well-known multilevel splitting algorithm. In its original form, the splitting algorithm cannot be applied to the simulation and estimation of time-independent problems, because splitting requires an underlying continuous-time Markov process whose trajectories can be split. We tackle this problem by embedding the static problem of interest within a continuous-time Markov process, so that the target time-independent distribution becomes the distribution of the Markov process at a given time instant. The main feature of the proposed multilevel splitting algorithm is its large scope of applicability. For illustration, we show how the same algorithm can be applied to the problem of estimating the cumulative distribution function (CDF) of sums of random variables (RVs), the CDF of partial sums of ordered RVs, the CDF of ratios of RVs, and the CDF of weighted sums of Poisson RVs. We investigate the computational efficiency of the proposed estimator via a number of simulation studies and find that it compares favorably with existing estimators."}}
{"id": "WKPIhgrFvPs", "cdate": 1546300800000, "mdate": 1682492602405, "content": {"title": "Mosaic Style Transfer Using Sparse Autocorrelograms", "abstract": ""}}
{"id": "ywO7qw2-j-", "cdate": 1483228800000, "mdate": 1682492602403, "content": {"title": "Logarithmically efficient estimation of the tail of the multivariate normal distribution", "abstract": "Simulation from the tail of the multivariate normal density has numerous applications in statistics and operations research. Unfortunately, there is no simple formula for the cumulative distribution function of the multivariate normal law, and simulation from its tail can frequently only be approximate. In this article we present an asymptotically efficient Monte Carlo estimator for quantities related to the tail of the multivariate normal distribution. The estimator leverages upon known asymptotic approximations. In addition, we generalize the notion of asymptotic efficiency of Monte Carlo estimators of rare-event probabilities to the sampling properties of Markov chain Monte Carlo algorithms. Regarding these new notions, we propose a simple and practical Markov chain sampler for the normal tail that is asymptotically optimal. We then give a numerical example from finance that illustrates the benefits of an asymptotically efficient Markov chain Monte Carlo sampler."}}
