{"id": "x7NeRoNktf", "cdate": 1672531200000, "mdate": 1680082795403, "content": {"title": "Where and How to Improve Graph-based Spatio-temporal Predictors", "abstract": ""}}
{"id": "tZCHQYwvLy", "cdate": 1672531200000, "mdate": 1695970175560, "content": {"title": "A Survey on Graph Neural Networks for Time Series: Forecasting, Classification, Imputation, and Anomaly Detection", "abstract": "Time series are the primary data type used to record dynamic system measurements and generated in great volume by both physical sensors and online processes (virtual sensors). Time series analytics is therefore crucial to unlocking the wealth of information implicit in available data. With the recent advancements in graph neural networks (GNNs), there has been a surge in GNN-based approaches for time series analysis. These approaches can explicitly model inter-temporal and inter-variable relationships, which traditional and other deep neural network-based methods struggle to do. In this survey, we provide a comprehensive review of graph neural networks for time series analysis (GNN4TS), encompassing four fundamental dimensions: forecasting, classification, anomaly detection, and imputation. Our aim is to guide designers and practitioners to understand, build applications, and advance research of GNN4TS. At first, we provide a comprehensive task-oriented taxonomy of GNN4TS. Then, we present and discuss representative research works and introduce mainstream applications of GNN4TS. A comprehensive discussion of potential future research directions completes the survey. This survey, for the first time, brings together a vast array of knowledge on GNN-based time series research, highlighting foundations, practical applications, and opportunities of graph neural networks for time series analysis."}}
{"id": "g3gGg-y1vaM", "cdate": 1672531200000, "mdate": 1680082795411, "content": {"title": "Graph Kalman Filters", "abstract": ""}}
{"id": "RLZ9RimH7yt", "cdate": 1672531200000, "mdate": 1680082795408, "content": {"title": "Taming Local Effects in Graph-based Spatiotemporal Forecasting", "abstract": ""}}
{"id": "Pia3bdjKNau", "cdate": 1672531200000, "mdate": 1680082795436, "content": {"title": "Graph state-space models", "abstract": ""}}
{"id": "SFeKNSxect", "cdate": 1652737527270, "mdate": null, "content": {"title": "AZ-whiteness test: a test for signal uncorrelation on spatio-temporal graphs", "abstract": "We present the first whiteness hypothesis test for graphs, i.e., a whiteness test for multivariate time series associated with the nodes of a dynamic graph; as such, the test represents an important model assessment tool for graph deep learning, e.g., in forecasting setups. The statistical test aims at detecting existing serial dependencies among close-in-time observations, as well as spatial dependencies among neighboring observations given the underlying graph. The proposed AZ-test can be intended as a spatio-temporal extension of traditional tests designed for system identification to graph signals. The AZ-test is versatile, allowing the underlying graph to be dynamic, changing in topology and set of nodes over time, and weighted, thus accounting for connections of different strength, as it is the case in many application scenarios like sensor and transportation networks. The asymptotic distribution of the designed test can be derived under the null hypothesis without assuming identically distributed data. We show the effectiveness of the test on both synthetic and real-world problems, and illustrate how it can be employed to assess the quality of spatio-temporal forecasting models by analyzing the prediction residuals appended to the graph stream."}}
{"id": "n78r0bUftU9", "cdate": 1640995200000, "mdate": 1655812529793, "content": {"title": "Sparse Graph Learning for Spatiotemporal Time Series", "abstract": "Outstanding achievements of graph neural networks for spatiotemporal time series prediction show that relational constraints introduce a positive inductive bias into neural forecasting architectures. Often, however, the relational information characterizing the underlying data generating process is unavailable; the practitioner is then left with the problem of inferring from data which relational graph to use in the subsequent processing stages. We propose novel, principled -- yet practical -- probabilistic methods that learn the relational dependencies by modeling distributions over graphs while maximizing, at the same time, end-to-end the forecasting accuracy. Our novel graph learning approach, based on consolidated variance reduction techniques for Monte Carlo score-based gradient estimation, is theoretically grounded and effective. We show that tailoring the gradient estimators to the graph learning problem allows us also for achieving state-of-the-art forecasting performance while controlling, at the same time, both the sparsity of the learned graph and the computational burden. We empirically assess the effectiveness of the proposed method on synthetic and real-world benchmarks, showing that the proposed solution can be used as a stand-alone graph identification procedure as well as a learned component of an end-to-end forecasting architecture."}}
{"id": "lt_ybnfQW9t", "cdate": 1640995200000, "mdate": 1680082795410, "content": {"title": "AZ-whiteness test: a test for uncorrelated noise on spatio-temporal graphs", "abstract": ""}}
{"id": "kKAAbzRpmU", "cdate": 1640995200000, "mdate": 1680082820461, "content": {"title": "Graph iForest: Isolation of anomalous and outlier graphs", "abstract": ""}}
{"id": "izVP2QEnje4", "cdate": 1640995200000, "mdate": 1695970175557, "content": {"title": "AZ-whiteness test: a test for signal uncorrelation on spatio-temporal graphs", "abstract": "We present the first whiteness hypothesis test for graphs, i.e., a whiteness test for multivariate time series associated with the nodes of a dynamic graph; as such, the test represents an important model assessment tool for graph deep learning, e.g., in forecasting setups. The statistical test aims at detecting existing serial dependencies among close-in-time observations, as well as spatial dependencies among neighboring observations given the underlying graph. The proposed AZ-test can be intended as a spatio-temporal extension of traditional tests designed for system identification to graph signals. The AZ-test is versatile, allowing the underlying graph to be dynamic, changing in topology and set of nodes over time, and weighted, thus accounting for connections of different strength, as it is the case in many application scenarios like sensor and transportation networks. The asymptotic distribution of the designed test can be derived under the null hypothesis without assuming identically distributed data. We show the effectiveness of the test on both synthetic and real-world problems, and illustrate how it can be employed to assess the quality of spatio-temporal forecasting models by analyzing the prediction residuals appended to the graph stream."}}
