{"id": "IM4Iwo58T4M", "cdate": 1663850349679, "mdate": null, "content": {"title": "TOWARDS AN OBJECTIVE EVALUATION OF THE TRUSTWORTHINESS OF CLASSIFIERS", "abstract": "With the widespread deployment of AI models in applications that impact human lives, research on model trustworthiness has become increasingly important, as a result of which model effectiveness alone (measured, e.g., with accuracy, F1, etc.) should not be the only criteria to evaluate predictive models; additionally the trustworthiness of these models should also be factored in. It has been argued that the features deemed important by a black-box model should be aligned with the human perception of the data, which in turn, should contribute to increasing the trustworthiness of a model. Existing research in XAI evaluates such alignments with user studies - the limitations being that these studies are subjective, difficult to reproduce, and consumes a large amount of time to conduct. We propose an evaluation framework, which provides a quantitative measure for trustworthiness of a black-box model, and hence, we are able to provide a fair comparison between a number of different black-box models. Our framework is applicable to both text and images, and our experiment results show that a model with a higher accuracy does not necessarily exhibit better trustworthiness."}}
{"id": "_NlE9YiyXKb", "cdate": 1663850025944, "mdate": null, "content": {"title": "Tessellated Neural Networks: A Robust Defence against Adversarial Attacks", "abstract": " Data-driven deep learning approaches for image classification are prone to adversarial attacks. An adversarial image which is sufficiently close (visually indistinguishable) from a true image of its representative class can often be misclassified to be a member of a different class. It is possible for attackers to exploit the high dimensionality of image representations, as learned by the neural models, to identify adversarial perturbations. To mitigate this problem, we propose a novel divide-and-conquer based approach of tessellating a base network architecture (e.g., a ResNet used in our experiments). The tessellated network learns the parameterized representations of each non-overlapping sub-region or tiles within an image, independently, and then learns how to combine these representations to finally estimate the class of the input image. We investigate two different modes of tessellation, namely periodic, comprised of regular square-shaped tiles, and aperiodic, comprised of rectangles of different dimensions. Experiments demonstrate that the tessellated extension of two standard deep neural models leads to a better defence against a number of standard adversarial attacks. We observed that the decrease in post-attack accuracy values relative to the accuracy of the uncompromised networks is smaller for our proposed tessellated approach. "}}
{"id": "LtI14EpWKH", "cdate": 1632875647734, "mdate": null, "content": {"title": "Tessellated 2D Convolution Networks: A Robust Defence against Adversarial Attacks", "abstract": "Data-driven (deep) learning approaches for image classification are prone to adversarial attacks. This means that an adversarial crafted image which is sufficiently close (visually indistinguishable) to its representative class can often be misclassified to be a member of a different class. A reason why deep neural approaches exhibits such vulnerability towards adversarial threats is mainly because the abstract representations learned in a data-driven manner often do not correlate well with human perceived features. To mitigate this problem, we propose the tessellated 2d convolution network, a novel divide-and-conquer based approach, which first independently learns the abstract representations of non-overlapping regions within an image, and then learns how to combine these representations to infer its class. It turns out that a non-uniform tiling of an image which ensures that the difference between the maximum and the minimum region sizes is not too large is the most robust way to construct such a tessellated 2d convolution network. This criterion can be achieved, among other schemes, by using a Mondrian tessellation of the input image. Our experiments demonstrate that our tessellated networks provides a more robust defence mechanism against gradient-based adversarial attacks in comparison to conventional deep neural models."}}
{"id": "H1gQY64FwB", "cdate": 1569439099312, "mdate": null, "content": {"title": "COMMUNITY PRESERVING NODE EMBEDDING", "abstract": "Detecting communities or the modular structure of real-life networks (e.g. a social\nnetwork or a product purchase network) is an important task because the way a\nnetwork functions is often determined by its communities.\nThe traditional approaches to community detection involve modularity-based approaches,\nwhich generally speaking, construct partitions based on heuristics that\nseek to maximize the ratio of the edges within the partitions to those between\nthem. Node embedding approaches, which represent each node in a graph as a\nreal-valued vector, transform the problem of community detection in a graph to\nthat of clustering a set of vectors. Existing node embedding approaches are primarily\nbased on first initiating uniform random walks from each node to construct\na context of a node and then seeks to make the vector representation of\nthe node close to its context. However, standard node embedding approaches do\nnot directly take into account the community structure of a network while constructing\nthe context around each node. To alleviate this, we explore two different\nthreads of work. First, we investigate the use of biased random walks (specifically,\nmaximum entropy based walks) to obtain more centrality preserving embedding\nof nodes, which we hypothesize may lead to more effective clusters in the embedded\nspace. Second, we propose a community structure aware node embedding\napproach where we incorporate modularity-based partitioning heuristics into\nthe objective function of node embedding. We demonstrate that our proposed approach\nfor community detection outperforms a number of modularity-based baselines\nas well as K-means on a standard node-embedded vector space (specifically,\nnode2vec) on a wide range of real-life networks of different sizes and densities."}}
