{"id": "kd4abXkbiBp", "cdate": 1640995200000, "mdate": 1682328911874, "content": {"title": "DyREx: Dynamic Query Representation for Extractive Question Answering", "abstract": "Extractive question answering (ExQA) is an essential task for Natural Language Processing. The dominant approach to ExQA is one that represents the input sequence tokens (question and passage) with a pre-trained transformer, then uses two learned query vectors to compute distributions over the start and end answer span positions. These query vectors lack the context of the inputs, which can be a bottleneck for the model performance. To address this problem, we propose \\textit{DyREx}, a generalization of the \\textit{vanilla} approach where we dynamically compute query vectors given the input, using an attention mechanism through transformer layers. Empirical observations demonstrate that our approach consistently improves the performance over the standard one. The code and accompanying files for running the experiments are available at \\url{https://github.com/urchade/DyReX}."}}
{"id": "poUQ1VvIuRW", "cdate": 1609459200000, "mdate": 1627113260707, "content": {"title": "Implementing a Detection System for COVID-19 based on Lung Ultrasound Imaging and Deep Learning", "abstract": "The COVID-19 pandemic started in China in December 2019 and quickly spread to several countries. The consequences of this pandemic are incalculable, causing the death of millions of people and damaging the global economy. To achieve large-scale control of this pandemic, fast tools for detection and treatment of patients are needed. Thus, the demand for alternative tools for the diagnosis of COVID-19 has increased dramatically since accurated and automated tools are not available. In this paper we present the ongoing work on a system for COVID-19 detection using ultrasound imaging and using Deep Learning techniques. Furthermore, such a system is implemented on a Raspberry Pi to make it portable and easy to use in remote regions without an Internet connection."}}
{"id": "Pyw_g33568", "cdate": 1609459200000, "mdate": 1627113260703, "content": {"title": "Detection of COVID-19 Disease using Deep Neural Networks with Ultrasound Imaging", "abstract": "The new coronavirus 2019 (COVID-2019) has rapidly become a pandemic and has had a devastating effect on both everyday life, public health and the global economy. It is critical to detect positive cases as early as possible to prevent the further spread of this epidemic and to treat affected patients quickly. The need for auxiliary diagnostic tools has increased as accurate automated tool kits are not available. This paper presents a work in progress that proposes the analysis of images of lung ultrasound scans using a convolutional neural network. The trained model will be used on a Raspberry Pi to predict on new images."}}
{"id": "5Ant1Mhbep5", "cdate": 1609459200000, "mdate": 1627113260650, "content": {"title": "Prediction of Tuberculosis using U-Net and segmentation techniques", "abstract": "One of the most serious public health problems in Peru and worldwide is Tuberculosis (TB), which is produced by a bacterium known as Mycobacterium tuberculosis. The purpose of this work is to facilitate and automate the diagnosis of tuberculosis using the MODS method and using lens-free microscopy, as it is easier to calibrate and easier to use by untrained personnel compared to lens microscopy. Therefore, we employed a U-Net network on our collected data set to perform automatic segmentation of cord shape bacterial accumulation and then predict tuberculosis. Our results show promising evidence for automatic segmentation of TB cords, and thus good accuracy for TB prediction."}}
{"id": "gAJr__daG4A", "cdate": 1577836800000, "mdate": 1627113260705, "content": {"title": "A Convolutional Neural Network for gaze preference detection: A potential tool for diagnostics of autism spectrum disorder in children", "abstract": "Early diagnosis of autism spectrum disorder (ASD) is known to improve the quality of life of affected individuals. However, diagnosis is often delayed even in wealthier countries including the US, largely due to the fact that gold standard diagnostic tools such as the Autism Diagnostic Observation Schedule (ADOS) and the Autism Diagnostic Interview-Revised (ADI-R) are time consuming and require expertise to administer. This trend is even more pronounced lower resources settings due to a lack of trained experts. As a result, alternative, less technical methods that leverage the unique ways in which children with ASD react to visual stimulation in a controlled environment have been developed to help facilitate early diagnosis. Previous studies have shown that, when exposed to a video that presents both social and abstract scenes side by side, a child with ASD will focus their attention towards the abstract images on the screen to a greater extent than a child without ASD. Such differential responses make it possible to implement an algorithm for the rapid diagnosis of ASD based on eye tracking against different visual stimuli. Here we propose a convolutional neural network (CNN) algorithm for gaze prediction using images extracted from a one-minute stimulus video. Our model achieved a high accuracy rate and robustness for prediction of gaze direction with independent persons and employing a different camera than the one used during testing. In addition to this, the proposed algorithm achieves a fast response time, providing a near real-time evaluation of ASD. Thereby, by applying the proposed method, we could significantly reduce the diagnosis time and facilitate the diagnosis of ASD in low resource regions."}}
{"id": "Tj0e_aJ3XrO", "cdate": 1577836800000, "mdate": 1627113260702, "content": {"title": "Using Capsule Neural Network to predict Tuberculosis in lens-free microscopic images", "abstract": "Tuberculosis, caused by a bacteria called Mycobacterium tuberculosis, is one of the most serious public health problems worldwide. This work seeks to facilitate and automate the prediction of tuberculosis by the MODS method and using lens-free microscopy, which is easy to use by untrained personnel. We employ the CapsNet architecture in our collected dataset and show that it has a better accuracy than traditional CNN architectures."}}
{"id": "CfKUduI7wOs", "cdate": 1577836800000, "mdate": 1627113260816, "content": {"title": "Automatic semantic segmentation for prediction of tuberculosis using lens-free microscopy images", "abstract": "Tuberculosis (TB), caused by a germ called Mycobacterium tuberculosis, is one of the most serious public health problems in Peru and the world. The development of this project seeks to facilitate and automate the diagnosis of tuberculosis by the MODS method and using lens-free microscopy, due they are easier to calibrate and easier to use (by untrained personnel) in comparison with lens microscopy. Thus, we employ a U-Net network in our collected dataset to perform the automatic segmentation of the TB cords in order to predict tuberculosis. Our initial results show promising evidence for automatic segmentation of TB cords."}}
{"id": "brLohzhjT1", "cdate": 1546300800000, "mdate": 1627113260693, "content": {"title": "Portable system for the prediction of anemia based on the ocular conjunctiva using Artificial Intelligence", "abstract": "Anemia is a major health burden worldwide. Examining the hemoglobin level of blood is an important way to achieve the diagnosis of anemia, but it requires blood drawing and a blood test. In this work we propose a non-invasive, fast, and cost-effective screening test for iron-deficiency anemia in Peruvian young children. Our initial results show promising evidence for detecting conjunctival pallor anemia and Artificial Intelligence techniques with photos taken with a popular smartphone."}}
{"id": "IvizP5ssT8-", "cdate": 1546300800000, "mdate": 1627113260650, "content": {"title": "Development of a hand pose recognition system on an embedded computer using CNNs", "abstract": "Demand of hand pose recognition systems are growing in the last years in technologies like human-machine interfaces. This work suggests an approach for hand pose recognition in embedded computers using hand tracking and CNNs. Results show a fast time response with an accuracy of 94.50% and low power consumption."}}
{"id": "GlveheQCeun", "cdate": 1546300800000, "mdate": 1627113260692, "content": {"title": "Development of a Hand Gesture Based Control Interface Using Deep Learning", "abstract": "This paper describes the implementation of a control system based on ten different hand gestures, providing a useful approach for the implementation of better user-friendly human-machine interfaces. Hand detection is achieved using fast detection and tracking algorithms, and classification by a light convolutional neural network. The experimental results show a real-time response with an accuracy of 95.09%, and making use of low power consumption. These results demonstrate that the proposed system could be applied in a large range of applications such as virtual reality, robotics, autonomous driving systems, human-machine interfaces, augmented reality among others."}}
