{"id": "YSh_ViPc8G", "cdate": 1683645313483, "mdate": null, "content": {"title": "Closed-Loop Tactile Controller for Tool Manipulation", "abstract": "In this paper, we present closed-loop control of a complex manipulation task where a robot uses a tool to interact with objects. Manipulation using a tool leads to complex kinematics and contact constraints that need to be satisfied for generating feasible manipulation trajectories. We first present an open-loop controller design using Non-Linear Programming (NLP) that satisfies these constraints. In order to design a closed-loop controller, we present a pose estimator of objects and tools using tactile sensors. Using our tactile estimator, we design a closed-loop controller based on Model Predictive Control (MPC). The proposed algorithm is verified using a 6 DoF manipulator on tasks using a variety of objects and tools. We verify that our closed-loop controller can successfully perform tool manipulation under several unexpected contacts. All hardware experiment videos could be found at $\\href{https://youtu.be/VsClK04qDhk}{https://youtu.be/VsClK04qDhk}$."}}
{"id": "MJ6TINinro", "cdate": 1683645313294, "mdate": null, "content": {"title": "STOCS: Simultaneous Trajectory Optimization and Contact Selection for Contact-Rich Manipulation", "abstract": "Contact-implicit trajectory optimization is an effective method to plan complex trajectories for various contact-rich systems including manipulation and locomotion. These methods formulate contact as complementarity constraints and require solving a mathematical program with complementarity constraints (MPCC). However, MPCC solve times increase steeply with the number of variables and complementarity constraints, which limits their applicability to problems with low geometric complexity. This paper introduces the simultaneous trajectory optimization and contact selection (STOCS) method that embeds the detection of salient contact points and contact times inside trajectory optimization. Because the number of active contact points is usually small, this approach minimize the number of MPCC variables and constraints, which makes solving manipulation trajectories for objects with complex, non-convex geometry computationally tractable. The proposed approach is validated on a pivoting problem in simulation and on a 6 DoF manipulator arm."}}
{"id": "rglgNeUak5", "cdate": 1645203496102, "mdate": null, "content": {"title": "Learning robot motor skills with mixed reality", "abstract": "Mixed Reality (MR) has recently shown great success as an intuitive interface for enabling end-users to teach robots. Related works have used MR interfaces to communicate robot intents and beliefs to a co-located human, as well as developed algorithms for taking multi-modal human input and learning complex motor behaviors. Even with these successes, enabling end-users to teach robots complex motor tasks still poses a challenge because end-user communication is highly task dependent and world knowledge is highly varied. We propose a learning framework where end-users teach robots a) motion demonstrations, b) task constraints, c) planning representations, and d) object information, all of which are integrated into a single motor skill learning framework based on Dynamic Movement Primitives (DMPs). We hypothesize that conveying this world knowledge will be intuitive with an MR interface, and that a sample-efficient motor skill learning framework which incorporates varied modalities of world knowledge will enable robots to effectively solve complex tasks."}}
{"id": "AZup6dwugb", "cdate": 1601061940096, "mdate": null, "content": {"title": "Local Policy Optimization for Trajectory-Centric Reinforcement Learning", "abstract": "The goal of this paper is to present a method for simultaneous trajectory and local stabilizing policy optimization to generate local policies for trajectory-centric model-based reinforcement learning (MBRL). This is motivated by the fact that global policy optimization for non-linear systems could be a very challenging problem both algorithmically and numerically. However, a lot of robotic manipulation tasks are trajectory-centric, and thus do not require a global model or policy. Due to inaccuracies in the learned model estimates, an open-loop trajectory optimization process mostly results in very poor performance when used on the real system. Motivated by these problems, we try to formulate the problem of trajectory optimization and local policy synthesis as a single optimization problem. It is then solved simultaneously as an instance of nonlinear programming. We provide some results for analysis as well as achieved performance of the proposed technique under some simplifying assumptions."}}
{"id": "ryNYBi-u-r", "cdate": 1546300800000, "mdate": null, "content": {"title": "Game Theoretic Optimization via Gradient-based Nikaido-Isoda Function", "abstract": "Computing Nash equilibrium (NE) of multi-player games has witnessed renewed interest due to recent advances in generative adversarial networks. However, computing equilibrium efficiently is challen..."}}
