{"id": "vaUuBg_u8Kr", "cdate": 1681660532231, "mdate": 1681660532231, "content": {"title": "Deterministic particle flows for constraining SDEs", "abstract": "Devising optimal interventions for diffusive systems often requires the solution of the Hamilton-Jacobi-Bellman (HJB) equation, a nonlinear backward partial differential equation (PDE), that is, in general, nontrivial to solve. Existing control methods either tackle the HJB directly with grid-based PDE solvers, or resort to iterative stochastic path sampling to obtain the necessary controls. Here, we present a framework that interpolates between these two approaches. By reformulating the optimal interventions in terms of logarithmic gradients ( scores ) of two forward probability flows, and by employing deterministic particle methods for solving Fokker-Planck equations, we introduce a novel fully deterministic framework that computes the required optimal interventions in one shot. "}}
{"id": "XxvqaacU9IE", "cdate": 1681659949081, "mdate": null, "content": {"title": "Inferring Network Connectivity from Event Timing Patterns", "abstract": "Reconstructing network connectivity from the collective dynamics of a system typically requires access to its complete continuous-time evolution, although these are often experimentally inaccessible. Here we propose a theory for revealing physical connectivity of networked systems only from the event time series their intrinsic collective dynamics generate. Representing the patterns of event timings in an event space spanned by interevent and cross-event intervals, we reveal which other units directly influence the interevent times of any given unit. For illustration, we linearize an event-space mapping constructed from the spiking patterns in model neural circuits to reveal the presence or absence of synapses between any pair of neurons, as well as whether the coupling acts in an inhibiting or activating (excitatory) manner. The proposed model-independent reconstruction theory is scalable to larger networks and may thus play an important role in the reconstruction of networks from biology to social science and engineering.\n\nKeywords: network reconstruction, nonlinear dynamics, spiking neurons, collective dynamics, neuronal dynamics, topological tools"}}
{"id": "oVmoAVSVsDZ", "cdate": 1681659333408, "mdate": null, "content": {"title": "Deterministic particle flows for constraining stochastic nonlinear systems", "abstract": "Devising optimal interventions for constraining stochastic systems is a challenging endeavor that has to confront the interplay between randomness and dynamical nonlinearity. Existing intervention methods that employ stochastic path sampling scale poorly with increasing system dimension and are slow to converge. Here we propose a generally applicable and practically feasible methodology that computes the optimal interventions in a noniterative scheme. We formulate the optimal dynamical adjustments in terms of deterministically sampled probability flows approximated by an interacting particle system. Applied to several biologically inspired models, we demonstrate that our method provides the necessary optimal controls in settings with terminal, transient, or generalized collective state constraints and arbitrary system dynamics.\n\nKeywords: stochastic control, stochastic dynamics, score functions, probability flow ODEs, particle filters, synchronisation control, stochastic Kuramoto oscillators"}}
{"id": "ppHJfYzL96", "cdate": 1675970199200, "mdate": null, "content": {"title": "Geometric constraints improve inference of sparsely observed stochastic dynamics", "abstract": "The dynamics of systems of many degrees of freedom evolving on multiple scales are often modeled in terms of stochastic differential equations. Usually the structural form of these equations is unknown and the only manifestation of the system's dynamics are observations at discrete points in time. Despite their widespread use, accurately inferring these systems from sparse-in-time observations remains challenging. Conventional inference methods either focus on the temporal structure of observations, neglecting the geometry of the system's invariant density, or use geometric approximations of the invariant density, which are limited to conservative driving forces. To address these limitations, here, we introduce a novel approach that reconciles these two perspectives. We propose a path augmentation scheme that employs data-driven control to account for the geometry of the invariant system's density. Non-parametric inference on the augmented paths, enables efficient identification of the underlying deterministic forces of systems observed at low sampling rates.\n"}}
{"id": "3vWXhXtMYE", "cdate": 1675944374587, "mdate": 1675944374587, "content": {"title": "Geometric path augmentation for inference of sparsely observed stochastic nonlinear systems", "abstract": "Stochastic evolution equations describing the dynamics of systems under the influence of both deterministic and stochastic forces are prevalent in all fields of science. Yet, identifying these systems from sparse-in-time observations remains still a challenging endeavour. Existing approaches focus either on the temporal structure of the observations by relying on conditional expectations, discarding thereby information ingrained in the geometry of the system's invariant density; or employ geometric approximations of the invariant density, which are nevertheless restricted to systems with conservative forces. Here we propose a method that reconciles these two paradigms. We introduce a new data-driven path augmentation scheme that takes the local observation geometry into account. By employing non-parametric inference on the augmented paths, we can efficiently identify the deterministic driving forces of the underlying system for systems observed at low sampling rates."}}
{"id": "zgJXEJDqKP", "cdate": 1672531200000, "mdate": 1681658303738, "content": {"title": "Geometric path augmentation for inference of sparsely observed stochastic nonlinear systems", "abstract": "Stochastic evolution equations describing the dynamics of systems under the influence of both deterministic and stochastic forces are prevalent in all fields of science. Yet, identifying these systems from sparse-in-time observations remains still a challenging endeavour. Existing approaches focus either on the temporal structure of the observations by relying on conditional expectations, discarding thereby information ingrained in the geometry of the system's invariant density; or employ geometric approximations of the invariant density, which are nevertheless restricted to systems with conservative forces. Here we propose a method that reconciles these two paradigms. We introduce a new data-driven path augmentation scheme that takes the local observation geometry into account. By employing non-parametric inference on the augmented paths, we can efficiently identify the deterministic driving forces of the underlying system for systems observed at low sampling rates."}}
{"id": "XJ1NT4Om0Fv", "cdate": 1577836800000, "mdate": 1681658303755, "content": {"title": "Interacting Particle Solutions of Fokker-Planck Equations Through Gradient-Log-Density Estimation", "abstract": "Fokker–Planck equations are extensively employed in various scientific fields as they characterise the behaviour of stochastic systems at the level of probability density functions. Although broadly used, they allow for analytical treatment only in limited settings, and often it is inevitable to resort to numerical solutions. Here, we develop a computational approach for simulating the time evolution of Fokker–Planck solutions in terms of a mean field limit of an interacting particle system. The interactions between particles are determined by the gradient of the logarithm of the particle density, approximated here by a novel statistical estimator. The performance of our method shows promising results, with more accurate and less fluctuating statistics compared to direct stochastic simulations of comparable particle number. Taken together, our framework allows for effortless and reliable particle-based simulations of Fokker–Planck equations in low and moderate dimensions. The proposed gradient–log–density estimator is also of independent interest, for example, in the context of optimal control."}}
