{"id": "V4tObbttbxM", "cdate": 1634226114398, "mdate": 1634226114398, "content": {"title": "Cross-Lingual Disaster-related Multi-label Tweet Classification with Manifold Mixup", "abstract": "Distinguishing informative and actionable messages from a social media platform like Twitter is critical for facilitating disaster management. For this purpose, we compile a multilingual dataset of over 130K samples for multi-label classification of disaster-related tweets. We present a masking-based loss function for partially labelled samples and demonstrate the effectiveness of Manifold Mixup in the text domain. Our main model is based on Multilingual BERT, which we further improve with Manifold Mixup. We show that our model generalizes to unseen disasters in the test set. Furthermore, we analyze the capability of our model for zero-shot generalization to new languages. Our code, dataset, and other resources are available on Github."}}
{"id": "xYt95YYZzD", "cdate": 1609459200000, "mdate": 1665153118247, "content": {"title": "Using Content Analysis and Machine Learning to Identify COVID-19 Information Relevant to Low-income Households on Social Media", "abstract": "COVID-19 pandemic has caused great distress in the lives of many populations. Low-income households are among the most severely impacted groups in the United States and across the globe. Using social media, this paper aims to identify and organize the information about the impact of the pandemic on low-income households. We use content analysis to derive an annotation protocol and manually annotate a tweet dataset using this protocol. Furthermore, we use machine learning to learn models from the annotated dataset. We also employ a human-in-the-loop data augmentation procedure to improve the model’s performance for the underrepresented classes. Our results show that using carefully annotated data, automated machine learning models can be trained and employed to identify information relevant to low income households, potentially in real time."}}
{"id": "uapRHzsAY1", "cdate": 1609459200000, "mdate": 1665153118243, "content": {"title": "Disaster Image Classification Using Capsule Networks", "abstract": "When a disaster happens, affected individuals may use social media platforms, such as Twitter or Facebook, to ask for help or post information about the disaster. From a disaster response point of view, it is important to filter posts, in particular, text and images that provide situational awareness information, in a timely manner. For image classification, capsule networks have shown superiority over convolutional neural networks (CNN). Given their success in other application domains, in this study, we used capsule networks to classify disaster images as Informative or Non-informative. Using publicly available images collected from several disasters, we compared capsule network models with ResNet-18 models, for both in-domain and cross-domain settings. The results showed that the capsule network models had better performance for all the disaster datasets considered in the in-domain experiments, and also for most of the cross-domain pairs of disasters used in the study."}}
{"id": "fuWNHJ8dEOz", "cdate": 1609459200000, "mdate": 1665153118220, "content": {"title": "Stance Detection in COVID-19 Tweets", "abstract": "Kyle Glandt, Sarthak Khanal, Yingjie Li, Doina Caragea, Cornelia Caragea. Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers). 2021."}}
{"id": "IGyX_rQyTr", "cdate": 1609459200000, "mdate": 1665153118222, "content": {"title": "Multi-task Learning to Enable Location Mention Identification in the Early Hours of a Crisis Event", "abstract": ""}}
{"id": "nTfh8_H_n7", "cdate": 1578980459177, "mdate": null, "content": {"title": "Identifying Disaster Damage Images Using a Domain Adaptation Approach", "abstract": "Approaches for effectively filtering useful situational awareness information posted by eyewitnesses of disasters, in real time, are greatly needed. While many studies have focused on filtering textual information, the research on filtering disaster images is more limited. In particular, there are no studies on the applicability of domain adaptation to filter images from an emergent target disaster, when no labeled data is available for the target disaster. To fill in this gap, we propose to apply a domain adaptation approach, called domain adversarial neural networks (DANN), to the task of identifying images that show damage. The DANN approach has VGG-19 as its backbone, and uses the adversarial training to find a transformation that makes the source and target data indistinguishable. Experimental results on several pairs of disasters suggest that the DANN model generally gives similar or better results as compared to the VGG-19 model fine-tuned on the source labeled data."}}
{"id": "vYh0Xm5KOu3", "cdate": 1577836800000, "mdate": 1665153118222, "content": {"title": "On Identifying Hashtags in Disaster Twitter Data", "abstract": "Tweet hashtags have the potential to improve the search for information during disaster events. However, there is a large number of disaster-related tweets that do not have any user-provided hashtags. Moreover, only a small number of tweets that contain actionable hashtags are useful for disaster response. To facilitate progress on automatic identification (or extraction) of disaster hashtags for Twitter data, we construct a unique dataset of disaster-related tweets annotated with hashtags useful for filtering actionable information. Using this dataset, we further investigate Long Short-Term Memory-based models within a Multi-Task Learning framework. The best performing model achieves an F1-score as high as $92.22%$. The dataset, code, and other resources are available on Github.1"}}
{"id": "sk7WPimviwl", "cdate": 1577836800000, "mdate": 1665153118269, "content": {"title": "Using AI and Social Media Multimodal Content for Disaster Response and Management: Opportunities, Challenges, and Future Directions", "abstract": ""}}
{"id": "Ofr_m61qAO", "cdate": 1577836800000, "mdate": 1665153118222, "content": {"title": "Domain Adaptation with Reconstruction for Disaster Tweet Classification", "abstract": "Identifying critical information in real time in the beginning of a disaster is a challenging but important task. This task has been recently addressed using domain adaptation approaches, which eliminate the need for target labeled data, and can thus accelerate the process of identifying useful information. We propose to investigate the effectiveness of the Domain Reconstruction Classification Network (DRCN) approach on disaster tweets. DRCN adapts information from target data by reconstructing it with an autoencoder. Experimental results using a sequence-to-sequence autoencodershow that the DRCN approach can improve the performance of both supervised and domain adaptation baseline models."}}
{"id": "DJQlj5tOyv", "cdate": 1577836800000, "mdate": 1665153118223, "content": {"title": "Identifying FinTech Innovations Using BERT", "abstract": "Advancements in technology have resulted in the emergence of numerous FinTech innovations. However, a global understanding of such innovations is limited, due to a lack of an underlying taxonomy and benchmark datasets in the FinTech domain. To address this limitation, we develop a FinTech taxonomy and manually annotate a set of FinTech patent abstracts according to the taxonomy. We use the annotated dataset to train deep learning models, specifically recurrent neural networks and convolutional neural networks combined with state-of-the-art BERT transformers. Experimental results show that the deep learning models can accurately identify FinTech innovations. We use our best performing BERT-based model on a large dataset of financial patent abstracts, and shortlist a set of 25,580 FinTech patent applications submitted to the European and US Patent Offices between 2000 and 2017. We illustrate how an analysis of the shortlisted set can be used to gain understanding of what FinTech innovations are, where and when they emerge, and provide the basis for further work on what their impact is on the companies investing in them, and ultimately on society."}}
