{"id": "wV93TzZWPfF", "cdate": 1546300800000, "mdate": null, "content": {"title": "Second-order Time-Reassigned Synchrosqueezing Transform: Application to Draupner Wave Analysis.", "abstract": "This paper addresses the problem of efficiently jointly representing a non-stationary multicomponent signal in time and frequency. We introduce a novel enhancement of the time-reassigned synchrosqueezing method designed to compute sharpened and reversible representations of impulsive or strongly modulated signals. After establishing theoretical relations of the new proposed method with our previous results, we illustrate in numerical experiments the improvement brought by our proposal when applied on both synthetic and real-world signals. Our experiments deal with an analysis of the Draupner wave record for which we provide pioneered time-frequency analysis results."}}
{"id": "qKy9897j5mq", "cdate": 1546300800000, "mdate": null, "content": {"title": "Second-order Time-Reassigned Synchrosqueezing Transform: Application to Draupner Wave Analysis.", "abstract": "This paper addresses the problem of efficiently jointly representing a non-stationary multicomponent signal in time and frequency. We introduce a novel enhancement of the time-reassigned synchrosqueezing method designed to compute sharpened and reversible representations of impulsive or strongly modulated signals. After establishing theoretical relations of the new proposed method with our previous results, we illustrate in numerical experiments the improvement brought by our proposal when applied on both synthetic and real-world signals. Our experiments deal with an analysis of the Draupner wave record for which we provide pioneered time-frequency analysis results."}}
{"id": "MLlv6dxqJ9N", "cdate": 1546300800000, "mdate": null, "content": {"title": "Deep Learning Methods for MRI Brain Tumor Segmentation: a comparative study.", "abstract": "Brain tumor segmentation from MRI is an important task in biomedical image processing that can help specialists to predict diseases and to improve their diagnoses. Nowadays, most of the state-of-the-art techniques are based on deep learning neural networks for which the choice of the best architecture remains an open question. Hence, this paper aims at providing answers through an intensive and comprehensive comparison between several promising neural network architectures. Our study leads us to three approaches which are respectively based on 2D U-Net, 3D U-Net and cascaded neural networks, that are compared together and with another unsupervised technique based on k-mean clustering. We also consider several enhancement techniques such as data augmentation, curriculum learning and an original boosting method based on majority voting. We achieve to improve the results of the baseline methods in terms of Dice score when the suitable combination of techniques is used."}}
{"id": "y5B5kkMFUi", "cdate": 1514764800000, "mdate": null, "content": {"title": "Statistical assessment of abrupt change detectors for non-intrusive load monitoring.", "abstract": "Non-Intrusive Load Monitoring (NILM) is the process of monitoring Home Electrical Appliances (HEAs) from voltage and current measurements at the Point of Common Coupling (PCC). The resulting information can be useful to raise greater awareness among customers about their HEAs' usage for a more efficient energy behaviour. NILM methods can be roughly categorized into event-based and non event-based approaches, depending on whether or not they rely on the detection of HEAs' significant state transitions (e.g. On/Off or state change). In this paper, we focus on event-based methods and describe a test bench to statistically assess three abrupt change detectors. Then, we define several evaluation metrics for judging on performance and quality of the detection algorithms in order to carry out a comparison. Finally, the three abrupt change detectors are applied to real data coming from a scenario of HEAs switched on and off by hand."}}
{"id": "jRltwM5Z3TZ", "cdate": 1514764800000, "mdate": null, "content": {"title": "Single-Channel Blind Source Separation for Singing Voice Detection: A Comparative Study.", "abstract": "We propose a novel unsupervised singing voice detection method which use single-channel Blind Audio Source Separation (BASS) algorithm as a preliminary step. To reach this goal, we investigate three promising BASS approaches which operate through a morphological filtering of the analyzed mixture spectrogram. The contributions of this paper are manyfold. First, the investigated BASS methods are reworded with the same formalism and we investigate their respective hyperparameters by numerical simulations. Second, we propose an extension of the KAM method for which we propose a novel training algorithm used to compute a source-specific kernel from a given isolated source signal. Second, the BASS methods are compared together in terms of source separation accuracy and in terms of singing voice detection accuracy when they are used in our new singing voice detection framework. Finally, we do an exhaustive singing voice detection evaluation for which we compare both supervised and unsupervised singing voice detection methods. Our comparison explores different combination of the proposed BASS methods with new features such as the new proposed KAM features and the scattering transform through a machine learning framework and also considers convolutional neural networks methods."}}
{"id": "bJ1TQmhdpKA", "cdate": 1514764800000, "mdate": null, "content": {"title": "Local AM/FM Parameters Estimation: Application to Sinusoidal Modeling and Blind Audio Source Separation.", "abstract": "This letter extends our recently introduced method which was designed to estimate instantaneous frequency and chirp rate of linearly modulated signals. Indeed, we derive several new estimators related to our previous ones which provide in the time-frequency plane all the signal parameters of the investigated model: amplitude, frequency, and their local modulations (AM/FM). Our estimators are first introduced and compared in terms of statistical efficiency with theoretical bounds and with other state-of-the-art estimators. Then, they are used to improve spectral analysis applied to audio sinusoidal modeling. Finally, they lead to a new source separation technique based on coherent amplitude and frequency modulation that is evaluated on real-world music signals."}}
{"id": "RHylFzf9B3A", "cdate": 1514764800000, "mdate": null, "content": {"title": "Fast and Adaptive Blind Audio Source Separation Using Recursive Levenberg-Marquardt Synchrosqueezing.", "abstract": "This paper revisits the Degenerate Unmixing Estimation Technique (duet) for blind audio separation of an arbitrary number of sources given two mixtures through a recursively computed and adaptive time-frequency representation. Recently, synchrosqueezing was introduced as a promising signal disentangling method which allows to compute reversible and sharpen time-frequency representations. Thus, it can be used to reduce overlaps between the sources in the time-frequency plane and to improve the sources' sparsity which is often exploited by source separation techniques. Furthermore, synchrosqueezing can also be extended using the Levenberg-Marquardt algorithm to allow a user to adjust the energy concentration of a time-frequency representation which can be efficiently implemented without the FFT algorithm. Hence, we show that our approach can improve the quality of the source separation process while remaining suitable for real-time applications."}}
{"id": "D4H_Ffc2KQV", "cdate": 1514764800000, "mdate": null, "content": {"title": "The Sliding Singular Spectrum Analysis: A Data-Driven Nonstationary Signal Decomposition Tool.", "abstract": "Singular spectrum analysis (SSA) is a signal decomposition technique that aims at expanding signals into interpretable and physically meaningful components (e.g., sinusoids, noise, etc.). This paper presents new theoretical and practical results about the separability of the SSA and introduces a new method called sliding SSA. First, the SSA is combined with an unsupervised classification algorithm to provide a fully automatic data-driven component extraction method for which we investigate the limitations for components separation in a theoretical study. Second, the detailed automatic SSA method is used to design an approach based on a sliding analysis window, which provides better results than the classical SSA method when analyzing nonstationary signals with a time-varying number of components. Finally, the proposed sliding SSA method is compared to the empirical mode decomposition and to the synchrosqueezed short-time Fourier transform, applied on both synthetic and real-world signals."}}
{"id": "0sLaBv_iE1d", "cdate": 1514764800000, "mdate": null, "content": {"title": "A fast time-frequency multi-window analysis using a tuning directional kernel.", "abstract": "Highlights • Time-frequency analysis and detection, based on the chirplet transform. • Dedicated to non-stationary as well as multi-component signals. • Estimation of spectral energy, instantaneous frequency, spectral delay, and chirp rate. • Local fitting of the chirplet kernel over time. • Produce combined time-frequency distributions. Abstract In this paper, a novel approach for time-frequency analysis and detection, based on the chirplet transform and dedicated to non-stationary as well as multi-component signals, is presented. Its main purpose is the estimation of spectral energy, instantaneous frequency (IF), spectral delay (SD), and chirp rate (CR) with a high time-frequency resolution (separation ability) achieved by adaptive fitting of the transform kernel. We propose two efficient implementations of this idea, which allow to use the fast Fourier transform (FFT). In the first one, referred to as “self-tuning”, a previously proposed CR estimation is used for a local fitting of the chirplet kernel over time. For this purpose, we use the CR associated with the dominant (prominent) component. In the second one, we define a new measure for evaluating at each time-frequency point, how the used analyzing window is matched to the signal. This measure is defined as the absolute difference between the estimated CR and the CR parameter associated to the used analysis window. Our method is able to produce combined time-frequency distributions of the spectral energy, IF, SD, and CR. They are obtained using several classical chirplet transforms with analysis windows of various CRs. The compositions are made by finding the lowest fitting measure for every time-frequency points over all transforms. Finally, we assess the robustness of the methods by a detection application and time-frequency localization, both in the presence of high additive white Gaussian noise (additive white Gaussian noise (AWGN)) as well as we present many time-frequency (TF) images of synthetic and real-world signals. Previous article in issue Next article in issue"}}
{"id": "vd0wj-9e4XS", "cdate": 1483228800000, "mdate": null, "content": {"title": "Recursive versions of the reassigned scalogram anc of the synchrosqueezed wavelet transform.", "abstract": "This paper introduces a new class of mother wavelet functions, based on a specific analysis window which allows a recursive implementation of the Continuous Wavelet Transform (CWT). Using this new transform, we propose to compute a sharpened time-frequency representation by rewording the reassigned scalogram and the (first and second-order) synchrosqueezed CWT. We also propose an extension of the CWT reassignment operators, using the Levenberg-Marquardt algorithm, which can control the energy concentration of a reassigned scalogram through a damping parameter. Thus, our methods provide tools which pave the way of the real-time computation of reversible and almost-ideal time-frequency representations."}}
