{"id": "R0a0kFI3dJx", "cdate": 1601308249592, "mdate": null, "content": {"title": "Adaptive Extra-Gradient Methods for Min-Max Optimization and Games", "abstract": "We present a new family of min-max optimization algorithms that automatically exploit the geometry of the gradient data observed at earlier iterations to perform more informative extra-gradient steps in later ones.\nThanks to this adaptation mechanism, the proposed method automatically detects whether the problem is smooth or not, without requiring any prior tuning by the optimizer.\nAs a result, the algorithm simultaneously achieves order-optimal convergence rates, \\ie it  converges to an $\\varepsilon$-optimal solution within $\\mathcal{O}(1/\\varepsilon)$ iterations in smooth problems, and within $\\mathcal{O}(1/\\varepsilon^2)$ iterations in non-smooth ones. Importantly, these guarantees do not require any of the standard boundedness or Lipschitz continuity conditions that are typically assumed in the literature; in particular, they apply even to problems with singularities (such as resource allocation problems and the like). This adaptation is achieved through the use of a geometric apparatus based on Finsler metrics and a suitably chosen mirror-prox template that allows us to derive sharp convergence rates for the methods at hand."}}
{"id": "chBoZ1nFm6", "cdate": 1577836800000, "mdate": null, "content": {"title": "Man-in-the-Middle and Denial of Service Attacks in Wireless Secret Key Generation", "abstract": "Wireless secret key generation (W-SKG) from shared randomness (e.g., from the wireless channel fading realizations), is a well established scheme that can be used for session key agreement. W-SKG approaches can be of particular interest in delay constrained wireless networks and notably in the context of ultra reliable low latency communications (URLLC) in beyond fifth generation (B5G) systems. However, W-SKG schemes are known to be malleable over the so called \"advantage distillation\" phase, during which observations of the shared randomness are obtained at the legitimate parties. As an example, an active attacker can act as a man-in-the-middle (MiM) by injecting pilot signals and/or can mount denial of service attacks (DoS) in the form of jamming. This paper investigates the impact of injection and reactive jamming attacks in W-SKG. First, it is demonstrated that injection attacks can be reduced to - potentially less harmful - jamming attacks by pilot randomization; a novel system design with randomized QPSK pilots is presented. Subsequently, the optimal jamming strategy is identified in a block fading additive white Gaussian noise (BF-AWGN) channel in the presence of a reactive jammer, using a game theoretic formulation. It is shown that the impact of a reactive jammer is far more severe than that of a simple proactive jammer"}}
{"id": "0KS7JdYJ-UD", "cdate": 1577836800000, "mdate": null, "content": {"title": "Online and stochastic optimization beyond Lipschitz continuity: A Riemannian approach", "abstract": "Motivated by applications to machine learning and imaging science, we study a class of online and stochastic optimization problems with loss functions that are not Lipschitz continuous; in particular, the loss functions encountered by the optimizer could exhibit gradient singularities or be singular themselves. Drawing on tools and techniques from Riemannian geometry, we examine a Riemann–Lipschitz (RL) continuity condition which is tailored to the singularity landscape of the problem’s loss functions. In this way, we are able to tackle cases beyond the Lipschitz framework provided by a global norm, and we derive optimal regret bounds and last iterate convergence results through the use of regularized learning methods (such as online mirror descent). These results are subsequently validated in a class of stochastic Poisson inverse problems that arise in imaging science."}}
{"id": "rkxZyaNtwB", "cdate": 1569438936699, "mdate": null, "content": {"title": "Online and stochastic optimization beyond Lipschitz continuity: A Riemannian approach", "abstract": "Motivated by applications to machine learning and imaging science, we study a class of online and stochastic optimization problems with loss functions that are not Lipschitz continuous; in particular, the loss functions encountered by the optimizer could exhibit gradient singularities or be singular themselves. Drawing on tools and techniques from Riemannian geometry, we examine a Riemann–Lipschitz (RL) continuity condition which is tailored to the singularity landscape of the problem’s loss functions. In this way, we are able to tackle cases beyond the Lipschitz framework provided by a global norm, and we derive optimal regret bounds and last iterate convergence results through the use of regularized learning methods (such as online mirror descent). These results are subsequently validated in a class of stochastic Poisson inverse problems that arise in imaging science."}}
{"id": "yhL0bvCchBM", "cdate": 1546300800000, "mdate": null, "content": {"title": "Moving-Target Defense for Detecting Coordinated Cyber-Physical Attacks in Power Grids", "abstract": "This work proposes a moving target defense (MTD) strategy to detect coordinated cyber-physical attacks (CCPAs) against power grids. A CCPA consists of a physical attack, such as disconnecting a transmission line, followed by a coordinated cyber attack that injects false data into the sensor measurements to mask the effects of the physical attack. Such attacks can lead to undetectable line outages and cause significant damage to the grid. The main idea of the proposed approach is to invalidate the knowledge that the attackers use to mask the effects of the physical attack by actively perturbing the grid's transmission line reactances using distributed flexible AC transmission system (D-FACTS) devices. We identify the MTD design criteria in this context to thwart CCPAs. The proposed MTD design consists of two parts. First, we identify the subset of links for D-FACTS device deployment that enables the defender to detect CCPAs against any link in the system. Then, in order to minimize the defense cost during the system's operational time, we use a game-theoretic approach to identify the best subset of links (within the D-FACTS deployment set) to perturb which will provide adequate protection. Extensive simulations performed using the MATPOWER simulator on IEEE bus systems verify the effectiveness of our approach in detecting CCPAs and reducing the operator's defense cost."}}
{"id": "jIIsUQkvUR", "cdate": 1546300800000, "mdate": null, "content": {"title": "Adversarial Multi-armed Bandit for mmWave Beam Alignment with One-Bit Feedback", "abstract": "To exploit the large bandwidth available in the millimeter wave spectrum, highly directional beams need to be employed to compensate for the severe pathloss incurred at high frequencies. As a result, the beams of both the transmitter and the receiver must be constantly aligned. In this paper, the beam alignment (BA) problem is formulated as an adversarial multi-armed bandit (MAB) problem, yielding to a distributed BA search between the transmitter and receiver. First, we analyze the optimal codebook size for the BA that reduces the search space while insuring good performance levels. Then, we propose to use the exponential weights algorithm at both the transmitter and the receiver to match their beams. Our distributed algorithm relies on a single bit of feedback information and its performance is demonstrated via numerical results and compared with existing schemes."}}
{"id": "hzkkR0WFcl", "cdate": 1546300800000, "mdate": null, "content": {"title": "Mitigating Jamming Attacks Using Energy Harvesting", "abstract": "The use of energy harvesting as a counter-jamming measure is investigated on the premise that part of the harmful interference can be harvested to increase the transmit power. We formulate the strategic interaction between a pair of legitimate nodes and a malicious jammer as a zero-sum game. Our analysis demonstrates that the legitimate nodes are able to neutralize the jammer. However, this policy is not necessarily a Nash equilibrium and hence is sub-optimal. Instead, harvesting the jamming interference can lead to relative gains of up to 95%, on average, in terms of Shannon capacity, when the jamming interference is high."}}
{"id": "YAOB4NLGsNf", "cdate": 1546300800000, "mdate": null, "content": {"title": "Gradient-free Online Resource Allocation Algorithms for Dynamic Wireless Networks", "abstract": "Future communication networks will be faced with supporting highly mobile, heterogeneous (including aerial) devices, which calls for new and efficient resource allocation policies that are able to adapt on-the-fly to the network dynamics while relying on little and possibly outdated information. The aim of this paper is twofold: to explicitly take into account the device mobility, their network connectivity patterns and behavior (which may be completely arbitrary and unpredictable); and to greatly reduce the information required at the transmitter. For this, we exploit the framework of online optimization and exponential learning to derive a provably efficient and gradient-free online power allocation algorithm relying only on a scalar-worth of feedback."}}
{"id": "SeT37N5zv1y", "cdate": 1546300800000, "mdate": null, "content": {"title": "An adaptive Mirror-Prox method for variational inequalities with singular operators", "abstract": "Lipschitz continuity is a central requirement for achieving the optimal O(1/T) rate of convergence in monotone, deterministic variational inequalities (a setting that includes convex minimization, convex-concave optimization, nonatomic games, and many other problems). However, in many cases of practical interest, the operator defining the variational inequality may become singular at the boundary of the feasible region, precluding in this way the use of fast gradient methods that attain this rate (such as Nemirovski's mirror-prox algorithm and its variants). To address this issue, we propose a novel smoothness condition which we call Bregman smoothness, and which relates the variation of the operator to that of a suitably chosen Bregman function. Leveraging this condition, we derive an adaptive mirror prox algorithm which attains an O(1/T) rate of convergence in problems with possibly singular operators, without any prior knowledge of the problem's Bregman constant (the Bregman analogue of the Lipschitz constant). We also present an extension of our algorithm to stochastic variational inequalities where the algorithm achieves a $O(1/\\sqrt{T})$ convergence rate."}}
{"id": "S1pFNDwSznO", "cdate": 1546300800000, "mdate": null, "content": {"title": "Online Power Optimization in Feedback-Limited, Dynamic and Unpredictable IoT Networks", "abstract": "One of the key challenges in Internet of Things (IoT) networks is to connect many different types of autonomous devices while reducing their individual power consumption. This problem is exacerbated by two main factors: first, the fact that these devices operate in and give rise to a highly dynamic and unpredictable environment where existing solutions (e.g., water-filling algorithms) are no longer relevant; and second, the lack of sufficient information at the device end. To address these issues, we propose a regret-based formulation that accounts for arbitrary network dynamics: this allows us to derive an online power control scheme that is provably capable of adapting to such changes, while relying solely on strictly causal feedback. In so doing, we identify an important tradeoff between the amount of feedback available at the transmitter side and the resulting system performance: if the device has access to unbiased gradient observations, the algorithm's regret after T stages is O(T <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">-1/2</sup> ) (up to logarithmic factors); on the other hand, if the device only has access to scalar, utility-based information, this decay rate drops to O(T <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">-1/4</sup> ). The above is validated by an extensive suite of numerical simulations in realistic channel conditions, which clearly exhibit the gains of the proposed online approach over traditional water-filling methods."}}
