{"id": "K1DdnjL6p7", "cdate": 1663850370492, "mdate": null, "content": {"title": "A simple Training-Free Method for Rejection Option", "abstract": "We present a simple yet effective method to implement the rejection option for a pre-trained classifier. Our method is based on a sound mathematical framework, enjoys good properties, and is hyperparameter free. It is lightweight, since it does not require any re-training of the network, and it is flexible, since it can be used with any model that outputs soft-probabilities. We compare our solution to state-of-the-art methods considering popular benchmarks (Cifar-10, Cifar-100, SVHN), and various models (VGG-16, DenseNet-121, ResNet-34). At evaluation time, our method, which is applied post-training to any classification model, achieves similar or better results with respect to its competitors that usually require further training and/or tuning of the models."}}
{"id": "gyTuMfkOney", "cdate": 1663849992692, "mdate": null, "content": {"title": "A Functional Perspective on Multi-Layer Out-of-Distribution Detection", "abstract": "A crucial component for implementing reliable classifiers is detecting examples far from the reference (training) distribution, referred to as out-of-distribution (OOD) samples. A key feature of OOD detection is to exploit the network by extracting statistical patterns and relationships through the pre-trained multi-layer classifier. Despite achieving solid results, state-of-the-art methods require either additional OOD examples, expensive computation of gradients, or are tightened to a particular architecture, limiting their applications. This work adopts an original approach based on a functional view of the network that exploits the sample's trajectories through the various layers and their statistical dependencies. In this new framework, OOD detection translates into detecting samples whose trajectories differ from the typical behavior characterized by the training set. Our method significantly decreases the OOD detection error of classifiers trained on ImageNet and outperforms the state-of-the-art methods on average AUROC and TNR at 95% TPR. We demonstrate that the functional signature left by a sample in a network carries relevant information for OOD detection. "}}
{"id": "ReB7CCByD6U", "cdate": 1652737363133, "mdate": null, "content": {"title": "Beyond Mahalanobis Distance for Textual OOD Detection", "abstract": "As the number of AI systems keeps growing, it is fundamental to implement and develop efficient control mechanisms to ensure the safe and proper functioning of machine learning (ML) systems. Reliable out-of-distribution (OOD) detection aims to detect test samples that are statistically far from the training distribution, as they might cause failures of in-production systems. In this paper, we propose a new detector called TRUSTED. Different from previous works, TRUSTED key components (i) include a novel OOD score relying on the concept of statistical data depth, (ii) rely on the idea’s full potential that all hidden layers of the network carry information regarding OOD. Our extensive experiments, comparing over 51k model configurations including different checkpoints, seed and various datasets, demonstrate that TRUSTED achieve state-of-the-art performances by producing an improvement of over 3 AUROC points."}}
{"id": "8tsqEls5sAF", "cdate": 1640995200000, "mdate": 1668718967240, "content": {"title": "Igeood: An Information Geometry Approach to Out-of-Distribution Detection", "abstract": "Reliable out-of-distribution (OOD) detection is fundamental to implementing safer modern machine learning (ML) systems. In this paper, we introduce Igeood, an effective method for detecting OOD samples. Igeood applies to any pre-trained neural network, works under various degrees of access to the ML model, does not require OOD samples or assumptions on the OOD data but can also benefit (if available) from OOD samples. By building on the geodesic (Fisher-Rao) distance between the underlying data distributions, our discriminator can combine confidence scores from the logits outputs and the learned features of a deep neural network. Empirically, we show that Igeood outperforms competing state-of-the-art methods on a variety of network architectures and datasets."}}
{"id": "lk8ii4g_oi_", "cdate": 1633790966986, "mdate": null, "content": {"title": "Igeood: An Information Geometry Approach to Out-of-Distribution Detection", "abstract": "Reliable out-of-distribution (OOD) detection is a fundamental step towards a safer implementation of modern machine learning (ML)  systems under distribution shift. In this paper, we introduce Igeood, an effective method for detecting OOD samples. Igeood applies to any pre-trained neural network, works under different degrees of access to the ML model, does not require OOD samples or assumptions on the OOD data, but can also benefit (if available) from OOD samples. By building on the geodesic (Fisher-Rao) distance between the underlying data distributions, our discriminator combines confidence scores from the logits outputs and the learned features of a deep neural network. Empirically, we show that Igeood is competitive and often outperforms state-of-the-art methods by a large margin on a variety of networks architectures and datasets."}}
{"id": "mfwdY3U_9ea", "cdate": 1632875642345, "mdate": null, "content": {"title": "Igeood: An Information Geometry Approach to Out-of-Distribution Detection", "abstract": "Reliable out-of-distribution (OOD) detection is fundamental to implementing safer modern machine learning (ML)  systems. In this paper, we introduce Igeood, an effective method for detecting OOD samples. Igeood applies to any pre-trained neural network, works under various degrees of access to the ML model, does not require OOD samples or assumptions on the OOD data but can also benefit (if available) from OOD samples. By building on the geodesic (Fisher-Rao) distance between the underlying data distributions, our discriminator can combine confidence scores from the logits outputs and the learned features of a deep neural network. Empirically, we show that Igeood outperforms competing state-of-the-art methods on a variety of network architectures and datasets."}}
{"id": "4NqgiYZner", "cdate": 1609459200000, "mdate": 1668718967415, "content": {"title": "CSI-aided Robust Neural-based Decoders", "abstract": "In this work <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup> , we investigate the design of neural based channel decoders for the Binary Asymmetric Channel (BAC), which exhibits robustness issues related to training/testing channel parameters mismatch. Rather than enforcing the independence of the trained model to the channel parameter as in our previous work, we show that providing even a coarse (possibly imperfect) quantized CSI to the decoder, allows to build a single robust neural decoder for all values of channel parameters."}}
