{"id": "lRZd4GeNie", "cdate": 1577836800000, "mdate": null, "content": {"title": "Hypernetwork-Based Augmentation", "abstract": "Data augmentation is an effective technique to improve the generalization of deep neural networks. Recently, AutoAugment proposed a well-designed search space and a search algorithm that automatically finds augmentation policies in a data-driven manner. However, AutoAugment is computationally intensive. In this paper, we propose an efficient gradient-based search algorithm, called Hypernetwork-Based Augmentation (HBA), which simultaneously learns model parameters and augmentation hyperparameters in a single training. Our HBA uses a hypernetwork to approximate a population-based training algorithm, which enables us to tune augmentation hyperparameters by gradient descent. Besides, we introduce a weight sharing strategy that simplifies our hypernetwork architecture and speeds up our search algorithm. We conduct experiments on CIFAR-10, CIFAR-100, SVHN, and ImageNet. Our results show that HBA is competitive to the state-of-the-art methods in terms of both search speed and accuracy."}}
{"id": "-QK-Jo8zEz7", "cdate": 1577836800000, "mdate": null, "content": {"title": "Soteria: A Provably Compliant User Right Manager Using a Novel Two-Layer Blockchain Technology", "abstract": "Soteria is a user right management system designed to safeguard user-data privacy in a transparent and provable manner in compliance to regulations such as GDPR and CCPA. Soteria represents user data rights as formal executable sharing agreements, which can automatically be translated into a human readable form and enforced as data are queried. To support revocation and to prove compliance, an indelible, audited trail of the hash of data access and sharing agreements are stored on a two-layer distributed ledger. The main chain ensures partition tolerance and availability (PA) properties while side chains ensure consistency and availability (CA), thus providing the three properties of the CAP (consistency, availability, and partition tolerance) theorem. Besides depicting the two-layer architecture of Soteria, this paper evaluates representative consensus protocols and reports performance statistics."}}
{"id": "ed69ULSBoA", "cdate": 1546300800000, "mdate": null, "content": {"title": "RelGAN: Multi-Domain Image-to-Image Translation via Relative Attributes", "abstract": "Multi-domain image-to-image translation has gained increasing attention recently. Previous methods take an image and some target attributes as inputs and generate an output image with the desired attributes. However, such methods have two limitations. First, these methods assume binary-valued attributes and thus cannot yield satisfactory results for fine-grained control. Second, these methods require specifying the entire set of target attributes, even if most of the attributes would not be changed. To address these limitations, we propose RelGAN, a new method for multi-domain image-to-image translation. The key idea is to use relative attributes, which describes the desired change on selected attributes. Our method is capable of modifying images by changing particular attributes of interest in a continuous manner while preserving the other attributes. Experimental results demonstrate both the quantitative and qualitative effectiveness of our method on the tasks of facial attribute transfer and interpolation."}}
{"id": "cD1wp9oLG7E", "cdate": 1546300800000, "mdate": null, "content": {"title": "G2R Bound: A Generalization Bound for Supervised Learning from GAN-Synthetic Data", "abstract": "Performing supervised learning from the data synthesized by using Generative Adversarial Networks (GANs), dubbed GAN-synthetic data, has two important applications. First, GANs may generate more labeled training data, which may help improve classification accuracy. Second, in scenarios where real data cannot be released outside certain premises for privacy and/or security reasons, using GAN- synthetic data to conduct training is a plausible alternative. This paper proposes a generalization bound to guarantee the generalization capability of a classifier learning from GAN-synthetic data. This generalization bound helps developers gauge the generalization gap between learning from synthetic data and testing on real data, and can therefore provide the clues to improve the generalization capability."}}
{"id": "Q-P_ayDyC5", "cdate": 1546300800000, "mdate": null, "content": {"title": "Effective Medical Test Suggestions Using Deep Reinforcement Learning", "abstract": "Effective medical test suggestions benefit both patients and physicians to conserve time and improve diagnosis accuracy. In this work, we show that an agent can learn to suggest effective medical tests. We formulate the problem as a stage-wise Markov decision process and propose a reinforcement learning method to train the agent. We introduce a new representation of multiple action policy along with the training method of the proposed representation. Furthermore, a new exploration scheme is proposed to accelerate the learning of disease distributions. Our experimental results demonstrate that the accuracy of disease diagnosis can be significantly improved with good medical test suggestions."}}
{"id": "CKDuuIfToab", "cdate": 1546300800000, "mdate": null, "content": {"title": "Toward Fusing Domain Knowledge with Generative Adversarial Networks to Improve Supervised Learning for Medical Diagnoses", "abstract": "This paper addresses the challenges of small training data in deep learning. We share our experiences in the medical domain and present promises and limitations. In particular, we show through experimental results that GANs are ineffective in generating quality training data to improve supervised learning. We suggest plausible research directions to remedy the problems."}}
{"id": "6hAEUjXn537", "cdate": 1546300800000, "mdate": null, "content": {"title": "RelGAN: Multi-Domain Image-to-Image Translation via Relative Attributes", "abstract": "Multi-domain image-to-image translation has gained increasing attention recently. Previous methods take an image and some target attributes as inputs and generate an output image with the desired attributes. However, such methods have two limitations. First, these methods assume binary-valued attributes and thus cannot yield satisfactory results for fine-grained control. Second, these methods require specifying the entire set of target attributes, even if most of the attributes would not be changed. To address these limitations, we propose RelGAN, a new method for multi-domain image-to-image translation. The key idea is to use relative attributes, which describes the desired change on selected attributes. Our method is capable of modifying images by changing particular attributes of interest in a continuous manner while preserving the other attributes. Experimental results demonstrate both the quantitative and qualitative effectiveness of our method on the tasks of facial attribute transfer and interpolation."}}
{"id": "0L_eXAYFnU8", "cdate": 1546300800000, "mdate": null, "content": {"title": "KG-GAN: Knowledge-Guided Generative Adversarial Networks", "abstract": "Can generative adversarial networks (GANs) generate roses of various colors given only roses of red petals as input? The answer is negative, since GANs' discriminator would reject all roses of unseen petal colors. In this study, we propose knowledge-guided GAN (KG-GAN) to fuse domain knowledge with the GAN framework. KG-GAN trains two generators; one learns from data whereas the other learns from knowledge with a constraint function. Experimental results demonstrate the effectiveness of KG-GAN in generating unseen flower categories from seen categories given textual descriptions of the unseen ones."}}
{"id": "uG96V3lH7gr", "cdate": 1514764800000, "mdate": null, "content": {"title": "DeepLinQ: Distributed Multi-Layer Ledgers for Privacy-Preserving Data Sharing", "abstract": "This paper presents requirements to DeepLinQ and its architecture. DeepLinQ proposes a multi-layer blockchain architecture to improve flexibility, accountability, and scalability through on-demand queries, proxy appointment, subgroup signatures, granular access control, and smart contracts in order to support privacy-preserving distributed data sharing. In this data-driven AI era where big data is the prerequisite for training an effective deep learning model, DeepLinQ provides a trusted infrastructure to enable training data collection in a privacy-preserved way. This paper uses healthcare data sharing as an application example to illustrate key properties and design of DeepLinQ."}}
{"id": "fvl2s-qL-C7", "cdate": 1514764800000, "mdate": null, "content": {"title": "BDA-PCH: Block-Diagonal Approximation of Positive-Curvature Hessian for Training Neural Networks", "abstract": "For training fully-connected neural networks (FCNNs), we propose a practical approximate second-order method including: 1) an approximation of the Hessian matrix and 2) a conjugate gradient (CG) based method. Our proposed approximate Hessian matrix is memory-efficient and can be applied to any FCNNs where the activation and criterion functions are twice differentiable. We devise a CG-based method incorporating one-rank approximation to derive Newton directions for training FCNNs, which significantly reduces both space and time complexity. This CG-based method can be employed to solve any linear equation where the coefficient matrix is Kronecker-factored, symmetric and positive definite. Empirical studies show the efficacy and efficiency of our proposed method."}}
