{"id": "MUl9FL5cgM", "cdate": 1672531200000, "mdate": 1707039291038, "content": {"title": "Sparse Representations, Inference and Learning", "abstract": "In recent years statistical physics has proven to be a valuable tool to probe into large dimensional inference problems such as the ones occurring in machine learning. Statistical physics provides analytical tools to study fundamental limitations in their solutions and proposes algorithms to solve individual instances. In these notes, based on the lectures by Marc M\\'ezard in 2022 at the summer school in Les Houches, we will present a general framework that can be used in a large variety of problems with weak long-range interactions, including the compressed sensing problem, or the problem of learning in a perceptron. We shall see how these problems can be studied at the replica symmetric level, using developments of the cavity methods, both as a theoretical tool and as an algorithm."}}
{"id": "1jG6Za_Zxb0", "cdate": 1672531200000, "mdate": 1707039291040, "content": {"title": "Gibbs Sampling the Posterior of Neural Networks", "abstract": "In this paper, we study sampling from a posterior derived from a neural network. We propose a new probabilistic model consisting of adding noise at every pre- and post-activation in the network, arguing that the resulting posterior can be sampled using an efficient Gibbs sampler. For small models, the Gibbs sampler attains similar performances as the state-of-the-art Markov chain Monte Carlo (MCMC) methods, such as the Hamiltonian Monte Carlo (HMC) or the Metropolis adjusted Langevin algorithm (MALA), both on real and synthetic data. By framing our analysis in the teacher-student setting, we introduce a thermalization criterion that allows us to detect when an algorithm, when run on data with synthetic labels, fails to sample from the posterior. The criterion is based on the fact that in the teacher-student setting we can initialize an algorithm directly at equilibrium."}}
{"id": "-CVS01aeIF", "cdate": 1672531200000, "mdate": 1707039291041, "content": {"title": "Asymptotic Characterisation of Robust Empirical Risk Minimisation Performance in the Presence of Outliers", "abstract": "We study robust linear regression in high-dimension, when both the dimension $d$ and the number of data points $n$ diverge with a fixed ratio $\\alpha=n/d$, and study a data model that includes outliers. We provide exact asymptotics for the performances of the empirical risk minimisation (ERM) using $\\ell_2$-regularised $\\ell_2$, $\\ell_1$, and Huber losses, which are the standard approach to such problems. We focus on two metrics for the performance: the generalisation error to similar datasets with outliers, and the estimation error of the original, unpolluted function. Our results are compared with the information theoretic Bayes-optimal estimation bound. For the generalization error, we find that optimally-regularised ERM is asymptotically consistent in the large sample complexity limit if one perform a simple calibration, and compute the rates of convergence. For the estimation error however, we show that due to a norm calibration mismatch, the consistency of the estimator requires an oracle estimate of the optimal norm, or the presence of a cross-validation set not corrupted by the outliers. We examine in detail how performance depends on the loss function and on the degree of outlier corruption in the training set and identify a region of parameters where the optimal performance of the Huber loss is identical to that of the $\\ell_2$ loss, offering insights into the use cases of different loss functions."}}
{"id": "DVqkVWf7-N", "cdate": 1640995200000, "mdate": 1675687826362, "content": {"title": "Rigorous dynamical mean field theory for stochastic gradient descent methods", "abstract": "We prove closed-form equations for the exact high-dimensional asymptotics of a family of first order gradient-based methods, learning an estimator (e.g. M-estimator, shallow neural network, ...) from observations on Gaussian data with empirical risk minimization. This includes widely used algorithms such as stochastic gradient descent (SGD) or Nesterov acceleration. The obtained equations match those resulting from the discretization of dynamical mean-field theory (DMFT) equations from statistical physics when applied to gradient flow. Our proof method allows us to give an explicit description of how memory kernels build up in the effective dynamics, and to include non-separable update functions, allowing datasets with non-identity covariance matrices. Finally, we provide numerical implementations of the equations for SGD with generic extensive batch-size and with constant learning rates."}}
{"id": "50tQlLRoCD", "cdate": 1640995200000, "mdate": 1707039291041, "content": {"title": "Optimal denoising of rotationally invariant rectangular matrices", "abstract": "In this manuscript we consider denoising of large rectangular matrices: given a noisy observation of a signal matrix, what is the best way of recovering the signal matrix itself? For Gaussian noise..."}}
{"id": "_L8USpCXfi", "cdate": 1577836800000, "mdate": 1675687826245, "content": {"title": "Stuttering Conway Sequences Are Still Conway Sequences", "abstract": "A look-and-say sequence is obtained iteratively by reading off the digits of the current value, grouping identical digits together: starting with 1, the sequence reads: 1, 11, 21, 1211, 111221, 312211, etc. (OEIS A005150). Starting with any digit $d \\neq 1$ gives Conway's sequence: $d$, $1d$, $111d$, $311d$, $13211d$, etc. (OEIS A006715). Conway popularised these sequences and studied some of their properties. In this paper we consider a variant subbed \"look-and-say again\" where digits are repeated twice. We prove that the look-and-say again sequence contains only the digits $1, 2, 4, 6, d$, where $d$ represents the starting digit. Such sequences decompose and the ratio of successive lengths converges to Conway's constant. In fact, these properties result from a commuting diagram between look-and-say again sequences and \"classical\" look-and-say sequences. Similar results apply to the \"look-and-say three times\" sequence."}}
{"id": "RULBtpqDFig", "cdate": 1577836800000, "mdate": 1675687826248, "content": {"title": "The Look-and-Say The Biggest Sequence Eventually Cycles", "abstract": "In this paper we consider a variant of Conway's sequence (OEIS A005150, A006715) defined as follows: the next term in the sequence is obtained by considering contiguous runs of digits, and rewriting them as $ab$ where $b$ is the digit and $a$ is the maximum of $b$ and the run's length. We dub this the \"look-and-say the biggest\" (LSB) sequence. Conway's sequence is very similar ($b$ is just the run's length). For any starting value except 22, Conway's sequence grows exponentially: the ration of lengths converges to a known constant $\\lambda$. We show that LSB does not: for every starting value, LSB eventually reaches a cycle. Furthermore, all cycles have a period of at most 9."}}
