{"id": "sp4es3Jo-K", "cdate": 1640995200000, "mdate": 1668404685805, "content": {"title": "InDiD: Instant Disorder Detection via a Principled Neural Network", "abstract": "For sequential data, a change point is a moment of abrupt regime switch in data streams. Such changes appear in different scenarios, including simpler data from sensors and more challenging video surveillance data. We need to detect disorders as fast as possible. Classic approaches for change point detection (CPD) might underperform for semi-structured sequential data because they cannot process its structure without a proper representation. We propose a principled loss function that balances change detection delay and time to a false alarm. It approximates classic rigorous solutions but is differentiable and allows representation learning for deep models. We consider synthetic sequences, real-world data sensors and videos with change points. We carefully labelled available video data with change point moments and released it for the first time. Experiments suggest that complex data require meaningful representations tailored for the specificity of the CPD task --- and our approach provides them outperforming considered baselines. For example, for explosion detection in video, the F1 score for our method is 0.53 compared to baseline scores of 0.31 and 0.35."}}
{"id": "6g1VHsnKbNU", "cdate": 1640995200000, "mdate": 1664551095629, "content": {"title": "Similarity learning for wells based on logging data", "abstract": "One of the first steps during the investigation of geological objects is the interwell correlation. It provides information on the structure of the objects under study, as it comprises the framework for constructing geological models and assessing hydrocarbon reserves. Today, the detailed interwell correlation relies on manual analysis of well-logging data. Thus, it is time-consuming and of a subjective nature. The essence of the interwell correlation constitutes an assessment of the similarities between geological profiles. There were many attempts to automate the process of interwell correlation by means of rule-based approaches, classic machine learning approaches, and deep learning approaches in the past. However, most approaches are of limited usage and inherent subjectivity of experts. We propose a novel framework to solve the geological profile similarity estimation based on a deep learning model. Our similarity model takes well-logging data as input and provides the similarity of wells as output. The developed framework enables (1) extracting patterns and essential characteristics of geological profiles within the wells and (2) model training following the unsupervised paradigm without the need for manual analysis and interpretation of well-logging data. For model testing, we used two open datasets originating in New Zealand and Norway. Our data-based similarity models provide high performance: the accuracy of our model is $0.926$ compared to $0.787$ for baselines based on the popular gradient boosting approach. With them, an oil\\&gas practitioner can improve interwell correlation quality and reduce operation time."}}
{"id": "xYDIEMZ6L_a", "cdate": 1577836800000, "mdate": 1682416109899, "content": {"title": "Real-Time Data-Driven Detection of the Rock-Type Alteration During a Directional Drilling", "abstract": "During directional drilling, a bit may sometimes go to a nonproductive rock layer due to the gap about 20 m between the bit and high-fidelity rock-type sensors. The only way to detect the lithotype changes in time is the usage of measurements while drilling (MWD). However, there are no general mathematical modeling approaches that both well reconstruct the rock type based on MWD data and correspond to specifics of the oil and gas industry. In this letter, we present a data-driven procedure that utilizes MWD data for quick detection of changes in rock types. We propose the approach that combines traditional machine learning (ML) based on the solution of the rock-type classification problem with change detection procedures rarely used before in oil and gas industry. The data come from a newly developed oilfield in the north of western Siberia. The results suggest that we can detect a significant part of changes in rock types, reducing the change detection delay from 20 to 1.8 m and the number of false-positive alarms from 43 to 6 per well."}}
{"id": "dyexFrmqTB3", "cdate": 1546300800000, "mdate": 1682416109898, "content": {"title": "Failures detection at directional drilling using real-time analogues search", "abstract": "We present a data-driven algorithm and mathematical model for anomaly alarming at directional drilling. The algorithm is based on machine learning. It compares the real-time drilling telemetry with one corresponding to past accidents and analyses the level of similarity. The model performs a time-series comparison using aggregated statistics and Gradient Boosting classification. It is trained on historical data containing the drilling telemetry of $80$ wells drilled within $19$ oilfields. The model can detect an anomaly and identify its type by comparing the real-time measurements while drilling with the ones from the database of past accidents. Validation tests show that our algorithm identifies half of the anomalies with about $0.53$ false alarms per day on average. The model performance ensures sufficient time and cost savings as it enables partial prevention of the failures and accidents at the well construction."}}
{"id": "OFS-YSe-tze", "cdate": 1514764800000, "mdate": 1682416109902, "content": {"title": "Interpolation error of Gaussian process regression for misspecified case", "abstract": "An interpolation error is an integral of the squared error of a regression model over a domain of interest. We consider the interpolation error for the case of misspecified Gaussian process regress..."}}
