{"id": "IDjtD2PG7Om", "cdate": 1674479887654, "mdate": 1674479887654, "content": {"title": "Unity is strength: Improving the Detection of Adversarial Examples with Ensemble Approaches", "abstract": "A key challenge in computer vision and deep learning is the definition of robust strategies for the detection of adversarial examples. Here, we propose the adoption of ensemble approaches to leverage the effectiveness of multiple detectors in exploiting distinct properties of the input data. To this end, the ENsemble Adversarial Detector (ENAD) framework integrates scoring functions from state-of-the-art detectors based on Mahalanobis distance, Local Intrinsic Dimensionality, and One-Class Support Vector Machines, which process the hidden features of deep neural networks. ENAD is designed to ensure high standardization and reproducibility to the computational workflow. Importantly, extensive tests on benchmark datasets, models and adversarial attacks show that ENAD outperforms all competing methods in the large majority of settings. The improvement over the state-of-the-art and the intrinsic generality of the framework, which allows one to easily extend ENAD to include any set of detectors, set the foundations for the new area of ensemble adversarial detection. "}}
{"id": "VuZWN-7DZG", "cdate": 1640995200000, "mdate": 1681760020733, "content": {"title": "A Survey on Causal Discovery: Theory and Practice", "abstract": ""}}
{"id": "VIZNpwAg7X", "cdate": 1640995200000, "mdate": 1681760020738, "content": {"title": "Risk Assessment of Lymph Node Metastasis in Endometrial Cancer Patients: A Causal Approach", "abstract": ""}}
{"id": "F1jER5Oo7dK", "cdate": 1640995200000, "mdate": 1681760020737, "content": {"title": "Structure learning algorithms for multidimensional continuous-time Bayesian network classifiers", "abstract": "Learning the structure of continuous-time Bayesian networks directly from data has traditionally been performed using score-based structure learning algorithms. Only recently has a constraint-based..."}}
{"id": "pw0ZAXb1bi2", "cdate": 1632061951647, "mdate": 1632061951647, "content": {"title": "continuous time bayesian networks classifiers", "abstract": "The class of continuous time Bayesian network classifiers is defined; it solves the problem of supervised\nclassification on multivariate trajectories evolving in continuous time. The trajectory consists of the values\nof discrete attributes that are measured in continuous time, while the predicted class is expected to\noccur in the future. Two instances from this class, namely the continuous time naive Bayes classifier and\nthe continuous time tree augmented naive Bayes classifier, are introduced and analyzed. They implement\na trade-off between computational complexity and classification accuracy. Learning and inference for the\nclass of continuous time Bayesian network classifiers are addressed, in the case where complete data are\navailable. A learning algorithm for the continuous time naive Bayes classifier and an exact inference algorithm\nfor the class of continuous time Bayesian network classifiers are described. The performance of the\ncontinuous time naive Bayes classifier is assessed in the case where real-time feedback to neurological\npatients undergoing motor rehabilitation must be provided."}}
{"id": "rx2ayNBcLvB", "cdate": 1609459200000, "mdate": null, "content": {"title": "Counterfactual Contextual Multi-Armed Bandit: a Real-World Application to Diagnose Apple Diseases", "abstract": "Post-harvest diseases of apple are one of the major issues in the economical sector of apple production, causing severe economical losses to producers. Thus, we developed DSSApple, a picture-based decision support system able to help users in the diagnosis of apple diseases. Specifically, this paper addresses the problem of sequentially optimizing for the best diagnosis, leveraging past interactions with the system and their contextual information (i.e. the evidence provided by the users). The problem of learning an online model while optimizing for its outcome is commonly addressed in the literature through a stochastic active learning paradigm - i.e. Contextual Multi-Armed Bandit (CMAB). This methodology interactively updates the decision model considering the success of each past interaction with respect to the context provided in each round. However, this information is very often partial and inadequate to handle such complex decision making problems. On the other hand, human decisions implicitly include unobserved factors (referred in the literature as unobserved confounders) that significantly contribute to the human's final decision. In this paper, we take advantage of the information embedded in the observed human decisions to marginalize confounding factors and improve the capability of the CMAB model to identify the correct diagnosis. Specifically, we propose a Counterfactual Contextual Multi-Armed Bandit, a model based on the causal concept of counterfactual. The proposed model is validated with offline experiments based on data collected through a large user study on the application. The results prove that our model is able to outperform both traditional CMAB algorithms and observed user decisions, in real-world tasks of predicting the correct apple disease."}}
{"id": "fPMDIXIf4Q", "cdate": 1609459200000, "mdate": 1681760020736, "content": {"title": "A constraint-based algorithm for the structural learning of continuous-time Bayesian networks", "abstract": ""}}
{"id": "9__K67JCQvS", "cdate": 1609459200000, "mdate": null, "content": {"title": "Non Stationary Multi-Armed Bandit: Empirical Evaluation of a New Concept Drift-Aware Algorithm", "abstract": "The Multi-Armed Bandit (MAB) problem has been extensively studied in order to address real-world challenges related to sequential decision making. In this setting, an agent selects the best action to be performed at time-step t, based on the past rewards received by the environment. This formulation implicitly assumes that the expected payoff for each action is kept stationary by the environment through time. Nevertheless, in many real-world applications this assumption does not hold and the agent has to face a non-stationary environment, that is, with a changing reward distribution. Thus, we present a new MAB algorithm, named f-Discounted-Sliding-Window Thompson Sampling (f-dsw TS), for non-stationary environments, that is, when the data streaming is affected by concept drift. The f-dsw TS algorithm is based on Thompson Sampling (TS) and exploits a discount factor on the reward history and an arm-related sliding window to contrast concept drift in non-stationary environments. We investigate how to combine these two sources of information, namely the discount factor and the sliding window, by means of an aggregation function f(.). In particular, we proposed a pessimistic (f=min), an optimistic (f=max), as well as an averaged (f=mean) version of the f-dsw TS algorithm. A rich set of numerical experiments is performed to evaluate the f-dsw TS algorithm compared to both stationary and non-stationary state-of-the-art TS baselines. We exploited synthetic environments (both randomly-generated and controlled) to test the MAB algorithms under different types of drift, that is, sudden/abrupt, incremental, gradual and increasing/decreasing drift. Furthermore, we adapt four real-world active learning tasks to our framework—a prediction task on crimes in the city of Baltimore, a classification task on insects species, a recommendation task on local web-news, and a time-series analysis on microbial organisms in the tropical air ecosystem. The f-dsw TS approach emerges as the best performing MAB algorithm. At least one of the versions of f-dsw TS performs better than the baselines in synthetic environments, proving the robustness of f-dsw TS under different concept drift types. Moreover, the pessimistic version (f=min) results as the most effective in all real-world tasks."}}
{"id": "w8pTXj5QClu", "cdate": 1577836800000, "mdate": null, "content": {"title": "Hard and Soft EM in Bayesian Network Learning from Incomplete Data", "abstract": "Incomplete data are a common feature in many domains, from clinical trials to industrial applications. Bayesian networks (BNs) are often used in these domains because of their graphical and causal interpretations. BN parameter learning from incomplete data is usually implemented with the Expectation-Maximisation algorithm (EM), which computes the relevant sufficient statistics (&ldquo;soft EM&rdquo;) using belief propagation. Similarly, the Structural Expectation-Maximisation algorithm (Structural EM) learns the network structure of the BN from those sufficient statistics using algorithms designed for complete data. However, practical implementations of parameter and structure learning often impute missing data (&ldquo;hard EM&rdquo;) to compute sufficient statistics instead of using belief propagation, for both ease of implementation and computational speed. In this paper, we investigate the question: what is the impact of using imputation instead of belief propagation on the quality of the resulting BNs? From a simulation study using synthetic data and reference BNs, we find that it is possible to recommend one approach over the other in several scenarios based on the characteristics of the data. We then use this information to build a simple decision tree to guide practitioners in choosing the EM algorithm best suited to their problem."}}
{"id": "NRP5lHomqH3", "cdate": 1577836800000, "mdate": null, "content": {"title": "Contextual multi-armed bandit strategies for diagnosing post-harvest diseases of apple", "abstract": "This paper describes a decision support system to fulfill the diagnosis of post-harvest diseases in apple fruit. The diagnostic system builds on user feedback elicitation via multiple conversational rounds. The interaction with the user is conducted by selecting and displaying images depicting symptoms of diseased apples. The system is able to adapt the image selection mechanism by exploiting previous user feedback through a contextual multi-armed bandit approach. We performed a large scale user experiment, where different strategies for image selection have been compared in order to identify which reloading strategy makes users more effective in the diagnosis task. Concretely, we compared contextual multi-armed bandit methods with two baseline strategies and identified that the exploration-exploitation principle significantly paid off in comparison to a greedy and to a random stratified selection strategy. Although the application context is very domain specific, we believe that the general methodology of conversational item selection for eliciting user preferences applies to other scenarios in decision support and recommendation systems."}}
