{"id": "LtT66oxfIyc", "cdate": 1683991596746, "mdate": 1683991596746, "content": {"title": "Multimodal single cell data integration challenge: results and lessons learned", "abstract": "Biology has become a data-intensive science. Recent technological advances in singlecell genomics have enabled the measurement of multiple facets of cellular state, producing\ndatasets with millions of single-cell observations. While these data hold great promise\nfor understanding molecular mechanisms in health and disease, analysis challenges arising\nfrom sparsity, technical and biological variability, and high dimensionality of the data\nhinder the derivation of such mechanistic insights. To promote the innovation of algorithms\nfor analysis of multimodal single-cell data, we organized a competition at NeurIPS 2021\napplying the Common Task Framework to multimodal single-cell data integration. For\nthis competition we generated the first multimodal benchmarking dataset for single-cell\nbiology and defined three tasks in this domain: prediction of missing modalities, aligning\nmodalities, and learning a joint representation across modalities. We further specified\nevaluation metrics and developed a cloud-based algorithm evaluation pipeline. Using this\nsetup, 280 competitors submitted over 2600 proposed solutions within a 3 month period,\nshowcasing substantial innovation especially in the modality alignment task. Here, we\npresent the results, describe trends of well performing approaches, and discuss challenges\nassociated with running the competition."}}
{"id": "cS3_jJ0se3z", "cdate": 1675896011536, "mdate": null, "content": {"title": "The Power of Motifs as Inductive Bias for Learning Molecular Distributions", "abstract": "Machine learning for molecules holds great potential for efficiently exploring the vast chemical space and thus streamlining the drug discovery process by facilitating the design of new therapeutic molecules. Deep generative models have shown promising results for molecule generation, but the benefits of specific inductive biases for learning distributions over small graphs are unclear. Our study aims to investigate the impact of subgraph structures and vocabulary design on distribution learning, using small drug molecules as a case study. To this end, we introduce Subcover, a new subgraph-based fragmentation scheme, and evaluate it through a two-step variational auto-encoder. Our results show that Subcover’s improved identification of chemically meaningful subgraphs leads to a relative improvement of the FCD score by 30%, outperforming previous methods. Our findings highlight the potential of Subcover to enhance the performance and scalability of existing methods, contributing to the advancement of drug discovery."}}
{"id": "3ZcryDcnoW2", "cdate": 1665285246011, "mdate": null, "content": {"title": "Modeling Single-Cell Dynamics Using Unbalanced Parameterized Monge Maps", "abstract": "Optimal Transport (OT) has proven useful to infer single-cell trajectories of developing biological systems by aligning distributions across time points. Recently, Parameterized Monge Maps (PMM) were introduced to learn the optimal map between two distributions.\nHere, we apply PMM to model single-cell dynamics and show that PMM fails to account for asymmetric shifts in cell state distributions. To alleviate this limitation, we propose Unbalanced Parameterised Monge Maps (UPMM). We first describe the novel formulation and show on synthetic data how our method extends discrete unbalanced OT to the continuous domain. Then, we demonstrate that UPMM outperforms well-established trajectory inference methods on real-world developmental single-cell data."}}
{"id": "vRrFVHxFiXJ", "cdate": 1652737755507, "mdate": null, "content": {"title": "Predicting Cellular Responses to Novel Drug Perturbations at a Single-Cell Resolution", "abstract": "Single-cell transcriptomics enabled the study of cellular heterogeneity in response to perturbations at the resolution of individual cells. However, scaling high-throughput screens (HTSs) to measure cellular responses for many drugs remains a challenge due to technical limitations and, more importantly, the cost of such multiplexed experiments. Thus, transferring information from routinely performed bulk RNA HTS is required to enrich single-cell data meaningfully.\nWe introduce chemCPA, a new encoder-decoder architecture to study the perturbational effects of unseen drugs. We combine the model with an architecture surgery for transfer learning and demonstrate how training on existing bulk RNA HTS datasets can improve generalisation performance. Better generalisation reduces the need for extensive and costly screens at single-cell resolution. \nWe envision that our proposed method will facilitate more efficient experiment designs through its ability to generate in-silico hypotheses, ultimately accelerating drug discovery."}}
{"id": "HZ20IYYAwah", "cdate": 1652737641442, "mdate": null, "content": {"title": "Sparsity in Continuous-Depth Neural Networks", "abstract": "Neural Ordinary Differential Equations (NODEs) have proven successful in learning dynamical systems in terms of accurately recovering the observed trajectories. While different types of sparsity have been proposed to improve robustness, the generalization properties of NODEs for dynamical systems beyond the observed data are underexplored. We systematically study the influence of weight and feature sparsity on forecasting as well as on identifying the underlying dynamical laws. Besides assessing existing methods, we propose a regularization technique to sparsify ``input-output connections'' and extract relevant features during training. Moreover, we curate real-world datasets including human motion capture and human hematopoiesis single-cell RNA-seq data to realistically analyze different levels of out-of-distribution (OOD) generalization in forecasting and dynamics identification respectively. Our extensive empirical evaluation on these challenging benchmarks suggests that weight sparsity improves generalization in the presence of noise or irregular sampling. However, it does not prevent learning spurious feature dependencies in the inferred dynamics, rendering them impractical for predictions under interventions, or for inferring the true underlying dynamics. Instead, feature sparsity can indeed help with recovering sparse ground-truth dynamics compared to unregularized NODEs."}}
{"id": "u4_fkgDtqth", "cdate": 1648731967856, "mdate": null, "content": {"title": "SystemMatch: optimizing preclinical drug models to human clinical outcomes via generative latent-space matching", "abstract": "Translating the relevance of preclinical models ($\\textit{in vitro}$, animal models, or organoids) to their relevance in humans presents an important challenge during drug development. The rising abundance of single-cell genomic data from human tumors and tissue offers a new opportunity to optimize model systems by their similarity to targeted human cell types in disease. In this work, we introduce SystemMatch to assess the fit of preclinical model systems to an $\\textit{in sapiens}$ target population and to recommend experimental changes to further optimize these systems. We demonstrate this through an application to developing $\\textit{in vitro}$ systems to model human tumor-derived suppressive macrophages. We show with held-out $\\textit{in vivo}$ controls that our pipeline successfully ranks macrophage subpopulations by their biological similarity to the target population, and apply this analysis to rank a series of 18 $\\textit{in vitro}$ macrophage systems perturbed with a variety of cytokine stimulations. We extend this analysis to predict the behavior of 66 $\\textit{in silico}$ model systems generated using a perturbational autoencoder and apply a $k$-medoids approach to recommend a subset of these model systems for further experimental development in order to fully explore the space of possible perturbations. Through this use case, we demonstrate a novel approach to model system development to generate a system more similar to human biology."}}
{"id": "Wz9OtQYk_A", "cdate": 1648731966580, "mdate": null, "content": {"title": "Predicting single-cell perturbation responses for unseen drugs", "abstract": "Single-cell transcriptomics enabled the study of cellular heterogeneity in response to perturbations at the resolution of individual cells. However, scaling high-throughput screens (HTSs) to measure cellular responses for many drugs remains a challenge due to technical limitations and, more importantly, the cost of such multiplexed experiments. Thus, transferring information from routinely performed bulk RNA-seq HTS is required to enrich single-cell data meaningfully.\nWe introduce a new encoder-decoder architecture to study the perturbational effects of unseen drugs. We combine the model with a transfer learning scheme and demonstrate how training on existing bulk RNA-seq HTS datasets can improve generalisation performance. Better generalisation reduces the need for extensive and costly screens at single-cell resolution. \nWe envision that our proposed method will facilitate more efficient experiment designs through its ability to generate in-silico hypotheses, ultimately accelerating targeted drug discovery."}}
{"id": "vURDiwau00", "cdate": 1640995200000, "mdate": 1684160229976, "content": {"title": "SystemMatch: optimizing preclinical drug models to human clinical outcomes via generative latent-space matching", "abstract": "Translating the relevance of preclinical models ($\\textit{in vitro}$, animal models, or organoids) to their relevance in humans presents an important challenge during drug development. The rising abundance of single-cell genomic data from human tumors and tissue offers a new opportunity to optimize model systems by their similarity to targeted human cell types in disease. In this work, we introduce SystemMatch to assess the fit of preclinical model systems to an $\\textit{in sapiens}$ target population and to recommend experimental changes to further optimize these systems. We demonstrate this through an application to developing $\\textit{in vitro}$ systems to model human tumor-derived suppressive macrophages. We show with held-out $\\textit{in vivo}$ controls that our pipeline successfully ranks macrophage subpopulations by their biological similarity to the target population, and apply this analysis to rank a series of 18 $\\textit{in vitro}$ macrophage systems perturbed with a variety of cytokine stimulations. We extend this analysis to predict the behavior of 66 $\\textit{in silico}$ model systems generated using a perturbational autoencoder and apply a $k$-medoids approach to recommend a subset of these model systems for further experimental development in order to fully explore the space of possible perturbations. Through this use case, we demonstrate a novel approach to model system development to generate a system more similar to human biology."}}
{"id": "uiXgfbC6f9", "cdate": 1640995200000, "mdate": 1684160230020, "content": {"title": "Sparsity in Continuous-Depth Neural Networks", "abstract": "Neural Ordinary Differential Equations (NODEs) have proven successful in learning dynamical systems in terms of accurately recovering the observed trajectories. While different types of sparsity have been proposed to improve robustness, the generalization properties of NODEs for dynamical systems beyond the observed data are underexplored. We systematically study the influence of weight and feature sparsity on forecasting as well as on identifying the underlying dynamical laws. Besides assessing existing methods, we propose a regularization technique to sparsify ``input-output connections'' and extract relevant features during training. Moreover, we curate real-world datasets including human motion capture and human hematopoiesis single-cell RNA-seq data to realistically analyze different levels of out-of-distribution (OOD) generalization in forecasting and dynamics identification respectively. Our extensive empirical evaluation on these challenging benchmarks suggests that weight sparsity improves generalization in the presence of noise or irregular sampling. However, it does not prevent learning spurious feature dependencies in the inferred dynamics, rendering them impractical for predictions under interventions, or for inferring the true underlying dynamics. Instead, feature sparsity can indeed help with recovering sparse ground-truth dynamics compared to unregularized NODEs."}}
{"id": "qSIzNyjibER", "cdate": 1640995200000, "mdate": 1684160230051, "content": {"title": "Noise Transfer for Unsupervised Domain Adaptation of Retinal OCT Images", "abstract": "Optical coherence tomography (OCT) imaging from different camera devices causes challenging domain shifts and can cause a severe drop in accuracy for machine learning models. In this work, we introduce a minimal noise adaptation method based on a singular value decomposition (SVDNA) to overcome the domain gap between target domains from three different device manufacturers in retinal OCT imaging. Our method utilizes the difference in noise structure to successfully bridge the domain gap between different OCT devices and transfer the style from unlabeled target domain images to source images for which manual annotations are available. We demonstrate how this method, despite its simplicity, compares or even outperforms state-of-the-art unsupervised domain adaptation methods for semantic segmentation on a public OCT dataset. SVDNA can be integrated with just a few lines of code into the augmentation pipeline of any network which is in contrast to many state-of-the-art domain adaptation methods which often need to change the underlying model architecture or train a separate style transfer model. The full code implementation for SVDNA will be made available at https://github.com/ValentinKoch/SVDNA ."}}
