{"id": "ugfKvsCgcu", "cdate": 1640995200000, "mdate": 1682689292361, "content": {"title": "Active Informed Consent to Boost the Application of Machine Learning in Medicine", "abstract": "Machine Learning may push research in precision medicine to unprecedented heights. To succeed, machine learning needs a large amount of data, often including personal data. Therefore, machine learning applied to precision medicine is on a cliff edge: if it does not learn to fly, it will deeply fall down. In this paper, we present Active Informed Consent (AIC) as a novel hybrid legal-technological tool to foster the gathering of a large amount of data for machine learning. We carefully analyzed the compliance of this technological tool to the legal intricacies protecting the privacy of European Citizens."}}
{"id": "peu0EvXqzk", "cdate": 1640995200000, "mdate": 1682689292351, "content": {"title": "The Dark Side of the Language: Pre-trained Transformers in the DarkNet", "abstract": "Pre-trained Transformers are challenging human performances in many natural language processing tasks. The gigantic datasets used for pre-training seem to be the key for their success on existing tasks. In this paper, we explore how a range of pre-trained natural language understanding models perform on truly novel and unexplored data, provided by classification tasks over a DarkNet corpus. Surprisingly, results show that syntactic and lexical neural networks largely outperform pre-trained Transformers. This seems to suggest that pre-trained Transformers have serious difficulties in adapting to radically novel texts."}}
{"id": "nh3GYoauwZ", "cdate": 1640995200000, "mdate": 1682689292338, "content": {"title": "Syntax and prejudice: ethically-charged biases of a syntax-based hate speech recognizer unveiled", "abstract": "Hate speech recognizers (HSRs) can be the panacea for containing hate in social media or can result in the biggest form of prejudice-based censorship hindering people to express their true selves. In this paper, we hypothesized how massive use of syntax can reduce the prejudice effect in HSRs. To explore this hypothesis, we propose Unintended-bias Visualizer based on Kermit modeling (KERM-HATE): a syntax-based HSR, which is endowed with syntax heat parse trees used as a post-hoc explanation of classifications. KERM-HATE significantly outperforms BERT-based, RoBERTa-based and XLNet-based HSR on standard datasets. Surprisingly this result is not sufficient. In fact, the post-hoc analysis on novel datasets on recent divisive topics shows that even KERM-HATE carries the prejudice distilled from the initial corpus. Therefore, although tests on standard datasets may show higher performance, syntax alone cannot drive the “attention” of HSRs to ethically-unbiased features."}}
{"id": "nBkGMUq5pU5", "cdate": 1640995200000, "mdate": 1682689292365, "content": {"title": "C-OSINT: COVID-19 Open Source Artificial INTelligence Framework", "abstract": ""}}
{"id": "bJgDeQXcEDl", "cdate": 1640995200000, "mdate": 1682689292344, "content": {"title": "Shedding Light on the Dark Web: Authorship Attribution in Radical Forums", "abstract": "Online users tend to hide their real identities by adopting different names on the Internet. On Facebook or LinkedIn, for example, people usually appear with their real names. On other standard websites, such as forums, people often use nicknames to protect their real identities. Aliases are used when users are trying to protect their anonymity. This can be a challenge to law enforcement trying to identify users who often change nicknames. In unmonitored contexts, such as the dark web, users expect strong identity protection. Thus, without censorship, these users may create parallel social networks where they can engage in potentially malicious activities that could pose security threats. In this paper, we propose a solution to the need to recognize people who anonymize themselves behind nicknames—the authorship attribution (AA) task—in the challenging context of the dark web: specifically, an English-language Islamic forum dedicated to discussions of issues related to the Islamic world and Islam, in which members of radical Islamic groups are present. We provide extensive analysis by testing models based on transformers, styles, and syntactic features. Downstream of the experiments, we show how models that analyze syntax and style perform better than pre-trained universal language models."}}
{"id": "P463qj7PBGF", "cdate": 1640995200000, "mdate": 1682689292357, "content": {"title": "Every time I fire a conversational designer, the performance of the dialogue system goes down", "abstract": "Giancarlo Xompero, Michele Mastromattei, Samir Salman, Cristina Giannone, Andrea Favalli, Raniero Romagnoli, Fabio Massimo Zanzotto. Proceedings of the Thirteenth Language Resources and Evaluation Conference. 2022."}}
{"id": "EmtsGKJuPe", "cdate": 1640995200000, "mdate": 1682689292349, "content": {"title": "Change My Mind: How Syntax-based Hate Speech Recognizer Can Uncover Hidden Motivations Based on Different Viewpoints", "abstract": ""}}
{"id": "EX5TljpoSWI", "cdate": 1640995200000, "mdate": 1682689292342, "content": {"title": "Machine Learning Techniques for Italian Phishing Detection", "abstract": ""}}
{"id": "DkJbEFt0pN", "cdate": 1640995200000, "mdate": 1682689292352, "content": {"title": "Lacking the Embedding of a Word? Look it up into a Traditional Dictionary", "abstract": ""}}
{"id": "2GHcRVQNld", "cdate": 1640995200000, "mdate": 1682689292343, "content": {"title": "Dis-Cover AI Minds to Preserve Human Knowledge", "abstract": "Modern AI technologies make use of statistical learners that lead to self-empiricist logic, which, unlike human minds, use learned non-symbolic representations. Nevertheless, it seems that it is not the right way to progress in AI. The structure of symbols—the operations by which the intellectual solution is realized—and the search for strategic reference points evoke important issues in the analysis of AI. Studying how knowledge can be represented through methods of theoretical generalization and empirical observation is only the latest step in a long process of evolution. For many years, humans, seeing language as innate, have carried out symbolic theories. Everything seems to have skipped ahead with the advent of Machine Learning. In this paper, after a long analysis of history, the rule-based and the learning-based vision, we would investigate the syntax as possible meeting point between the different learning theories. Finally, we propose a new vision of knowledge in AI models based on a combination of rules, learning, and human knowledge."}}
