{"id": "Ek4o-xMTZYX", "cdate": 1640995200000, "mdate": 1683632336340, "content": {"title": "Space-Time Block Preconditioning for Incompressible Flow", "abstract": "Parallel-in-time methods have become increasingly popular in the simulation of time-dependent numerical PDEs, allowing for the efficient use of additional message passing interface processes when spatial parallelism saturates. Most methods treat the solution and parallelism in space and time separately. In contrast, all-at-once methods solve the full space-time system directly, largely treating time as simply another spatial dimension. All-at-once methods offer a number of benefits over separate treatment of space and time, most notably significantly increased parallelism and faster time to solution (when applicable). However, the development of fast, scalable all-at-once methods has largely been limited to time-dependent (advection-)diffusion problems. This paper introduces the concept of space-time block preconditioning for the all-at-once solution of incompressible flow. By extending well-known concepts of spatial block preconditioning to the space-time setting, we develop a block preconditioner whose application requires the solution of a space-time (advection-)diffusion equation in the velocity block, coupled with a pressure Schur complement approximation consisting of independent spatial solves at each time-step, and a space-time matrix-vector multiplication. The new method is tested on four classical models in incompressible flow. Results indicate perfect scalability in refinement of spatial and temporal mesh spacing, perfect scalability in nonlinear Picard iteration count when applied to a nonlinear Navier--Stokes problem, and minimal overhead in terms of number of preconditioner applications compared with sequential time-stepping."}}
{"id": "zifN3lM6LN", "cdate": 1609459200000, "mdate": 1683632336322, "content": {"title": "Multigrid Reduction in Time for non-linear hyperbolic equations", "abstract": "Time-parallel algorithms seek greater concurrency by decomposing the temporal domain of a Partial Differential Equation (PDE), providing possibilities for accelerating the computation of its solution. While parallelisation in time has allowed remarkable speed-ups in applications involving parabolic equations, its effectiveness in the hyperbolic framework remains debatable: growth of instabilities and slow convergence are both strong issues in this case, which often negate most of the advantages from time-parallelisation. Here, we focus on the Multigrid Reduction in Time (MGRIT) algorithm, investigating in detail its performance when applied to non-linear conservation laws with a variety of discretisation schemes. Specific attention is given to high-accuracy Weighted Essentially Non-Oscillatory (WENO) reconstructions, coupled with Strong Stability Preserving (SSP) integrators, which are often the discretisations of choice for such PDEs. A technique to improve the performance of MGRIT when applied to a low-order, more dissipative scheme is also outlined. This study aims at identifying the main causes for degradation in the convergence speed of the algorithm, and finds the Courant-Friedrichs-Lewy (CFL) limit to be the principal determining factor."}}
{"id": "lK2nU5_WhM", "cdate": 1609459200000, "mdate": 1683632336336, "content": {"title": "Time-parallelisation techniques with applications to plasma simulation", "abstract": "Parallel-in-time (PinT) methods have become an increasingly popular tool in the numerical solution of time-dependent Partial Differential Equations (PDEs), in light of their potential for extracting additional concurrency when spatial parallelism saturates. Particularly complex applications, such as the ones involving plasma simulations for fusion research, would benefit greatly from the implementation of such methods, given the large computational time usually necessary for the numerical solution of their governing equations. In the first part of this thesis, we develop the concept of Space-Time Block Preconditioning (STBP), a technique for simplifying the task of time-parallelising the solution of a whole system of PDEs by reducing it to that of inverting space-time operators acting on single variables only, which are more amenable to be tackled by PinT algorithms. This technique borrows from block preconditioning strategies developed for spatial operators in the framework of time-stepping algorithms, and extends them to the whole space-time setting. After illustrating the guiding principles behind STBP, we measure its effectiveness with applications in fluid dynamics and magnetohydrodynamics. In both cases, the resulting pre-conditioners show excellent scaling properties with respect to mesh refinement, and their applications come at little-to-no overhead cost in terms of iterations to convergence with respect to their time-stepping counterpart, thus providing evidence for their potential parallel efficiency. Ultimately, however, the parallel performance of a space-time block preconditioner depends on that of its internal components, which still rely on already-existing PinT methods. This might become an issue when dealing with advection-dominated or hyperbolic equations, as classical PinT algorithms have shown to struggle in this case. For this reason, the second part of this thesis is dedicated to investigating the causes behind this degradation in performance, as well as to study more recent PinT approaches for overcoming this limitation."}}
{"id": "WHLmFi_Q3W8", "cdate": 1609459200000, "mdate": 1683632336322, "content": {"title": "All-at-once solution of linear wave equations", "abstract": "Efficient parallel-in-time methods for hyperbolic partial differential equation problems remain scarce. Here we investigate an approach based on circulant preconditioned generalised minimal residual ..."}}
{"id": "Z18bxEDin_S", "cdate": 1577836800000, "mdate": 1683632336322, "content": {"title": "Tight two-level convergence of Linear Parareal and MGRIT: Extensions and implications in practice", "abstract": "Two of the most popular parallel-in-time methods are Parareal and multigrid-reduction-in-time (MGRIT). Recently, a general convergence theory was developed in Southworth (2019) for linear two-level MGRIT/Parareal that provides necessary and sufficient conditions for convergence, with tight bounds on worst-case convergence factors. This paper starts by providing a new and simplified analysis of linear error and residual propagation of Parareal, wherein the norm of error or residual propagation is given by one over the minimum singular value of a certain block bidiagonal operator. New discussion is then provided on the resulting necessary and sufficient conditions for convergence that arise by appealing to block Toeplitz theory as in Southworth (2019). Practical applications of the theory are discussed, and the convergence bounds demonstrated to predict convergence in practice to high accuracy on two standard linear hyperbolic PDEs: the advection(-diffusion) equation, and the wave equation in first-order form."}}
