{"id": "oydpDn4d52", "cdate": 1677628800000, "mdate": 1682328746176, "content": {"title": "Fuzzy Synchronization of Chaotic Systems with Hidden Attractors", "abstract": "Chaotic systems are hard to synchronize, and no general solution exists. The presence of hidden attractors makes finding a solution particularly elusive. Successful synchronization critically depends on the control strategy, which must be carefully chosen considering system features such as the presence of hidden attractors. We studied the feasibility of fuzzy control for synchronizing chaotic systems with hidden attractors and employed a special numerical integration method that takes advantage of the oscillatory characteristic of chaotic systems. We hypothesized that fuzzy synchronization and the chosen numerical integration method can successfully deal with this case of synchronization. We tested two synchronization schemes: complete synchronization, which leverages linearization, and projective synchronization, capitalizing on parallel distributed compensation (PDC). We applied the proposal to a set of known chaotic systems of integer order with hidden attractors. Our results indicated that fuzzy control strategies combined with the special numerical integration method are effective tools to synchronize chaotic systems with hidden attractors. In addition, for projective synchronization, we propose a new strategy to optimize error convergence. Furthermore, we tested and compared different Takagi–Sugeno (T–S) fuzzy models obtained by tensor product (TP) model transformation. We found an effect of the fuzzy model of the chaotic system on the synchronization performance."}}
{"id": "pirW-0ynZx", "cdate": 1640995200000, "mdate": 1682328746173, "content": {"title": "Risks of misinterpretation in the evaluation of Distant Supervision for Relation Extraction", "abstract": "Distant Supervision is frequently used for addressing Relation Extraction. The evaluation of Distant Supervision in Relation Extraction has been attempted through Precision-Recall curves and/or calculation of Precision at N elements. However, such evaluation is challenging because the labeling of the instances results from an automatic process that can introduce noise into the labels. Consequently, the labels are not necessarily correct, affecting the learning process and the interpretation of the evaluation results. Therefore, this research aims to show that the performance of the methods measured with the mentioned evaluation strategies varies significantly if the correct labels are used during the evaluation. Besides, based on the preceding, the current interpretation of the results of these measures is questioned. To this end, we manually labeled a subset of a well-known data set and evaluated the performance of 6 traditional Distant Supervision approaches. We demonstrate quantitative differences in the evaluation scores when considering manually versus automatically labeled subsets. Consequently, the ranking of performance among distant supervision methods is different with both labeled. "}}
{"id": "j3V_3qgMSn", "cdate": 1640995200000, "mdate": 1682328746172, "content": {"title": "Multi-Label and Multimodal Classifier for Affective States Recognition in Virtual Rehabilitation", "abstract": "Computational systems that process multiple affective states may benefit from explicitly considering the interaction between the states to enhance their recognition performance. This work proposes the combination of a multi-label classifier, Circular Classifier Chain (CCC), with a multimodal classifier, Fusion using a Semi-Naive Bayesian classifier (FSNBC), to include explicitly the dependencies between multiple affective states during the automatic recognition process. This combination of classifiers is applied to a virtual rehabilitation context of post-stroke patients. We collected data from post-stroke patients, which include finger pressure, hand movements, and facial expressions during ten longitudinal sessions. Videos of the sessions were labelled by clinicians to recognize four states: tiredness, anxiety, pain, and engagement. Each state was modelled by the FSNBC receiving the information of finger pressure, hand movements, and facial expressions. The four FSNBCs were linked in the CCC to exploit the dependency relationships between the states. The convergence of CCC was reached by 5 iterations at most for all the patients. Results (ROC AUC) of CCC with the FSNBC are over <inline-formula><tex-math notation=\"LaTeX\">$0.940 \\pm 0.045$</tex-math></inline-formula> ( <inline-formula><tex-math notation=\"LaTeX\">$mean \\pm std.\\;deviation$</tex-math></inline-formula> ) for the four states. Relationships of mutual exclusion between engagement and all the other states and co-occurrences between pain and anxiety were detected and discussed."}}
{"id": "IXddmMgrvo", "cdate": 1640995200000, "mdate": 1682328746171, "content": {"title": "ReminiScentia: shaping olfactory interaction in a personal space for multisensory stimulation therapy", "abstract": "Recently, multimodal interfaces are incorporating smell as an additional means of interaction. Devices called olfactory displays have been designed to improve applications with various objectives, such as notifying or alerting through scents, increasing immersion in virtual or augmented reality applications, or learning and enhancement of mental functions. Based on the potential of olfactory memory to evoke memories and emotions to benefit health and well-being, we propose ReminiScentia as an olfactory display to generate and deliver scents. This work presents an evaluation of the effectiveness of ReminiScentia in evoking brain responses similar to those generated by manually delivered scents. To achieve this, we monitored the hemodynamic responses during manual and ReminiScentia olfactory stimulation over the prefrontal cortex (PFC) by using a functional near-infrared spectroscopy (fNIRS) device in 33 healthy subjects. Among the results, it was found that when ReminiScentia was used to deliver the olfactory stimuli, there is no statistically significant difference in the magnitude of concentration changes of OxyHb in the PFC between manual deliver and ReminiScentia (Wilcoxon: p > 0.05). The effectiveness of the use of ReminiScentia has allowed us not only its application for the evocation of memories in a multisensory therapy but also to propose an olfactory interaction design space where olfactory stimuli are used to provide feedback or instructions in multisensory stimulation activities that could support the training of higher mental functions such as memory and learning in patients with cognitive disabilities."}}
{"id": "E_eaOORE2M", "cdate": 1640995200000, "mdate": 1682328746289, "content": {"title": "Evaluation of a New Representation for Noise Reduction in Distant Supervision", "abstract": "Distant Supervision is a relation extraction approach that allows automatic labeling of a dataset. However, this labeling introduces noise in the labels (e.g., when two entities in a sentence are automatically labeled with an invalid relation). Noise in labels makes difficult the relation extraction task. This noise is precisely one of the main challenges of this task. Until now, the methods that incorporate a previous noise reduction step do not evaluate the performance of this step. This paper evaluates the noise reduction using a new representation obtained with autoencoders. In addition, it was incoporated more information to the input of the autoencoder proposed in the state-of-the-art to improve the representation over which the noise is reduced. Also, three methods were proposed to select the instances considered as real. As a result, it was obtained the highest values of the area under the ROC curves using the improved input combined with state-of-the-art anomaly detection methods. Moreover, the three proposed selection methods significantly improve the existing method in the literature."}}
{"id": "DD_-zXic0t3", "cdate": 1640995200000, "mdate": 1682328746176, "content": {"title": "An autoencoder-based representation for noise reduction in distant supervision of relation extraction", "abstract": "Distant Supervision is an approach that allows automatic labeling of instances. This approach has been used in Relation Extraction. Still, the main challenge of this task is handling instances with noisy labels (e.g., when two entities in a sentence are automatically labeled with an invalid relation). The approaches reported in the literature addressed this problem by employing noise-tolerant classifiers. However, if a noise reduction stage is introduced before the classification step, this increases the macro precision values. This paper proposes an Adversarial Autoencoders-based approach for obtaining a new representation that allows noise reduction in Distant Supervision. The representation obtained using Adversarial Autoencoders minimize the intra-cluster distance concerning pre-trained embeddings and classic Autoencoders. Experiments demonstrated that in the noise-reduced datasets, the macro precision values obtained over the original dataset are similar using fewer instances considering the same classifier. For example, in one of the noise-reduced datasets, the macro precision was improved approximately 2.32% using 77% of the original instances. This suggests the validity of using Adversarial Autoencoders to obtain well-suited representations for noise reduction. Also, the proposed approach maintains the macro precision values concerning the original dataset and reduces the total instances needed for classification."}}
{"id": "ph5NEOCwk3o", "cdate": 1609459200000, "mdate": 1682328746187, "content": {"title": "Dealing with a Missing Sensor in a Multilabel and Multimodal Automatic Affective States Recognition System", "abstract": "Data from multiple sensors can boost the automatic recognition of multiple affective states in a multilabel and multimodal recognition system. At any time, the streaming from any of the contributing sensors can be missing. This work proposes a method for dealing with a missing sensor in a multilabel and multimodal automatic affective states recognition system. The proposed method, called Hot Deck using Conditional Probability Tables (HD-CPT), is incorporated into a multimodal affective state recognition system for compensating the loss of a sensor using the recorded historical information of the sensor and its interaction with the other available sensors. In this work, we consider a multilabel classifier, named Circular Classifier Chain, for the automatic recognition of four states: tiredness, anxiety, pain, and engagement; combined with a multimodal classifier based on three sensors: fingers pressure, hand movements, and facial expressions; which was adapted for coping with the problem of a missing sensor in a virtual rehabilitation platform for post-stroke patients. A dataset of five post-stroke patients who attended ten longitudinal rehabilitation sessions was used for the evaluation. The inclusion of HD-CPT compensated for the loss of one sensor with results above those obtained with only the remaining sensors available. HD-CPT prevents the system from collapsing when a sensor fails, providing continuity of operation with results that attenuate the loss of the sensor. The proposed method HD-CPT can provide robustness for the naturalistic everyday use of an affective states recognition system."}}
{"id": "OO9JDMR48fH", "cdate": 1609459200000, "mdate": 1682328746290, "content": {"title": "Characterization of a Raspberry Pi as the Core for a Low-cost Multimodal EEG-fNIRS Platform", "abstract": "Poor understanding of brain recovery after injury, sparsity of evaluations and limited availability of healthcare services hinders the success of neurorehabilitation programs in rural communities. The availability of neuroimaging ca-pacities in remote communities can alleviate this scenario supporting neurorehabilitation programs in remote settings. This research aims at building a multimodal EEG-fNIRS neuroimaging platform deployable to rural communities to support neurorehabilitation efforts. A Raspberry Pi 4 is chosen as the CPU for the platform responsible for presenting the neurorehabilitation stimuli, acquiring, processing and storing concurrent neuroimaging records as well as the proper synchronization between the neuroimaging streams. We present here two experiments to assess the feasibility and characterization of the Raspberry Pi as the core for a multimodal EEG-fNIRS neuroimaging platform; one over controlled conditions using a combination of synthetic and real data, and another from a full test during resting state. CPU usage, RAM usage and operation temperature were measured during the tests with mean operational records below 40% for CPU cores, 13.6% for memory and 58.85 ° C for temperatures. Package loss was inexistent on synthetic data and negligible on experimental data. Current consumption can be satisfied with a 1000 mAh 5V battery. The Raspberry Pi 4 was able to cope with the required workload in conditions of operation similar to those needed to support a neurorehabilitation evaluation."}}
{"id": "NYs46DoWoS", "cdate": 1609459200000, "mdate": 1682328746175, "content": {"title": "Key factors that influence the UX of a dual-player game for the cognitive stimulation and motor rehabilitation of older adults", "abstract": "In this work, the results of usability and user experience (UX) evaluation of a serious video game for the cognitive stimulation and motor rehabilitation of the upper limb of the elderly are presented. The serious game includes features that allow (1) performing cooperative therapy exercises between two patients, (2) remote session configuration therapy, and (3) monitoring/analyzing the sessions’ results by the therapist. An evaluation of the game with 16 older adults provides evidence about how the tool is perceived by participants, who embraced it as stimulating, useful, usable and even fun, and which impacts in therapy compliance and acceptability by the elderly. In addition, through an in depth analysis of the participants’ performance and observed emotions, as well as their self-report, we determined which engagement attributes are present in the game. Finally, we also found evidence that suggests that the participants’ skill level and the game difficulty level rather than just a good performance on the game are key factors that influence their enjoyment and frustration."}}
{"id": "2WQDPVdYUnK", "cdate": 1609459200000, "mdate": 1682328746173, "content": {"title": "Ordering of functions according to multiple fuzzy criteria: application to denoising electroencephalography", "abstract": "We introduce a new relation of order over functions according to multiple fuzzy criteria. Proof of the complied properties for relations of partial orders is given. Convergent and divergent validity of the new membership functions is established. Tolerance to noise of the relation of order is evaluated by corrupting synthetic prototypes and observing changes in the retrieved ordering. The effect of weighting strategies is evaluated in terms of Jaccard and XOR indices. The performance of the ordering algorithm is quantified in terms of richness of the resulting Hasse diagram. Applicability is demonstrated in the context of de-noising electroencephalographic (EEG) signals exemplified over two datasets and evaluated by classification wrapping."}}
