{"id": "nXjyCmLOYj", "cdate": 1685624089148, "mdate": null, "content": {"title": "FedLEGO: Enabling Heterogenous Model Cooperation via Brick Reassembly in Federated Learning", "abstract": "This paper focuses on addressing the practical yet challenging problem of model heterogeneity in federated learning, where clients possess models with different network structures. To track this problem, we propose a novel framework called FedLEGO, which treats each client model as a LEGO toy, reassembles it into bricks, and assembles bricks back into personalized models accordingly. Moreover, FedLEGO automatically and dynamically generates informative and diverse personalized candidates with minimal human intervention. Furthermore, our proposed heterogeneous model reassembly technique mitigates the adverse impact introduced by using public data with different distributions from the client data to a certain extent. Experimental results demonstrate that FedLEGO outperforms baselines on three datasets under both IID and Non-IID settings. Additionally, FedLEGO effectively reduces the adverse impact of using different public data and dynamically generates diverse personalized models in an automated manner."}}
{"id": "E7jF3Z6pF-", "cdate": 1648717893710, "mdate": 1648717893710, "content": {"title": "Writing by Memorizing: Hierarchical Retrieval-based Medical Report Generation", "abstract": "Medical report generation is one of the most challenging tasks in medical image analysis. Although existing approaches have achieved promising results, they either require a predefined template database in order to retrieve sentences or ignore the hierarchical nature of medical report generation. To address these issues, we propose MedWriter that incorporates a novel hierarchical retrieval mechanism to automatically extract both report and sentence-level templates for clinically accurate report generation. MedWriter first employs the Visual-Language Retrieval~(VLR) module to retrieve the most relevant reports for the given images. To guarantee the logical coherence between sentences, the Language-Language Retrieval~(LLR) module is introduced to retrieve relevant sentences based on the previous generated description. At last, a language decoder fuses image features and features from retrieved reports and sentences to generate meaningful medical reports. We verified the effectiveness of our model by automatic evaluation and human evaluation on two datasets, i.e., Open-I and MIMIC-CXR."}}
{"id": "tLcjEpy6lf", "cdate": 1640995200000, "mdate": 1668029141962, "content": {"title": "LeapAttack: Hard-Label Adversarial Attack on Text via Gradient-Based Optimization", "abstract": ""}}
{"id": "sWMDFXhuaW1", "cdate": 1640995200000, "mdate": 1668029141994, "content": {"title": "QUALIFIER: Question-Guided Self-Attentive Multimodal Fusion Network for Audio Visual Scene-Aware Dialog", "abstract": "Audio video scene-aware dialog (AVSD) is a new but more challenging visual question answering (VQA) task because of the higher complexity of feature extraction and fusion brought by the additional modalities. Although recent methods have achieved early success in improving feature extraction technique for AVSD, the technique of feature fusion still needs further investigation. In this paper, inspired by the success of self-attention mechanism and the importance of understanding questions for VQA answering, we propose a question-guided self-attentive multi-modal fusion network (QUALIFIER) to improve the AVSD practice in the stage of feature fusion and answer generation. Specifically, after extracting features and learning a comprehensive feature for each modality, we first use the designed self-attentive multi-modal fusion (SMF) module to aggregate each feature with the correlated information learned from others. Later, by prioritizing the question feature, we concatenate it with each fused feature to guide the generation of a natural language response to the question. As for experimental results, QUALIFIER shows better performance than other baseline methods in the large-scale AVSD dataset named DSTC7. Additionally, the human evaluation and ablation study results also demonstrate the effectiveness of our network architecture."}}
{"id": "j8lqtyKGHO", "cdate": 1640995200000, "mdate": 1668029142030, "content": {"title": "Forecasting User Interests Through Topic Tag Predictions in Online Health Communities", "abstract": "The increasing reliance on online communities for healthcare information by patients and caregivers has led to the increase in the spread of misinformation, or subjective, anecdotal and inaccurate or non-specific recommendations, which, if acted on, could cause serious harm to the patients. Hence, there is an urgent need to connect users with accurate and tailored health information in a timely manner to prevent such harm. This paper proposes an innovative approach to suggesting reliable information to participants in online communities as they move through different stages in their disease or treatment. We hypothesize that patients with similar histories of disease progression or course of treatment would have similar information needs at comparable stages. Specifically, we pose the problem of predicting topic tags or keywords that describe the future information needs of users based on their profiles, traces of their online interactions within the community (past posts, replies) and the profiles and traces of online interactions of other users with similar profiles and similar traces of past interaction with the target users. The result is a variant of the collaborative information filtering or recommendation system tailored to the needs of users of online health communities. We report results of our experiments on an expert curated data set which demonstrate the superiority of the proposed approach over the state of the art baselines with respect to accurate and timely prediction of topic tags (and hence information sources of interest)."}}
{"id": "dsONSHOVe2", "cdate": 1640995200000, "mdate": 1668029142021, "content": {"title": "Predicting Ulnar Collateral Ligament Injury in Rookie Major League Baseball Pitchers", "abstract": "In the growing world of machine learning and data analytics, scholars are finding new and innovative ways to solve real-world problems. One solution comes by way of an intersection between healthcare, sports statistics, and data sciences. Within the realm of Major League Baseball (MLB), pitchers are regarded as the most important roster position. They often are among the highest paid players and are crucial to a franchise's success, but they are more at risk to suffer an injury that sidelines them for over a complete season. The ulnar collateral ligament (UCL) is a small ligament in the elbow that controls the strength and stability of a pitcher's throwing arm. Due to repetitive strain, it is not uncommon for pitchers to tear it partially or completely during their careers. Repairing this injury requires UCL reconstruction surgery, as known informally as Tommy John surgery. In this podium abstract, we want to investigate whether we can use machine learning techniques to predict UCL injury by analyzing online pitcher data."}}
{"id": "ddY2G9xvELo", "cdate": 1640995200000, "mdate": 1668029141971, "content": {"title": "Price DOES Matter! Modeling Price and Interest Preferences in Session-based Recommendation", "abstract": "Session-based recommendation aims to predict items that an anonymous user would like to purchase based on her short behavior sequence. The current approaches towards session-based recommendation only focus on modeling users' interest preferences, while they all ignore a key attribute of an item, i.e., the price. Many marketing studies have shown that the price factor significantly influences users' behaviors and the purchase decisions of users are determined by both price and interest preferences simultaneously. However, it is nontrivial to incorporate price preferences for session-based recommendation. Firstly, it is hard to handle heterogeneous information from various features of items to capture users' price preferences. Secondly, it is difficult to model the complex relations between price and interest preferences in determining user choices. To address the above challenges, we propose a novel method Co-guided Heterogeneous Hypergraph Network (CoHHN) for session-based recommendation. Towards the first challenge, we devise a heterogeneous hypergraph to represent heterogeneous information and rich relations among them. A dual-channel aggregating mechanism is then designed to aggregate various information in the heterogeneous hypergraph. After that, we extract users' price preferences and interest preferences via attention layers. As to the second challenge, a co-guided learning scheme is designed to model the relations between price and interest preferences and enhance the learning of each other. Finally, we predict user actions based on item features and users' price and interest preferences. Extensive experiments on three real-world datasets demonstrate the effectiveness of the proposed CoHHN. Further analysis reveals the significance of price for session-based recommendation."}}
{"id": "Yr0RI7hf1M7", "cdate": 1640995200000, "mdate": 1668029141962, "content": {"title": "Textbook Enhanced Student Learning Outcome Prediction", "abstract": "Online learning platforms that can recommend tailored materials for different students have become increasingly popular recently. To enable personalized learning, it is critical and essential to automatically estimate the mastery levels of students, which motivates a new task in the education field, i.e., the student learning outcome prediction. Although several models have been proposed, most of them ignore the relations between questions and knowledge concepts. However, manually labeling the relations among questions only by experts is inefficient and impractical, due to the large volume of questions in the online learning platforms. Thus, an automatic inference of such relations is needed. In addition, different students may use different concepts when answering the same question, which makes the inferred relation between a question and concepts differ among students. To address these challenges, we propose to leverage information from a textbook to link questions with knowledge concepts that a student may retrieve. Correspondingly, we propose a novel framework named TESLOP, which can effectively utilize both textual and structural information in the textbook for student learning outcome prediction. The model simulates the process of a student picking an answer by recalling the knowledge obtained from the textbook and utilizing the knowledge to pick a correct answer. Experimental results show that the proposed TESLOP framework outperforms state-of-the-art baselines, which confirms the importance of leveraging textbook information in the student learning outcome prediction task. It also demonstrates that the proposed way of integrating such information is effective."}}
{"id": "WyfaIORI-uG", "cdate": 1640995200000, "mdate": 1668029141961, "content": {"title": "Dynamic intent-aware iterative denoising network for session-based recommendation", "abstract": ""}}
{"id": "QY3oyQ42I9G", "cdate": 1640995200000, "mdate": 1668029141966, "content": {"title": "Price DOES Matter!: Modeling Price and Interest Preferences in Session-based Recommendation", "abstract": "Session-based recommendation aims to predict items that an anonymous user would like to purchase based on her short behavior sequence. The current approaches towards session-based recommendation only focus on modeling users' interest preferences, while they all ignore a key attribute of an item, i.e., the price. Many marketing studies have shown that the price factor significantly influences users' behaviors and the purchase decisions of users are determined by both price and interest preferences simultaneously. However, it is nontrivial to incorporate price preferences for session-based recommendation. Firstly, it is hard to handle heterogeneous information from various features of items to capture users' price preferences. Secondly, it is difficult to model the complex relations between price and interest preferences in determining user choices. To address the above challenges, we propose a novel method Co-guided Heterogeneous Hypergraph Network (CoHHN) for session-based recommendation. Towards the first challenge, we devise a heterogeneous hypergraph to represent heterogeneous information and rich relations among them. A dual-channel aggregating mechanism is then designed to aggregate various information in the heterogeneous hypergraph. After that, we extract users' price preferences and interest preferences via attention layers. As to the second challenge, a co-guided learning scheme is designed to model the relations between price and interest preferences and enhance the learning of each other. Finally, we predict user actions based on item features and users' price and interest preferences. Extensive experiments on three real-world datasets demonstrate the effectiveness of the proposed CoHHN. Further analysis reveals the significance of price for session-based recommendation."}}
