{"id": "l0uGlVgxLJ", "cdate": 1680307200000, "mdate": 1683971403304, "content": {"title": "A novel technique for the detection of myocardial dysfunction using ECG signals based on CEEMD, DWT, PSR and neural networks", "abstract": "The cardiovascular disease is one of the most serious health problems around the world. Traditionally, detection of cardiac arrhythmia based on the visual inspection of electrocardiography (ECG) signals by cardiologists is tedious, laborious and subjective. To overcome such disadvantages, numerous arrhythmia detection techniques including signal processing and machine learning tools have been developed. However, there still remain the problems of automatic detection with high efficiency and accuracy in distinguishing different myocardial dysfunctions through ECG signals. In this study we propose a novel technique for automatic detection of cardiac arrhythmia in one-lead ECG signals based upon complete ensemble empirical mode decomposition (CEEMD), discrete wavelet transform (DWT), phase space reconstruction (PSR) and neural networks. First, ECG signals are decomposed into a series of Intrinsic Mode Functions (IMFs) by using the CEEMD method without the preprocessing of QRS detection. The IMF6 and IMF7 of the ECG signals are extracted, which contain the majority of the ECG signals’ energy and are considered to be the predominant IMFs. Second, four levels DWT is employed to decompose the predominant IMFs into different frequency bands, in which third-order Daubechies (db3) wavelet function is selected as reference variable for analysis. Third, phase space of the reference variable is reconstructed based on db3, in which the properties associated with the nonlinear ECG system dynamics are preserved. Three-dimensional (3D) PSR together with Euclidean distance (ED) has been utilized to derive features, which demonstrate significant difference in ECG system dynamics between normal versus abnormal individual heartbeats. Fourth, neural networks are then used to model, identify and classify ECG system dynamics between normal (healthy) and arrhythmia ECG signals. Finally, experiments are carried out on the MIT-BIH arrhythmia database to assess the effectiveness of the proposed method, in which 436 ECG signal fragments for one lead (MLII) from 28 persons of five classes of heart beats were extracted. By using the 10-fold cross-validation style, the achieved average classification accuracy is reported to be $$98.81\\%$$ 98.81 % . Compared with various state-of-the-art methods, the results demonstrate superior performance and the proposed method can serve as a potential candidate for the automatic detection of myocardial dysfunction in the clinical application."}}
{"id": "qEf_ETPCSW", "cdate": 1672531200000, "mdate": 1683971403303, "content": {"title": "Spectral CT Image-Domain Material Decomposition via Sparsity Residual Prior and Dictionary Learning", "abstract": "The spectral computed tomography (CT) system based on a photon-counting detector (PCD) can quantitatively analyze the material composition of the inspected object by material decomposition. Nonetheless, the raw projection of spectral CT is frequently disturbed by noise and artifacts, resulting in poor quality material decomposition images. Recently, a generalized dictionary learning based image-domain material decomposition (GDLIMD) to obtain high-quality material images. DL has great advantages in noise suppression and artifacts, while its protection of the fine structure and edge information is insufficient. To address this limitation, we proposed a sparsity residual prior and dictionary learning (SRPDL) algorithm for spectral CT image-domain material decomposition. The SRPDL method retains the noise-resistance performance of dictionary learning (DL) while introducing the pixel-value-based <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$l_{0} $ </tex-math></inline-formula> norm constraint to guide the material decomposition process by using the structural redundancy information between the prior image and the material images, which further improves structure protection and reduces material misclassification. We conducted numerical simulations, physical phantom, and preclinical experiments to validate and evaluate the SRPDL method. The results demonstrate that the proposed SRPDL method obtained better material decomposition accuracy than the state-of-the-art methods in noise reduction and edge protection."}}
