{"id": "o74n_EvupNh", "cdate": 1620405716601, "mdate": null, "content": {"title": "Optimally deceiving a learning leader in Stackelberg games", "abstract": "Recent results in the ML community have revealed that learning algorithms used to compute the optimal strategy for the leader to commit to in a Stackelberg game, are susceptible to manipulation by the follower. Such a learning algorithm operates by querying the best responses or the payoffs of the follower, who consequently can deceive the algorithm by responding as if his payoffs were much different than what they actually are. For this strategic behavior to be successful, the main challenge faced by the follower is to pinpoint the payoffs that would make the learning algorithm compute a commitment so that best responding to it maximizes the follower's utility, according to his true payoffs. While this problem has been considered before, the related literature only focused on the simplified scenario in which the payoff space is finite, thus leaving the general version of the problem unanswered. In this paper, we fill in this gap, by showing that it is always possible for the follower to compute (near-)optimal payoffs for various scenarios about the learning interaction between leader and follower."}}
{"id": "iKpx4bDavZA", "cdate": 1577836800000, "mdate": null, "content": {"title": "Learning Strong Substitutes Demand via Queries", "abstract": "This paper addresses the computational challenges of learning strong substitutes demand when given access to a demand (or valuation) oracle. Strong substitutes demand generalises the well-studied gross substitutes demand to a multi-unit setting. Recent work by Baldwin and Klemperer shows that any such demand can be expressed in a natural way as a finite list of weighted bid vectors. A simplified version of this bidding language has been used by the Bank of England. Assuming access to a demand oracle, we provide an algorithm that computes the unique list of weighted bid vectors corresponding to a bidder's demand preferences. In the special case where their demand can be expressed using positive bids only, we have an efficient algorithm that learns this list in linear time. We also show super-polynomial lower bounds on the query complexity of computing the list of bids in the general case where bids may be positive and negative. Our algorithms constitute the first systematic approach for bidders to construct a bid list corresponding to non-trivial demand, allowing them to participate in `product-mix' auctions."}}
{"id": "wxOoHiAPcVC", "cdate": 1546300800000, "mdate": null, "content": {"title": "Fairness and Efficiency in DAG-based Cryptocurrencies", "abstract": "Bitcoin is a decentralised digital currency that serves as an alternative to existing transaction systems based on an external central authority for security. Although Bitcoin has many desirable properties, one of its fundamental shortcomings is its inability to process transactions at high rates. To address this challenge, many subsequent protocols either modify the rules of block acceptance (longest chain rule) and reward, or alter the graphical structure of the public ledger from a tree to a directed acyclic graph (DAG). Motivated by these approaches, we introduce a new general framework that captures ledger growth for a large class of DAG-based implementations. With this in hand, and by assuming honest miner behaviour, we (experimentally) explore how different DAG-based protocols perform in terms of fairness, i.e., if the block reward of a miner is proportional to their hash power, as well as efficiency, i.e. what proportion of user transactions a ledger deems valid after a certain length of time. Our results demonstrate fundamental structural limits on how well DAG-based ledger protocols cope with a high transaction load. More specifically, we show that even in a scenario where every miner on the system is honest in terms of when they publish blocks, what they point to, and what transactions each block contains, fairness and efficiency of the ledger can break down at specific hash rates if miners have differing levels of connectivity to the P2P network sustaining the protocol."}}
{"id": "uSe_7c9cs1", "cdate": 1546300800000, "mdate": null, "content": {"title": "Logarithmic Query Complexity for Approximate Nash Computation in Large Games", "abstract": "We investigate the problem of equilibrium computation for “large” n-player games. Large games have a Lipschitz-type property that no single player’s utility is greatly affected by any other individual player’s actions. In this paper, we mostly focus on the case where any change of strategy by a player causes other players’ payoffs to change by at most 1 n $\\frac {1}{n}$ . We study algorithms having query access to the game’s payoff function, aiming to find ε-Nash equilibria. We seek algorithms that obtain ε as small as possible, in time polynomial in n. Our main result is a randomised algorithm that achieves ε approaching 1 8 $\\frac {1}{8}$ for 2-strategy games in a completely uncoupled setting, where each player observes her own payoff to a query, and adjusts her behaviour independently of other players’ payoffs/actions. O(log n) rounds/queries are required. We also show how to obtain a slight improvement over 1 8 $\\frac {1}{8}$ , by introducing a small amount of communication between the players. Finally, we give extension of our results to large games with more than two strategies per player, and alternative largeness parameters."}}
{"id": "V68I7Ttbtz5", "cdate": 1546300800000, "mdate": null, "content": {"title": "Competing (Semi)-Selfish Miners in Bitcoin", "abstract": "The Bitcoin protocol prescribes certain behavior by the miners who are responsible for maintaining and extending the underlying blockchain; in particular, miners who successfully solve a puzzle, and hence can extend the chain by a block, are supposed to release that block immediately. Eyal and Sirer showed, however, that a selfish miner is incentivized to deviate from the protocol and withhold its blocks under certain conditions.   The analysis by Eyal and Sirer, as well as in followup work, considers a \\emph{single} deviating miner (who may control a large fraction of the hashing power in the network) interacting with a remaining pool of honest miners. Here, we extend this analysis to the case where there are \\emph{multiple} (non-colluding) selfish miners. We find that with multiple strategic miners, specific deviations from honest mining by multiple strategic agents can outperform honest mining, even if individually miners would not be incentivised to be dishonest. This previous point effectively renders the Bitcoin protocol to be less secure than previously thought."}}
{"id": "B_QW2quOhAC", "cdate": 1546300800000, "mdate": null, "content": {"title": "Competing (Semi-)Selfish Miners in Bitcoin", "abstract": "The Bitcoin protocol prescribes certain behavior by the miners who are responsible for maintaining and extending the underlying blockchain; in particular, miners who successfully solve a puzzle, and hence can extend the chain by a block, are supposed to release that block immediately. Eyal and Sirer showed, however, that a selfish miner is incentivized to deviate from the protocol and withhold its blocks under certain conditions.                                                                                                                                                                   The analysis by Eyal and Sirer, as well as in followup work, considers a single selfish miner (who may control a large fraction of the hashing power in the network) interacting with a remaining pool of honest miners. Here, we extend this analysis to the case where there are multiple (non-colluding) selfish miners. We find that in this setting there are cases in which it may be profitable for those miners to deviate even when they would not be incentivized to deviate individually."}}
{"id": "KI1CzZrGTYs", "cdate": 1514764800000, "mdate": null, "content": {"title": "Learning Convex Partitions and Computing Game-theoretic Equilibria from Best Response Queries", "abstract": "Suppose that an $m$-simplex is partitioned into $n$ convex regions having disjoint interiors and distinct labels, and we may learn the label of any point by querying it. The learning objective is to know, for any point in the simplex, a label that occurs within some distance $\\epsilon$ from that point. We present two algorithms for this task: Constant-Dimension Generalised Binary Search (CD-GBS), which for constant $m$ uses $poly(n, \\log \\left( \\frac{1}{\\epsilon} \\right))$ queries, and Constant-Region Generalised Binary Search (CR-GBS), which uses CD-GBS as a subroutine and for constant $n$ uses $poly(m, \\log \\left( \\frac{1}{\\epsilon} \\right))$ queries. We show via Kakutani's fixed-point theorem that these algorithms provide bounds on the best-response query complexity of computing approximate well-supported equilibria of bimatrix games in which one of the players has a constant number of pure strategies. We also partially extend our results to games with multiple players, establishing further query complexity bounds for computing approximate well-supported equilibria in this setting."}}
{"id": "3MlVO0hiuob", "cdate": 1514764800000, "mdate": null, "content": {"title": "Learning Convex Partitions and Computing Game-Theoretic Equilibria from Best Response Queries", "abstract": "Suppose that an m-simplex is partitioned into n convex regions having disjoint interiors and distinct labels, and we may learn the label of any point by querying it. The learning objective is to know, for any point in the simplex, a label that occurs within some distance $$\\varepsilon $$ from that point. We present two algorithms for this task: Constant-Dimension Generalised Binary Search (CD-GBS), which for constant m uses $$poly(n, \\log \\left( \\frac{1}{\\varepsilon } \\right) )$$ queries, and Constant-Region Generalised Binary Search (CR-GBS), which uses CD-GBS as a subroutine and for constant n uses $$poly(m, \\log \\left( \\frac{1}{\\varepsilon } \\right) )$$ queries. We show via Kakutani’s fixed-point theorem that these algorithms provide bounds on the best-response query complexity of computing approximate well-supported equilibria of bimatrix games in which one of the players has a constant number of pure strategies."}}
{"id": "SHGQ-AKiSTj", "cdate": 1451606400000, "mdate": null, "content": {"title": "Logarithmic Query Complexity for Approximate Nash Computation in Large Games", "abstract": "We investigate the problem of equilibrium computation for \"large\" $n$-player games. Large games have a Lipschitz-type property that no single player's utility is greatly affected by any other individual player's actions. In this paper, we mostly focus on the case where any change of strategy by a player causes other players' payoffs to change by at most $\\frac{1}{n}$. We study algorithms having query access to the game's payoff function, aiming to find $\\epsilon$-Nash equilibria. We seek algorithms that obtain $\\epsilon$ as small as possible, in time polynomial in $n$. Our main result is a randomised algorithm that achieves $\\epsilon$ approaching $\\frac{1}{8}$ for 2-strategy games in a {\\em completely uncoupled} setting, where each player observes her own payoff to a query, and adjusts her behaviour independently of other players' payoffs/actions. $O(\\log n)$ rounds/queries are required. We also show how to obtain a slight improvement over $\\frac{1}{8}$, by introducing a small amount of communication between the players. Finally, we give extension of our results to large games with more than two strategies per player, and alternative largeness parameters."}}
{"id": "E1WwzjkYSJ", "cdate": 1451606400000, "mdate": null, "content": {"title": "Logarithmic Query Complexity for Approximate Nash Computation in Large Games", "abstract": "We investigate the problem of equilibrium computation for “large” n-player games where each player has two pure strategies. Large games have a Lipschitz-type property that no single player’s utility is greatly affected by any other individual player’s actions. In this paper, we assume that a player can change another player’s payoff by at most $$\\frac{1}{n}$$ by changing her strategy. We study algorithms having query access to the game’s payoff function, aiming to find $$\\varepsilon $$ -Nash equilibria. We seek algorithms that obtain $$\\varepsilon $$ as small as possible, in time polynomial in n. Our main result is a randomised algorithm that achieves $$\\varepsilon $$ approaching $$\\frac{1}{8}$$ in a completely uncoupled setting, where each player observes her own payoff to a query, and adjusts her behaviour independently of other players’ payoffs/actions. $$O(\\log n)$$ rounds/queries are required. We also show how to obtain a slight improvement over $$\\frac{1}{8}$$ , by introducing a small amount of communication between the players."}}
