{"id": "vF3MNDcOLu", "cdate": 1677628800000, "mdate": 1682581148539, "content": {"title": "Core-Periphery Detection in Hypergraphs", "abstract": "Core-periphery detection is a key task in exploratory network analysis where one aims to find a core, a set of nodes well connected internally and with the periphery, and a periphery, a set of nodes connected only (or mostly) with the core. In this work we propose a model of core-periphery for higher-order networks modeled as hypergraphs, and we propose a method for computing a core-score vector that quantifies how close each node is to the core. In particular, we show that this method solves the corresponding nonconvex core-periphery optimization problem globally to an arbitrary precision. This method turns out to coincide with the computation of the Perron eigenvector of a nonlinear hypergraph operator, suitably defined in terms of the incidence matrix of the hypergraph, generalizing recently proposed centrality models for hypergraphs. We perform several experiments on synthetic and real-world hypergraphs showing that the proposed method outperforms alternative core-periphery detection algorithms, in particular those obtained by transferring established graph methods to the hypergraph setting via clique expansion."}}
{"id": "qoja9oQRKC", "cdate": 1672531200000, "mdate": 1682581148546, "content": {"title": "Laplacian-based Semi-Supervised Learning in Multilayer Hypergraphs by Coordinate Descent", "abstract": "Graph Semi-Supervised learning is an important data analysis tool, where given a graph and a set of labeled nodes, the aim is to infer the labels to the remaining unlabeled nodes. In this paper, we start by considering an optimization-based formulation of the problem for an undirected graph, and then we extend this formulation to multilayer hypergraphs. We solve the problem using different coordinate descent approaches and compare the results with the ones obtained by the classic gradient descent method. Experiments on synthetic and real-world datasets show the potential of using coordinate descent methods with suitable selection rules."}}
{"id": "cLf300JyQK", "cdate": 1672531200000, "mdate": 1682581148405, "content": {"title": "Collaboration and topic switches in science", "abstract": "Collaboration is a key driver of science and innovation. Mainly motivated by the need to leverage different capacities and expertise to solve a scientific problem, collaboration is also an excellent source of information about the future behavior of scholars. In particular, it allows us to infer the likelihood that scientists choose future research directions via the intertwined mechanisms of selection and social influence. Here we thoroughly investigate the interplay between collaboration and topic switches. We find that the probability for a scholar to start working on a new topic increases with the number of previous collaborators, with a pattern showing that the effects of individual collaborators are not independent. The higher the productivity and the impact of authors, the more likely their coworkers will start working on new topics. The average number of coauthors per paper is also inversely related to the topic switch probability, suggesting a dilution of this effect as the number of collaborators increases."}}
{"id": "IhUUqkxWgBr", "cdate": 1672531200000, "mdate": 1682581148404, "content": {"title": "Quantifying the structural stability of simplicial homology", "abstract": "The homology groups of a simplicial complex reveal fundamental properties of the topology of the data or the system and the notion of topological stability naturally poses an important yet not fully investigated question. In the current work, we study the stability in terms of the smallest perturbation sufficient to change the dimensionality of the corresponding homology group. Such definition requires an appropriate weighting and normalizing procedure for the boundary operators acting on the Hodge algebra's homology groups. Using the resulting boundary operators, we then formulate the question of structural stability as a spectral matrix nearness problem for the corresponding higher-order graph Laplacian. We develop a bilevel optimization procedure suitable for the formulated matrix nearness problem and illustrate the method's performance on a variety of synthetic quasi-triangulation datasets and transportation networks."}}
{"id": "5zgtcrh_P4J", "cdate": 1672531200000, "mdate": 1682581148557, "content": {"title": "Optimizing network robustness via Krylov subspaces", "abstract": "We consider the problem of attaining either the maximal increase or reduction of the robustness of a complex network by means of a bounded modification of a subset of the edge weights. We propose two novel strategies combining Krylov subspace approximations with a greedy scheme and with the limited-memory BFGS. The paper discuss the computational and modeling aspects of our methodology and illustrates the various optimization problems on networks that can be addressed within the proposed framework. Finally, in the numerical experiments we compare the performances of our algorithms with state-of-the-art techniques on synthetic and real-world networks."}}
{"id": "-aNsDkIfYIU", "cdate": 1672531200000, "mdate": 1682581148421, "content": {"title": "A nonlinear model of opinion dynamics on networks with friction-inspired stubbornness", "abstract": "The modeling of opinion dynamics has seen much study in varying academic disciplines. Understanding the complex ways information can be disseminated is a complicated problem for mathematicians as well as social scientists. Inspired by the Cucker-Smale system of flocking dynamics, we present a nonlinear model of opinion dynamics that utilizes an environmental averaging protocol similar to the DeGroot and Freidkin-Johnsen models. Indeed, the way opinions evolve is complex and nonlinear effects ought to be considered when modelling. For this model, the nonlinearity destroys the translation invariance of the equations, as well as the convexity of the associated payout functions. The standard theory for well-posedness and convergence no longer applies and we must utilize the Brouwer topological degree and nonconvex analysis in order to achieve these results. Numerical simulations of the model reveal that the nonlinearity behaves similarly to the well-known Friedkin-Johnsen for so-called \"reasonable\" opinions, but better models the way agents that hold \"extreme\" opinions are more stubborn than their reasonable counterparts."}}
{"id": "RMwt1hhWVYU", "cdate": 1664582400000, "mdate": 1682581154449, "content": {"title": "A variance-aware multiobjective Louvain-like method for community detection in multiplex networks", "abstract": "In this article, we focus on the community detection problem in multiplex networks, that is, networks with multiple layers having the same node sets and no inter-layer connections. In particular, we look for groups of nodes that can be recognized as communities consistently across the layers. To this end, we propose a new approach that generalizes the Louvain method by (a) simultaneously updating the average and variance of the modularity scores across the layers and (b) reformulating the greedy search procedure in terms of a filter-based multiobjective optimization scheme. Unlike many previous modularity maximization strategies, which rely on some form of aggregation of the various layers, our multiobjective approach aims at maximizing the individual modularities on each layer simultaneously. We report experiments on synthetic and real-world networks, showing the effectiveness and the robustness of the proposed strategies both in the informative case, where all layers show the same community structure, and in the noisy case, where some layers represent only noise."}}
{"id": "IILJ0KWZMy9", "cdate": 1652737611770, "mdate": null, "content": {"title": "Low-rank lottery tickets: finding efficient low-rank neural networks via matrix differential equations", "abstract": "Neural networks have achieved tremendous success in a large variety of applications. However, their memory footprint and computational demand can render them impractical in application settings with limited hardware or energy resources. In this work, we propose a novel algorithm to find efficient low-rank subnetworks. Remarkably, these subnetworks are determined and adapted already during the training phase and the overall time and memory resources required by both training and evaluating them is significantly reduced. The main idea is to restrict the weight matrices to a \nlow-rank manifold and to update the low-rank factors rather than the full matrix during training. To derive training updates that are restricted to the prescribed manifold, we employ techniques from dynamic model order reduction for matrix differential equations. Moreover, our method automatically and dynamically adapts the ranks during training to achieve a desired approximation accuracy.\nThe efficiency of the proposed method is demonstrated through a variety of numerical experiments on fully-connected and convolutional networks. "}}
{"id": "yzK-dG3pG1", "cdate": 1640995200000, "mdate": 1682581154184, "content": {"title": "Core-periphery detection in hypergraphs", "abstract": "Core-periphery detection is a key task in exploratory network analysis where one aims to find a core, a set of nodes well-connected internally and with the periphery, and a periphery, a set of nodes connected only (or mostly) with the core. In this work we propose a model of core-periphery for higher-order networks modeled as hypergraphs and we propose a method for computing a core-score vector that quantifies how close each node is to the core. In particular, we show that this method solves the corresponding non-convex core-periphery optimization problem globally to an arbitrary precision. This method turns out to coincide with the computation of the Perron eigenvector of a nonlinear hypergraph operator, suitably defined in term of the incidence matrix of the hypergraph, generalizing recently proposed centrality models for hypergraphs. We perform several experiments on synthetic and real-world hypergraphs showing that the proposed method outperforms alternative core-periphery detection algorithms, in particular those obtained by transferring established graph methods to the hypergraph setting via clique expansion."}}
{"id": "wiBF95vw_p", "cdate": 1640995200000, "mdate": 1682581154185, "content": {"title": "Core-periphery Partitioning and Quantum Annealing", "abstract": ""}}
