{"id": "6gTzZ5Dv3FA", "cdate": 1701388800000, "mdate": 1693832873423, "content": {"title": "LACE 2.0: an interactive R tool for the inference and visualization of longitudinal cancer evolution", "abstract": "Background Longitudinal single-cell sequencing experiments of patient-derived models are increasingly employed to investigate cancer evolution. In this context, robust computational methods are needed to properly exploit the mutational profiles of single cells generated via variant calling, in order to reconstruct the evolutionary history of a tumor and characterize the impact of therapeutic strategies, such as the administration of drugs. To this end, we have recently developed the LACE framework for the Longitudinal Analysis of Cancer Evolution. Results The LACE 2.0 release aimed at inferring longitudinal clonal trees enhances the original framework with new key functionalities: an improved data management for preprocessing of standard variant calling data, a reworked inference engine, and direct connection to public databases. Conclusions All of this is accessible through a new and interactive Shiny R graphical interface offering the possibility to apply filters helpful in discriminating relevant or potential driver mutations, set up inferential parameters, and visualize the results. The software is available at: github.com/BIMIB-DISCo/LACE."}}
{"id": "FE5zj3vX0l4", "cdate": 1696118400000, "mdate": 1693832873386, "content": {"title": "Unity is strength: Improving the detection of adversarial examples with ensemble approaches", "abstract": ""}}
{"id": "MFkYioR0wy", "cdate": 1674479606479, "mdate": 1674479606479, "content": {"title": "A review of computational strategies for denoising and imputation of single-cell transcriptomic data", "abstract": "# Motivation\nThe advancements of single-cell sequencing methods have paved the way for the characterization of cellular states at unprecedented resolution, revolutionizing the investigation on complex biological systems. Yet, single-cell sequencing experiments are hindered by several technical issues, which cause output data to be noisy, impacting the reliability of downstream analyses. Therefore, a growing number of data science methods has been proposed to recover lost or corrupted information from single-cell sequencing data. To date, however, no quantitative benchmarks have been proposed to evaluate such methods.\n\n# Results\nWe present a comprehensive analysis of the state-of-the-art computational approaches for denoising and imputation of single-cell transcriptomic data, comparing their performance in different experimental scenarios. In detail, we compared 19 denoising and imputation methods, on both simulated and real-world datasets, with respect to several performance metrics related to imputation of dropout events, recovery of true expression profiles, characterization of cell similarity, identification of differentially expressed genes and computation time. The effectiveness and scalability of all methods were assessed with regard to distinct sequencing protocols, sample size and different levels of biological variability and technical noise. As a result, we identify a subset of versatile approaches exhibiting solid performances on most tests and show that certain algorithmic families prove effective on specific tasks but inefficient on others. Finally, most methods appear to benefit from the introduction of appropriate assumptions on noise distribution of biological processes."}}
{"id": "0QKdWVAUf2", "cdate": 1609459200000, "mdate": 1671891851674, "content": {"title": "Combining multi-target regression deep neural networks and kinetic modeling to predict relative fluxes in reaction systems", "abstract": ""}}
{"id": "hA6lCK15lz", "cdate": 1577836800000, "mdate": 1671891851647, "content": {"title": "Investigating the Compositional Structure of Deep Neural Networks", "abstract": "The current understanding of deep neural networks can only partially explain how input structure, network parameters and optimization algorithms jointly contribute to achieve the strong generalization power that is typically observed in many real-world applications. In order to improve the comprehension and interpretability of deep neural networks, we here introduce a novel theoretical framework based on the compositional structure of piecewise linear activation functions. By defining a direct acyclic graph representing the composition of activation patterns through the network layers, it is possible to characterize the instances of the input data with respect to both the predicted label and the specific linear transformation used to perform predictions. Preliminary tests on the MNIST dataset show that our method can group input instances with regard to their similarity in the internal representation of the neural network, providing an intuitive measure of input complexity."}}
{"id": "_7wjT6u9O-8", "cdate": 1577836800000, "mdate": 1671891851686, "content": {"title": "Understanding Deep Learning with Activation Pattern Diagrams", "abstract": ""}}
