{"id": "ZuD8GmNi8b", "cdate": 1640995200000, "mdate": 1679992491110, "content": {"title": "Supervised Learning Achieves Human-Level Performance in MOBA Games: A Case Study of Honor of Kings", "abstract": ""}}
{"id": "xVs5d5ZSWaa", "cdate": 1621629903921, "mdate": null, "content": {"title": "Learning Diverse Policies in MOBA Games via Macro-Goals", "abstract": "Recently, many researchers have made successful progress in building the AI systems for MOBA-game-playing with deep reinforcement learning, such as on Dota 2 and Honor of Kings. Even though these AI systems have achieved or even exceeded human-level performance, they still suffer from the lack of policy diversity. In this paper, we propose a novel Macro-Goals Guided framework, called MGG, to learn diverse policies in MOBA games. MGG abstracts strategies as macro-goals from human demonstrations and trains a Meta-Controller to predict these macro-goals. To enhance policy diversity, MGG samples macro-goals from the Meta-Controller prediction and guides the training process towards these goals. Experimental results on the typical MOBA game Honor of Kings demonstrate that MGG can execute diverse policies in different matches and lineups, and also outperform the state-of-the-art methods over 102 heroes."}}
{"id": "zle_q26F2F1", "cdate": 1609459200000, "mdate": 1679992491122, "content": {"title": "Learning Diverse Policies in MOBA Games via Macro-Goals", "abstract": ""}}
{"id": "f7RW4CShal", "cdate": 1609459200000, "mdate": 1682318520174, "content": {"title": "Learning Diverse Policies in MOBA Games via Macro-Goals", "abstract": "Recently, many researchers have made successful progress in building the AI systems for MOBA-game-playing with deep reinforcement learning, such as on Dota 2 and Honor of Kings. Even though these AI systems have achieved or even exceeded human-level performance, they still suffer from the lack of policy diversity. In this paper, we propose a novel Macro-Goals Guided framework, called MGG, to learn diverse policies in MOBA games. MGG abstracts strategies as macro-goals from human demonstrations and trains a Meta-Controller to predict these macro-goals. To enhance policy diversity, MGG samples macro-goals from the Meta-Controller prediction and guides the training process towards these goals. Experimental results on the typical MOBA game Honor of Kings demonstrate that MGG can execute diverse policies in different matches and lineups, and also outperform the state-of-the-art methods over 102 heroes."}}
{"id": "e7k2vQCyxFM", "cdate": 1577836800000, "mdate": null, "content": {"title": "Towards Playing Full MOBA Games with Deep Reinforcement Learning", "abstract": "MOBA games, e.g., Honor of Kings, League of Legends, and Dota 2, pose grand challenges to AI systems such as multi-agent, enormous state-action space, complex action control, etc. Developing AI for playing MOBA games has raised much attention accordingly. However, existing work falls short in handling the raw game complexity caused by the explosion of agent combinations, i.e., lineups, when expanding the hero pool in case that OpenAI's Dota AI limits the play to a pool of only 17 heroes. As a result, full MOBA games without restrictions are far from being mastered by any existing AI system. In this paper, we propose a MOBA AI learning paradigm that methodologically enables playing full MOBA games with deep reinforcement learning. Specifically, we develop a combination of novel and existing learning techniques, including curriculum self-play learning, policy distillation, off-policy adaption, multi-head value estimation, and Monte-Carlo tree-search, in training and playing a large pool of heroes, meanwhile addressing the scalability issue skillfully. Tested on Honor of Kings, a popular MOBA game, we show how to build superhuman AI agents that can defeat top esports players. The superiority of our AI is demonstrated by the first large-scale performance test of MOBA AI agent in the literature."}}
{"id": "Fm1zzgcr2n6", "cdate": 1577836800000, "mdate": null, "content": {"title": "Supervised Learning Achieves Human-Level Performance in MOBA Games: A Case Study of Honor of Kings", "abstract": "We present JueWu-SL, the first supervised-learning-based artificial intelligence (AI) program that achieves human-level performance in playing multiplayer online battle arena (MOBA) games. Unlike prior attempts, we integrate the macro-strategy and the micromanagement of MOBA-game-playing into neural networks in a supervised and end-to-end manner. Tested on Honor of Kings, the most popular MOBA at present, our AI performs competitively at the level of High King players in standard 5v5 games."}}
{"id": "74pNPrXkM2a", "cdate": 1577836800000, "mdate": null, "content": {"title": "Towards Playing Full MOBA Games with Deep Reinforcement Learning", "abstract": "MOBA games, e.g., Honor of Kings, League of Legends, and Dota 2, pose grand challenges to AI systems such as multi-agent, enormous state-action space, complex action control, etc. Developing AI for playing MOBA games has raised much attention accordingly. However, existing work falls short in handling the raw game complexity caused by the explosion of agent combinations, i.e., lineups, when expanding the hero pool in case that OpenAI's Dota AI limits the play to a pool of only 17 heroes. As a result, full MOBA games without restrictions are far from being mastered by any existing AI system. In this paper, we propose a MOBA AI learning paradigm that methodologically enables playing full MOBA games with deep reinforcement learning. Specifically, we develop a combination of novel and existing learning techniques, including off-policy adaption, multi-head value estimation, curriculum self-play learning, policy distillation, and Monte-Carlo tree-search, in training and playing a large pool of heroes, meanwhile addressing the scalability issue skillfully. Tested on Honor of Kings, a popular MOBA game, we show how to build superhuman AI agents that can defeat top esports players. The superiority of our AI is demonstrated by the first large-scale performance test of MOBA AI agent in the literature."}}
{"id": "U7aeWFPpUe", "cdate": 1483228800000, "mdate": 1679992491107, "content": {"title": "Robust object tracking based on sparse representation and incremental weighted PCA", "abstract": ""}}
{"id": "Oq4ZG6LdFPZ", "cdate": 1420070400000, "mdate": 1679992491125, "content": {"title": "A new real-time robust object tracking method", "abstract": ""}}
{"id": "XDcy3wXhbO", "cdate": 1356998400000, "mdate": 1679992491398, "content": {"title": "A novel incremental weighted PCA algorithm for visual tracking", "abstract": ""}}
