{"id": "vi7-o8rLJV", "cdate": 1695981281218, "mdate": 1695981281218, "content": {"title": "A Patient-Specific Single Equivalent Dipole Model", "abstract": "Sophisticated models for the electrocardiographic inverse problem are available, but their reliance on imaging data and large numbers of electrodes limit their use.\nSimple models such as the single equivalent dipole model\n(SEDM) therefore remain relevant. We developed a probabilistic approach to the equivalent unbounded uniform\nsingle dipole problem and developed a natural extension\nto the bounded nonuniform case that relies on a patientspecific statistical inference of the propagation mechanism\nbetween the location of the dipole and the electrode locations. The two models were tested on data simulated with\na detailed heart-torso model with four different activation\nsequences and three different sets of tissue characteristics.\nWe observed a throughout enhancement of the ability to reconstruct the ECG of the patient-specific model when compared to the uniform unbounded dipole model."}}
{"id": "q-hkDa5FyO", "cdate": 1672531200000, "mdate": 1693139189548, "content": {"title": "State and parameter learning with PARIS particle Gibbs", "abstract": "Non-linear state-space models, also known as general hidden Markov models (HMM), are ubiquitous in statistical machine learning, being the most classical generative models for serial data and seque..."}}
{"id": "40Vp_q1KqD", "cdate": 1672531200000, "mdate": 1693139172150, "content": {"title": "Monte Carlo guided Diffusion for Bayesian linear inverse problems", "abstract": "Ill-posed linear inverse problems that combine knowledge of the forward measurement model with prior models arise frequently in various applications, from computational photography to medical imaging. Recent research has focused on solving these problems with score-based generative models (SGMs) that produce perceptually plausible images, especially in inpainting problems. In this study, we exploit the particular structure of the prior defined in the SGM to formulate recovery in a Bayesian framework as a Feynman--Kac model adapted from the forward diffusion model used to construct score-based diffusion. To solve this Feynman--Kac problem, we propose the use of Sequential Monte Carlo methods. The proposed algorithm, MCGdiff, is shown to be theoretically grounded and we provide numerical simulations showing that it outperforms competing baselines when dealing with ill-posed inverse problems."}}
{"id": "HH_jBD2ObPq", "cdate": 1652737446106, "mdate": null, "content": {"title": "BR-SNIS: Bias Reduced Self-Normalized Importance Sampling", "abstract": "Importance Sampling (IS) is a method for approximating expectations with respect to a target distribution using independent samples from a proposal distribution and the associated to importance weights. In many cases, the target distribution is known up to a normalization constant and self-normalized IS (SNIS) is then used. While the use of self-normalization can have a positive effect on the dispersion of the estimator, it introduces bias. In this work, we propose a new method BR-SNIS whose complexity is essentially the same as SNIS and which significantly reduces bias. This method is a wrapper, in the sense that it uses the same proposal samples and importance weights but makes a clever use of iterated sampling-importance-resampling (i-SIR) to form a bias-reduced version of the estimator. We derive the proposed algorithm with rigorous theoretical results, including novel bias, variance, and high-probability bounds. We illustrate our findings with numerical examples."}}
{"id": "qDgy1I26tS", "cdate": 1640995200000, "mdate": 1682081387882, "content": {"title": "BR-SNIS: Bias Reduced Self-Normalized Importance Sampling", "abstract": "Importance Sampling (IS) is a method for approximating expectations under a target distribution using independent samples from a proposal distribution and the associated importance weights. In many applications, the target distribution is known only up to a normalization constant, in which case self-normalized IS (SNIS) can be used. While the use of self-normalization can have a positive effect on the dispersion of the estimator, it introduces bias. In this work, we propose a new method, BR-SNIS, whose complexity is essentially the same as that of SNIS and which significantly reduces bias without increasing the variance. This method is a wrapper in the sense that it uses the same proposal samples and importance weights as SNIS, but makes clever use of iterated sampling--importance resampling (ISIR) to form a bias-reduced version of the estimator. We furnish the proposed algorithm with rigorous theoretical results, including new bias, variance and high-probability bounds, and these are illustrated by numerical examples."}}
{"id": "V75OhkiNFDw", "cdate": 1640995200000, "mdate": 1702039465420, "content": {"title": "BR-SNIS: Bias Reduced Self-Normalized Importance Sampling", "abstract": "Importance Sampling (IS) is a method for approximating expectations with respect to a target distribution using independent samples from a proposal distribution and the associated to importance weights. In many cases, the target distribution is known up to a normalization constant and self-normalized IS (SNIS) is then used. While the use of self-normalization can have a positive effect on the dispersion of the estimator, it introduces bias. In this work, we propose a new method BR-SNIS whose complexity is essentially the same as SNIS and which significantly reduces bias. This method is a wrapper, in the sense that it uses the same proposal samples and importance weights but makes a clever use of iterated sampling-importance-resampling (i-SIR) to form a bias-reduced version of the estimator. We derive the proposed algorithm with rigorous theoretical results, including novel bias, variance, and high-probability bounds. We illustrate our findings with numerical examples."}}
{"id": "PHy23KZ3n2b", "cdate": 1640995200000, "mdate": 1682081387880, "content": {"title": "A Patient-Specific Single Equivalent Dipole Model", "abstract": ""}}
{"id": "5KXsufG-mS", "cdate": 1640995200000, "mdate": 1682081387910, "content": {"title": "Generative methods for sampling transition paths in molecular dynamics", "abstract": "Molecular systems often remain trapped for long times around some local minimum of the potential energy function, before switching to another one -- a behavior known as metastability. Simulating transition paths linking one metastable state to another one is difficult by direct numerical methods. In view of the promises of machine learning techniques, we explore in this work two approaches to more efficiently generate transition paths: sampling methods based on generative models such as variational autoencoders, and importance sampling methods based on reinforcement learning."}}
