{"id": "bWtVtYQ_S0c", "cdate": 1683906083841, "mdate": 1683906083841, "content": {"title": "GraphGUIDE: interpretable and controllable conditional graph generation with discrete Bernoulli diffusion", "abstract": "Diffusion models achieve state-of-the-art performance in generating realistic objects and have been successfully applied to images, text, and videos. Recent work has shown that diffusion can also be defined on graphs, including graph representations of drug-like molecules. Unfortunately, it remains difficult to perform conditional generation on graphs in a way which is interpretable and controllable. In this work, we propose GraphGUIDE, a novel framework for graph generation using diffusion models, where edges in the graph are flipped or set at each discrete time step. We demonstrate GraphGUIDE on several graph datasets, and show that it enables full control over the conditional generation of arbitrary structural properties without relying on predefined labels. Our framework for graph diffusion can have a large impact on the interpretable conditional generation of graphs, including the generation of drug-like molecules with desired properties in a way which is informed by experimental evidence."}}
{"id": "obdFVDcyaC", "cdate": 1675981056017, "mdate": null, "content": {"title": "Improving Graph Generation by Restricting Graph Bandwidth", "abstract": "Deep graph generative modeling has proven capable of learning the distribution of complex, multi-scale structures characterizing real-world graphs. However, one of the main limitations of existing methods is their large output space, which limits generation scalability and hinders accurate modeling of the underlying distribution. To overcome these limitations, we propose a novel approach that significantly reduces the output space of existing graph generative models. Specifically, starting from the observation that many real-world graphs have low graph bandwidth, we restrict graph bandwidth during training and generation. Our strategy improves both generation scalability and quality without increasing architectural complexity or reducing expressiveness. Our approach is compatible with existing graph generative methods, and we describe its application to both autoregressive and one-shot models. We extensively validate our strategy on synthetic and real datasets, including molecular graphs. Our experiments show that, in addition to improving generation efficiency, our approach consistently improves generation quality and reconstruction accuracy. The implementation will be publicly released upon unblinding."}}
{"id": "w4Zb1ov9qNi", "cdate": 1675880437559, "mdate": null, "content": {"title": "GraphGUIDE: interpretable and controllable conditional graph generation with discrete Bernoulli diffusion", "abstract": "Diffusion models achieve state-of-the-art performance in generating realistic objects and have been successfully applied to images, text, and videos. Recent work has shown that diffusion can also be defined on graphs, including graph representations of drug-like molecules. Unfortunately, it remains difficult to perform conditional generation on graphs in a way which is interpretable and controllable. In this work, we propose GraphGUIDE, a novel framework for graph generation using diffusion models, where edges in the graph are flipped or set at each discrete time step. We demonstrate GraphGUIDE on several graph datasets, and show that it enables full control over the conditional generation of arbitrary structural properties without relying on predefined labels. Our framework for graph diffusion can have a large impact on the interpretable conditional generation of graphs, including the generation of drug-like molecules with desired properties in a way which is informed by experimental evidence."}}
{"id": "xVOkITusOx-", "cdate": 1672531200000, "mdate": 1681484234423, "content": {"title": "Improving Graph Generation by Restricting Graph Bandwidth", "abstract": ""}}
{"id": "VswIgFRVv0n", "cdate": 1672531200000, "mdate": 1681484234420, "content": {"title": "GraphGUIDE: interpretable and controllable conditional graph generation with discrete Bernoulli diffusion", "abstract": ""}}
{"id": "l-Y1igioRF_", "cdate": 1665285240783, "mdate": null, "content": {"title": "Deep Fitness Inference for Drug Discovery with Directed Evolution", "abstract": "Directed evolution, with iterated mutation and human-designed selection, is a powerful approach for drug discovery. Here, we establish a fitness inference problem given time series DNA sequencing data. We describe maximum likelihood solutions for the nonlinear dynamical system induced by fitness-based competition. Our approach learns from multiple time series rounds in a principled manner, in contrast to prior work focused on two-round enrichment prediction. While fitness inference does not require deep learning in principle, we show that inferring fitness while jointly learning a sequence-to-fitness transformer (DeepFitness) improves performance over a non-deep baseline, and a two-round enrichment baseline. Finally, we highlight how DeepFitness can improve the diversity of the discovered hits in a directed evolution experiment.\n\n\n(Non-archival paper removed at authors' request)"}}
{"id": "lT3jXy8hPKI", "cdate": 1664248834318, "mdate": null, "content": {"title": "A 3D-Shape Similarity-based Contrastive Approach to Molecular Representation Learning", "abstract": "Molecular shape and geometry dictate key biophysical recognition processes, yet many modern graph neural networks disregard 3D information for molecular property prediction. Here, we propose a new contrastive-learning procedure for graph neural networks, Molecular Contrastive Learning from Shape Similarity (MolCLaSS), that implicitly learns a three-dimensional representation. Rather than directly encoding or targeting three-dimensional poses, MolCLaSS matches a similarity objective based on Gaussian overlays to learn a meaningful representation of molecular shape. We demonstrate how this framework naturally captures key aspects of three-dimensionality that two-dimensional representations cannot and provides an inductive framework for scaffold hopping."}}
{"id": "EfR55bFcrcI", "cdate": 1664151219089, "mdate": null, "content": {"title": "STab: Self-supervised Learning for Tabular Data", "abstract": "Self-supervised learning has drawn recent interest for learning generalizable, transferable and robust representations from unlabeled tabular data. Unfortunately, unlike its image and language counterparts which have unique spatial or semantic structure information, it is difficult to design an effective augmentation method generically beneficial to downstream tasks in the tabular setting, owing to its lack of common structure and diverse nature. On the other hand, most existing augmentation methods are domain-specific (such as rotation in vision, token masking for NLP, and edge dropping for graphs), making them less effective for real-world tabular data. This significantly limits tabular self-supervised learning and hinders progress in this domain. Aiming to fill this crucial gap, we propose STab, an augmentation-free self-supervised representation learning based on stochastic regularization techniques that does not rely on negative pairs, to capture highly heterogeneous and non-structured information in tabular data. Our experiments show that STab achieves state-of-the-art performance compared to existing contrastive and pretext task self-supervised methods."}}
{"id": "yqPRRQ0GDw", "cdate": 1640995200000, "mdate": 1681484234419, "content": {"title": "CIME: Context-aware geolocation of emergency-related posts", "abstract": ""}}
{"id": "t1686dCxxI", "cdate": 1640995200000, "mdate": 1681484234421, "content": {"title": "A 3D-Shape Similarity-based Contrastive Approach to Molecular Representation Learning", "abstract": ""}}
