{"id": "YXy_2b5wufe", "cdate": 1621630335769, "mdate": null, "content": {"title": "Row-clustering of a Point Process-valued Matrix", "abstract": "Structured point process data harvested from various platforms poses new challenges to the machine learning community. To cluster repeatedly observed marked point processes, we propose a novel mixture model of multi-level marked point processes for identifying potential heterogeneity in the observed data. Specifically, we study a matrix whose entries are marked log-Gaussian Cox processes and cluster rows of such a matrix.  An efficient semi-parametric Expectation-Solution (ES) algorithm combined with functional principal component analysis (FPCA) of point processes is proposed for model estimation. The effectiveness of the proposed framework is demonstrated through simulation studies and real data analyses.\n"}}
{"id": "-jHUpEwRN9h", "cdate": 1621630335769, "mdate": null, "content": {"title": "Row-clustering of a Point Process-valued Matrix", "abstract": "Structured point process data harvested from various platforms poses new challenges to the machine learning community. To cluster repeatedly observed marked point processes, we propose a novel mixture model of multi-level marked point processes for identifying potential heterogeneity in the observed data. Specifically, we study a matrix whose entries are marked log-Gaussian Cox processes and cluster rows of such a matrix.  An efficient semi-parametric Expectation-Solution (ES) algorithm combined with functional principal component analysis (FPCA) of point processes is proposed for model estimation. The effectiveness of the proposed framework is demonstrated through simulation studies and real data analyses.\n"}}
{"id": "ZDEzFbiBS_Z", "cdate": 1577836800000, "mdate": null, "content": {"title": "Semi-parametric Learning of Structured Temporal Point Processes", "abstract": "We propose a general framework of using a multi-level log-Gaussian Cox process to model repeatedly observed point processes with complex structures; such type of data has become increasingly available in various areas including medical research, social sciences, economics, and finance due to technological advances. A novel nonparametric approach is developed to efficiently and consistently estimate the covariance functions of the latent Gaussian processes at all levels. To predict the functional principal component scores, we propose a consistent estimation procedure by maximizing the conditional likelihood of super-positions of point processes. We further extend our procedure to the bivariate point process case in which potential correlations between the processes can be assessed. Asymptotic properties of the proposed estimators are investigated, and the effectiveness of our procedures is illustrated through a simulation study and an application to a stock trading dataset."}}
{"id": "WLlbSbDOso", "cdate": 1577836800000, "mdate": null, "content": {"title": "Borrowing strength and borrowing index for Bayesian hierarchical models", "abstract": "A novel borrowing strength measure and an overall borrowing index to characterize the strength of borrowing behaviors among subgroups are proposed for a given Bayesian hierarchical model. The constructions of the proposed indexes are based on the Mallow’s distance and can be easily computed using MCMC samples for univariate or multivariate posterior distributions. Consequently, the proposed indexes can serve as meaningful and useful exploratory tools to better understand the roles played by the priors in a hierarchical model, including their influences on the posteriors that are used to make statistical inferences. These relationships are otherwise ambiguous. The proposed methods can be applied to both the continuous and binary outcome variables. Furthermore, the proposed approach can be easily adapted to various settings of clinical trials, where Bayesian hierarchical models are deem appropriate. The effectiveness of the proposed method is illustrated using extensive simulation studies and a real data example."}}
{"id": "fy86OS_-pWV", "cdate": 1546300800000, "mdate": null, "content": {"title": "Optimal Nonparametric Inference under Quantization", "abstract": "Statistical inference based on lossy or incomplete samples is of fundamental importance in research areas such as signal/image processing, medical image storage, remote sensing, signal transmission. In this paper, we propose a nonparametric testing procedure based on quantized samples. In contrast to the classic nonparametric approach, our method lives on a coarse grid of sample information and are simple-to-use. Under mild technical conditions, we establish the asymptotic properties of the proposed procedures including asymptotic null distribution of the quantization test statistic as well as its minimax power optimality. Concrete quantizers are constructed for achieving the minimax optimality in practical use. Simulation results and a real data analysis are provided to demonstrate the validity and effectiveness of the proposed test. Our work bridges the classical nonparametric inference to modern lossy data setting."}}
{"id": "9nc81wR3kAZ", "cdate": 1420070400000, "mdate": null, "content": {"title": "Efficient maximum approximated likelihood inference for Tukey's g-and-h distribution", "abstract": "Tukey’s g -and- h distribution has been a powerful tool for data exploration and modeling since its introduction. However, two long standing challenges associated with this distribution family have remained unsolved until this day: how to find an optimal estimation procedure and how to make valid statistical inference on unknown parameters. To overcome these two challenges, a computationally efficient estimation procedure based on maximizing an approximated likelihood function of Tukey’s g -and- h distribution is proposed and is shown to have the same estimation efficiency as the maximum likelihood estimator under mild conditions. The asymptotic distribution of the proposed estimator is derived and a series of approximated likelihood ratio test statistics are developed to conduct hypothesis tests involving two shape parameters of Tukey’s g -and- h distribution. Simulation examples and an analysis of air pollution data are used to demonstrate the effectiveness of the proposed estimation and testing procedures."}}
