{"id": "w1tyZDYhce", "cdate": 1683918228840, "mdate": null, "content": {"title": "Vacuum selection on axionic landscapes", "abstract": "We compute the distribution of minima that are reached dynamically on multi-field axionic landscapes, both numerically and analytically. Such landscapes are well suited for inflationary model building due to the presence of shift symmetries and possible alignment effects (the KNP mechanism).\n\nThe resulting distribution of dynamically reached minima differs considerably from the naive expectation based on counting all vacua. These differences are more pronounced in the presence of many fields due to dynamical selection effects: while low lying minima are preferred as fields roll down the potential, trajectories are also more likely to get trapped by one of the many nearby minima. We show that common analytic arguments based on random matrix theory in the large D-limit to estimate the distribution of minima are insufficient for quantitative arguments pertaining to the dynamically reached ones. This discrepancy is not restricted to axionic potentials. We provide an empirical expression for the expectation value of such dynamically reached minimas' height and argue that the cosmological constant problem is not alleviated in the absence of anthropic arguments. We further comment on the likelihood of inflation on axionic landscapes in the large D-limit."}}
{"id": "ra7BVkYHV3d", "cdate": 1683918125115, "mdate": 1683918125115, "content": {"title": "Random functions via Dyson brownian motion: progress and problems", "abstract": "We develope a computationally efficient extension of the Dyson Brownian Motion (DBM) algorithm to generate random function in C2 locally. We further explain that random functions generated via DBM show an unstable growth as the traversed distance increases. This feature restricts the use of such functions considerably if they are to be used to model globally defined ones. The latter is the case if one uses random functions to model landscapes in string theory. We provide a concrete example, based on a simple axionic potential often used in cosmology, to highlight this problem and also offer an ad hoc modification of DBM that suppresses this growth to some degree."}}
{"id": "RXmCHCbML-", "cdate": 1683917992955, "mdate": 1683917992955, "content": {"title": "Phase Separation of Randomly Cross-Linked Diblock Copolymers", "abstract": "Cross-linking is a versatile strategy to restrain the single-chain and collective dynamics of polymers and thereby stabilize structures against transformations in response to variations of thermodynamic conditions, such as temperature. Using particle-based simulations and analytic calculations, we systematically study the dependence of the phase behavior of randomly cross-linked, symmetric diblock copolymer melts on the preparation state, in which the cross-linking has been performed. The irreversible nonselective cross-links that do not prefer any of the two segment species impart a memory of the preparation state onto the system, and therefore the phase diagram does not only depend on the incompatibility, χmN, at which the system is observed and the cross-link density but also on the incompatibility, χpN, in the preparation state."}}
{"id": "XfTd_XNsSp", "cdate": 1683917873924, "mdate": null, "content": {"title": "Phase Separation of Regular, Quasi-Two-Dimensional AB Copolymer Networks", "abstract": "Using computer simulations and phenomenological considerations, we study the interplay between elasticity and microphase separation in quasi-two-dimensional phantom networks, obtained by cross-linking AB diblock copolymers at their ends. In the limit of weak stretching, where the average distance, lu, of A cross-links (or the mesh-cell size of the regular network) in the disordered phase is much smaller than the lamellar spacing, L*, of the diblock copolymer melt, network elasticity plays only a minor role. Upon increasing the stretching, we find that the incompatibility χNdb, at which the order–disorder transition occurs, decreases, and it becomes vanishingly small for lu ≫ L* and large networks. At intermediate stretching, we observe a multigrain state, where the lamellae tilt with respect to the network orientation."}}
{"id": "otE9XvN5id", "cdate": 1683917164886, "mdate": null, "content": {"title": "Collective short-time dynamics in multicomponent polymer melts", "abstract": "On short length and time scales, the collective kinetics of relaxation or structure formation in multicomponent polymer melts, such as homopolymer blends and copolymers, is influenced by the subdiffusive single-chain dynamics. We compare the predictions of the dynamic random-phase approximation (D-RPA) and dynamic self-consistent field theory (D-SCFT) to that of particle-based simulation, focusing on the decay of a density fluctuation in the disordered phase, the spinodal phase separation after a quench from the disordered phase, and the response of the disordered phase to an external field. D-SCFT with a wavevector-dependent Onsager coefficient qualitatively fails to predict the time evolution on time scales shorter than the Rouse relaxation time of the underlying polymers, whereas D-RPA successfully captures the collective behavior observed in particle-based simulation. Extensions of D-SCFT, employing a time-dependent Onsager coefficient that is derived from D-RPA and that accounts for the subdiffusive single-chain dynamics on short time scales, are discussed."}}
