{"id": "KsZWGN3CB2f", "cdate": 1668074551268, "mdate": 1668074551268, "content": {"title": "Sparse approximation of 3D meshes using the spectral geometry of the Hamiltonian operator", "abstract": "The discrete Laplace operator is ubiquitous in spectral shape analysis, since its eigenfunctions are provably optimal in representing smooth functions defined on the surface of the shape. Indeed, subspaces defined by its eigenfunctions have been utilized for shape compression, treating the coordinates as smooth functions defined on the given surface. However, surfaces of shapes in nature often contain geometric structures for which the general smoothness assumption may fail to hold. At the other end, some explicit mesh compression algorithms utilize the order by which vertices that represent the surface are traversed, a property which has been ignored in spectral approaches. Here, we incorporate the order of vertices into an operator that defines a novel spectral domain. We propose a method for representing 3D meshes using the spectral geometry of the Hamiltonian operator, integrated within a sparse approximation framework. We adapt the concept of a potential function from quantum physics and incorporate vertex ordering information into the potential, yielding a novel data-dependent operator. The potential function modifies the spectral geometry of the Laplacian to focus on regions with finer details of the given\nsurface. By sparsely encoding the geometry of the shape using the proposed data-dependent basis, we improve compression performance compared to previous results that use the standard Laplacian basis and spectral graph wavelets."}}
{"id": "xsAx9ztxqkF", "cdate": 1640995200000, "mdate": 1668508179088, "content": {"title": "Implicit field supervision for robust non-rigid shape matching", "abstract": "Establishing a correspondence between two non-rigidly deforming shapes is one of the most fundamental problems in visual computing. Existing methods often show weak resilience when presented with challenges innate to real-world data such as noise, outliers, self-occlusion etc. On the other hand, auto-decoders have demonstrated strong expressive power in learning geometrically meaningful latent embeddings. However, their use in \\emph{shape analysis} has been limited. In this paper, we introduce an approach based on an auto-decoder framework, that learns a continuous shape-wise deformation field over a fixed template. By supervising the deformation field for points on-surface and regularising for points off-surface through a novel \\emph{Signed Distance Regularisation} (SDR), we learn an alignment between the template and shape \\emph{volumes}. Trained on clean water-tight meshes, \\emph{without} any data-augmentation, we demonstrate compelling performance on compromised data and real-world scans."}}
{"id": "oSnOUmJdERu", "cdate": 1640995200000, "mdate": 1668508132451, "content": {"title": "Deep Isometric Maps", "abstract": ""}}
{"id": "e1lDTZTHMxu", "cdate": 1609459200000, "mdate": 1668508132450, "content": {"title": "Fast Sinkhorn Filters: Using Matrix Scaling for Non-Rigid Shape Correspondence With Functional Maps", "abstract": "In this paper, we provide a theoretical foundation for pointwise map recovery from functional maps and highlight its relation to a range of shape correspondence methods based on spectral alignment. With this analysis in hand, we develop a novel spectral registration technique: Fast Sinkhorn Filters, which allows for the recovery of accurate and bijective pointwise correspondences with a superior time and memory complexity in comparison to existing approaches. Our method combines the simple and concise representation of correspondence using functional maps with the matrix scaling schemes from computational optimal transport. By exploiting the sparse structure of the kernel matrices involved in the transport map computation, we provide an efficient trade-off between acceptable accuracy and complexity for the problem of dense shape correspondence."}}
{"id": "77rzL7VziI", "cdate": 1609459200000, "mdate": 1668508132505, "content": {"title": "DPFM: Deep Partial Functional Maps", "abstract": "We consider the problem of computing dense correspondences between non-rigid shapes with potentially significant partiality. Existing formulations tackle this problem through heavy manifold optimization in the spectral domain, given hand-crafted shape descriptors. In this paper, we propose the first learning method aimed directly at partial non-rigid shape correspondence. Our approach uses the functional map framework, can be trained in a supervised or unsupervised manner, and learns descriptors directly from the data, thus both improving robustness and accuracy in challenging cases. Furthermore, unlike existing techniques, our method is also applicable to partial-to-partial non-rigid matching, in which the common regions on both shapes are unknown a priori. We demonstrate that the resulting method is data-efficient, and achieves state-of-the-art results on several benchmark datasets. Our code and data can be found online: https://github.com/pvnieo/DPFM."}}
{"id": "Bx52b7bHS-8", "cdate": 1546300800000, "mdate": 1668508132485, "content": {"title": "DIMAL: Deep Isometric Manifold Learning Using Sparse Geodesic Sampling", "abstract": "This paper explores a fully unsupervised deep learning approach for computing distance-preserving maps that generate low-dimensional embeddings for a certain class of manifolds. We use the Siamese configuration to train a neural network to solve the problem of least squares multidimensional scaling for generating maps that approximately preserve geodesic distances. By training with only a few landmarks, we show a significantly improved local and nonlocal generalization of the isometric mapping as compared to analogous non-parametric counterparts. Importantly, the combination of a deep-learning framework with a multidimensional scaling objective enables a numerical analysis of network architectures to aid in understanding their representation power. This provides a geometric perspective to the generalizability of deep learning."}}
{"id": "5d7FF3vW3F", "cdate": 1546300800000, "mdate": 1668508132431, "content": {"title": "Deep Eikonal Solvers", "abstract": ""}}
{"id": "B1uvH_gC-", "cdate": 1518730182235, "mdate": null, "content": {"title": "Parametric Manifold Learning Via Sparse Multidimensional Scaling", "abstract": "We propose a metric-learning framework for computing distance-preserving maps that generate low-dimensional embeddings for a certain class of manifolds. We employ Siamese networks to solve the problem of least squares multidimensional scaling for generating mappings that preserve geodesic distances on the manifold. In contrast to previous parametric manifold learning methods we show a substantial reduction in training effort enabled by the computation of geodesic distances in a farthest point sampling strategy. Additionally, the use of a network to model the distance-preserving map reduces the complexity of the multidimensional scaling problem and leads to an improved non-local generalization of the manifold compared to analogous non-parametric counterparts. We demonstrate our claims on point-cloud data and on image manifolds and show a numerical analysis of our technique to facilitate a greater understanding of the representational power of neural networks in modeling manifold data."}}
{"id": "i71zFLhBSw", "cdate": 1514764800000, "mdate": 1668508132448, "content": {"title": "Sparse Approximation of 3D Meshes Using the Spectral Geometry of the Hamiltonian Operator", "abstract": ""}}
{"id": "hR7K6n_2Hz", "cdate": 1483228800000, "mdate": 1668508132432, "content": {"title": "Schrödinger Operator for Sparse Approximation of 3D Meshes", "abstract": "We introduce a Schrödinger operator for spectral approximation of meshes representing surfaces in 3D. The operator is obtained by modifying the Laplacian with a potential function which defines the rate of oscillation of the harmonics on different regions of the surface. We design the potential using a vertex ordering scheme which modulates the Fourier basis of a 3D mesh to focus on crucial regions of the shape having high-frequency structures and employ a sparse approximation framework to maximize compression performance. The combination of the spectral geometry of the Hamiltonian in conjunction with a sparse approximation approach outperforms existing spectral compression schemes."}}
