{"id": "p6D0I_0FYxs", "cdate": 1577836800000, "mdate": null, "content": {"title": "Enhancing Network Security Via Machine Learning: Opportunities and Challenges", "abstract": "Network security can be defined as the act of protecting any given network against threats that may lead to the availability of the network to be compromised. Moreover, we can also add that unauthorized access or even misuse of network-accessible resources are issues that network security must address. Traditional detection techniques are inefficient when dealing with huge amounts of data because their analysis processes are complex and time-consuming. Hence, the use of tools and techniques provided to us through big data can assist in the analysis and storage of data in intrusion detection systems to help reduce both processing and training time. This document presents a review of the work related to network security via machine learning."}}
{"id": "nDWgpV8ey9h", "cdate": 1577836800000, "mdate": null, "content": {"title": "Generalized Mm, r-Network: A Case for Fixed Message Dimensions", "abstract": "In this letter, we first present a class of networks named <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Generalized</i> <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">${{M}}_{{ \\textit {m, r}}}$ </tex-math></inline-formula> <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">-Network</i> for every integer <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">${m} \\geq 2$ </tex-math></inline-formula> and <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$\\forall {r} \\in \\{0, 1,\\ldots, {m}-1\\}$ </tex-math></inline-formula> and we show that every network of this class admits a vector linear solution if and only if the message dimension is an integer multiple of <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">${m}$ </tex-math></inline-formula> . We show that the <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Generalized</i> <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">${M}$ </tex-math></inline-formula> <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">-Network</i> presented in the work of Das and Rai and the <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Dim-</i> <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">${m}$ </tex-math></inline-formula> <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Network</i> introduced in the work of Connelly and Zeger which are generalizations to the <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">${M}$ </tex-math></inline-formula> -Network can be considered as special cases of Generalized <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">${M}_{\\textit {m, r}}$ </tex-math></inline-formula> -Network for <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">${r}=1$ </tex-math></inline-formula> and <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">${r}={m}-1$ </tex-math></inline-formula> respectively. Then we focus on a problem induced by depending on integer multiples of <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">${m}$ </tex-math></inline-formula> as message dimensions to achieve the linear coding capacity in the class of Generalized <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">${M}_{\\textit {m, r}}$ </tex-math></inline-formula> (proven to be equal to 1). We note that for large values of <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">${m}$ </tex-math></inline-formula> , packet sizes will grow beyond feasible thresholds in real-world networks. This motivates us to examine the capacity of the network in the case of fixed message dimensions. A study on the contrast among the impacts of fixed message dimensions in different networks of class <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">${M}_{\\textit {m, r}}$ </tex-math></inline-formula> -Network highlights the importance of the examined problem. In addition to complete/partial solutions obtained for different networks of the class Generalized <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">${M}_{\\textit {m, r}}$ </tex-math></inline-formula> -Network, our studies pose some open problems which make the Generalized <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">${M}_{\\textit {m, r}}$ </tex-math></inline-formula> -Network an attractive topic for further research."}}
{"id": "lmjTa31nHah", "cdate": 1577836800000, "mdate": null, "content": {"title": "Wireless Transmitter Identification Based on Device Imperfections", "abstract": "Mining useful patterns from databases is an important research topic. The research in utility mining mostly focuses on discovering patterns of high value in large databases, and analyzing the important factors in a data mining process. This idea is applied to the wireless device identification in this paper. Radio Frequency Fingerprint (RFF) reflects differences between transmitter hardware components. It contains rich non-linear characteristics of the internal components of the transmitter. Small differences and inaccuracies in the manufacturing process determine the unique characteristic contained in the transmitted signal. The device can be identified by the signal transmitted by the wireless device. In this paper, the generation mechanism of RFF is analyzed and two pattern mining algorithms are used to extract useful information from wireless signals for device identification. Then, a real communication transmitter link is established to study the effect of different components of a transmitter. The signals are acquired from the transmitters with different components replaced, including the amplifier, the bandpass filter, and the local oscillator. Finally, the influence of different components and pattern mining methods are evaluated."}}
{"id": "fH4H0mzo5s", "cdate": 1577836800000, "mdate": null, "content": {"title": "RAT Hunter: Building Robust Models for Detecting Remote Access Trojans Based on Optimum Hybrid Features", "abstract": "Nowadays, critical infrastructures are severely exposed to a wide range of malicious attempts. The malicious activities are becoming more sophisticated. They infect victim’s machines and seek to obtain information from users instead of doing a destructiveness to the machine. Remote Access Trojan (RAT) is a type of malware that tries to control the victim’s machine remotely without victim awareness. Accordingly, the number and harmful effect of RAT threats for information thieves has increased dramatically. In this chapter, we propose an optimum feature set for hunting RAT malware based on intelligence feature selection for machine learning classification tasks. For building a robust model, we collected real-world samples from well-known repositories like Virus Total and Virus Share. Afterwards, the behaviour of these types of malware are analyzed through a modified sandbox as a reverse engineering tool to extract features from dynamic and static analysis. With the feature selection process, we applied a two-layer feature selection algorithm like information gain and correlated feature selection for obtaining the optimum set of features to tackles RAT threats. By implementing different models like the generative and deep learning models, we obtained an accuracy rate of 99.75% and a false alarm rate of 0.3%."}}
{"id": "Z0-Ww05kygl", "cdate": 1577836800000, "mdate": null, "content": {"title": "Analysis of Dimensionality Reduction Techniques on Big Data", "abstract": "Due to digitization, a huge volume of data is being generated across several sectors such as healthcare, production, sales, IoT devices, Web, organizations. Machine learning algorithms are used to uncover patterns among the attributes of this data. Hence, they can be used to make predictions that can be used by medical practitioners and people at managerial level to make executive decisions. Not all the attributes in the datasets generated are important for training the machine learning algorithms. Some attributes might be irrelevant and some might not affect the outcome of the prediction. Ignoring or removing these irrelevant or less important attributes reduces the burden on machine learning algorithms. In this work two of the prominent dimensionality reduction techniques, Linear Discriminant Analysis (LDA) and Principal Component Analysis (PCA) are investigated on four popular Machine Learning (ML) algorithms, Decision Tree Induction, Support Vector Machine (SVM), Naive Bayes Classifier and Random Forest Classifier using publicly available Cardiotocography (CTG) dataset from University of California and Irvine Machine Learning Repository. The experimentation results prove that PCA outperforms LDA in all the measures. Also, the performance of the classifiers, Decision Tree, Random Forest examined is not affected much by using PCA and LDA.To further analyze the performance of PCA and LDA the eperimentation is carried out on Diabetic Retinopathy (DR) and Intrusion Detection System (IDS) datasets. Experimentation results prove that ML algorithms with PCA produce better results when dimensionality of the datasets is high. When dimensionality of datasets is low it is observed that the ML algorithms without dimensionality reduction yields better results."}}
{"id": "Xm4QfRJrC3V", "cdate": 1577836800000, "mdate": null, "content": {"title": "Security Aspects of Internet of Things aided Smart Grids: a Bibliometric Survey", "abstract": "The integration of sensors and communication technology in power systems, known as the smart grid, is an emerging topic in science and technology. One of the critical issues in the smart grid is its increased vulnerability to cyber threats. As such, various types of threats and defense mechanisms are proposed in literature. This paper offers a bibliometric survey of research papers focused on the security aspects of Internet of Things (IoT) aided smart grids. To the best of the authors' knowledge, this is the very first bibliometric survey paper in this specific field. A bibliometric analysis of all journal articles is performed and the findings are sorted by dates, authorship, and key concepts. Furthermore, this paper also summarizes the types of cyber threats facing the smart grid, the various security mechanisms proposed in literature, as well as the research gaps in the field of smart grid security."}}
{"id": "XY7bQyAg_q", "cdate": 1577836800000, "mdate": null, "content": {"title": "Hybridization of cognitive computing for food services", "abstract": "Highlights • The application of data mining technology to the restaurant industry has certain social value. • Propose a new interwoven novel fusion approach applied to restaurant data to assist in the prediction of customer traffic in the restaurant industry. • This predictive algorithm using cognitive techniques can assist these newly place robots in the food industry better serve their client base. Abstract The application of data mining technology to food services and the restaurant industry has certain social value. By predicting customer traffic and needs, a restaurant can prepare a reasonable amount of meals for customers according to predicted needs which is conducive to improving the dining experience of customers and also improving the quality of food preparation and making the restaurant itself operate more efficiently. In recent years, we have seen the use of collaborative robots for use in the fast food industry. In Asia and more specifically in Japan, we have seen many fast-food chains implement the use of robots to better serve their customers. By studying the linear regression algorithm and the random forest algorithm, this paper proposes a new interwoven novel fusion approach of combining both algorithms and applies the new model to restaurant data to assist in the prediction of customer traffic in the restaurant industry. This predictive algorithm using cognitive techniques can assist these newly place robots in the food industry better serve their client base and in doing so make the industry more efficient. Experimental, comparison, and analysis are reported in the paper. The error rate of the fusion solution is reduced by approximately 5.503% compared with the linear regression algorithm and is approximately 3.719% lower than the error rate of the random forest algorithm. Results show that the new fusion algorithm can achieve better prediction results of customer traffic prediction for the restaurant industry. Furthermore, we also provide a new take on the application of data mining technology in the restaurant industry itself."}}
{"id": "WpLBZJ-hUNZ", "cdate": 1577836800000, "mdate": null, "content": {"title": "A Hybrid Deep Generative Local Metric Learning Method for Intrusion Detection", "abstract": "Advancement in information technology and widespread use of digital networks have led to an increasing number of malicious activities and intrusions targeting software and systems. There are various Machine Learning techniques have been utilized for Intrusion Detection Systems (IDS) to protect computers and networks from network based and host-based attacks. However, there are harmful categories of attacks where their information resembles other attacks to lead IDS detection astray. In this chapter, we propose a hybrid model designed to detect abnormal intrusions such as Remote to Local (R2L) and User to Root (U2R). The proposed model leverages an unsupervised learning algorithm that applies back-propagation to learn the identity function of attacks data and also reduce the dimension of dataset and cluster the data. Furthermore, we apply the Generative Local Metric Learning (GLML) on cluster to learn local metrics within each cluster to apply a robust nearest neighbor classifier. The empirical results on NSL-KDD dataset demonstrate that our model outperforms previous models designed to detect two major harmful attacks (U2R and R2L)."}}
{"id": "WEpNjwEYUxS", "cdate": 1577836800000, "mdate": null, "content": {"title": "A Comparison of State-of-the-Art Machine Learning Models for OpCode-Based IoT Malware Detection", "abstract": "The Internet of Things is dramatically changing the face of our modern world. A number of significant organizations are leveraging this onset of IoT to enhance the quality and scope of their digital services. A wide range of attacks are targeting the Internet of Things to degrade its performance, security and privacy using malicious programs. It is crucial to provide robust and accurate approaches to mitigate the adverse effect of such attacks. This chapter evaluates and analyzes the performance of several state-of-the-art machine learning models on the Internet of Things dataset of malicious applications. Comparing ten machine learning models, this chapter demonstrates that the Radial Basis Function (RBF) Support Vector Machine (SVM) and Naive Bayes outperform other models while Linear SVM and Random Forest fail to recognize malicious codes accurately."}}
{"id": "TDdb2AKUM8T", "cdate": 1577836800000, "mdate": null, "content": {"title": "An efficient algorithm for fuzzy frequent itemset mining", "abstract": "Association-rule mining (ARM) has concerned as an important and critical research issue in the field of data analytics and mining that aims at finding the correlations among the items in binary databases. However, the conventional algorithms considered the frequency of the item(set) in binary databases for ARM, which is not sufficient in real-life situations. Mining of useful information is not an easy task especially if the item(set) consists of the added values. Moreover, the discovered knowledge is not easy to understand if you are not the domain experts. For the past decades, several intelligent systems involved the fuzzy-set theory for many domains and applications due to it is interpretable for human reasoning. Before, the Apriori-based method for discovering fuzzy frequent itemsets (FFIs) based on the type-2 fuzzy-set theory was proposed, which requires the amount of computations with enormous candidates. In this study, we then first present a fast list-based multiple fuzzy frequent itemset mining (named as LFFT2)algorithm under type-2 fuzzy-set theory. It is developed by the type-2 membership functions to retrieve the multiple fuzzy frequent itemsets for presenting more useful and meaningful knowledge for making the efficient strategies or decisions. From the results shown in the experiments, it is clear to see that the developed LFFT2 outperforms the conventional Apriori-based approach regarding the execution time and the number of examined nodes in the search space."}}
