{"id": "oNYhNVbyeN", "cdate": 1640995200000, "mdate": 1668702589519, "content": {"title": "Boosting Few-shot visual recognition via saliency-guided complementary attention", "abstract": ""}}
{"id": "Likqwd6jly", "cdate": 1609459200000, "mdate": 1668702588877, "content": {"title": "Class-wise Metric Scaling for Improved Few-Shot Classification", "abstract": "Few-shot classification aims to generalize basic knowledge to recognize novel categories from a few samples. Recent centroid-based methods achieve promising classification performance with the nearest neighbor rule. However, we consider that those methods intrinsically ignore per-class distribution, as the decision boundaries are biased due to the diversity of intra-class variances. Hence, we propose a class-wise metric scaling (CMS) mechanism, which can be applied to both training and testing stages. Concretely, metric scalars are set as learnable parameters in the training stage, helping to learn a more discriminative and transferable feature representation. As for testing, we construct a convex optimization problem to generate an optimal scalar vector for refining the nearest neighbor decisions. Besides, we also involve a low-ranking bilinear pooling layer for improved representation capacity, which further provides significant performance gains. Extensive experiments are conducted on a series of feature extractor backbones, datasets, and testing modes, which have shown consistent improvements compared to prior SOTA methods, e.g., we achieve accuracies of 66.64 % and 83.63 % for 5-way 1-shot and 5-shot settings on the mini-ImageNet, respectively. Under the semi-supervised inductive mode, results are further up to 78.34 % and 87.53 %, respectively."}}
{"id": "D-fu5umHA1", "cdate": 1609459200000, "mdate": 1668702588587, "content": {"title": "PDA: Proxy-based domain adaptation for few-shot image recognition", "abstract": ""}}
{"id": "-ZFENLV4HG", "cdate": 1609459200000, "mdate": 1668702588586, "content": {"title": "Saliency-Guided Complementary Attention for Improved Few-Shot Learning", "abstract": "Despite significant progress in recent deep neural networks, most deep learning algorithms rely heavily on abundant training samples. To address this problem, we propose an effective and interpretable few-shot classification model using Saliency-Guided Complementary Attention (SGCA), which aims to learn transferable representations and to build a robust classification module simultaneously. Concretely, we propose to train our feature extractor using an auxiliary task to separate object regions from background clutter guided by saliency detection signals. In addition, to make the separation beneficial to the downstream tasks, we introduce a complementary attention mechanism to force the classification module to focus on various informative parts of the image. Extensive experiments on few-shot learning tasks demonstrate the effectiveness of our proposed method, e.g., we achieve 68.81% and 84.60% for 5-way 1-shot and 5-shot settings on mini-ImageNet, respectively."}}
{"id": "A11CiqjE4i", "cdate": 1577836800000, "mdate": 1668702589524, "content": {"title": "Visual question answering with attention transfer and a cross-modal gating mechanism", "abstract": ""}}
