{"id": "jAcRq8j2Bxr", "cdate": 1676827090934, "mdate": null, "content": {"title": "Scalable and Robust Tensor Ring Decomposition for Large-scale Data", "abstract": "Tensor ring (TR) decomposition has recently received increased attention due to its superior expressive performance for high-order tensors. However, the applicability of traditional TR decomposition algorithms to real-world applications is hindered by prevalent large data sizes, missing entries, and corruption with outliers. In this work, we propose a scalable and robust TR decomposition algorithm capable of handling large-scale tensor data with missing entries and gross corruptions. We first develop a novel auto-weighted steepest descent method that can adaptively fill the missing entries and identify the outliers during the decomposition process. Further, taking advantage of the tensor ring model, we develop a novel fast Gram matrix computation (FGMC) approach and a randomized subtensor sketching (RStS) strategy which yield significant reduction in storage and computational complexity. Experimental results demonstrate that the proposed method outperforms existing TR decomposition methods in the presence of outliers, and runs significantly faster than existing robust tensor completion algorithms."}}
{"id": "xUSSg3d_sWd", "cdate": 1577836800000, "mdate": null, "content": {"title": "A Multi-criteria Approach for Fast and Outlier-aware Representative Selection from Manifolds", "abstract": "The problem of representative selection amounts to sampling few informative exemplars from large datasets. This paper presents MOSAIC, a novel representative selection approach from high-dimensional data that may exhibit non-linear structures. Resting upon a novel quadratic formulation, Our method advances a multi-criteria selection approach that maximizes the global representation power of the sampled subset, ensures diversity, and rejects disruptive information by effectively detecting outliers. Through theoretical analyses we characterize the obtained sketch and reveal that the sampled representatives maximize a well-defined notion of data coverage in a transformed space. In addition, we present a highly scalable randomized implementation of the proposed algorithm shown to bring about substantial speedups. MOSAIC's superiority in achieving the desired characteristics of a representative subset all at once while exhibiting remarkable robustness to various outlier types is demonstrated via extensive experiments conducted on both real and synthetic data with comparisons to state-of-the-art algorithms."}}
{"id": "wWLYPPhCGJ", "cdate": 1577836800000, "mdate": null, "content": {"title": "Scalable and Robust Community Detection With Randomized Sketching", "abstract": "This article explores and analyzes the unsupervised clustering of large partially observed graphs. We propose a scalable and provable randomized framework for clustering graphs generated from the stochastic block model. The clustering is first applied to a sub-matrix of the graph's adjacency matrix associated with a reduced graph sketch constructed using random sampling. Then, the clusters of the full graph are inferred based on the clusters extracted from the sketch using a correlation-based retrieval step. Uniform random node sampling is shown to improve the computational complexity over clustering of the full graph when the cluster sizes are balanced. A new random degree-based node sampling algorithm is presented which significantly improves upon the performance of the clustering algorithm even when clusters are unbalanced. This framework improves the phase transitions for matrix-decomposition-based clustering with regard to computational complexity and minimum cluster size, which are shown to be nearly dimension-free in the low inter-cluster connectivity regime. A third sampling technique is shown to improve balance by randomly sampling nodes based on spatial distribution. We provide analysis and numerical results using a convex clustering algorithm based on matrix completion."}}
{"id": "0c15wmJ5cd0", "cdate": 1577836800000, "mdate": null, "content": {"title": "Steady-State Policy Synthesis in Multichain Markov Decision Processes", "abstract": "The formal synthesis of automated or autonomous agents has elicited strong interest from the artificial intelligence community in recent years. This problem space broadly entails the derivation of decision-making policies for agents acting in an environment such that a formal specification of behavior is satisfied. Popular formalisms for such specifications include the quintessential Linear Temporal Logic (LTL) and Computation Tree Logic (CTL) which reason over infinite sequences and trees, respectively, of states. However, the related and relevant problem of reasoning over the frequency with which states are visited infinitely and enforcing behavioral specifications on the same has received little attention. That problem, known as Steady-State Policy Synthesis (SSPS) or steady-state control, is the focus of this paper. Prior related work has been mostly confined to unichain Markov Decision Processes (MDPs), while a tractable solution to the general multichain setting heretofore remains elusive. In this paper, we provide a solution to the latter within the context of multichain MDPs over a class of policies that account for all possible transitions in the given MDP. The solution policy is derived from a novel linear program (LP) that encodes constraints on the limiting distributions of the Markov chain induced by said policy. We establish a one-to-one correspondence between the feasible solutions of the LP and the stationary distributions of the induced Markov chains. The derived policy is shown to maximize the reward among the constrained class of stationary policies and to satisfy the specification constraints even when it does not exercise all possible transitions."}}
{"id": "q8dgy2aESmhN", "cdate": 1546300800000, "mdate": null, "content": {"title": "Robust Manifold Learning via Conformity Pursuit", "abstract": "This letter presents an effective and simple method, termed Global Conformity Pursuit (GCP), for robust manifold learning. Data points lying on a union of low-dimensional nonlinear manifolds are expected to be highly conforming. On the other hand, outliers do not typically adhere to low-dimensional structures or otherwise do not exist in large numbers. Hence, they can be identified by their low overall resemblance to the rest of the data. Our kernel-based setting allows us to capture the underlying nonlinear structure of the manifold data, while avoiding the construction of local neighborhood regions which typically causes extreme sensitivity to noise and outliers. Aside from its significantly simple structure-involving only a matrix evaluation and multiplication-GCP is the first manifold learning approach that is simultaneously noniterative and capable of tolerating a large number of outliers, dependent outliers, and noise components. Theoretical analysis guarantees a large gap between conformity values of inliers and outliers. Experimental results showcase potential uses of the proposed framework on benchmark datasets."}}
{"id": "dYaPjzS0LY6", "cdate": 1546300800000, "mdate": null, "content": {"title": "Signal reconstruction from interferometric measurements under sensing constraints", "abstract": "Highlights • Developing a unifying framework for signal recovery from interferometric measurements. • Compressive recovery under constraints imposed by the interferometer structure. • Establishing performance guarantees on compressive recovery under sensing constraints. • Devising controlled sampling policies to collect more informative measurements. Abstract We develop a framework in which the problem of signal reconstruction from interferometric measurements amounts to one of basis analysis, with measurements that are linear in the basis coefficients. We leverage a generalized interferometry approach to enable the reconstruction of signals represented in different bases of arbitrary domains. Our framework is unifying in that it applies whether the sought-after information concerns the input signal or a sample object, as well as in settings where we have no control over the relative delays of the two paths of the interferometer. While the linear transformation underlying the measurement system has only a limited number of degrees of freedom set by the constrained sensing structure, we show that compressive signal recovery is achievable without introducing any additional randomization to the measurement setup. We establish performance guarantees under constrained sensing by proving that the transformation satisfies sufficient conditions for successful reconstruction. Also, we propose two control policies to guide the collection of informative measurements given prior knowledge about the constrained sensing structure. By minimizing the mutual coherence of the sampled measurements, the controlled approach is shown to yield further gains in sample size complexity."}}
{"id": "cpd1ekfNin", "cdate": 1546300800000, "mdate": null, "content": {"title": "Multi-Modal Non-Line-of-Sight Passive Imaging", "abstract": "We consider the non-line-of-sight (NLOS) imaging of an object using the light reflected off a diffusive wall. The wall scatters incident light such that a lens is no longer useful to form an image. Instead, we exploit the 4D spatial coherence function to reconstruct a 2D projection of the obscured object. The approach is completely passive in the sense that no control over the light illuminating the object is assumed and is compatible with the partially coherent fields ubiquitous in both the indoor and outdoor environments. We formulate a multi-criteria convex optimization problem for reconstruction, which fuses the reflected field's intensity and spatial coherence information at different scales. Our formulation leverages established optics models of light propagation and scattering and exploits the sparsity common to many images in different bases. We also develop an algorithm based on the alternating direction method of multipliers to efficiently solve the convex program proposed. A means for analyzing the null space of the measurement matrices is provided as well as a means for weighting the contribution of individual measurements to the reconstruction. This paper holds promise to advance passive imaging in the challenging NLOS regimes in which the intensity does not necessarily retain distinguishable features and provides a framework for multi-modal information fusion for efficient scene reconstruction."}}
{"id": "QIranD7HyW2", "cdate": 1546300800000, "mdate": null, "content": {"title": "A Sequential and Scalable Approach to Community Detection in Dynamic Graphs", "abstract": "We study a sequential sketch-based approach for the clustering of time-evolving graphs. We present a dynamic extension to the static Stochastic Block Model, which accommodates growing and shrinking graphs, as well as the movement of nodes between clusters. We then propose an online algorithm which constructs and maintains a small sketch consisting of nodes sampled from the full graph. The sketch is clustered and a retrieval algorithm is used to infer cluster membership of nodes in each successive graph snapshot. We demonstrate that the use of a small sketch not only improves computational complexity, but also improves the success rate when sketches are properly proportioned. We present a sampling method which chooses nodes according to node degree, whereby very small clusters can be successfully tracked."}}
{"id": "CXIvkqPakfWR", "cdate": 1546300800000, "mdate": null, "content": {"title": "Low-Dimensional Decomposition of Manifolds in Presence of Outliers", "abstract": "Existing approaches to robust subspace recovery and outlier identification decompose the data into low-rank plus sparse matrices corresponding to inliers and outliers, respectively. This paper considers a more generalized scheme, whereby the data is decomposed into two components, one corresponding to inliers belonging to low-dimensional manifolds and one to outliers not conforming to the inliers' structure. The inliers may not form a low-rank matrix, nor the outliers a sparse one. An informative encoding of the data is obtained through a kernel-based setting, which captures the underlying structure of the manifold effectively, and leads to a distinguishable representation of outliers from inliers. We introduce a novel measure, gauging each point's ability to represent the whole dataset, through which we certify the identity of a data point to be an inlier or an outlier. An efficient and parallelizable algorithm is developed to improve the scalability of the resulting convex program. Finally, the superiority of the proposed method is showcased with regard to resilience to considerable numbers of random outliers, and robustness to structured outliers and noise components for manifold data."}}
{"id": "21CVCqo_S1", "cdate": 1546300800000, "mdate": null, "content": {"title": "Pinball attacks against Dynamic Channel assignment in wireless networks", "abstract": "In this paper, we expose a class of stealthy attacks, which we coin pinball attacks, that exploit the adaptive nature of Dynamic Channel Assignment algorithms in wireless networks. In a pinball attack, the attacker strategically induces interference in the neighborhood of certain nodes to cause a cascading channel switching behavior, thereby exploiting the topology of the network to his own advantage. The attacker’s problem is formulated as a Markov Decision Process in which the attacker seeks to maximize his long-term net rewards. To overcome the exponential size of the state space, we derive suboptimal attack policies through approximation methods. We expose the pinball attacks on two general setups that arise practically in wireless communication systems. In the first setup, each wireless node is an access point aiming to select a channel that has minimum interference with its neighbors. In the second setup, we consider wireless nodes with multiple antennas whereby every node should communicate with each of its neighbors on a separate channel. We formally establish the equivalence of both setups by showing that the identified pinball attack policies on one can be directly mapped to attack policies on the other. We present numerical results to assess the impact of the obtained pinball attack policies under various topologies, and show that they outperform other known attack policies over all topologies considered. We also propose a novel approach to scale up the attack to larger size networks with special structures."}}
