{"id": "yOMI9R4NQaJ", "cdate": 1620330702898, "mdate": null, "content": {"title": "Model Selection for Production System via Automated Online Experiments", "abstract": "A challenge that machine learning practitioners in the industry face is the task of selecting the best model to deploy in production. As a model is often an intermediate component of a production system, online controlled experiments such as A/B tests yield the most reliable estimation of the effectiveness of the whole system, but can only compare two or a few models due to budget constraints. We propose an automated online experimentation mechanism that can efficiently perform model selection from a large pool of models with a small number of online experiments. We derive the probability distribution of the metric of interest that contains the model uncertainty from our Bayesian surrogate model trained using historical logs. Our method efficiently identifies the best model by sequentially selecting and deploying a list of models from the candidate set that balance exploration-exploitation. Using simulations based on real data, we demonstrate the effectiveness of our method on two different tasks.\n\n"}}
{"id": "Me5QTLG4rF0", "cdate": 1620330649230, "mdate": null, "content": {"title": "Mixed Membership Recurrent Neural Networks", "abstract": "Models for sequential data such as the recurrent neural network (RNN) often\nimplicitly model a sequence as having a fixed time interval between observations and do\nnot account for group-level effects when multiple sequences are observed. We propose a\nmodel for grouped sequential data based on the RNN that accounts for varying time\nintervals between observations in a sequence by learning a group-level base parameter to\nwhich each sequence can revert. Our approach is motivated by the mixed membership\nframework, and we show how it can be used for dynamic topic modeling in which the\ndistribution on topics (not the topics themselves) are evolving in time. We demonstrate\nour approach on a dataset of 3.4 million online grocery shopping orders made by 206K\ncustomers."}}
{"id": "SyNYfo-_bH", "cdate": 1514764800000, "mdate": null, "content": {"title": "CRVI: Convex Relaxation for Variational Inference", "abstract": "We present a new technique for solving non-convex variational inference optimization problems. Variational inference is a widely used method for posterior approximation in which the inference probl..."}}
