{"id": "Hyji0k3NyW", "cdate": 1672531200000, "mdate": 1681649902891, "content": {"title": "Deep learning system to predict the 5-year risk of high myopia using fundus imaging in children", "abstract": ""}}
{"id": "t6cavlrBZPC", "cdate": 1577836800000, "mdate": null, "content": {"title": "Generative Data Augmentation for Diabetic Retinopathy Classification", "abstract": "A fundamental factor limiting the effectiveness of classification algorithms, especially in the medical imaging domain, has been an insufficient quantity of relevant class-specific data. In particular, positive examples of disease conditions tend to be rare, and represent a common bottleneck in improving model performance. In this paper, we introduce GAN-based generative data augmentation methods with dynamic input sampling, and compare their performance against an image feature transfer technique, towards improving the performance of real-world diabetic retinopathy classification tasks. Results suggest that generative data augmentation has the potential to significantly improve classification performance over the baseline."}}
{"id": "GSmGkgyxuu1", "cdate": 1577836800000, "mdate": null, "content": {"title": "Multi-Task Learning for Diabetic Retinopathy Grading and Lesion Segmentation", "abstract": "Although deep learning for Diabetic Retinopathy (DR) screening has shown great success in achieving clinically acceptable accuracy for referable versus non-referable DR, there remains a need to provide more fine-grained grading of the DR severity level as well as automated segmentation of lesions (if any) in the retina images. We observe that the DR severity level of an image is dependent on the presence of different types of lesions and their prevalence. In this work, we adopt a multi-task learning approach to perform the DR grading and lesion segmentation tasks. In light of the lack of lesion segmentation mask ground-truths, we further propose a semi-supervised learning process to obtain the segmentation masks for the various datasets. Experiments results on publicly available datasets and a real world dataset obtained from population screening demonstrate the effectiveness of the multi-task solution over state-of-the-art networks."}}
{"id": "A8eI0rk71Vc", "cdate": 1577836800000, "mdate": 1681649902892, "content": {"title": "Technical and imaging factors influencing performance of deep learning systems for diabetic retinopathy", "abstract": ""}}
{"id": "rQN3_0mbv8w", "cdate": 1546300800000, "mdate": 1681649902891, "content": {"title": "Feature Isolation for Hypothesis Testing in Retinal Imaging: An Ischemic Stroke Prediction Case Study", "abstract": ""}}
{"id": "HibD11MldaB", "cdate": 1546300800000, "mdate": null, "content": {"title": "Feature Isolation for Hypothesis Testing in Retinal Imaging: An Ischemic Stroke Prediction Case Study.", "abstract": "Ischemic stroke is a leading cause of death and long-term disability that is difficult to predict reliably. Retinal fundus photography has been proposed for stroke risk assessment, due to its non-invasiveness and the similarity between retinal and cerebral microcirculations, with past studies claiming a correlation between venular caliber and stroke risk. However, it may be that other retinal features are more appropriate. In this paper, extensive experiments with deep learning on six retinal datasets are described. Feature isolation involving segmented vascular tree images is applied to establish the effectiveness of vessel caliber and shape alone for stroke classification, and dataset ablation is applied to investigate model generalizability on unseen sources. The results suggest that vessel caliber and shape could be indicative of ischemic stroke, and sourcespecific features could influence model performance."}}
{"id": "3bOhwHXburu", "cdate": 1546300800000, "mdate": 1681649902892, "content": {"title": "Deep learning in estimating prevalence and systemic risk factors for diabetic retinopathy: a multi-ethnic study", "abstract": ""}}
{"id": "zACOV4FpbL0", "cdate": 1514764800000, "mdate": null, "content": {"title": "Enhanced Detection of Referable Diabetic Retinopathy via DCNNs and Transfer Learning", "abstract": "A clinically acceptable deep learning system (DLS) has been developed for the detection of diabetic retinopathy by the Singapore Eye Research Institute. For its utility in a national screening programme, further enhancement was needed. With newer deep convolutional neural networks (DCNNs) being introduced and technological methodology such as transfer learning gaining recognition for better performance, this paper compared the performance of the DCNN used in the original DLS, VGGNet, with newer DCNNs, ResNet and Ensemble, with transfer learning. The DLS performance improved with higher AUC, sensitivity and specificity with the adoption of the newer DCNNs and transfer learning."}}
{"id": "yfLEQfjhevM", "cdate": 1514764800000, "mdate": null, "content": {"title": "A Differential-Based Approach for Vessel Type Classification in Retinal Images", "abstract": "Vessel type classification is a preliminary step in quantifying the severity of various diseases. This paper proposes DBA, a simple yet effective vessel type classification method based on the principle that arteries are brighter than veins at the local scale. The weighted local difference of the red channel intensity of the main trunk of each vessel is compared with that of its two immediately neighbouring vessels, a feature that is highly correlated with vessel-rectified oxygen capacity, and in turn, vessel type. Experiments on the publicly-available INSPIRE-AVR and DRIVE datasets obtained average vessel accuracies of 0.9217/0.9071, and average pixel accuracies of 0.9602/0.9634 respectively, with particular effectiveness on images with low contrast, non-uniform illumination and colour variation confirmed on the SiMES 1 dataset."}}
{"id": "kcO_suL3Pa4", "cdate": 1514764800000, "mdate": null, "content": {"title": "Intermediate Goals in Deep Learning for Retinal Image Analysis", "abstract": "End-to-end deep learning has been demonstrated to exhibit human-level performance in many retinal image analysis tasks. However, such models’ generalizability to data from new sources may be less than optimal. We highlight some benefits of introducing intermediate goals in deep learning-based models."}}
