{"id": "dsniCVdYm7N", "cdate": 1683880251405, "mdate": 1683880251405, "content": {"title": "Planted XY model: Thermodynamics and inference", "abstract": "In this paper we study a fully connected planted spin glass named the planted XY model. Motivation for\nstudying this system comes both from the spin glass field and the one of statistical inference where it models\nthe angular synchronization problem. We derive the replica symmetric (RS) phase diagram in the temperature,\nferromagnetic bias plane using the approximate message passing (AMP) algorithm and its state evolution\n(SE). While the RS predictions are exact on the Nishimori line (i.e., when the temperature is matched to the\nferromagnetic bias), they become inaccurate when the parameters are mismatched, giving rise to a spin glass\nphase where AMP is not able to converge. To overcome the defects of the RS approximation we carry out\na one-step replica symmetry-breaking (1RSB) analysis based on the approximate survey propagation (ASP)\nalgorithm. Exploiting the state evolution of ASP, we count the number of metastable states in the measure,\nderive the 1RSB free entropy and find the behavior of the Parisi parameter throughout the spin glass phase."}}
{"id": "P4l6wOUcy1", "cdate": 1683880091209, "mdate": 1683880091209, "content": {"title": "Aligning random graphs with a sub-tree similarity message-passing algorithm ", "abstract": "The problem of aligning Erd˝os–R´enyi random graphs is a noisy,\naverage-case version of the graph isomorphism problem, in which a pair of correlated random graphs is observed through a random permutation of their vertices.\nWe study a polynomial time message-passing algorithm devised to solve the inference problem of partially recovering the hidden permutation, in the sparse regime\nwith constant average degrees. We perform extensive numerical simulations to\ndetermine the range of parameters in which this algorithm achieves partial recovery. We also introduce a generalized ensemble of correlated random graphs with\nprescribed degree distributions, and extend the algorithm to this case."}}
