{"id": "M84OnT0ZvDq", "cdate": 1663939410278, "mdate": null, "content": {"title": "Early Detection of Sexual Predators with Federated Learning", "abstract": "The rise in screen time and the isolation brought by the different containment measures implemented during the COVID-19 pandemic have led to an alarming increase in cases of online grooming. Online grooming is defined as all the strategies used by predators to lure children into sexual exploitation. Previous attempts made in industry and academia on the detection of grooming rely on accessing and monitoring users’ private conversations through the training of a model centrally or by sending personal conversations to a global server. We introduce a first, privacy-preserving, cross-device, federated learning framework for the early detection of sexual predators, which aims to ensure a safe online environment for children while respecting their privacy. "}}
{"id": "ytEtFGSVYjw", "cdate": 1637514918325, "mdate": null, "content": {"title": "Post-processing Counterexample-guided Fairness Guarantees in Neural Networks", "abstract": "There is an increasing interest in adopting high-capacity machine learning models such as deep neural networks to semi-automate human decisions. Hence, it is crucial that these models guarantee similar decisions for similar individuals. To ensure such a fair decision, it is necessary to construct tools capable of verifying and enforcing fairness constraints. In this work, we propose methods to guarantee fairness of a neural network via verification using mixed-integer programming. We show, that it is possible to guarantee individual fair prediction without intervening in the model, efficiently and with little to no loss in accuracy."}}
{"id": "Skb44k-d-H", "cdate": 1514764800000, "mdate": null, "content": {"title": "Fairness-Aware Relational Learning and Inference", "abstract": "AI and machine learning tools are being used with increasing frequency for decision making in domains that affect peoples' lives such as employment, education, policing and loan approval. These uses raise concerns about biases of algorithmic discrimination and have motivated the development of fairness-aware machine learning. However, existing fairness approaches are based solely on attributes of individuals. In many cases, discrimination is much more complex, and taking into account the social, organizational, and other connections between individuals is important. We introduce new notions of fairness that are able to capture the relational structure in a domain. We use first-order logic to provide a flexible and expressive language for specifying complex relational patterns of discrimination. We incorporate our definition of relational fairness to propose 1) fairness-aware constrained conditional inference subject to common data-oriented fairness measures and 2) fairness-aware parameter learning by incorporating decision-oriented fairness measures."}}
{"id": "ry-K2fM_WB", "cdate": 1420070400000, "mdate": null, "content": {"title": "Statistical Relational Learning Towards Modelling Social Media Users", "abstract": "1 Motivation Nowadays web users actively generate content on different social media platforms. The large number of users requiring personalized services creates a unique opportunity for researchers to explore user modelling. To distinguish users, recognizing their attributes such as personality, age and gender is essential. To this end, substantial research has been done by utilizing user generated content to recognize user attributes by applying different classification or regression techniques. Among other things, we have inferred the personality traits of Facebook users based on their status updates using three different classifiers [Farnadi et al., 2013]. But as we concluded in [Farnadi et al., 2014b], user attributes are not isolated, as emotions expressed in Facebook status updates are related to age, gender and personality of the authors. Using multivariate regression or multi-target classification techniques is one approach to leverage these dependencies in the user attribute learning process. For example, to employ the dependencies between different personality traits, we applied five multivariate regression techniques to infer the personality of YouTube vloggers [Farnadi et al., 2014c]. The above mentioned techniques are powerful types of machine learning approaches, however they only partially model social media users. Users communicate directly as friends, or indirectly, by liking others content. These types of interaction between users are a valuable source but modelling them with the traditional machine learning approaches is challenging. Furthermore, user generated content in social media comes in different modalities such as visual and textual content, whereas different pieces of evidence might contradict each other. Moreover, in extracting features from each source, a reasonable amount of noise is expected. Hence, using the extracted features as a single feature space without considering features’ noise, dependencies or conflicts, reduces the quality of the learning process. To overcome these limitations, we introduce a new statistical relational learning (SRL) framework [Getoor and Taskar, 2007] suitable for modelling social media users, which we call PSL Q [Farnadi et al., 2014a]."}}
{"id": "Hy4ifReu-r", "cdate": 1388534400000, "mdate": null, "content": {"title": "Extending PSL with Fuzzy Quantifiers", "abstract": "Probabilistic soft logic (PSL) is a probabilistic modeling framework which uses first-order logic and soft truth values in the interval[0;1] for reasoning in relational domains. PSL uses the Łukasiewicz t-norm and t-conorm from fuzzy logic to model respectively conjunction and disjunction. A PSL rule such as Trusts(A;X)^Trusts(X;B)->Trusts(A;B) models that “A trusts B” is true to the degree to which there is a trusted third party X. In the current version of PSL there is no way to express that A should trust B if most trusted friends of A trust B. In this work, we propose an extension of PSL with fuzzy quantifiers to address this limitation."}}
