{"id": "dz6DqabHH7", "cdate": 1600116586373, "mdate": null, "content": {"title": "Automated Benchmark Model Generators for Model-Based Diagnostic Inference", "abstract": "The task of model-based diagnosis is NP-complete, but it is not known whether it is computationally difficult for the “average” real-world system. There has been no systematic study of the complexity of diagnosing real-world problems, and few good benchmarks exist to test this. Real-world-graphs, a mathematical framework that has been proposed as a model for complex systems, have empirically been shown to capture several topological properties of real-world systems. We describe the adequacy with which a real-world-graph can characterise the complexity of model-based diagnostic inference on real-world systems. We empirically compare the inference complexity of diagnosing models automatically generated using the real-world graph framework with comparable models from well-known ISCAS circuit benchmarks. We identify parameters necessary for the real-world graph framework to generate benchmark diagnosis circuit models with realistic properties."}}
{"id": "hwJEvhXdAT5", "cdate": 1546300800000, "mdate": null, "content": {"title": "Fault-Tolerant Control for Unseen Faults using Randomized Methods", "abstract": "Real-time tolerance to novel faults is often needed to avoid catastrophic outcomes. However, no real-time solutions currently exist for novel faults: e.g., isolating the underlying fault and implementing an appropriate control may be too time-consuming or require a priori fault information. For such circumstances, we propose a novel approach that uses fast randomized control switching to stabilize a system, without any state estimation. We first show theoretically that, for a properly tuned controller, a randomized approach guarantees mean-square stability and is guaranteed to converge to an optimal solution. We then empirically demonstrate the efficacy of this approach on trajectory following in a quadcopter UAV."}}
{"id": "VOnSFKTR72", "cdate": 1514764800000, "mdate": null, "content": {"title": "On-line Reinforcement Learning for Trajectory Following with Unknown Faults", "abstract": ""}}
{"id": "6rNqaVzUC4R", "cdate": 1514764800000, "mdate": null, "content": {"title": "Comparison of Control and Cooperation Frameworks for Blended Autonomy", "abstract": "Autonomous vehicles, e.g., cars, aircraft or ships, will need to accept some degree of human control for the coming years. Consequently, a method of controlling autonomous systems (ASs) that integrates control inputs from humans and machines is critical. We describe a framework for blended autonomy, in which humans and ASs interact with varying degrees of control to safely achieve a task. We empirically compare collaborative control tasks in which the human and AS have identical or conflicting objectives, under three main control frameworks: (1) leader-follower control (based on Stackelberg games); (2) blended control; and (3) switching control. We validate our results on a car steering control model, given communication delays, noise and different collaboration levels."}}
{"id": "HLbzcSZ8iME", "cdate": 1483228800000, "mdate": null, "content": {"title": "An Algebraic Approach for Diagnosing Discrete-Time Hybrid Systems", "abstract": "A broad range of real-world systems can be defined using discrete-time hybrid systems, e.g., chemical process plants and manufacturing systems. We characterize this application domain using a class of discrete-event systems, max-plus linear discrete-event systems, which captures synchronization without concurrency or selection. The model framework of these hybrid systems is non-linear in a conventional algebra, but linear in the max-plus algebra, thereby enabling linear-time inference. We use an observer-based framework for monitoring and diagnosing max-plus diagnostics models, and further improve computational efficiency by searching over only the most-likely space of behaviours. We illustrate our approach using a chemical process-control example. Keyphrases : hybrid system diagnosis , max-plus algebra , Systems Modeling In : Marina Zanella , Ingo Pill and Alessandro Cimatti (editors). 28th International Workshop on Principles of Diagnosis (DX'17) , vol 4, pages 37--51 Links: https://easychair.org/publications/paper/9Nth https://doi.org/10.29007/n87m BibTeX entry @inproceedings{DX'17:An_Algebraic_Approach_for, author = {Gregory Provan}, title = {An Algebraic Approach for Diagnosing Discrete-Time Hybrid Systems}, booktitle = {28th International Workshop on Principles of Diagnosis (DX'17)}, editor = {Marina Zanella and Ingo Pill and Alessandro Cimatti}, series = {Kalpa Publications in Computing}, volume = {4}, pages = {37--51}, year = {2018}, publisher = {EasyChair}, bibsource = {EasyChair, https://easychair.org}, issn = {2515-1762}, url = {https://easychair.org/publications/paper/9Nth}, doi = {10.29007/n87m}}"}}
{"id": "6mamRNrRKz", "cdate": 1483228800000, "mdate": null, "content": {"title": "Comparing Switching vs. Mixing MPC for Robust Fault-Tolerant Control", "abstract": "L'apprentissage de modèles temporels constitue l'une des grandes problématiques de l'Exploration de Données (Data Mining). Dans cette thèse, nous avons développé un nouveau modèle temporel appelé TITA Rules (Règle associative temporelle basé sur des arbres d'intervalles). Ce modèle permet de décrire des phénomènes ayant un certain degré d'incertitude et/ou d'imprécision. Ce modèle permet entre autres d'exprimer la synchronicité entre évènements, les contraintes temporelles disjonctives et la négation temporelle. De par leur nature, les TITA Rules peuvent êtes utilisées pour effectuer des prédictions avec une grande précision temporel. Nous avons aussi développé un algorithme capable de découvrir et d'extraire de manière efficace des TITA Rules dans de grandes bases de données temporelles. Le cœur de l'algorithme est basé sur des techniques de minimisation d'entropie, de filtrage par Apriori et par des analyses de co-dépendance. Note modèle temporelle et notre algorithme ont été appliqués et évalués sur plusieurs jeux de données issues de phénomènes réels et de phénomènes simulés. La seconde partie de cette thèse à consisté à étudier l'utilisation de notre modèle temporel sur la problématique de la Planification Automatique. Ces travaux ont mené au développement d'un algorithme de planification automatique. L'algorithme prend en entrée un ensemble de TITA Rules décrivant le fonctionnement d'un système quelconque, une description de l'état initial du système, et un but à atteindre. En retour, l'algorithme calcule un plan décrivant la meilleure façon d'atteindre le but donné. Par la nature même des TITA Rules, cet algorithme est capable de gérer l'incertain (probabilités), l'imprécision temporelle, les contraintes temporelles disjonctives, ainsi que les événements exogènes prédictibles mais imprécis."}}
{"id": "sz3AEbzaYuJ", "cdate": 1451606400000, "mdate": null, "content": {"title": "An Improved State Filter Algorithm for SIR Epidemic Forecasting", "abstract": "In epidemic modeling, state filtering is an excellent tool for enhancing the performance of traditional epidemic models. We introduce a novel state filter algorithm to further improve the performance of state-of-the-art approaches based on Susceptible-Infected-Recovered (SIR) models. The proposed algorithm merges two techniques, which are typically used separately: linear correction, as seen in the Ensemble Kalman Filter (EnKF), and resampling, as used in the Particle Filter (PF). We compare the inferential accuracy of our approach against the EnKF and the Ensemble Adjustment Kalman Filter (EAKF), using algorithms employing both an uncentered covariance matrix (UCM) and the standard column-centered covariance matrix (CCM). Our algorithm requires O(DN) more time than EnKF does, where D is the ensemble dimension and N denotes the ensemble size. We demonstrate empirically that our algorithm with UCM achieves the lowest root-mean-square-error (RMSE) and the highest correlation coefficient (CORR) amongst the selected methods, in 11 out of 14 major real-world scenarios. We show that the EnKF with UCM outperforms the EnKF with CCM, while the EAKF gains better accuracy with CCM in most scenarios."}}
{"id": "augtXyfpVNC", "cdate": 1451606400000, "mdate": null, "content": {"title": "A General Characterization of Model-Based Diagnosis", "abstract": "The Model-Based Diagnosis (MBD) framework developed by Reiter has been a strong theoretical foundation for MBD, yet is limited to models that are described in terms of logical sentences. We propose a more general framework that covers a wide range of modelling languages, ranging from AI-based languages (e.g., logic and Bayesian networks) to FDI-based languages (e.g., linear Gaussian models). We show that a graph-theoretic basis for decomposable system models can be augmented with several languages and corresponding inference algorithms based on valuation algebras."}}
{"id": "9MewBZCULuO", "cdate": 1451606400000, "mdate": null, "content": {"title": "Learning Dynamical Models Using System Motifs", "abstract": ""}}
{"id": "gaVWbggynZD", "cdate": 1420070400000, "mdate": null, "content": {"title": "A Framework For Assessing Diagnostics Model Fidelity", "abstract": ""}}
