{"id": "13w29rMg8hb", "cdate": 1674005027076, "mdate": 1674005027076, "content": {"title": "Objective-aware Traffic Simulation via Inverse Reinforcement Learning", "abstract": "Traffic simulators act as an essential component in the operating and planning of transportation sys- tems. Conventional traffic simulators usually em- ploy a calibrated physical car-following model to describe vehicles’ behaviors and their interactions with traffic environment. However, there is no uni- versal physical model that can accurately predict the pattern of vehicle’s behaviors in different sit- uations. A fixed physical model tends to be less effective in a complicated environment given the non-stationary nature of traffic dynamics. In this paper, we formulate traffic simulation as an in- verse reinforcement learning problem, and propose a parameter sharing adversarial inverse reinforce- ment learning model for dynamics-robust simula- tion learning. Our proposed model is able to imi- tate a vehicle’s trajectories in the real world while simultaneously recovering the reward function that reveals the vehicle’s true objective which is invari- ant to different dynamics. Extensive experiments on synthetic and real-world datasets show the su- perior performance of our approach compared to state-of-the-art methods and its robustness to vari- ant dynamics of traffic."}}
{"id": "5iqzNK-Qeb", "cdate": 1663850077585, "mdate": null, "content": {"title": "CBLab: Scalable Traffic Simulation with Enriched Data Supporting", "abstract": "Traffic simulation provides interactive data for the optimization of traffic policies. However, existing traffic simulators are limited by their lack of scalability and shortage in input data, which prevents them from generating interactive data from traffic simulation in the scenarios of real large-scale city road networks. \n\nIn this paper, we present \\textbf{C}ity \\textbf{B}rain \\textbf{Lab}, a toolkit for scalable traffic simulation. CBLab is consist of three components: CBEngine, CBData, and CBScenario. CBEngine is a highly efficient simulator supporting large-scale traffic simulation. CBData includes a traffic dataset with road network data of 100 cities all around the world. We also develop a pipeline to conduct a one-click transformation from raw road networks to input data of our traffic simulation. Combining CBEngine and CBData allows researchers to run scalable traffic simulations in the road network of real large-scale cities. Based on that, CBScenario implements an interactive environment and several baseline methods for two scenarios of traffic policies respectively, with which traffic policies adaptable for large-scale urban traffic can be trained and tuned. To the best of our knowledge, CBLab is the first infrastructure supporting traffic policy optimization in large-scale urban scenarios. The code is available on GitHub:~\\url{https://github.com/CityBrainLab/CityBrainLab.git}."}}
{"id": "Syli5u3LPr", "cdate": 1569274003202, "mdate": null, "content": {"title": "Revisiting Spatial-Temporal Similarity: A Deep Learning Framework for Traffic Prediction", "abstract": ""}}
{"id": "ryV974bu-H", "cdate": 1514764800000, "mdate": null, "content": {"title": "IntelliLight: A Reinforcement Learning Approach for Intelligent Traffic Light Control", "abstract": "The intelligent traffic light control is critical for an efficient transportation system. While existing traffic lights are mostly operated by hand-crafted rules, an intelligent traffic light control system should be dynamically adjusted to real-time traffic. There is an emerging trend of using deep reinforcement learning technique for traffic light control and recent studies have shown promising results. However, existing studies have not yet tested the methods on the real-world traffic data and they only focus on studying the rewards without interpreting the policies. In this paper, we propose a more effective deep reinforcement learning model for traffic light control. We test our method on a large-scale real traffic dataset obtained from surveillance cameras. We also show some interesting case studies of policies learned from the real data."}}
{"id": "ry4rIMbdWS", "cdate": 1514764800000, "mdate": null, "content": {"title": "DRN: A Deep Reinforcement Learning Framework for News Recommendation", "abstract": "In this paper, we propose a novel Deep Reinforcement Learning framework for news recommendation. Online personalized news recommendation is a highly challenging problem due to the dynamic nature of news features and user preferences. Although some online recommendation models have been proposed to address the dynamic nature of news recommendation, these methods have three major issues. First, they only try to model current reward (e.g., Click Through Rate). Second, very few studies consider to use user feedback other than click / no click labels (e.g., how frequent user returns) to help improve recommendation. Third, these methods tend to keep recommending similar news to users, which may cause users to get bored. Therefore, to address the aforementioned challenges, we propose a Deep Q-Learning based recommendation framework, which can model future reward explicitly. We further consider user return pattern as a supplement to click / no click label in order to capture more user feedback information. In addition, an effective exploration strategy is incorporated to find new attractive news for users. Extensive experiments are conducted on the offline dataset and online production environment of a commercial news recommendation application and have shown the superior performance of our methods."}}
{"id": "rJExqVW_bB", "cdate": 1483228800000, "mdate": null, "content": {"title": "Contextual Spatial Outlier Detection with Metric Learning", "abstract": "Hydraulic fracturing (or \"fracking\") is a revolutionary well stimulation technique for shale gas extraction, but has spawned controversy in environmental contamination. If methane from gas wells leaks extensively, this greenhouse gas can impact drinking water wells and enhance global warming. Our work is motivated by this heated debate on environmental issue and focuses on general data analytical techniques to detect anomalous spatial data samples (e.g., water samples related to potential leakages). Specifically, we propose a spatial outlier detection method based on contextual neighbors. Different from existing work, our approach utilizes both spatial attributes and non-spatial contextual attributes to define neighbors. We further use robust metric learning to combine different contextual attributes in order to find meaningful neighbors. Our technique can be applied to any spatial dataset. Extensive experimental results on five real-world datasets demonstrate the effectiveness of our approach. We also show some interesting case studies, including one case linking to leakage of a gas well."}}
