{"id": "ef5uDQSKpw3", "cdate": 1609459200000, "mdate": 1682495677741, "content": {"title": "EEG-Based Sleep Staging Analysis with Functional Connectivity", "abstract": "Sleep staging is important in sleep research since it is the basis for sleep evaluation and disease diagnosis. Related works have acquired many desirable outcomes. However, most of current studies focus on time-domain or frequency-domain measures as classification features using single or very few channels, which only obtain the local features but ignore the global information exchanging between different brain regions. Meanwhile, brain functional connectivity is considered to be closely related to brain activity and can be used to study the interaction relationship between brain areas. To explore the electroencephalography (EEG)-based brain mechanisms of sleep stages through functional connectivity, especially from different frequency bands, we applied phase-locked value (PLV) to build the functional connectivity network and analyze the brain interaction during sleep stages for different frequency bands. Then, we performed the feature-level, decision-level and hybrid fusion methods to discuss the performance of different frequency bands for sleep stages. The results show that (1) PLV increases in the lower frequency band (delta and alpha bands) and vice versa during different stages of non-rapid eye movement (NREM); (2) alpha band shows a better discriminative ability for sleeping stages; (3) the classification accuracy of feature-level fusion (six frequency bands) reaches 96.91% and 96.14% for intra-subject and inter-subjects respectively, which outperforms decision-level and hybrid fusion methods."}}
{"id": "FKuBJu-7zU", "cdate": 1609459200000, "mdate": 1683882645434, "content": {"title": "Speaker recognition with voice evoked EEG", "abstract": "Traditional speaker recognition is based on the individual difference information in the voice’s acoustic parameters aroused by the structural characteristics of vocal organs. However, it only focuses on the recognition accuracy from the speaker-side without the listeners’ side. In this paper, we explored the voice evoked EEG (electroencephalography)-based speaker recognition with experiment design, feature extraction, classification and channel selection. The subject (listener) was asked to listen the audio-text stimuli consisted of four speakers and the subject’s EEG was used to decode the speakers. The extracted time-domain and time-frequency domain features were fed into siamese network in which the inter-class and intraclass samples were both trained. The empirical results show that 1) delta band (0.1-3 Hz) and high gamma band (51-80 Hz) provide higher recognition accuracy among other frequency bands; 2) frontal and parietal lobes play an important role; 3) the recognition performance is improved with subject’s attention; 4) when the listener is familiar with the speakers, the recognition accuracy is significantly higher than unfamiliar case. This work provides the brain mechanism and data processing method for auditory brain computer interface (BCI)."}}
{"id": "2hkYdm7mTE", "cdate": 1609459200000, "mdate": 1683882405300, "content": {"title": "Multi-Branch Network for Cross-Subject EEG-based Emotion Recognition", "abstract": "In recent years, electrocardiogram (EEG)-based emotion recognition has received increasing attention in affective computing. Since the individual differences of EEG signals are large, most models a..."}}
{"id": "EsDjL6e0aB", "cdate": 1546300800000, "mdate": 1683882645419, "content": {"title": "UAV-Based Motion Target Detection and Tracking Method in Dynamic Scenes", "abstract": "In this paper, we present a novel moving object detection algorithm with better robustness and severability under dynamic background. Frame difference search method is proposed to reduce the accuracy requirement of background compensation in moving object detection under dynamic background. Specifically, we incorporate the idea of selective search algorithm into the moving target detection algorithm, and use the frame difference method to incorporate image pixel-level features to improve the anti-noise ability. In addition, the advantage of the heuristic search of the selective search algorithm is utilized to segment a specific moving target, and the detection frames of each moving target are respectively obtained. In the UAV campus data set we collected, the frame difference search method was used to obtain an average accuracy of 89.2%."}}
