{"id": "KVXbh4cyK6", "cdate": 1640995200000, "mdate": 1671833359782, "content": {"title": "Using Ubiquitous Mobile Sensing and Temporal Sensor-Relation Graph Neural Network to Predict Fluid Intake of End Stage Kidney Patients", "abstract": "End-Stage Kidney Disease (ESKD) patients on hemodialysis suf-fer from kidney failure, with the inability to remove excess fluid causing fluid overload. This can cause many morbidities, and is one of the most insidious and common risk factors for mortality in ESKD patients. Existing solutions for fluid intake monitoring such as self-report and weight gain monitoring are burdensome, non-continuous, and usually administered in clinics only. It is then critical to develop a ubiquitous fluid intake monitoring system to help ESKD patients better control their fluid consumption. In this study, we propose to leverage smartwatch sensor data (e.g., Photoplethysmography (PPG), Gyroscope, etc.) combined with a temporal sensor relation graph neural network (TSR-GNN) to predict fluid intake given past sensing data between two dialysis sessions. Our empirical experiments highlight promising findings about the feasibility of using ubiquitous sensing to predict fluid intake, and demonstrate that the proposed model TSR-GNN outperforms the selected baseline models in both accuracy and robustness. Additionally, an in-depth analysis of model interpretability by attention weights and GNNExplainer variant is conducted to better under-stand the inter-sensor interactions and sensor contributions to the fluid intake prediction results."}}
{"id": "FMOmsOlEOf", "cdate": 1640995200000, "mdate": 1671833359783, "content": {"title": "Graph Neural Networks in IoT: A Survey", "abstract": "The Internet of Things (IoT) boom has revolutionized almost every corner of people's daily lives: healthcare, home, transportation, manufacturing, supply chain, and so on. With the recent development of sensor and communication technologies, IoT devices including smart wearables, cameras, smartwatches, and autonomous vehicles can accurately measure and perceive their surrounding environment. Continuous sensing generates massive amounts of data and presents challenges for machine learning. Deep learning models (e.g., convolution neural networks and recurrent neural networks) have been extensively employed in solving IoT tasks by learning patterns from multi-modal sensory data. Graph Neural Networks (GNNs), an emerging and fast-growing family of neural network models, can capture complex interactions within sensor topology and have been demonstrated to achieve state-of-the-art results in numerous IoT learning tasks. In this survey, we present a comprehensive review of recent advances in the application of GNNs to the IoT field, including a deep dive analysis of GNN design in various IoT sensing environments, an overarching list of public data and source code from the collected publications, and future research directions. To keep track of newly published works, we collect representative papers and their open-source implementations and create a Github repository at https://github.com/GuiminDong/GNN4IoT."}}
{"id": "kVlxyXXzhpa", "cdate": 1609459200000, "mdate": 1640746918690, "content": {"title": "Influenza-like symptom recognition using mobile sensing and graph neural networks", "abstract": "Early detection of influenza-like symptoms can prevent widespread flu viruses and enable timely treatments, particularly in the post-pandemic era. Mobile sensing leverages an increasingly diverse set of embedded sensors to capture fine-grained information of human behaviors and ambient contexts, and can serve as a promising solution for influenza-like symptom recognition. Traditionally, handcrafted and high level features of mobile sensing data are extracted by manual feature engineering and convolutional/recurrent neural network respectively. In this work, we apply graph representation to encode the dynamics of state transitions and internal dependencies in human behaviors, leverage graph embeddings to automatically extract the topological and spatial features from graph inputs, and propose an end-to-end graph neural network (GNN) model with multi-channel mobile sensing input for influenzalike symptom recognition based on people's daily mobility, social interactions, and physical activities. Using data generated from 448 participants, we show that GNN with GraphSAGE convolutional layers significantly outperforms baseline models with handcrafted features. Furthermore, we use GNN interpretability method to generate insights (e.g., important nodes and graph structures) about the importance of mobile sensing for recognizing Influenza-like symptoms. To the best of our knowledge, this is the first work that applies graph representation and graph neural network on mobile sensing data for graph-based human behavior modeling and health symptoms prediction."}}
{"id": "jd_lbzJ_fJC", "cdate": 1609459200000, "mdate": 1671833359779, "content": {"title": "Using Graph Representation Learning to Predict Salivary Cortisol Levels in Pancreatic Cancer Patients", "abstract": "Cortisol is a glucocorticoid hormone that is critical to immune system functioning. Studies show that prolonged exposure to high levels of cortisol can lead to a range of physical health ailments including the progression of tumor growth. The ability to monitor cortisol levels over time can therefore be used to facilitate decision-making during cancer treatment. However, collecting serum or saliva samples to monitor cortisol in situ is inconvenient, costly, and impractical. In this paper, we propose a general predictive modeling process that uses passively sensed actigraphy data to predict underlying salivary cortisol levels using graph representation learning. We compare machine learning models with handcrafted feature engineering and with graph representation learning, which includes Graph2Vec, FeatherGraph, GeoScattering and NetLSD. Our preliminary results generated from data from 10 newly diagnosed pancreatic cancer patients demonstrate that machine learning models with graph representation learning can outperform the handcrafted feature engineering to predict salivary cortisol levels."}}
{"id": "_j_Sc32-mq", "cdate": 1609459200000, "mdate": 1671833359782, "content": {"title": "Detection and Analysis of Interrupted Behaviors by Public Policy Interventions during COVID-19", "abstract": "In most countries around the world, various public policies and guidelines, such as social distancing and stay-at-home orders, have been put in place to slow down the spreading of COVID-19. Relying on traditional surveys to assess policy impacts on community level behavior changes may lead to biased results, and limit fine-grained understanding of human behavior dynamics over time. We propose to leverage mobile sensing to capture people's behavior footprints amid the COVID-19 pandemic, and understand their collective behavior changes with respect to existing policies. Specifically, we propose to extract a rich set of behavioral markers from raw mobile sensing data, including mobility, social interactions, physical activities, and health states, and apply them in a generalized behavior change analysis framework to measure and detect community level behavior changes in an epidemic context. We present how to combine change point detection algorithm and interrupted time series analysis to automatically detect three different measurements of behavior changes (e.g., level, trend, and variance changes), and provide insights supported by statistical inference. A case study using a dataset that we collected from a large mobile sensing study conducted in the United States is shown to demonstrate the proposed framework and method."}}
{"id": "376lyl-n8b", "cdate": 1609459200000, "mdate": 1671833359783, "content": {"title": "Semi-supervised Graph Instance Transformer for Mental Health Inference", "abstract": "Mental health disorders, such as generalized anxiety disorder and depression, are prevalent in modern society. Early detection of mental illness is essential to minimize the negative consequences of long-term psychological discomfort and behavioral dysfunction. As a diverse set of embedded sensors in smart mobile devices becomes commonplace, passively and continuously collected mobile sensing data are increasingly being used to develop machine learning based tools for early-stage disease diagnosis. In the training process of machine learning models, self-reported results from ecological momentary assessments (EMAs) are usually employed to provide supervisions. However, complete responses of these high-frequency surveys in the wild are impractical due to heavy user burden and low user engagement. Without the availability of EMA responses in low level of label granularity, the annotations in the high level can only provide weak supervisions. To leverage the vast majority of unannotated data in different levels of granularity, in this paper, we propose an end-to-end graph neural network algorithm called semi-supervised Graph Instance Transformer (SS-GIT) based on multiple instance learning and contrastive self-supervised learning to predict early signs of generalized anxiety disorder and depression under the weak supervisions. Using a mobile sensing dataset that we collected from around 1,300 participants in the wild, our empirical results demonstrate improved performance when compared to the existing state-of-the-art baseline graph neural networks for mental health inference. On average, our proposed model outperforms the best baseline model by 8.8% on Fl-score, 6.7% on ROC-AUC, and 7.2% on PR-AUC."}}
