{"id": "fUMHqkreXY", "cdate": 1696217129746, "mdate": 1696217129746, "content": {"title": "Time-delayed Multivariate Time Series Predictions", "abstract": "A major issue with real-time monitoring is to collect complete data. Hardware or software failures, network issues or, more frequently, time delays can disrupt such a collection. This results in having two versions of the same information: one in real-time but with potentially missing data, and the another, albeit complete, is delayed. Many works have studied how to handle missing data for classification and prediction. However, to the best of our knowledge, they do not consider how to leverage the delayed complete data to assist in learning the representation of real-time available data with missing values. This is despite the fact that the delayed complete data contain all the information (e.g., periodicities and trends). In this paper, we propose a framework to enhance the representation learning of the real-time available data by aligning the representation of past real-time but with missing data to that of past delayed but complete data. We test both a distance metric and contrastive learning to achieve this alignment. We implement our framework on a Transformer-based model and experiment it on three datasets. The efficiency of our solution is evaluated against seven baselines and considering four distinct patterns of missing data. Our experiments show that this proposal has a significant improvement in prediction accuracy (5.21% on average) over the baselines."}}
{"id": "ncnf49eyUOg", "cdate": 1640995200000, "mdate": 1667523073858, "content": {"title": "Physics-Informed Long-Sequence Forecasting From Multi-Resolution Spatiotemporal Data", "abstract": "Spatiotemporal data aggregated over regions or time windows at various resolutions demonstrate heterogeneous patterns and dynamics in each resolution. Meanwhile, the multi-resolution characteristic provides rich contextual information, which is critical for effective long-sequence forecasting. The importance of such inter-resolution information is more significant in practical cases, where fine-grained data is usually collected via approaches with lower costs but also lower qualities compared to those for coarse-grained data. However, existing works focus on uni-resolution data and cannot be directly applied to fully utilize the aforementioned extra information in multi-resolution data. In this work, we propose Spatiotemporal Koopman Multi-Resolution Network (ST-KMRN), a physics-informed learning framework for long-sequence forecasting from multi-resolution spatiotemporal data. Our method jointly models data aggregated in multiple resolutions and captures the inter-resolution dynamics with the self-attention mechanism. We also propose downsampling and upsampling modules among resolutions to further strengthen the connections among data of multiple resolutions. Moreover, we enhance the modeling of intra-resolution dynamics with physics-informed modules based on Koopman theory. Experimental results demonstrate that our proposed approach achieves the best performance on the long-sequence forecasting tasks compared to baselines without a specific design for multi-resolution data."}}
{"id": "d-lVaLbZ6O", "cdate": 1640995200000, "mdate": 1667523073878, "content": {"title": "Mu2ReST: Multi-resolution Recursive Spatio-Temporal Transformer for Long-Term Prediction", "abstract": "Long-term spatio-temporal prediction (LTSTP) over different resolutions plays a crucial role in planning and dispatching smart city applications, such as smart transportation and smart grid. The Transformer, which has demonstrated superiority in capturing long-term dependencies, was recently studied for spatio-temporal prediction. However, it is difficult to leverage it using both multi-resolution knowledge and spatio-temporal dependencies to aid LTSTP. The challenge typically lies in addressing two issues: (1) efficiently fusing information across multiple resolutions that demands elaborate and complicated modifications to the model, and (2) handling the necessary long-term sequence that makes concurrent space and time attentions too costly to be performed. To address these issues, we proposed a multi-resolution recursive spatio-temporal transformer (Mu2ReST). It implements a novel multi-resolution structure with recursive prediction from coarser to finer resolutions. This proposal reveals that an arduous modification of the model is not the only way to leverage multi-resolution knowledge. It further uses a redesigned lightweight space-time attention implementation to concurrently capture spatial and temporal dependencies. Experiment results using open and commercial urban datasets demonstrate that Mu2ReST outperforms existing methods for multi-resolution LTSTP tasks."}}
{"id": "h08-volq6D", "cdate": 1609459200000, "mdate": 1667523073878, "content": {"title": "Influence of Land Use information over performance when predicting spatiotemporal electricity load demand", "abstract": "In a world where the growing concern about climate change becomes more apparent, electricity industry has its role to play in slowing down such an evolution. In fact, tools and services could be provided to consumers in order to better manage their ever-increasing consumption. But, while waiting for such a complex solution to be deployed, a first step would be to better forecast current consumption. Such an improvement would enable to generate electricity accordingly, while renewable solutions are not presently optimal – i.e., intermittent, long-term storage issue, etc.Electricity Load Demand (ELD) fluctuations do not solely depend on temporal factors, they also have a spatial contribution that is often underestimated. Indeed, it is possible to map different ELD profiles with their Land Use (LU) information. For example, ELD in residential areas fits with residents’ commuting style, while in industrial areas, it mostly correlates with working hours. This paper aims to investigate such a relation. Considering ELD data on a 500m square grid and LU data on a 100m square grid, different 500m cell labeling has been defined. In order to assess if cells with similar labels have similar ELD, they have been grouped under the same forecast model. Several types of models (Multilayer Perceptron, Recurrent Neural Network) have been used to compare their performance and efficiency. This study confirms that, all models considered, some labels are more difficult to forecast than others. Such associations can reduce by over 30% the prediction error compare to a per cell scenario. Additional investigations would be needed to further reduce prediction error and to help models better seize the land specificity of each grid-cell. External data also affects ELD, and pairing them with an optimal LU labeling could be a promising solution."}}
{"id": "7ChuuERdIN", "cdate": 1609459200000, "mdate": 1667523073884, "content": {"title": "Is Adding More Modalities Better in a Multimodal Spatio-temporal Prediction Scenario? A Case Study on Japan Air Quality", "abstract": "Nowadays, several spatio-temporal datasets are made available for research purposes (e.g., location, traffic or meteorology dataset). These datasets are more and more utilized as multimodal inputs of neural networks in order to perform spatio-temporal predictions. However, there are few methods that include functions, which explicitly capture cross-modal relationships. This lack of information will be a serious problem when more complex modalities and dependencies among modalities will need to be taken into consideration. Considering that in the future more spatio-temporal datasets will be made available, it is of crucial importance to tackle this problem. In this paper, we conduct some preliminary experiments to confirm whether an existing multimodal spatio-temporal network performs better when another modality is added. These experiments compare air quality forecasting performance using a trimodal spatio-temporal dataset. This comparison is realized with several methods and especially one that has been modified to handle multiple modalities. Based on the obtained results, we confirm that prediction performance does not improve when another modality is simply added. Therefore, some methods are required to capture complex cross-modal relationships."}}
{"id": "VJADf6c_qf", "cdate": 1577836800000, "mdate": 1667523073877, "content": {"title": "Elucidating the extent by which population staying patterns help improve electricity load demand predictions", "abstract": "The need for electricity has never been more important these days. In order to achieve balance between generation and distribution - as well as schedule operations accordingly-high-accuracy load demand predictions are mandatory. But our society is currently undergoing modifications in electricity consumption allocation. We are witnessing a fast shift from office-to home- based working style. As a consequence, Electricity load demand prediction models are in need for additional data in order to quickly adapt to these modifications and maintain efficient predictions accuracy. The rising popularity of \"tracking\" devices and alike-applications opens up to a new type of multi-modal investigations. The availability of associated location data enables researcher to study mobility routine and patterns in order to cross it with other data. Electricity consumption is one domain impacted by people's mobility behavior (commuting, telework, etc.) as people are not \"plugged\" onto the power grid while moving. This paper presents a study on population staying patterns and how it can relate to electricity load demand. Time-series data providing the number of people staying in a given area has been used within a Deep Learning model in order to enhance electricity load demand predictions at the provider level. It unveils the potential usage of such dynamics data, while setting the foundations for more complex studies."}}
{"id": "XRYGB8qq5o", "cdate": 1546300800000, "mdate": 1682037181615, "content": {"title": "Detecting errors in short-term electricity demand forecast using people dynamics", "abstract": "The landscape of power grids is gradually changing. The growing number of electrical appliances as well as the outbreak of Electric Vehicles (EVs) is increasing the need for electricity. As a consequence, high-accuracy consumption predictions are necessary in order to both schedule and plan production and operations accordingly. The emergence of connected “tracking” devices opens up new data-sets into both Internet-of-Things and Big Data worlds. It provides information on human dynamics (people mobility behavior) and with it several opportunities. Electricity consumption is impacted by people movements as while moving they are not “connected” to the power grid. Therefore, predicting such movement patterns and volume could help electricity providers improve their own consumption predictions. This paper presents a system and methods used to predict people movement behaviors as well as detect any anomaly. A scoring system is used to both evaluate the dynamics predictions and raise alerts when the computed score surpasses established thresholds. This proposal is tested over a scenario using available datasets and demonstrates that modifications in people movement behavior is affecting the consumption profile."}}
{"id": "GrKpWM8scvw", "cdate": 1514764800000, "mdate": 1682037181650, "content": {"title": "Delivery Management System Based on Vehicles Monitoring and a Machine-Learning Mechanism", "abstract": "The continuously growing online shopping is increasing the number of attended home deliveries. The last-mile delivery plays an important role in online shopping satisfaction and especially for food deliveries. This paper focuses on food delivery retailers and particularly investigates the possibility to enhance deliveries using information and data knowledge. In fact, in addition to optimize and to share delivery routes, delivery vehicles could be monitored in order to always maintain shortest delivery delays. We propose in this paper a delivery management architecture targeting these principles. This system is composed of several core mechanisms that should keep delivery delays to a minimum while maintaining low service times. A proof-of-concept of this delivery management system has been developed using Electric Scooters, smartphones and several algorithms. It demonstrates how this architecture could work in a food delivery scenario."}}
{"id": "ECzlIuGFLXm", "cdate": 1483228800000, "mdate": 1682037181644, "content": {"title": "An efficient electric vehicle charging architecture based on LoRa communication", "abstract": ""}}
{"id": "6Pu0eCmS9rW", "cdate": 1483228800000, "mdate": null, "content": {"title": "Monitoring Traffic Optimization in a Smart Grid", "abstract": "The emergence of microgeneration systems steadily increases, and it raises concerns regarding their impact on the power grid. It is, therefore, crucial to efficiently integrate them into future smart grid architectures, as there is not any standard way to monitor production units. Moreover, current data collection systems are simple and do not consider their impact on local area networks. This paper presents a set of proposed mechanisms that reduces the monitoring traffic, while offering management flexibility on large-scale systems. This study is illustrated with measurements performed on a small grid, and it shows that, for monitoring a photovoltaic production, both 1-min and 1-s intervals provide the same production estimation, while significantly decreasing the associated traffic. It can be reduced even more by aggregating several measurements during a given period before sending them and by using specific mechanisms to ensure reliability. This experiment also helps authors identify best practices for monitoring different equipment based on their behaviors."}}
