{"id": "Iicb5TKkiR", "cdate": 1620603277419, "mdate": null, "content": {"title": "Identifiability of Generalized Hypergeometric Distribution (GHD) Directed Acyclic Graphical Models", "abstract": "We introduce a new class of identifiable DAG models where the conditional distribution of each node given its parents belongs to a family of generalized hypergeometric distributions (GHD). A family of generalized hypergeometric distributions includes a lot of discrete distributions such as the binomial, Beta-binomial, negative binomial, Poisson, hyper-Poisson, and many more. We prove that if the data drawn from the new class of DAG models, one can fully identify the graph structure. We further present a reliable and polynomial-time algorithm that recovers the graph from finitely many data. We show through theoretical results and numerical experiments that our algorithm is statistically consistent in high-dimensional settings (p >n) if the indegree of the graph is bounded, and out-performs state-of-the-art DAG learning algorithms."}}
{"id": "H1Eq0dW_bS", "cdate": 1420070400000, "mdate": null, "content": {"title": "Learning Large-Scale Poisson DAG Models based on OverDispersion Scoring", "abstract": "In this paper, we address the question of identifiability and learning algorithms for large-scale Poisson Directed Acyclic Graphical (DAG) models. We define general Poisson DAG models as models where each node is a Poisson random variable with rate parameter depending on the values of the parents in the underlying DAG. First, we prove that Poisson DAG models are identifiable from observational data, and present a polynomial-time algorithm that learns the Poisson DAG model under suitable regularity conditions. The main idea behind our algorithm is based on overdispersion, in that variables that are conditionally Poisson are overdispersed relative to variables that are marginally Poisson. Our algorithms exploits overdispersion along with methods for learning sparse Poisson undirected graphical models for faster computation. We provide both theoretical guarantees and simulation results for both small and large-scale DAGs."}}
