{"id": "CGVWsBBI7z", "cdate": 1640995200000, "mdate": 1668232694983, "content": {"title": "WaveNets: Wavelet Channel Attention Networks", "abstract": "Channel Attention reigns supreme as an effective technique in the field of computer vision. However, the proposed channel attention by SENet suffers from information loss in feature learning caused by the use of Global Average Pooling (GAP) to represent channels as scalars. Thus, designing effective channel attention mechanisms requires finding a solution to enhance features preservation in modeling channel inter-dependencies. In this work, we utilize Wavelet transform compression as a solution to the channel representation problem. We first test wavelet transform as an Auto-Encoder model equipped with conventional channel attention module. Next, we test wavelet transform as a standalone channel compression method. We prove that global average pooling is equivalent to the recursive approximate Haar wavelet transform. With this proof, we generalize channel attention using Wavelet compression and name it WaveNet. Implementation of our method can be embedded within existing channel attention methods with a couple of lines of code. We test our proposed method using ImageNet dataset for image classification task. Our method outperforms the baseline SENet, and achieves the state-of-the-art results. Our code implementation is publicly available at https://github.com/hady1011/WaveNet-C."}}
{"id": "9M-molSTrA", "cdate": 1640995200000, "mdate": 1668232694982, "content": {"title": "GHM Wavelet Transform for Deep Image Super Resolution", "abstract": "The GHM multi-level discrete wavelet transform is proposed as preprocessing for image super resolution with convolutional neural networks. Previous works perform analysis with the Haar wavelet only. In this work, 37 single-level wavelets are experimentally analyzed from Haar, Daubechies, Biorthogonal, Reverse Biorthogonal, Coiflets, and Symlets wavelet families. All single-level wavelets report similar results indicating that the convolutional neural network is invariant to choice of wavelet in a single-level filter approach. However, the GHM multi-level wavelet achieves higher quality reconstructions than the single-level wavelets. Three large data sets are used for the experiments: DIV2K, a dataset of textures, and a dataset of satellite images. The approximate high resolution images are compared using seven objective error measurements. A convolutional neural network based approach using wavelet transformed images has good results in the literature."}}
{"id": "eKfKTEYT7UZ", "cdate": 1577836800000, "mdate": 1668232694979, "content": {"title": "Similarity Metric for Millions of Unlabeled Face Images", "abstract": "Lately, image classification with unknown labels has been the focus of many research related to social media and cyber-security. In order to cluster images into labels, a similarity metric is used to compare images and based on the output a decision is made. In this article, we propose a Convolution Neural Network (CNN) based metric that achieves state of the art results. The proposed approach learns the priority features that differentiate two given input faces. The metric is trained on MSCeleb (10M faces of 100k individuals) and VGGFace2 (3.3M faces of 9k individuals) then tested using LFW (13 K faces of 5,749 individuals), MSCeleb, and VGGFace2 datasets. The network is evaluated through <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$F_{\\beta}$</tex> measure and accuracy. The metric proposed in this paper achieves state of the art <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$F_{\\beta}$</tex> measure of 0.94 for LFW benchmark."}}
{"id": "58Th1WKJgnf", "cdate": 1577836800000, "mdate": 1668232694987, "content": {"title": "Semi-Supervised Learning and Feature Fusion for Multi-view Data Clustering", "abstract": "Generative Adversarial Networks GANs have become widely used in Single-view classification tasks. Nowadays, most of the data have multiple views and each view emphasizes a unique feature set of the data. In this paper, we investigate the application of GANs on Multi-view data for the task of clustering and few-shot learning. We propose mvSGAN, a deep learning approach to GAN multi-view clustering, where generator and classifier networks are in a competitive min-max game. A multi-view learning algorithm is implemented with a mini-batch which can handle large data sets. We test the accuracy of our method in clustering real-world data sets. The experimental results show that our method outperforms state-of-the-art research."}}
