{"id": "v_Mpn18TKeH", "cdate": 1672531200000, "mdate": 1683158761370, "content": {"title": "Support Recovery in Sparse PCA with Non-Random Missing Data", "abstract": "We analyze a practical algorithm for sparse PCA on incomplete and noisy data under a general non-random sampling scheme. The algorithm is based on a semidefinite relaxation of the $\\ell_1$-regularized PCA problem. We provide theoretical justification that under certain conditions, we can recover the support of the sparse leading eigenvector with high probability by obtaining a unique solution. The conditions involve the spectral gap between the largest and second-largest eigenvalues of the true data matrix, the magnitude of the noise, and the structural properties of the observed entries. The concepts of algebraic connectivity and irregularity are used to describe the structural properties of the observed entries. We empirically justify our theorem with synthetic and real data analysis. We also show that our algorithm outperforms several other sparse PCA approaches especially when the observed entries have good structural properties. As a by-product of our analysis, we provide two theorems to handle a deterministic sampling scheme, which can be applied to other matrix-related problems."}}
{"id": "x5ysKCMXR5s", "cdate": 1652737724566, "mdate": null, "content": {"title": "Support Recovery in Sparse PCA with Incomplete Data", "abstract": "We study a practical algorithm for sparse principal component analysis (PCA) of incomplete and noisy data.\nOur algorithm is based on the semidefinite program (SDP) relaxation of the non-convex $l_1$-regularized PCA problem.\nWe provide theoretical and experimental evidence that SDP enables us to exactly recover the true support of the sparse leading eigenvector of the unknown true matrix, despite only observing an incomplete (missing uniformly at random) and noisy version of it.\nWe derive sufficient conditions for exact recovery, which involve matrix incoherence, the spectral gap between the largest and second-largest eigenvalues, the observation probability and the noise variance.\nWe validate our theoretical results with incomplete synthetic data, and show encouraging and meaningful results on a gene expression dataset."}}
{"id": "DzVPxyKgWmQ", "cdate": 1640995200000, "mdate": 1681694081406, "content": {"title": "On the Fundamental Limits of Exact Inference in Structured Prediction", "abstract": "Inference in structured prediction is naturally modeled with a graph, where the goal is to recover the unknown true label for each node given noisy observations corresponding to nodes and edges. The focus of this paper is on the fundamental limits of exact recovery irrespective of computational efficiency, assuming the generative process proposed by [1]. Analyzing the fundamental limits is crucial for algorithm evaluation and development. In this regard, we establish the information-theoretic limit bounds and show that there exists a gap between the limits and the performance of the existent tractable method [2], implying the need for further development of algorithms for exact inference. The fundamental limit we suggest applies to general connected graphs and involves graphical metrics such as the Cheeger constant and the maximum degree. Finally, we reveal that the sufficient and necessary conditions derived from the limit bounds are tight up to a logarithmic factor for a wide range of graphs."}}
{"id": "6ziwEDo-PMJ", "cdate": 1640995200000, "mdate": 1683158761387, "content": {"title": "Support Recovery in Sparse PCA with Incomplete Data", "abstract": "We study a practical algorithm for sparse principal component analysis (PCA) of incomplete and noisy data. Our algorithm is based on the semidefinite program (SDP) relaxation of the non-convex $l_1$-regularized PCA problem. We provide theoretical and experimental evidence that SDP enables us to exactly recover the true support of the sparse leading eigenvector of the unknown true matrix, despite only observing an incomplete (missing uniformly at random) and noisy version of it. We derive sufficient conditions for exact recovery, which involve matrix incoherence, the spectral gap between the largest and second-largest eigenvalues, the observation probability and the noise variance. We validate our theoretical results with incomplete synthetic data, and show encouraging and meaningful results on a gene expression dataset."}}
{"id": "0t8z_o07qrs", "cdate": 1640995200000, "mdate": 1684114225392, "content": {"title": "Support Recovery in Sparse PCA with Incomplete Data", "abstract": "We study a practical algorithm for sparse principal component analysis (PCA) of incomplete and noisy data.Our algorithm is based on the semidefinite program (SDP) relaxation of the non-convex $l_1$-regularized PCA problem.We provide theoretical and experimental evidence that SDP enables us to exactly recover the true support of the sparse leading eigenvector of the unknown true matrix, despite only observing an incomplete (missing uniformly at random) and noisy version of it.We derive sufficient conditions for exact recovery, which involve matrix incoherence, the spectral gap between the largest and second-largest eigenvalues, the observation probability and the noise variance.We validate our theoretical results with incomplete synthetic data, and show encouraging and meaningful results on a gene expression dataset."}}
{"id": "s3Ss2vzF4fQ", "cdate": 1609459200000, "mdate": null, "content": {"title": "On the Fundamental Limits of Exact Inference in Structured Prediction", "abstract": "Inference is a main task in structured prediction and it is naturally modeled with a graph. In the context of Markov random fields, noisy observations corresponding to nodes and edges are usually involved, and the goal of exact inference is to recover the unknown true label for each node precisely. The focus of this paper is on the fundamental limits of exact recovery irrespective of computational efficiency, assuming the generative process proposed by Globerson et al. (2015). We derive the necessary condition for any algorithm and the sufficient condition for maximum likelihood estimation to achieve exact recovery with high probability, and reveal that the sufficient and necessary conditions are tight up to a logarithmic factor for a wide range of graphs. Finally, we show that there exists a gap between the fundamental limits and the performance of the computationally tractable method of Bello and Honorio (2019), which implies the need for further development of algorithms for exact inference."}}
