{"id": "qwwHNiFHxy", "cdate": 1681483833589, "mdate": 1681483833589, "content": {"title": "Towards Fine-Grained Reasoning for Fake News Detection", "abstract": "The detection of fake news often requires sophisticated reasoning skills, such as logically combining information by considering word-level subtle clues. In this paper, we move towards fine-grained reasoning for fake news detection by better reflecting the logical processes of human thinking and enabling the modeling of subtle clues. In particular, we propose a fine-grained reasoning framework by following the human’s information-processing model, introduce a mutualreinforcement-based method for incorporating human knowledge about which evidence is more important, and design a prior-aware bi-channel kernel graph network to model subtle differences between pieces of evidence. Extensive experiments show that our model outperforms the state-of-the-art methods and demonstrate the explainability of our approach."}}
{"id": "CrA01lg035", "cdate": 1680307200000, "mdate": 1696037902813, "content": {"title": "Spammer detection via ranking aggregation of group behavior", "abstract": ""}}
{"id": "tjwSeGU1-2Z", "cdate": 1672531200000, "mdate": 1696037902839, "content": {"title": "Popularity Ratio Maximization: Surpassing Competitors through Influence Propagation", "abstract": "In this paper, we present an algorithmic study on how to surpass competitors in popularity by strategic promotions in social networks. We first propose a novel model, in which we integrate the Preferential Attachment (PA) model for popularity growth with the Independent Cascade (IC) model for influence propagation in social networks called PA-IC model. In PA-IC, a popular item and a novice item grab shares of popularity from the natural popularity growth via the PA model, while the novice item tries to gain extra popularity via influence cascade in a social network. The popularity ratio is defined as the ratio of the popularity measure between the novice item and the popular item. We formulate Popularity Ratio Maximization (PRM) as the problem of selecting seeds in multiple rounds to maximize the popularity ratio in the end. We analyze the popularity ratio and show that it is monotone but not submodular. To provide an effective solution, we devise a surrogate objective function and show that empirically it is very close to the original objective function while theoretically, it is monotone and submodular. We design two efficient algorithms, one for the overlapping influence and non-overlapping seeds (across rounds) setting and the other for the non-overlapping influence and overlapping seed setting, and further discuss how to deal with other models and problem variants. Our empirical evaluation further demonstrates that our proposed method consistently achieves the best popularity promotion compared to other methods. Our theoretical and empirical analyses shed light on the interplay between influence maximization and preferential attachment in social networks."}}
{"id": "UABsBwq0kiO", "cdate": 1672531200000, "mdate": 1696037902838, "content": {"title": "Explainable Restaurant Closure Prediction through Co-Attentive Contrastive Learning", "abstract": "In this paper, we propose a novel approach to enhance user and restaurant representations in the context of predicting the closure of a restaurant and give an explanation based on data generated from user-restaurant interactions. In order to accurately predict the operating status of a restaurant and give a reasonable explanation, we need rich relevant information of user-restaurant interaction and reviews to model their representations. However, the interaction information between the user and the restaurant is usually sparse. To address this issue, we propose a new model, which is called the Co-Attentive Contrastive Learning (CACL) model. Our model employs a contrastive learning algorithm to deal with data sparsity and leverages co-attention mechanism to select the most relevant review information assisting the former to obtain a more accurate and granular representation. By fusing these module, we obtain rich information to perform two tasks with better quality. To demonstrate the effectiveness of our model, extensive experiments was conducted in six different cities, and the results showed that CACL was superior to the previous method in terms of prediction accuracy and explainable ability (average 4.8% improvement in prediction and 35.4% improvement in explanation)."}}
{"id": "SYwldN43MXo", "cdate": 1672531200000, "mdate": 1684030285582, "content": {"title": "Popularity Ratio Maximization: Surpassing Competitors through Influence Propagation", "abstract": "In this paper, we present an algorithmic study on how to surpass competitors in popularity by strategic promotions in social networks. We first propose a novel model, in which we integrate the Preferential Attachment (PA) model for popularity growth with the Independent Cascade (IC) model for influence propagation in social networks called PA-IC model. In PA-IC, a popular item and a novice item grab shares of popularity from the natural popularity growth via the PA model, while the novice item tries to gain extra popularity via influence cascade in a social network. The {\\em popularity ratio} is defined as the ratio of the popularity measure between the novice item and the popular item. We formulate {\\em Popularity Ratio Maximization (PRM)} as the problem of selecting seeds in multiple rounds to maximize the popularity ratio in the end. We analyze the popularity ratio and show that it is monotone but not submodular. To provide an effective solution, we devise a surrogate objective function and show that empirically it is very close to the original objective function while theoretically, it is monotone and submodular. We design two efficient algorithms, one for the overlapping influence and non-overlapping seeds (across rounds) setting and the other for the non-overlapping influence and overlapping seed setting, and further discuss how to deal with other models and problem variants. Our empirical evaluation further demonstrates that the proposed PRM-IMM method consistently achieves the best popularity promotion compared to other methods. Our theoretical and empirical analyses shed light on the interplay between influence maximization and preferential attachment in social networks."}}
{"id": "H4sDSw1AZq", "cdate": 1672531200000, "mdate": 1696037902821, "content": {"title": "Explainable Recommendation with Personalized Review Retrieval and Aspect Learning", "abstract": "Explainable recommendation is a technique that combines prediction and generation tasks to produce more persuasive results. Among these tasks, textual generation demands large amounts of data to achieve satisfactory accuracy. However, historical user reviews of items are often insufficient, making it challenging to ensure the precision of generated explanation text. To address this issue, we propose a novel model, ERRA (Explainable Recommendation by personalized Review retrieval and Aspect learning). With retrieval enhancement, ERRA can obtain additional information from the training sets. With this additional information, we can generate more accurate and informative explanations. Furthermore, to better capture users' preferences, we incorporate an aspect enhancement component into our model. By selecting the top-n aspects that users are most concerned about for different items, we can model user representation with more relevant details, making the explanation more persuasive. To verify the effectiveness of our model, extensive experiments on three datasets show that our model outperforms state-of-the-art baselines (for example, 3.4% improvement in prediction and 15.8% improvement in explanation for TripAdvisor)."}}
{"id": "CXK41WThkUr", "cdate": 1672531200000, "mdate": 1695387679866, "content": {"title": "MUSER: A MUlti-Step Evidence Retrieval Enhancement Framework for Fake News Detection", "abstract": "The ease of spreading false information online enables individuals with malicious intent to manipulate public opinion and destabilize social stability. Recently, fake news detection based on evidence retrieval has gained popularity in an effort to identify fake news reliably and reduce its impact. Evidence retrieval-based methods can improve the reliability of fake news detection by computing the textual consistency between the evidence and the claim in the news. In this paper, we propose a framework for fake news detection based on MUlti- Step Evidence Retrieval enhancement (MUSER), which simulates the steps of human beings in the process of reading news, summarizing, consulting materials, and inferring whether the news is true or fake. Our model can explicitly model dependencies among multiple pieces of evidence, and perform multi-step associations for the evidence required for news verification through multi-step retrieval. In addition, our model is able to automatically collect existing evidence through paragraph retrieval and key evidence selection, which can save the tedious process of manual evidence collection. We conducted extensive experiments on real-world datasets in different languages, and the results demonstrate that our proposed model outperforms state-of-the-art baseline methods for detecting fake news by at least 3% in F1-Macro and 4% in F1-Micro. Furthermore, it provides interpretable evidence for end users."}}
{"id": "A8e2UGS4WD_", "cdate": 1672531200000, "mdate": 1696037902826, "content": {"title": "Temporal burstiness and collaborative camouflage aware fraud detection", "abstract": ""}}
{"id": "5vVSA_cdRqe", "cdate": 1652737409978, "mdate": null, "content": {"title": "FairVFL: A Fair Vertical Federated Learning Framework with Contrastive Adversarial Learning", "abstract": "Vertical federated learning (VFL) is a privacy-preserving machine learning paradigm that can learn models from features distributed on different platforms in a privacy-preserving way. Since in real-world applications the data may contain bias on fairness-sensitive features (e.g., gender), VFL models may inherit bias from training data and become unfair for some user groups. However, existing fair machine learning methods usually rely on the centralized storage of fairness-sensitive features to achieve model fairness, which are usually inapplicable in federated scenarios. In this paper, we propose a fair vertical federated learning framework (FairVFL), which can improve the fairness of VFL models. The core idea of FairVFL is to learn unified and fair representations of samples based on the decentralized feature fields in a privacy-preserving way. Specifically, each platform with fairness-insensitive features first learns local data representations from local features. Then, these local representations are uploaded to a server and aggregated into a unified representation for the target task. In order to learn a fair unified representation, we send it to each platform storing fairness-sensitive features and apply adversarial learning to remove bias from the unified representation inherited from the biased data. Moreover, for protecting user privacy, we further propose a contrastive adversarial learning method to remove private information from the unified representation in server before sending it to the platforms keeping fairness-sensitive features. Experiments on three real-world datasets validate that our method can effectively improve model fairness with user privacy well-protected."}}
{"id": "xryvwthoXD", "cdate": 1640995200000, "mdate": 1684030285917, "content": {"title": "A Joint Learning Framework for Restaurant Survival Prediction and Explanation", "abstract": ""}}
