{"id": "2__CwzQD19", "cdate": 1672531200000, "mdate": 1683983837553, "content": {"title": "Neural Control of Parametric Solutions for High-dimensional Evolution PDEs", "abstract": "We develop a novel computational framework to approximate solution operators of evolution partial differential equations (PDEs). By employing a general nonlinear reduced-order model, such as a deep neural network, to approximate the solution of a given PDE, we realize that the evolution of the model parameter is a control problem in the parameter space. Based on this observation, we propose to approximate the solution operator of the PDE by learning the control vector field in the parameter space. From any initial value, this control field can steer the parameter to generate a trajectory such that the corresponding reduced-order model solves the PDE. This allows for substantially reduced computational cost to solve the evolution PDE with arbitrary initial conditions. We also develop comprehensive error analysis for the proposed method when solving a large class of semilinear parabolic PDEs. Numerical experiments on different high-dimensional evolution PDEs with various initial conditions demonstrate the promising results of the proposed method."}}
{"id": "rEnGR3VdDW5", "cdate": 1646916789827, "mdate": null, "content": {"title": "Scalable Computation of Monge Maps with General Costs", "abstract": "Monge map refers to the optimal transport map between two probability distributions and provides a principled approach to transform one distribution to another. In spite of the rapid developments of the numerical methods for optimal transport problems, computing the Monge maps remains challenging, especially for high dimensional problems. In this paper, we present a scalable algorithm for computing the Monge map between two probability distributions. Our algorithm is based on a weak form of the optimal transport problem, thus it only requires samples from the marginals instead of their analytic expressions, and can accommodate optimal transport between two distributions with different dimensions. Our algorithm is suitable for general cost functions, compared with other existing methods for estimating Monge maps using samples, which are usually for quadratic costs. The performance of our algorithms is demonstrated through a series of experiments with both synthetic and realistic data."}}
{"id": "yCxf5V_Ywm", "cdate": 1640995200000, "mdate": 1683983837549, "content": {"title": "Collective Motion Planning for a Group of Robots Using Intermittent Diffusion", "abstract": "In this work we establish a simple yet effective strategy, based on intermittent diffusion, for enabling a group of robots to accomplish complex tasks, shape formation and assembly. We demonstrate the feasibility of this approach and rigorously prove collision avoidance and convergence properties of the proposed algorithms."}}
{"id": "t17EG0-qFB", "cdate": 1640995200000, "mdate": 1683983837547, "content": {"title": "Time discretizations of Wasserstein-Hamiltonian flows", "abstract": ""}}
{"id": "pRjJHjfkNZ", "cdate": 1640995200000, "mdate": 1683645670334, "content": {"title": "Discrete Langevin Sampler via Wasserstein Gradient Flow", "abstract": "It is known that gradient-based MCMC samplers for continuous spaces, such as Langevin Monte Carlo (LMC), can be derived as particle versions of a gradient flow that minimizes KL divergence on a Wasserstein manifold. The superior efficiency of such samplers has motivated several recent attempts to generalize LMC to discrete spaces. However, a fully principled extension of Langevin dynamics to discrete spaces has yet to be achieved, due to the lack of well-defined gradients in the sample space. In this work, we show how the Wasserstein gradient flow can be generalized naturally to discrete spaces. Given the proposed formulation, we demonstrate how a discrete analogue of Langevin dynamics can subsequently be developed. With this new understanding, we reveal how recent gradient-based samplers in discrete spaces can be obtained as special cases by choosing particular discretizations. More importantly, the framework also allows for the derivation of novel algorithms, one of which, \\textit{Discrete Langevin Monte Carlo} (DLMC), is obtained by a factorized estimate of the transition matrix. The DLMC method admits a convenient parallel implementation and time-uniform sampling that achieves larger jump distances. We demonstrate the advantages of DLMC on various binary and categorical distributions."}}
{"id": "gYLJjX99pea", "cdate": 1640995200000, "mdate": 1683983837555, "content": {"title": "New theoretical insights in the decomposition and time-frequency representation of nonstationary signals: the IMFogram algorithm", "abstract": "The analysis of the time-frequency content of a signal is a classical problem in signal processing, with a broad number of applications in real life. Many different approaches have been developed over the decades, which provide alternative time-frequency representations of a signal each with its advantages and limitations. In this work, following the success of nonlinear methods for the decomposition of signals into intrinsic mode functions (IMFs), we first provide more theoretical insights into the so-called Iterative Filtering decomposition algorithm, proving an energy conservation result for the derived decompositions. Furthermore, we present a new time-frequency representation method based on the IMF decomposition of a signal, which is called IMFogram. We prove theoretical results regarding this method, including its convergence to the spectrogram representation for a certain class of signals, and we present a few examples of applications, comparing results with some of the most well know approaches available in the literature."}}
{"id": "WJmYBDrBvbY", "cdate": 1640995200000, "mdate": 1683983837552, "content": {"title": "Optimal control for stochastic nonlinear Schrodinger equation on graph", "abstract": "We study the optimal control formulation for stochastic nonlinear Schrodinger equation (SNLSE) on a finite graph.   By viewing the SNLSE as a stochastic Wasserstein Hamiltonian flow on density manifold, we show the global existence of a unique strong solution for SNLSE with a linear drift control or a linear diffusion control on graph. Furthermore, we provide the gradient formula, the existence of the optimal control and a description on the optimal condition via the forward and backward stochastic differential equations."}}
{"id": "SjDGKHEeoxu", "cdate": 1640995200000, "mdate": 1683983837548, "content": {"title": "Path Exploration in Unknown Environments Using Fokker-Planck Equation on Graph", "abstract": "This paper introduces a graph-based, potential-guided method for path planning problems in unknown environments, where obstacles are unknown until the robots are in close proximity to the obstacle locations. Inspired by the Fokker-Planck equation and the intermittent diffusion process, the proposed method generates a tree connecting the initial and target configurations, and then finds a path on it using the available environmental information. The tree and path are updated iteratively when newly encountered obstacle information becomes available. The resulting method is a deterministic procedure proven to be complete, i.e., it is guaranteed to find a feasible path, when one exists, in a finite number of iterations. The method is scalable to high-dimensional problems. In addition, our method does not search the entire domain for the path, instead, the algorithm only explores a sub-region that can be described by the evolution of the Fokker-Planck equation on graph with a changing of diffusion coefficient intermittently. We demonstrate the performance of our algorithm via several numerical examples with different environments and dimensions, including high-dimensional cases."}}
{"id": "PrMONet0HT", "cdate": 1640995200000, "mdate": 1683983837551, "content": {"title": "Neural Parametric Fokker-Planck Equation", "abstract": "In this paper, we develop and analyze numerical methods for high-dimensional Fokker--Planck equations by leveraging generative models from deep learning. Our starting point is a formulation of the Fokker--Planck equation as a system of ordinary differential equations (ODEs) on finite-dimensional parameter space with the parameters inherited from generative models such as normalizing flows. We call such ODEs neural parametric Fokker--Planck equations. The fact that the Fokker--Planck equation can be viewed as the $L^2$-Wasserstein gradient flow of Kullback--Leibler (KL) divergence allows us to derive the ODEs as the constrained $L^2$-Wasserstein gradient flow of KL divergence on the set of probability densities generated by neural networks. For numerical computation, we design a variational semi-implicit scheme for the time discretization of the proposed ODE. Such an algorithm is sampling-based, which can readily handle the Fokker--Planck equations in higher dimensional spaces. Moreover, we also establish bounds for the asymptotic convergence analysis of the neural parametric Fokker--Planck equation as well as the error analysis for both the continuous and discrete versions. Several numerical examples are provided to illustrate the performance of the proposed algorithms and analysis."}}
{"id": "GDcGIiiccE", "cdate": 1640995200000, "mdate": 1683983837548, "content": {"title": "Method of evolving junction on optimal path planning in flows fields", "abstract": "We propose an algorithm using method of evolving junctions to solve the optimal path planning problems with piece-wise constant flow fields. In such flow fields, we prove that the optimal trajectories, with respect to a convex Lagrangian in the objective function, must be formed by piece-wise constant velocity motions. Taking advantage of this property, we transform the infinite dimensional optimal control problem into a finite dimensional optimization and use intermittent diffusion to solve the problems. The algorithm is proven to be complete. At last, we demonstrate the performance of the algorithm with various simulation examples."}}
