{"id": "pLGmOAuIdK4", "cdate": 1675209600000, "mdate": 1682714717334, "content": {"title": "Multi-cover inequalities for totally-ordered multiple knapsack sets: theory and computation", "abstract": "We propose a method to generate cutting-planes from multiple covers of knapsack constraints. The covers may come from different knapsack inequalities if the weights in the inequalities form a totally-ordered set. Thus, we introduce and study the structure of a totally-ordered multiple knapsack set. The valid multi-cover inequalities we derive for its convex hull have a number of interesting properties. First, they generalize the well-known (1, k)-configuration inequalities. Second, they are not aggregation cuts. Third, they cannot be generated as rank-1 Chvátal-Gomory cuts from the inequality system consisting of the knapsack constraints and all their minimal cover inequalities. We also provide conditions under which the inequalities are facets for the convex hull of the totally-ordered knapsack set, as well as conditions for those inequalities to fully characterize its convex hull. We give an integer program to solve the separation and provide numerical experiments that showcase the strength of these new inequalities"}}
{"id": "O_pCUK14OO", "cdate": 1640995200000, "mdate": 1682714717322, "content": {"title": "New Classes of Facets for Complementarity Knapsack Problems", "abstract": "The complementarity knapsack problem (CKP) is a knapsack problem with real-valued variables and complementarity conditions between pairs of its variables. We extend the polyhedral studies of De Farias et al. for CKP, by proposing three new families of cutting-planes that are all obtained from a combinatorial concept known as a pack. Sufficient conditions for these inequalities to be facet-defining, based on the concept of a maximal switching pack, are also provided. Moreover, we answer positively a conjecture by De Farias et al. about the separation complexity of the inequalities introduced in their work."}}
{"id": "MHQhHuQgfl", "cdate": 1640995200000, "mdate": 1682714717298, "content": {"title": "Recognition of Facets for Knapsack Polytope is DP-complete", "abstract": "DP is a complexity class that is the class of all languages that are the intersection of a language in NP and a language in co-NP, as coined by Papadimitriou and Yannakakis. In this paper, we will establish that, recognizing a facet for the knapsack polytope is DP-complete, as conjectured by Hartvigsen and Zemel in 1992. Moreover, we show that the recognition problem of a supporting hyperplane for the knapsack polytope and the exact knapsack problem are both DP-complete, and the membership problem of knapsack polytope is NP-complete."}}
{"id": "8_wHubheXWF", "cdate": 1640995200000, "mdate": 1682714717332, "content": {"title": "On the Complexity of Separation from the Knapsack Polytope", "abstract": "We close three open problems on the separation complexity of valid inequalities for the knapsack polytope. Specifically, we establish that the separation problems for extended cover inequalities, (1, k)-configuration inequalities, and weight inequalities are all $$\\mathcal {NP}$$ -complete. We also show that, when the number of constraints of the LP relaxation is constant and its optimal solution is an extreme point, then the separation problems of both extended cover inequalities and weight inequalities can be solved in polynomial time."}}
{"id": "zhYY9LQF88H", "cdate": 1609459200000, "mdate": 1682714717293, "content": {"title": "Multi-cover Inequalities for Totally-Ordered Multiple Knapsack Sets", "abstract": "We propose a method to generate cutting-planes from multiple covers of knapsack constraints. The covers may come from different knapsack inequalities if the weights in the inequalities form a totally-ordered set. Thus, we introduce and study the structure of a totally-ordered multiple knapsack set. The valid multi-cover inequalities we derive for its convex hull have a number of interesting properties. First, they generalize the well-known (1, k)-configuration inequalities. Second, they are not aggregation cuts. Third, they cannot be generated as a rank-1 Chvátal-Gomory cut from the inequality system consisting of the knapsack constraints and all their minimal covers. Finally, we provide conditions under which the inequalities are facet-defining for the convex hull of the totally-ordered knapsack set."}}
{"id": "5zatGx3QOA", "cdate": 1609459200000, "mdate": 1682714717287, "content": {"title": "Integer packing sets form a well-quasi-ordering", "abstract": ""}}
{"id": "yHjtZxiV4qn", "cdate": 1577836800000, "mdate": 1631189741635, "content": {"title": "A Scalable MIP-based Method for Learning Optimal Multivariate Decision Trees", "abstract": "Several recent publications report advances in training optimal decision trees (ODT) using mixed-integer programs (MIP), due to algorithmic advances in integer programming and a growing interest in addressing the inherent suboptimality of heuristic approaches such as CART. In this paper, we propose a novel MIP formulation, based on a 1-norm support vector machine model, to train a multivariate ODT for classification problems. We provide cutting plane techniques that tighten the linear relaxation of the MIP formulation, in order to improve run times to reach optimality. Using 36 data-sets from the University of California Irvine Machine Learning Repository, we demonstrate that our formulation outperforms its counterparts in the literature by an average of about 10% in terms of mean out-of-sample testing accuracy across the data-sets. We provide a scalable framework to train multivariate ODT on large data-sets by introducing a novel linear programming (LP) based data selection method to choose a subset of the data for training. Our method is able to routinely handle large data-sets with more than 7,000 sample points and outperform heuristics methods and other MIP based techniques. We present results on data-sets containing up to 245,000 samples. Existing MIP-based methods do not scale well on training data-sets beyond 5,500 samples."}}
{"id": "vRIs-1so8s", "cdate": 1577836800000, "mdate": 1631189741583, "content": {"title": "A Scalable MIP-based Method for Learning Optimal Multivariate Decision Trees", "abstract": "Several recent publications report advances in training optimal decision trees (ODTs) using mixed-integer programs (MIPs), due to algorithmic advances in integer programming and a growing interest in addressing the inherent suboptimality of heuristic approaches such as CART. In this paper, we propose a novel MIP formulation, based on 1-norm support vector machine model, to train a binary oblique ODT for classification problems. We further present techniques, such as cutting planes, to tighten its linear relaxation, to improve run times to reach optimality. Using 36 datasets from the University of California Irvine Machine Learning Repository, we demonstrate that our training approach outperforms its counterparts from literature in terms of out-of-sample performance (around 10% improvement in mean out-of-sample testing accuracy). Towards our goal of developing a scalable framework to train multivariate ODT on large datasets, we propose a new linear programming based data selection method to choose a subset of the data, and use it to train a decision tree through our proposed MIP model. We conclude this paper with extensive numerical testing results, that showcase the generalization performance of our new MIP formulation, and the improvement in mean out-of-sample accuracy on large datasets."}}
