{"id": "WhBD_AGCQUi", "cdate": 1672531200000, "mdate": 1681533611240, "content": {"title": "In-Distribution Barrier Functions: Self-Supervised Policy Filters that Avoid Out-of-Distribution States", "abstract": ""}}
{"id": "z_hPo2Fu9A3", "cdate": 1655376349273, "mdate": null, "content": {"title": "RAP: Risk-Aware Prediction for Robust Planning", "abstract": "Robust planning in interactive scenarios requires predicting the uncertain future to make risk-aware decisions. Unfortunately, due to long-tail safety-critical events, the risk is often under-estimated by finite-sampling approximations of probabilistic motion forecasts. This can lead to overconfident and unsafe robot behavior, even with robust planners. Instead of assuming full prediction coverage that robust planners require, we propose to make prediction itself risk-aware. We introduce a new prediction objective to learn a risk-biased distribution over trajectories, so that risk evaluation simplifies to an expected cost estimation under this biased distribution. This reduces sample complexity of the risk estimation during online planning, which is needed for safe real-time performance. Evaluation results in a didactic simulation environment and on a real-world dataset demonstrate the effectiveness of our approach. The code and a demo are available."}}
{"id": "2ZWOv7-P-my", "cdate": 1640995200000, "mdate": 1681533611309, "content": {"title": "RAP: Risk-Aware Prediction for Robust Planning", "abstract": ""}}
{"id": "028zPShrGX", "cdate": 1640995200000, "mdate": 1681533611246, "content": {"title": "RAP: Risk-Aware Prediction for Robust Planning", "abstract": ""}}
{"id": "tZIK44naZ2E", "cdate": 1609459200000, "mdate": 1654712789395, "content": {"title": "SACBP: Belief space planning for continuous-time dynamical systems via stochastic sequential action control", "abstract": ""}}
{"id": "pxSuNhBCoKY", "cdate": 1609459200000, "mdate": 1654712789397, "content": {"title": "RAT iLQR: A Risk Auto-Tuning Controller to Optimally Account for Stochastic Model Mismatch", "abstract": "Successful robotic operation stochastic environments relies on accurate characterization of the underlying probability distributions, yet this is often imperfect due to limited knowledge. This work presents a control algorithm that is capable of handling such distributional mismatches. Specifically, we propose a novel nonlinear MPC for distributionally robust control, which plans locally optimal feedback policies against a worst-case distribution within a given KL divergence bound from a Gaussian distribution. Leveraging mathematical equivalence between distributionally robust control and risk-sensitive optimal control, our framework also provides an algorithm to dynamically adjust the risk-sensitivity level online for risk-sensitive control. The benefits of the distributional robustness as well as the automatic risk-sensitivity adjustment are demonstrated in a dynamic collision avoidance scenario where the predictive distribution of human motion is erroneous."}}
{"id": "sKuGMum3Izu", "cdate": 1577836800000, "mdate": 1681750313698, "content": {"title": "Risk-Sensitive Sequential Action Control with Multi-Modal Human Trajectory Forecasting for Safe Crowd-Robot Interaction", "abstract": "This paper presents a novel online framework for safe crowd-robot interaction based on risk-sensitive stochastic optimal control, wherein the risk is modeled by the entropic risk measure. The sampling-based model predictive control relies on mode insertion gradient optimization for this risk measure as well as Trajectron++, a state-of-the-art generative model that produces multimodal probabilistic trajectory forecasts for multiple interacting agents. Our modular approach decouples the crowd-robot interaction into learning-based prediction and model-based control, which is advantageous compared to end-to-end policy learning methods in that it allows the robot's desired behavior to be specified at run time. In particular, we show that the robot exhibits diverse interaction behavior by varying the risk sensitivity parameter. A simulation study and a real-world experiment show that the proposed online framework can accomplish safe and efficient navigation while avoiding collisions with more than 50 humans in the scene."}}
{"id": "iil2-LScJaM", "cdate": 1577836800000, "mdate": null, "content": {"title": "Risk-Sensitive Sequential Action Control with Multi-Modal Human Trajectory Forecasting for Safe Crowd-Robot Interaction", "abstract": "This paper presents a novel online framework for safe crowd-robot interaction based on risk-sensitive stochastic optimal control, wherein the risk is modeled by the entropic risk measure. The sampling-based model predictive control relies on mode insertion gradient optimization for this risk measure as well as Trajectron++, a state-of-the-art generative model that produces multimodal probabilistic trajectory forecasts for multiple interacting agents. Our modular approach decouples the crowd-robot interaction into learning-based prediction and model-based control, which is advantageous compared to end-to-end policy learning methods in that it allows the robot's desired behavior to be specified at run time. In particular, we show that the robot exhibits diverse interaction behavior by varying the risk sensitivity parameter. A simulation study and a real-world experiment show that the proposed online framework can accomplish safe and efficient navigation while avoiding collisions with more than 50 humans in the scene."}}
{"id": "Yje3eQQkCr", "cdate": 1577836800000, "mdate": 1681750313808, "content": {"title": "SACBP: Belief Space Planning for Continuous-Time Dynamical Systems via Stochastic Sequential Action Control", "abstract": "We propose a novel belief space planning technique for continuous dynamics by viewing the belief system as a hybrid dynamical system with time-driven switching. Our approach is based on the perturbation theory of differential equations and extends Sequential Action Control to stochastic dynamics. The resulting algorithm, which we name SACBP, does not require discretization of spaces or time and synthesizes control signals in near real-time. SACBP is an anytime algorithm that can handle general parametric Bayesian filters under certain assumptions. We demonstrate the effectiveness of our approach in an active sensing scenario and a model-based Bayesian reinforcement learning problem. In these challenging problems, we show that the algorithm significantly outperforms other existing solution techniques including approximate dynamic programming and local trajectory optimization."}}
{"id": "QWBY_5HH2C", "cdate": 1577836800000, "mdate": 1681750313714, "content": {"title": "RAT iLQR: A Risk Auto-Tuning Controller to Optimally Account for Stochastic Model Mismatch", "abstract": "Successful robotic operation in stochastic environments relies on accurate characterization of the underlying probability distributions, yet this is often imperfect due to limited knowledge. This work presents a control algorithm that is capable of handling such distributional mismatches. Specifically, we propose a novel nonlinear MPC for distributionally robust control, which plans locally optimal feedback policies against a worst-case distribution within a given KL divergence bound from a Gaussian distribution. Leveraging mathematical equivalence between distributionally robust control and risk-sensitive optimal control, our framework also provides an algorithm to dynamically adjust the risk-sensitivity level online for risk-sensitive control. The benefits of the distributional robustness as well as the automatic risk-sensitivity adjustment are demonstrated in a dynamic collision avoidance scenario where the predictive distribution of human motion is erroneous."}}
