{"id": "iz8EK6w-g_S", "cdate": 1672531200000, "mdate": 1696011642187, "content": {"title": "O(k)-Equivariant Dimensionality Reduction on Stiefel Manifolds", "abstract": "Many real-world datasets live on high-dimensional Stiefel and Grassmannian manifolds, $V_k(\\mathbb{R}^N)$ and $Gr(k, \\mathbb{R}^N)$ respectively, and benefit from projection onto lower-dimensional Stiefel (respectively, Grassmannian) manifolds. In this work, we propose an algorithm called Principal Stiefel Coordinates (PSC) to reduce data dimensionality from $ V_k(\\mathbb{R}^N)$ to $V_k(\\mathbb{R}^n)$ in an $O(k)$-equivariant manner ($k \\leq n \\ll N$). We begin by observing that each element $\\alpha \\in V_n(\\mathbb{R}^N)$ defines an isometric embedding of $V_k(\\mathbb{R}^n)$ into $V_k(\\mathbb{R}^N)$. Next, we optimize for such an embedding map that minimizes data fit error by warm-starting with the output of principal component analysis (PCA) and applying gradient descent. Then, we define a continuous and $O(k)$-equivariant map $\\pi_\\alpha$ that acts as a ``closest point operator'' to project the data onto the image of $V_k(\\mathbb{R}^n)$ in $V_k(\\mathbb{R}^N)$ under the embedding determined by $\\alpha$, while minimizing distortion. Because this dimensionality reduction is $O(k)$-equivariant, these results extend to Grassmannian manifolds as well. Lastly, we show that the PCA output globally minimizes projection error in a noiseless setting, but that our algorithm achieves a meaningfully different and improved outcome when the data does not lie exactly on the image of a linearly embedded lower-dimensional Stiefel manifold as above. Multiple numerical experiments using synthetic and real-world data are performed."}}
{"id": "mW2iLEJ1hq", "cdate": 1664806781381, "mdate": null, "content": {"title": "Automatic Sleep Scoring from Large-scale Multi-channel Pediatric EEG", "abstract": " Sleep is particularly important to the health of infants, children, and adolescents, and sleep scoring is the first step to accurate diagnosis and treatment of potentially life-threatening conditions. But pediatric sleep is severely under-researched compared to adult sleep in the context of machine learning for health, and sleep scoring algorithms developed for adults usually perform poorly on infants. Here, we present the first automated sleep scoring results on a recent large-scale pediatric sleep study dataset that was collected during standard clinical care. We develop a transformer-based model that learns to classify five sleep stages from millions of multi-channel electroencephalogram (EEG) sleep epochs with 78% overall accuracy. Further, we conduct an in-depth analysis of the model performance based on patient demographics and EEG channels. The results point to the growing need for machine learning research on pediatric sleep."}}
{"id": "pfA0j4smsq", "cdate": 1640995200000, "mdate": 1681660567271, "content": {"title": "Pediatric Sleep Scoring In-the-wild from Millions of Multi-channel EEG Signals", "abstract": "Sleep is particularly important to the health of infants, children, and adolescents, and sleep scoring is the first step to accurate diagnosis and treatment of potentially life-threatening conditions. But pediatric sleep is severely under-researched compared to adult sleep in the context of machine learning for health, and sleep scoring algorithms developed for adults usually perform poorly on infants. Here, we present the first automated sleep scoring results on a recent large-scale pediatric sleep study dataset that was collected during standard clinical care. We develop a transformer-based model that learns to classify five sleep stages from millions of multi-channel electroencephalogram (EEG) sleep epochs with 78% overall accuracy. Further, we conduct an in-depth analysis of the model performance based on patient demographics and EEG channels. The results point to the growing need for machine learning research on pediatric sleep."}}
{"id": "joEvN3eNmj", "cdate": 1640995200000, "mdate": 1681660567404, "content": {"title": "Active Learning of Non-semantic Speech Tasks with Pretrained Models", "abstract": "Pretraining neural networks with massive unlabeled datasets has become popular as it equips the deep models with a better prior to solve downstream tasks. However, this approach generally assumes that the downstream tasks have access to annotated data of sufficient size. In this work, we propose ALOE, a novel system for improving the data- and label-efficiency of non-semantic speech tasks with active learning. ALOE uses pretrained models in conjunction with active learning to label data incrementally and learn classifiers for downstream tasks, thereby mitigating the need to acquire labeled data beforehand. We demonstrate the effectiveness of ALOE on a wide range of tasks, uncertainty-based acquisition functions, and model architectures. Training a linear classifier on top of a frozen encoder with ALOE is shown to achieve performance similar to several baselines that utilize the entire labeled data."}}
{"id": "cKTYhw4RA0", "cdate": 1640995200000, "mdate": 1681660567269, "content": {"title": "Distilled Non-Semantic Speech Embeddings with Binary Neural Networks for Low-Resource Devices", "abstract": "This work introduces BRILLsson, a novel binary neural network-based representation learning model for a broad range of non-semantic speech tasks. We train the model with knowledge distillation from a large and real-valued TRILLsson model with only a fraction of the dataset used to train TRILLsson. The resulting BRILLsson models are only 2MB in size with a latency less than 8ms, making them suitable for deployment in low-resource devices such as wearables. We evaluate BRILLsson on eight benchmark tasks (including but not limited to spoken language identification, emotion recognition, health condition diagnosis, and keyword spotting), and demonstrate that our proposed ultra-light and low-latency models perform as well as large-scale models."}}
{"id": "WC9zTIg7T4D", "cdate": 1640995200000, "mdate": 1681490147363, "content": {"title": "Privacy-Preserving Federated Multi-Task Linear Regression: A One-Shot Linear Mixing Approach Inspired By Graph Regularization", "abstract": ""}}
{"id": "T_Z-jTIKgC", "cdate": 1640995200000, "mdate": 1682097915216, "content": {"title": "Predicting the Future of AI with AI: High-quality link prediction in an exponentially growing knowledge network", "abstract": "A tool that could suggest new personalized research directions and ideas by taking insights from the scientific literature could significantly accelerate the progress of science. A field that might benefit from such an approach is artificial intelligence (AI) research, where the number of scientific publications has been growing exponentially over the last years, making it challenging for human researchers to keep track of the progress. Here, we use AI techniques to predict the future research directions of AI itself. We develop a new graph-based benchmark based on real-world data -- the Science4Cast benchmark, which aims to predict the future state of an evolving semantic network of AI. For that, we use more than 100,000 research papers and build up a knowledge network with more than 64,000 concept nodes. We then present ten diverse methods to tackle this task, ranging from pure statistical to pure learning methods. Surprisingly, the most powerful methods use a carefully curated set of network features, rather than an end-to-end AI approach. It indicates a great potential that can be unleashed for purely ML approaches without human knowledge. Ultimately, better predictions of new future research directions will be a crucial component of more advanced research suggestion tools."}}
{"id": "P8HAOwxwIr", "cdate": 1640995200000, "mdate": 1696011642183, "content": {"title": "A Simple, interpretable method to identify surprising topic shifts in scientific fields", "abstract": "This paper proposes a text-mining framework to systematically identify vanishing or newly formed topics in highly interdisciplinary and diverse fields like cognitive science. We apply topic modeling via non-negative matrix factorization to cognitive science publications before and after 2012; this allows us to study how the field has changed since the revival of neural networks in the neighboring field of AI/ML. Our proposed method represents the two distinct sets of topics in an interpretable, common vector space, and uses an entropy-based measure to quantify topical shifts. Case studies on vanishing (e.g., connectionist/symbolic AI debate) and newly emerged (e.g., art and technology) topics are presented. Our framework can be applied to any field or any historical event considered to mark a major shift in thought. Such findings can help lead to more efficient and impactful scientific discoveries."}}
{"id": "yzVECygEpF_", "cdate": 1632499908982, "mdate": null, "content": {"title": "Joint Content-Context Analysis of Scientific Publications: Identifying Opportunities for Collaboration in Cognitive Science", "abstract": "This work studies publications in the field of cognitive science and utilizes mathematical techniques to connect the analysis of the papers' content (abstracts) to the context (citation, journals). We apply hierarchical topic modeling on the abstracts and community detection algorithms on the citation network, and measure content-context discrepancy to find academic fields that study similar topics but do not cite each other or publish in the same venues. These results show a promising, systemic framework to identify opportunities for scientific collaboration in highly interdisciplinary fields such as cognitive science and machine learning."}}
{"id": "PdPqFvlkeY", "cdate": 1620328347322, "mdate": null, "content": {"title": "NCH Sleep DataBank: A Large Collection of Real-world Pediatric Sleep Studies", "abstract": "Despite being crucial to health and quality of life, sleep—especially pediatric sleep—is notyet well understood. This is exacerbated by lack of access to sufficient pediatric sleep datawith clinical annotation. In order to accelerate research on pediatric sleep and its connectionto health, we create the Nationwide Children’s Hospital (NCH) Sleep DataBank and publishit at the National Sleep Research Resource (NSRR), which is a large sleep data common withphysiological data, clinical data, and tools for analyses. The NCH Sleep DataBank consistsof 3,984 polysomnography studies and over 5.6 million clinical observations on 3,673 uniquepatients between 2017 and 2019 at NCH. The novelties of this dataset include: 1) large-scalesleep dataset suitable for discovering new insights via data mining, 2) explicit focus on pediatricpatients, 3) gathered in a real-world clinical setting, and 4) the accompanying rich set of clinicaldata. The NCH Sleep DataBank is a valuable resource for advancing automatic sleep scoringand real-time sleep disorder prediction, among many other potential scientific discoveries."}}
