{"id": "dmtR2ZV9qRK", "cdate": 1577836800000, "mdate": null, "content": {"title": "Unsupervised Ensemble of Ranking Models for News Comments Using Pseudo Answers", "abstract": "Ranking comments on an online news service is a practically important task, and thus there have been many studies on this task. Although ensemble techniques are widely known to improve the performance of models, there is little types of research on ensemble neural-ranking models. In this paper, we investigate how to improve the performance on the comment-ranking task by using unsupervised ensemble methods. We propose a new hybrid method composed of an output selection method and a typical averaging method. Our method uses a pseudo answer represented by the average of multiple model outputs. The pseudo answer is used to evaluate multiple model outputs via ranking evaluation metrics, and the results are used to select and weight the models. Experimental results on the comment-ranking task show that our proposed method outperforms several ensemble baselines, including supervised one."}}
{"id": "bYuJ_gEztk", "cdate": 1577836800000, "mdate": null, "content": {"title": "Semi-supervised Extractive Question Summarization Using Question-Answer Pairs", "abstract": "Neural extractive summarization methods often require much labeled training data, for which headlines or lead summaries of news articles can sometimes be used. Such directly useful summaries are not always available, however, especially for user-generated content, such as questions posted on community question answering services. In this paper, we address an extractive summarization (i.e., headline extraction) task for such questions as a case study and consider how to alleviate the problem by using question-answer pairs, instead of missing-headline pairs. To this end, we propose a framework to examine how to use such unlabeled paired data from the viewpoint of training methods. Experimental results show that multi-task training performs well with undersampling and distant supervision."}}
{"id": "H9AdZqBBI2u", "cdate": 1577836800000, "mdate": null, "content": {"title": "Distant Supervision for Extractive Question Summarization", "abstract": "Questions are often lengthy and difficult to understand because they tend to contain peripheral information. Previous work relies on costly human-annotated data or question-title pairs. In this work, we propose a distant supervision framework that can train a question summarizer without annotation costs or question-title pairs, where sentences are automatically annotated by means of heuristic rules. The key idea is that a single-sentence question tends to have a summary-like property. We empirically show that our models trained on the framework perform competitively with respect to supervised models without the requirement of a costly human-annotated dataset."}}
{"id": "3dRRkyTv4To", "cdate": 1577836800000, "mdate": null, "content": {"title": "POI Atmosphere Categorization Using Web Search Session Behavior", "abstract": "Point Of Interest (POI) categorization is to group POIs into several categories and make them easy-to-use in geospatial applications. Previous studies mainly used geospatial features, such as check-in sequences and satellite images, to group POIs into pre-defined rough categories. However, each POI has its own \"atmosphere\" beyond its geospatial features, which represents what kinds of people tend to visit it and how they spend their time there. This subtle atmosphere is important for users to decide whether to visit the POI, so considering it may be critical when providing commercial services, such as a property search service. In this paper, we propose a new POI categorization method that can capture the POI atmosphere by using user behavior on a web search engine. Our key observation is that the next queries of a search query about a POI tend to contain the user's purpose for visiting it. We harness this observation to train a neural encoder that maps POIs to continuous vectors (called embeddings) via next-query prediction with a deep structured semantic model (DSSM). Experimental results indicate that our method performs well for POI atmosphere categorization of parks as a case study. We believe that our method complements the existing POI categorization methods."}}
{"id": "acz3BAOSJOo", "cdate": 1546300800000, "mdate": null, "content": {"title": "Diamonds in the Rough: Generating Fluent Sentences from Early-Stage Drafts for Academic Writing Assistance", "abstract": "The writing process consists of several stages such as drafting, revising, editing, and proofreading. Studies on writing assistance, such as grammatical error correction (GEC), have mainly focused on sentence editing and proofreading, where surface-level issues such as typographical, spelling, or grammatical errors should be corrected. We broaden this focus to include the earlier revising stage, where sentences require adjustment to the information included or major rewriting and propose Sentence-level Revision (SentRev) as a new writing assistance task. Well-performing systems in this task can help inexperienced authors by producing fluent, complete sentences given their rough, incomplete drafts. We build a new freely available crowdsourced evaluation dataset consisting of incomplete sentences authored by non-native writers paired with their final versions extracted from published academic papers for developing and evaluating SentRev models. We also establish baseline performance on SentRev using our newly built evaluation dataset."}}
{"id": "WkBsFwU8ru", "cdate": 1546300800000, "mdate": null, "content": {"title": "Dataset Creation for Ranking Constructive News Comments", "abstract": "Ranking comments on an online news service is a practically important task for the service provider, and thus there have been many studies on this task. However, most of them considered users’ positive feedback, such as “Like”-button clicks, as a quality measure. In this paper, we address directly evaluating the quality of comments on the basis of “constructiveness,” separately from user feedback. To this end, we create a new dataset including 100K+ Japanese comments with constructiveness scores (C-scores). Our experiments clarify that C-scores are not always related to users’ positive feedback, and the performance of pairwise ranking models tends to be enhanced by the variation of comments rather than articles."}}
{"id": "O-NVqYITPBI", "cdate": 1546300800000, "mdate": null, "content": {"title": "Cross-Domain Recommendation via Deep Domain Adaptation", "abstract": "The behavior of users in certain services indicates their preferences, which may be used to make recommendations for other services they have never used. However, the cross-domain relation between items and user preferences is not simple, especially when there are few or no common users and items across domains. We propose a content-based cross-domain recommendation method for cold-start users that does not require user- or item-overlap. We formulate recommendations as an extreme classification task, and the problem is treated as an instance of unsupervised domain adaptation. We assess the performance of the approach in experiments on large datasets collected from Yahoo! JAPAN video and news services and find that it outperforms several baseline methods including a cross-domain collaborative filtering method."}}
{"id": "BJEMc7W_ZH", "cdate": 1546300800000, "mdate": null, "content": {"title": "A Case Study on Neural Headline Generation for Editing Support", "abstract": "Kazuma Murao, Ken Kobayashi, Hayato Kobayashi, Taichi Yatsuka, Takeshi Masuyama, Tatsuru Higurashi, Yoshimune Tabuchi. Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Industry Papers). 2019."}}
{"id": "rJWtKGfubH", "cdate": 1514764800000, "mdate": null, "content": {"title": "Frustratingly Easy Model Ensemble for Abstractive Summarization", "abstract": ""}}
{"id": "qx-yoLMI_Pm", "cdate": 1514764800000, "mdate": null, "content": {"title": "Extractive Headline Generation Based on Learning to Rank for Community Question Answering", "abstract": "User-generated content such as the questions on community question answering (CQA) forums does not always come with appropriate headlines, in contrast to the news articles used in various headline generation tasks. In such cases, we cannot use paired supervised data, e.g., pairs of articles and headlines, to learn a headline generation model. To overcome this problem, we propose an extractive headline generation method based on learning to rank for CQA that extracts the most informative substring from each question as its headline. Experimental results show that our method outperforms several baselines, including a prefix-based method, which is widely used in real services."}}
