{"id": "b7QTDRrCxC", "cdate": 1695042808277, "mdate": 1695042808277, "content": {"title": "HUGE: Huge Unsupervised Graph Embeddings with TPUs", "abstract": "Graphs are a representation of structured data that captures the relationships between sets of objects. With the ubiquity of available network data, there is increasing industrial and academic need to quickly analyze graphs with billions of nodes and trillions of edges. A common first step for network understanding is Graph Embedding, the process of creating a continuous representation of nodes in a graph. A continuous representation is often more amenable, especially at scale, for solving downstream machine learning tasks such as classification, link prediction, and clustering. A high-performance graph embedding architecture leveraging Tensor Processing Units (TPUs) with configurable amounts of high-bandwidth memory is presented that simplifies the graph embedding problem and can scale to graphs with billions of nodes and trillions of edges. We verify the embedding space quality on real and synthetic large-scale datasets."}}
{"id": "vyi9sWMtGkT", "cdate": 1609459200000, "mdate": null, "content": {"title": "Consistent k-Clustering for General Metrics", "abstract": "Given a stream of points in a metric space, is it possible to maintain a constant approximate clustering by changing the cluster centers only a small number of times during the entire execution of the algorithm? This question received attention in recent years in the machine learning literature and, before our work, the best known algorithm performs Õ(k2) center swaps (the Õ(·) notation hides polylogarithmic factors in the number of points n and the aspect ratio Δ of the input instance). This is a quadratic increase compared to the offline case — the whole stream is known in advance and one is interested in keeping a constant approximation at any point in time — for which Õ(k) swaps are known to be sufficient and simple examples show that Ω(k log(nΔ)) swaps are necessary. We close this gap by developing an algorithm that, perhaps surprisingly, matches the guarantees in the offline setting. Specifically, we show how to maintain a constant-factor approximation for the k-median problem by performing an optimal (up to polylogarithimic factors) number Õ(k) of center swaps. To obtain our result we leverage new structural properties of k-median clustering that may be of independent interest."}}
{"id": "wPBiNYI2LZ", "cdate": 1577836800000, "mdate": null, "content": {"title": "Sampling Arbitrary Subgraphs Exactly Uniformly in Sublinear Time", "abstract": "We present a simple sublinear-time algorithm for sampling an arbitrary subgraph $H$ \\emph{exactly uniformly} from a graph $G$ with $m$ edges, to which the algorithm has access by performing the following types of queries: (1) degree queries, (2) neighbor queries, (3) pair queries and (4) edge sampling queries. The query complexity and running time of our algorithm are $\\tilde{O}(\\min\\{m, \\frac{m^{\\rho(H)}}{\\# H}\\})$ and $\\tilde{O}(\\frac{m^{\\rho(H)}}{\\# H})$, respectively, where $\\rho(H)$ is the fractional edge-cover of $H$ and $\\# H$ is the number of copies of $H$ in $G$. For any clique on $r$ vertices, i.e., $H=K_r$, our algorithm is almost optimal as any algorithm that samples an $H$ from any distribution that has $\\Omega(1)$ total probability mass on the set of all copies of $H$ must perform $\\Omega(\\min\\{m, \\frac{m^{\\rho(H)}}{\\# H\\cdot (cr)^r}\\})$ queries. Together with the query and time complexities of the $(1\\pm \\varepsilon)$-approximation algorithm for the number of subgraphs $H$ by Assadi, Kapralov and Khanna [ITCS 2018] and the lower bound by Eden and Rosenbaum [APPROX 2018] for approximately counting cliques, our results suggest that in our query model, approximately counting cliques is \"equivalent to\" exactly uniformly sampling cliques, in the sense that the query and time complexities of exactly uniform sampling and randomized approximate counting are within a polylogarithmic factor of each other. This stands in interesting contrast to an analogous relation between approximate counting and almost uniformly sampling for self-reducible problems in the polynomial-time regime by Jerrum, Valiant and Vazirani [TCS 1986]."}}
{"id": "aOOWo2X7TDc", "cdate": 1577836800000, "mdate": null, "content": {"title": "Sampling Arbitrary Subgraphs Exactly Uniformly in Sublinear Time", "abstract": "We present a simple sublinear-time algorithm for sampling an arbitrary subgraph H exactly uniformly from a graph G, to which the algorithm has access by performing the following types of queries: (1) uniform vertex queries, (2) degree queries, (3) neighbor queries, (4) pair queries and (5) edge sampling queries. The query complexity and running time of our algorithm are Õ(min{m, (m^ρ(H))/#H}) and Õ((m^ρ(H))/#H}), respectively, where ρ(H) is the fractional edge-cover of H and #H is the number of copies of H in G. For any clique on r vertices, i.e., H = K_r, our algorithm is almost optimal as any algorithm that samples an H from any distribution that has Ω(1) total probability mass on the set of all copies of H must perform Ω(min{m, (m^ρ(H))/(#H⋅(cr)^r)}) queries. Together with the query and time complexities of the (1±ε)-approximation algorithm for the number of subgraphs H by Assadi et al. [Sepehr Assadi et al., 2018] and the lower bound by Eden and Rosenbaum [Eden and Rosenbaum, 2018] for approximately counting cliques, our results suggest that in our query model, approximately counting cliques is \"equivalent to\" exactly uniformly sampling cliques, in the sense that the query and time complexities of exactly uniform sampling and randomized approximate counting are within polylogarithmic factor of each other. This stands in interesting contrast to an analogous relation between approximate counting and almost uniformly sampling for self-reducible problems in the polynomial-time regime by Jerrum, Valiant and Vazirani [Jerrum et al., 1986]."}}
{"id": "RA47__j_Qgl", "cdate": 1577836800000, "mdate": null, "content": {"title": "Consistent k-Clustering for General Metrics", "abstract": "Given a stream of points in a metric space, is it possible to maintain a constant approximate clustering by changing the cluster centers only a small number of times during the entire execution of the algorithm? This question received attention in recent years in the machine learning literature and, before our work, the best known algorithm performs $\\widetilde{O}(k^2)$ center swaps (the $\\widetilde{O}(\\cdot)$ notation hides polylogarithmic factors in the number of points $n$ and the aspect ratio $\\Delta$ of the input instance). This is a quadratic increase compared to the offline case -- the whole stream is known in advance and one is interested in keeping a constant approximation at any point in time -- for which $\\widetilde{O}(k)$ swaps are known to be sufficient and simple examples show that $\\Omega(k \\log(n \\Delta))$ swaps are necessary. We close this gap by developing an algorithm that, perhaps surprisingly, matches the guarantees in the offline setting. Specifically, we show how to maintain a constant-factor approximation for the $k$-median problem by performing an optimal (up to polylogarithimic factors) number $\\widetilde{O}(k)$ of center swaps. To obtain our result we leverage new structural properties of $k$-median clustering that may be of independent interest."}}
{"id": "4Ny0oW6c-gF", "cdate": 1577836800000, "mdate": null, "content": {"title": "Testable Properties in General Graphs and Random Order Streaming", "abstract": "We consider the fundamental question of understanding the relative power of two important computational models: property testing and data streaming. We present a novel framework closely linking these areas in the setting of general graphs in the context of constant-query complexity testing and constant-space streaming. Our main result is a generic transformation of a one-sided error property tester in the random-neighbor model with constant query complexity into a one-sided error property tester in the streaming model with constant space complexity. Previously such a generic transformation was only known for bounded-degree graphs."}}
{"id": "vJ5CCzJ5cGt", "cdate": 1546300800000, "mdate": null, "content": {"title": "Every Testable (Infinite) Property of Bounded-Degree Graphs Contains an Infinite Hyperfinite Subproperty", "abstract": "One of the most fundamental questions in graph property testing is to characterize the combinatorial structure of properties that are testable with a constant number of queries. We work towards an answer to this question for the bounded-degree graph model introduced in [GR02], where the input graphs have maximum degree bounded by a constant d. In this model, it is known (among other results) that every hyperfinite property is constant-query testable [NS13], where, informally, a graph property is hyperfinite, if for every δ > 0 every graph in the property can be partitioned into small connected components by removing δn edges. In this paper we show that hyperfiniteness plays a role in every testable property, i.e. we show that every testable property is either finite (which trivially implies hyperfiniteness and testability) or contains an infinite hyperfinite subproperty. A simple consequence of our result is that no infinite graph property that only consists of expander graphs is constant-query testable. Based on the above findings, one could ask if every infinite testable non-hyperfinite property might contain an infinite family of expander (or near-expander) graphs. We show that this is not true. Motivated by our counterexample we develop a theorem that shows that we can partition the set of vertices of every bounded degree graph into a constant number of subsets and a separator set, such that the separator set is small and the distribution of k-discs on every subset of a partition class, is roughly the same as that of the partition class if the subset has small expansion."}}
{"id": "X2M7dgdEDfF", "cdate": 1546300800000, "mdate": null, "content": {"title": "Testable Properties in General Graphs and Random Order Streaming", "abstract": "We present a novel framework closely linking the areas of property testing and data streaming algorithms in the setting of general graphs. It has been recently shown (Monemizadeh et al. 2017) that for bounded-degree graphs, any constant-query tester can be emulated in the random order streaming model by a streaming algorithm that uses only space required to store a constant number of words. However, in a more natural setting of general graphs, with no restriction on the maximum degree, no such results were known because of our lack of understanding of constant-query testers in general graphs and lack of techniques to appropriately emulate in the streaming setting off-line algorithms allowing many high-degree vertices. In this work we advance our understanding on both of these challenges. First, we provide canonical testers for all constant-query testers for general graphs, both, for one-sided and two-sided errors. Such canonizations were only known before (in the adjacency matrix model) for dense graphs (Goldreich and Trevisan 2003) and (in the adjacency list model) for bounded degree (di-)graphs (Goldreich and Ron 2011, Czumaj et al. 2016). Using the concept of canonical testers, we then prove that every property of general graphs that is constant-query testable with one-sided error can also be tested in constant-space with one-sided error in the random order streaming model. Our results imply, among others, that properties like $(s,t)$ disconnectivity, $k$-path-freeness, etc. are constant-space testable in random order streams."}}
{"id": "1OWqfu43oj", "cdate": 1546300800000, "mdate": null, "content": {"title": "Testing Individual-Based Stability Properties in Graphical Hedonic Games", "abstract": "In hedonic games, players form coalitions based on individual preferences over the group of players they belong to. Several concepts to describe the stability of coalition structures in a game have been proposed and analysed. However, prior research focuses on algorithms with time complexity that is at least linear in the input size. In the light of very large games that arise from, e.g., social networks and advertising, we initiate the study of sublinear time property testing algorithms for existence and verification problems under several notions of coalition stability in a model of hedonic games represented by graphs with bounded degree. In graph property testing, one shall decide whether a given input has a property (e.g., a game admits a stable coalition structure) or is far from it, i.e., one has to modify at least an ε-fraction of the input (e.g., the game's preferences) to make it have the property. In particular, we consider verification of perfection, individual rationality, Nash stability, and (contractual) individual stability. Furthermore, we show that while there is always a Nash-stable coalition (which also implies individually stable coalitions), the existence of a perfect coalition can be tested. All our testers have one-sided error and time complexity that is independent of the input size."}}
{"id": "tGKtNP5ue8M", "cdate": 1514764800000, "mdate": null, "content": {"title": "Every Testable (Infinite) Property of Bounded-Degree Graphs Contains an Infinite Hyperfinite Subproperty", "abstract": "One of the most fundamental questions in graph property testing is to characterize the combinatorial structure of properties that are testable with a constant number of queries. We work towards an answer to this question for the bounded-degree graph model introduced in [Goldreich, Ron, 2002], where the input graphs have maximum degree bounded by a constant $d$. In this model, it is known (among other results) that every \\emph{hyperfinite} property is constant-query testable [Newman, Sohler, 2013], where, informally, a graph property is hyperfinite, if for every $\\delta >0$ every graph in the property can be partitioned into small connected components by removing $\\delta n$ edges. In this paper we show that hyperfiniteness plays a role in \\emph{every} testable property, i.e. we show that every testable property is either finite (which trivially implies hyperfiniteness and testability) or contains an infinite hyperfinite subproperty. A simple consequence of our result is that no infinite graph property that only consists of expander graphs is constant-query testable. Based on the above findings, one could ask if every infinite testable non-hyperfinite property might contain an infinite family of expander (or near-expander) graphs. We show that this is not true. Motivated by our counter-example we develop a theorem that shows that we can partition the set of vertices of every bounded degree graph into a constant number of subsets and a separator set, such that the separator set is small and the distribution of $k$-disks on every subset of a partition class, is roughly the same as that of the partition class if the subset has small expansion."}}
