{"id": "G6L0EYtiPL6", "cdate": 1577836800000, "mdate": null, "content": {"title": "Inductive Quantum Embedding", "abstract": "Quantum logic inspired embedding (aka Quantum Embedding (QE)) of a Knowledge-Base (KB) was proposed recently by Garg:2019. It is claimed that the QE preserves the logical structure of the input KB given in the form of unary and binary predicates hierarchy. Such structure preservation allows one to perform Boolean logic style deductive reasoning directly over these embedding vectors. The original QE idea, however, is limited to the transductive (not inductive) setting. Moreover, the original QE scheme runs quite slow on real applications involving millions of entities. This paper alleviates both of these key limitations. We start by reformulating the original QE problem to allow for the induction. On the way, we also underscore some interesting analytic and geometric properties of the solution and leverage them to design a faster training scheme. As an application, we show that one can achieve state-of-the-art performance on the well-known NLP task of fine-grained entity type classification by using the inductive QE approach. Our training runs 9-times faster than the original QE scheme on this task."}}
{"id": "DAhG3YzTekF", "cdate": 1577836800000, "mdate": null, "content": {"title": "Question Answering over Knowledge Bases by Leveraging Semantic Parsing and Neuro-Symbolic Reasoning", "abstract": "Knowledge base question answering (KBQA)is an important task in Natural Language Processing. Existing approaches face significant challenges including complex question understanding, necessity for reasoning, and lack of large end-to-end training datasets. In this work, we propose Neuro-Symbolic Question Answering (NSQA), a modular KBQA system, that leverages (1) Abstract Meaning Representation (AMR) parses for task-independent question understanding; (2) a simple yet effective graph transformation approach to convert AMR parses into candidate logical queries that are aligned to the KB; (3) a pipeline-based approach which integrates multiple, reusable modules that are trained specifically for their individual tasks (semantic parser, entity andrelationship linkers, and neuro-symbolic reasoner) and do not require end-to-end training data. NSQA achieves state-of-the-art performance on two prominent KBQA datasets based on DBpedia (QALD-9 and LC-QuAD1.0). Furthermore, our analysis emphasizes that AMR is a powerful tool for KBQA systems."}}
{"id": "9_tgmRvMTlS", "cdate": 1577836800000, "mdate": null, "content": {"title": "Logical Neural Networks", "abstract": "We propose a novel framework seamlessly providing key properties of both neural nets (learning) and symbolic logic (knowledge and reasoning). Every neuron has a meaning as a component of a formula in a weighted real-valued logic, yielding a highly intepretable disentangled representation. Inference is omnidirectional rather than focused on predefined target variables, and corresponds to logical reasoning, including classical first-order logic theorem proving as a special case. The model is end-to-end differentiable, and learning minimizes a novel loss function capturing logical contradiction, yielding resilience to inconsistent knowledge. It also enables the open-world assumption by maintaining bounds on truth values which can have probabilistic semantics, yielding resilience to incomplete knowledge."}}
{"id": "Q59AYkTs3ZI", "cdate": 1546300800000, "mdate": null, "content": {"title": "Quantum Embedding of Knowledge for Reasoning", "abstract": "Statistical Relational Learning (SRL) methods are the most widely used techniques to generate distributional representations of the symbolic Knowledge Bases (KBs). These methods embed any given KB into a vector space by exploiting statistical similarities among its entities and predicates but without any guarantee of preserving the underlying logical structure of the KB. This, in turn, results in poor performance of logical reasoning tasks that are solved using such distributional representations. We present a novel approach called Embed2Reason (E2R) that embeds a symbolic KB into a vector space in a logical structure preserving manner. This approach is inspired by the theory of Quantum Logic. Such an embedding allows answering membership based complex logical reasoning queries with impressive accuracy improvements over popular SRL baselines."}}
{"id": "sbZjlO3nGhi", "cdate": 1514764800000, "mdate": null, "content": {"title": "Document Structure Measure for Hypernym discovery", "abstract": "Hypernym discovery is the problem of finding terms that have is-a relationship with a given term. We introduce a new context type, and a relatedness measure to differentiate hypernyms from other types of semantic relationships. Our Document Structure measure is based on hierarchical position of terms in a document, and their presence or otherwise in definition text. This measure quantifies the document structure using multiple attributes, and classes of weighted distance functions."}}
{"id": "WEaoV_L_gA", "cdate": 1514764800000, "mdate": null, "content": {"title": "Scalable Reasoning Infrastructure for Large Scale Knowledge Bases", "abstract": ""}}
{"id": "3OvX--F0H-A", "cdate": 1514764800000, "mdate": null, "content": {"title": "Tooling Framework for Instantiating Natural Language Querying System", "abstract": ""}}
{"id": "t2yBWxTU2fE", "cdate": 1483228800000, "mdate": null, "content": {"title": "Creation and Interaction with Large-scale Domain-Specific Knowledge Bases", "abstract": ""}}
{"id": "e_dwjb7nKIp", "cdate": 1483228800000, "mdate": null, "content": {"title": "Visual Exploration of Unstructured Regulatory Documents", "abstract": "Governmental authorities publish rules and directives that govern the operations of an industry. These documents, called regulations, are meant to safeguard the interests of consumers. With increasing number, size and complexity of such documents, companies face an uphill task to comply with them. We present a cognitive system, called Cogpliance, for exploring and understanding regulatory documents with the goal of assisting compliance officers in attaining regulatory compliance. Cogpliance automatically reads natural language regulatory documents, extracts key concepts and presents an interactive information exploration user interface for answering compliance officers queries."}}
{"id": "HTxvj1JfhUJ", "cdate": 1483228800000, "mdate": null, "content": {"title": "Cognitive Compliance for Financial Regulations", "abstract": "Regulations are rules and directives published by authorities to safeguard consumer interest in an industry. Compliance with such regulations is getting increasingly hard due both to the complexity of these documents, which require experts to read, understand, and interpret them manually, and to the sheer volume of regulatory change. Many CFOs rate this as their top challenge. The authors' Cogpliance platform uses a cognitive approach to achieve regulatory compliance. Here, they describe key compliance-related tasks and demonstrate how Cogpliance helps compliance officers to handle those tasks effectively."}}
