{"id": "ufhAU2PxER", "cdate": 1640995200000, "mdate": 1674452538468, "content": {"title": "HPODNets: deep graph convolutional networks for predicting human protein-phenotype associations", "abstract": "Deciphering the relationship between human genes/proteins and abnormal phenotypes is of great importance in the prevention, diagnosis and treatment against diseases. The Human Phenotype Ontology (HPO) is a standardized vocabulary that describes the phenotype abnormalities encountered in human disorders. However, the current HPO annotations are still incomplete. Thus, it is necessary to computationally predict human protein–phenotype associations. In terms of current, cutting-edge computational methods for annotating proteins (such as functional annotation), three important features are (i) multiple network input, (ii) semi-supervised learning and (iii) deep graph convolutional network (GCN), whereas there are no methods with all these features for predicting HPO annotations of human protein."}}
{"id": "_rjVHOmOXi", "cdate": 1640995200000, "mdate": 1674452538470, "content": {"title": "DIVERSE: Bayesian Data IntegratiVE Learning for Precise Drug ResponSE Prediction", "abstract": "Detecting predictive biomarkers from multi-omics data is important for precision medicine, to improve diagnostics of complex diseases and for better treatments. This needs substantial experimental efforts that are made difficult by the heterogeneity of cell lines and huge cost. An effective solution is to build a computational model over the diverse omics data, including genomic, molecular, and environmental information. However, choosing informative and reliable data sources from among the different types of data is a challenging problem. We propose DIVERSE, a framework of Bayesian importance-weighted tri- and bi-matrix factorization(DIVERSE3 or DIVERSE2) to predict drug responses from data of cell lines, drugs, and gene interactions. DIVERSE integrates the data sources systematically, in a step-wise manner, examining the importance of each added data set in turn. More specifically, we sequentially integrate five different data sets, which have not all been combined in earlier bioinformatic methods for predicting drug responses. Empirical experiments show that DIVERSE clearly outperformed five other methods including three state-of-the-art approaches, under cross-validation, particularly in out-of-matrix prediction, which is closer to the setting of real use cases and more challenging than simpler in-matrix prediction. Additionally, case studies for discovering new drugs further confirmed the performance advantage of DIVERSE."}}
{"id": "qT92_CUn1mQ", "cdate": 1609459200000, "mdate": 1674452538472, "content": {"title": "Reshaped tensor nuclear norms for higher order tensor completion", "abstract": "We investigate optimal conditions for inducing low-rankness of higher order tensors by using convex tensor norms with reshaped tensors. We propose the reshaped tensor nuclear norm as a generalized approach to reshape tensors to be regularized by using the tensor nuclear norm. Furthermore, we propose the reshaped latent tensor nuclear norm to combine multiple reshaped tensors using the tensor nuclear norm. We analyze the generalization bounds for tensor completion models regularized by the proposed norms and show that the novel reshaping norms lead to lower Rademacher complexities. Through simulation and real-data experiments, we show that our proposed methods are favorably compared to existing tensor norms consolidating our theoretical claims."}}
{"id": "h2P8Nslf4l4", "cdate": 1609459200000, "mdate": 1623975284108, "content": {"title": "Learning subtree pattern importance for Weisfeiler-Lehmanbased graph kernels", "abstract": "Graph is an usual representation of relational data, which are ubiquitous in manydomains such as molecules, biological and social networks. A popular approach to learningwith graph structured data is to make use of graph kernels, which measure the similaritybetween graphs and are plugged into a kernel machine such as a support vector machine.Weisfeiler-Lehman (WL) based graph kernels, which employ WL labeling scheme to extract subtree patterns and perform node embedding, are demonstrated to achieve great performance while being efficiently computable. However, one of the main drawbacks of ageneral kernel is the decoupling of kernel construction and learning process. For moleculargraphs, usual kernels such as WL subtree, based on substructures of the molecules, consider all available substructures having the same importance, which might not be suitable inpractice. In this paper, we propose a method to learn the weights of subtree patterns in the framework of WWL kernels, the state of the art method for graph classification task [14]. To overcome the computational issue on large scale data sets, we present an efficient learning algorithm and also derive a generalization gap bound to show its convergence. Finally, through experiments on synthetic and real-world data sets, we demonstrate the effectiveness of our proposed method for learning the weights of subtree patterns."}}
{"id": "feQgKizVMmn", "cdate": 1609459200000, "mdate": 1623975284100, "content": {"title": "On Convex Clustering Solutions", "abstract": "Convex clustering is an attractive clustering algorithm with favorable properties such as efficiency and optimality owing to its convex formulation. It is thought to generalize both k-means clustering and agglomerative clustering. However, it is not known whether convex clustering preserves desirable properties of these algorithms. A common expectation is that convex clustering may learn difficult cluster types such as non-convex ones. Current understanding of convex clustering is limited to only consistency results on well-separated clusters. We show new understanding of its solutions. We prove that convex clustering can only learn convex clusters. We then show that the clusters have disjoint bounding balls with significant gaps. We further characterize the solutions, regularization hyperparameters, inclusterable cases and consistency."}}
{"id": "_3o9FBOyzIb", "cdate": 1609459200000, "mdate": 1674452538474, "content": {"title": "HPOFiller: identifying missing protein-phenotype associations by graph convolutional network", "abstract": "Exploring the relationship between human proteins and abnormal phenotypes is of great importance in the prevention, diagnosis and treatment of diseases. The human phenotype ontology (HPO) is a standardized vocabulary that describes the phenotype abnormalities encountered in human diseases. However, the current HPO annotations of proteins are not complete. Thus, it is important to identify missing protein–phenotype associations."}}
{"id": "Xk9iwcUS8nQ", "cdate": 1609459200000, "mdate": 1631274133483, "content": {"title": "DIVERSE: bayesian Data IntegratiVE learning for precise drug ResponSE prediction", "abstract": "Detecting predictive biomarkers from multi-omics data is important for precision medicine, to improve diagnostics of complex diseases and for better treatments. This needs substantial experimental efforts that are made difficult by the heterogeneity of cell lines and huge cost. An effective solution is to build a computational model over the diverse omics data, including genomic, molecular, and environmental information. However, choosing informative and reliable data sources from among the different types of data is a challenging problem. We propose DIVERSE, a framework of Bayesian importance-weighted tri- and bi-matrix factorization(DIVERSE3 or DIVERSE2) to predict drug responses from data of cell lines, drugs, and gene interactions. DIVERSE integrates the data sources systematically, in a step-wise manner, examining the importance of each added data set in turn. More specifically, we sequentially integrate five different data sets, which have not all been combined in earlier bioinformatic methods for predicting drug responses. Empirical experiments show that DIVERSE clearly outperformed five other methods including three state-of-the-art approaches, under cross-validation, particularly in out-of-matrix prediction, which is closer to the setting of real use cases and more challenging than simpler in-matrix prediction. Additionally, case studies for discovering new drugs further confirmed the performance advantage of DIVERSE."}}
{"id": "WagjX7110ZS", "cdate": 1609459200000, "mdate": 1674452538650, "content": {"title": "Drug3D-DTI: Improved Drug-target Interaction Prediction by Incorporating Spatial Information of Small Molecules", "abstract": "A number of machine learning (ML) approaches for drug discovery have been available that rely only on sequential (1D) and planar (2D) information without effectively using the 3D information for generating features of drugs. However, 3D information of small molecules can reflect relative position of atoms more directly, which affects molecular properties. In this work, we present a new deep learning model called Drug3D-DTI for drug-target interaction prediction. Drug3D-DTI takes advantage of molecular spatial information, i.e., atom proximity in three-dimensional (3D) structures. We comprehensively evaluated the performance of Drug3D-DTI on two datasets with two tasks of regression and classification. In particular, we compared Drug3D-DTI with several existing methods including the two cutting-edge methods for compound-protein interaction prediction. From the experimental results, Drug3D-DTI clearly outperformed other methods under all settings. Further, this performance improvement was validated by ablation experiments and a case study. The implementation of Drug3D-DTI is available at (https://github.com/zhiruiliao/Drug3D-DTI)."}}
{"id": "VDPjlYC4emD", "cdate": 1609459200000, "mdate": 1648707915131, "content": {"title": "Learning subtree pattern importance for Weisfeiler-Lehman based graph kernels", "abstract": "Graph is an usual representation of relational data, which are ubiquitous in many domains such as molecules, biological and social networks. A popular approach to learning with graph structured data is to make use of graph kernels, which measure the similarity between graphs and are plugged into a kernel machine such as a support vector machine. Weisfeiler-Lehman (WL) based graph kernels, which employ WL labeling scheme to extract subtree patterns and perform node embedding, are demonstrated to achieve great performance while being efficiently computable. However, one of the main drawbacks of a general kernel is the decoupling of kernel construction and learning process. For molecular graphs, usual kernels such as WL subtree, based on substructures of the molecules, consider all available substructures having the same importance, which might not be suitable in practice. In this paper, we propose a method to learn the weights of subtree patterns in the framework of WWL kernels, the state of the art method for graph classification task (Togninalli et al., in: Advances in Neural Information Processing Systems, pp. 6439–6449, 2019). To overcome the computational issue on large scale data sets, we present an efficient learning algorithm and also derive a generalization gap bound to show its convergence. Finally, through experiments on synthetic and real-world data sets, we demonstrate the effectiveness of our proposed method for learning the weights of subtree patterns."}}
{"id": "QXEBA8sRmEZ", "cdate": 1609459200000, "mdate": 1623975284098, "content": {"title": "A survey on adverse drug reaction studies: data, tasks and machine learning methods", "abstract": "Adverse drug reaction (ADR) or drug side effect studies play a crucial role in drug discovery. Recently, with the rapid increase of both clinical and non-clinical data, machine learning methods have emerged as prominent tools to support analyzing and predicting ADRs. Nonetheless, there are still remaining challenges in ADR studies."}}
