{"id": "VwCpClVULnD", "cdate": 1683880849923, "mdate": 1683880849923, "content": {"title": "Sample-Efficient Deep Learning Techniques for Burn Severity Assessment with Limited Data Conditions", "abstract": "The automatic analysis of medical data and images to help diagnosis has recently become a major area in the application of deep learning. In general, deep learning techniques can be effective when a large high-quality dataset is available for model training. Thus, there is a need for sample-efficient learning techniques, particularly in the field of medical image analysis, as significant cost and effort are required to obtain a sufficient number of well-annotated high-quality training samples. In this paper, we address the problem of deep neural network training under sample deficiency by investigating several sample-efficient deep learning techniques. We concentrate on applying these techniques to skin burn image analysis and classification. We first build a large-scale, professionally annotated dataset of skin burn images, which enables the establishment of convolutional neural network (CNN) models for burn severity assessment with high accuracy. We then deliberately set data limitation conditions and adapt several sample-efficient techniques, such as transferable learning (TL), self-supervised learning (SSL), federated learning (FL), and generative adversarial network (GAN)-based data augmentation, to those conditions. Through comprehensive experimentation, we evaluate the sample-efficient deep learning techniques for burn severity assessment, and show, in particular, that SSL models learned on a small task-specific dataset can achieve comparable accuracy to a baseline model learned on a six-times larger dataset. We also demonstrate the applicability of FL and GANs to model training under different data limitation conditions that commonly occur in the area of healthcare and medicine where deep learning models are adopted."}}
{"id": "JvsMfrLeIY5", "cdate": 1683880703187, "mdate": 1683880703187, "content": {"title": "Iterative Pruning-based Model Compression for Pose Estimation on Resource-constrained Devices", "abstract": "In this work, we propose a pruning-based model compression scheme, aiming at achieving an efficient model that has strength in both accuracy and inference time on an embedded device environment with limited resources. The proposed scheme consists of (1) pruning profiling and (2) iterative pruning via knowledge distillation. With the scheme, we develop a resource-efficient 2D pose estimation model using HRNet and evaluate the model on NVIDA JetsonNano with the Microsoft COCO keypoint dataset. Specifically, our compressed model obtains the fast pose estimation of 20.3 FPS on NVIDA JetsonNano, while maintaining a high accuracy of 74.1 AP. Compared to the conventional HRNet model without compression, the proposed compression technique achieves 33 % improvement in FPS with only 0.4 % degradation in AP."}}
{"id": "EQ8lhAVkS2b", "cdate": 1683880587795, "mdate": 1683880587795, "content": {"title": "Transfer Learning based Precise Pose Estimation with Insufficient Data", "abstract": "With the recent advance in computer vision techniques and the growing utility of real-time human pose detection and tracking, deep learning-based pose estimation has been intensively studied in recent years. These studies rely on large-scale datasets of human pose images, for which expensive annotation jobs are required due to the complex spatial structure of pose keypoints. In this work, we present a transfer learning-based pose estimation model that leverages low-cost synthetic datasets and regressive domain adaptation, enabling the sample-efficient learning on precise human poses. In evaluation, we demonstrate that our model achieves the high accurate pose estimation on a dataset of golf swing images, which is targeted for a virtual golf coaching application."}}
{"id": "QDC2t4BsRZn", "cdate": 1672531200000, "mdate": 1695986395369, "content": {"title": "A Configurable Model-Based Reinforcement Learning Framework for Disaggregated Storage Systems", "abstract": "With the rapid growth of data-intensive jobs and the use of different hardware in storage, disaggregated storage architecture systems are being used to improve the operational cost efficiency of data centers. The hardware heterogeneity and mixed configurations of disaggregated storage systems, along with the diversity of workloads, often make it difficult for administrators to operate them optimally. In this work, we investigate model-based reinforcement learning (RL) schemes to develop automated system operations and maintain the storage performance across various system settings and workloads in self-managed storage systems. Specifically, we propose a novel configurable model structure in which a system environment is abstracted with a two-level hierarchy of storage devices and a platform and thus the environment can be reconfigured according to a given system specification. Using that novel model structure, we implement a configurable model-based RL framework CoMoRL by which RL agents are trained through model variants that represent a variety of storage system specifications; thus, their learned management policy can be highly robust to the diverse operation conditions of real-world storage systems. We evaluate our CoMoRL framework using a storage cluster that relies on NVMe-oF devices and demonstrate that the framework can be adapted to different scenarios such as volume placement scenarios with Kubernetes and primary affinity control scenarios with Ceph. The learned management policy outperforms an IOPS-based heuristic method and a model-based method by 0.7%~5.1% and 11.8%~29.7%, respectively, for various Kubernetes system specifications, and by 1.6%~5.6% and 8.2%~16.5%, respectively, for various Ceph system specifications, without requiring model and policy retraining. This zero-shot adaptation superiority of our framework makes it possible to realize RL-based self-managing storage systems in data centers with frequent system changes."}}
{"id": "KMDuqydChK", "cdate": 1672531200000, "mdate": 1695986395361, "content": {"title": "One-shot Imitation in a Non-Stationary Environment via Multi-Modal Skill", "abstract": "One-shot imitation is to learn a new task from a single demonstration, yet it is a challenging problem to adopt it for complex tasks with the high domain diversity inherent in a non-stationary envi..."}}
{"id": "uuaMrewU9Kk", "cdate": 1652737651065, "mdate": null, "content": {"title": "Skills Regularized Task Decomposition for Multi-task Offline Reinforcement Learning", "abstract": "Reinforcement learning (RL) with diverse offline datasets can have the advantage of leveraging the relation of multiple tasks and the common skills learned across those tasks, hence allowing us to deal with real-world complex problems efficiently in a data-driven way.  In offline RL where only offline data is used and online interaction with the environment is restricted, it is yet difficult to achieve the optimal policy for multiple tasks, especially when the data quality varies for the tasks. In this paper, we present a skill-based multi-task RL technique on heterogeneous datasets that are generated by behavior policies of different quality. To learn the shareable knowledge across those datasets effectively, we employ a task decomposition method for which common skills are jointly learned and used as guidance to reformulate a task in shared and achievable subtasks. In this joint learning, we use Wasserstein Auto-Encoder (WAE) to represent both skills and tasks on the same latent space and use the quality-weighted loss as a regularization term to induce tasks to be decomposed into subtasks that are more consistent with high-quality skills than others. To improve the performance of offline RL agents learned on the latent space, we also augment datasets with imaginary trajectories relevant to high-quality skills for each task. Through experiments, we show that our multi-task offline RL approach is robust to different-quality datasets and it outperforms other state-of-the-art algorithms for several robotic manipulation tasks and drone navigation tasks."}}
{"id": "uFswZz5wq4", "cdate": 1640995200000, "mdate": 1695986395491, "content": {"title": "Reinforcement Learning based Load Balancing in a Distributed Heterogeneous Storage System", "abstract": "With the growing demand for big data storage and processing, distributed storage systems with heterogeneous devices have become the majority in cloud data centers. However, hardware heterogeneity and workload variety make it challenging to maintain optimal performance in those storage systems. In this work, we present a learning-based control method that optimizes the performance of a distributed storage system. Specifically, to provide automatic parameter tuning upon dynamic workload patterns on a tiered storage architecture, we employ deep reinforcement learning (RL) and implement a simulation environment for a Ceph storage system. Through simulation tests, we demonstrate our RL method shows better performance than other heuristic approaches for a task of load balancing based on the primary affinity settings in Ceph."}}
{"id": "tmikB1iQWh", "cdate": 1640995200000, "mdate": 1695986395369, "content": {"title": "A Graph Convolution Network-Based Bug Triage System to Learn Heterogeneous Graph Representation of Bug Reports", "abstract": "Many bugs and defects occur during software testing and maintenance. These bugs should be resolved as soon as possible, to improve software quality. However, bug triage aims to solve these bugs by assigning the reported bugs to an appropriate developer or list of developers. It is an arduous task for a human triager to assign an appropriate developer to a bug report, when there are several developers with different skills, and several automated and semi-automated triage systems have been proposed in the last decade. Some recent techniques have suggested possibilities for the development of an effective triage system. However, these techniques require improvement. In previous work, we proposed a heterogeneous graph representation for bug triage, using word&#x2013;word edges and word-bug document co-occurrences to build a heterogeneous graph of bug data. Cosine similarity is used to weight the word&#x2013;word edges. Then, a graph convolution network is used to learn a heterogeneous graph representation. This paper extends our previous work by adopting different similarity metrics and correlation metrics for weighting word&#x2013;word edges. The method was validated using different small and large datasets obtained from large-scale open-source projects. The top-k accuracy metric was used to evaluate the performance of the bug triage system. The experimental results showed that the point-wise mutual information of the proposed model was better than that of other word&#x2013;word weighting methods, and our method had better accuracy for large datasets than other recent state-of-the-art methods. The proposed method with point-wise mutual information showed 3&#x0025; to 6&#x0025; higher top-1 accuracy than state-of-the-art methods for large datasets."}}
{"id": "rkHQc4sfFs1", "cdate": 1640995200000, "mdate": 1683896280308, "content": {"title": "Structure Learning-Based Task Decomposition for Reinforcement Learning in Non-stationary Environments", "abstract": "Reinforcement learning (RL) agents empowered by deep neural networks have been considered a feasible solution to automate control functions in a cyber-physical system. In this work, we consider an RL-based agent and address the issue of learning via continual interaction with a time-varying dynamic system modeled as a non-stationary Markov decision process (MDP). We view such a non-stationary MDP as a time series of conventional MDPs that can be parameterized by hidden variables. To infer the hidden parameters, we present a task decomposition method that exploits CycleGAN-based structure learning. This method enables the separation of time-variant tasks from a non-stationary MDP, establishing the task decomposition embedding specific to time-varying information. To mitigate the adverse effect due to inherent noises of task embedding, we also leverage continual learning on sequential tasks by adapting the orthogonal gradient descent scheme with a sliding window. Through various experiments, we demonstrate that our approach renders the RL agent adaptable to time-varying dynamic environment conditions, outperforming other methods including state-of-the-art non-stationary MDP algorithms."}}
{"id": "qmpfTjCO6R3", "cdate": 1640995200000, "mdate": 1695986395494, "content": {"title": "Skills Regularized Task Decomposition for Multi-task Offline Reinforcement Learning", "abstract": "Reinforcement learning (RL) with diverse offline datasets can have the advantage of leveraging the relation of multiple tasks and the common skills learned across those tasks, hence allowing us to deal with real-world complex problems efficiently in a data-driven way. In offline RL where only offline data is used and online interaction with the environment is restricted, it is yet difficult to achieve the optimal policy for multiple tasks, especially when the data quality varies for the tasks. In this paper, we present a skill-based multi-task RL technique on heterogeneous datasets that are generated by behavior policies of different quality. To learn the shareable knowledge across those datasets effectively, we employ a task decomposition method for which common skills are jointly learned and used as guidance to reformulate a task in shared and achievable subtasks. In this joint learning, we use Wasserstein Auto-Encoder (WAE) to represent both skills and tasks on the same latent space and use the quality-weighted loss as a regularization term to induce tasks to be decomposed into subtasks that are more consistent with high-quality skills than others. To improve the performance of offline RL agents learned on the latent space, we also augment datasets with imaginary trajectories relevant to high-quality skills for each task. Through experiments, we show that our multi-task offline RL approach is robust to different-quality datasets and it outperforms other state-of-the-art algorithms for several robotic manipulation tasks and drone navigation tasks."}}
