{"id": "ewERzbvtfP", "cdate": 1672531200000, "mdate": 1678091619163, "content": {"title": "Smoothness Analysis for Probabilistic Programs with Application to Optimised Variational Inference", "abstract": ""}}
{"id": "PnA-lr4Jgm", "cdate": 1672531200000, "mdate": 1680500759291, "content": {"title": "Over-parameterised Shallow Neural Networks with Asymmetrical Node Scaling: Global Convergence Guarantees and Feature Learning", "abstract": ""}}
{"id": "OQtY993Y4TV", "cdate": 1652737644402, "mdate": null, "content": {"title": "Learning Symmetric Rules with SATNet", "abstract": "SATNet is a differentiable constraint solver with a custom backpropagation algorithm, which can be used as a layer in a deep-learning system. It is a promising proposal for bridging deep learning and logical reasoning. In fact, SATNet has been successfully applied to learn, among others, the rules of a complex logical puzzle, such as Sudoku, just from input and output pairs where inputs are given as images. In this paper, we show how to improve the learning of SATNet by exploiting symmetries in the target rules of a given but unknown logical puzzle or more generally a logical formula. We present SymSATNet, a variant of SATNet that translates the given symmetries of the target rules to a condition on the parameters of SATNet and requires that the parameters should have a particular parametric form that guarantees the condition. The requirement dramatically reduces the number of parameters to learn for the rules with enough symmetries, and makes the parameter learning of SymSATNet much easier than that of SATNet. We also describe a technique for automatically discovering symmetries of the target rules from examples. Our experiments with Sudoku and Rubik's cube show the substantial improvement of SymSATNet over the baseline SATNet."}}
{"id": "8U5J6zK_MtV", "cdate": 1652737525262, "mdate": null, "content": {"title": "LobsDICE: Offline Learning from Observation via Stationary Distribution Correction Estimation", "abstract": "We consider the problem of learning from observation (LfO), in which the agent aims to mimic the expert's behavior from the state-only demonstrations by experts. We additionally assume that the agent cannot interact with the environment but has access to the action-labeled transition data collected by some agents with unknown qualities. This offline setting for LfO is appealing in many real-world scenarios where the ground-truth expert actions are inaccessible and the arbitrary environment interactions are costly or risky. In this paper, we present LobsDICE, an offline LfO algorithm that learns to imitate the expert policy via optimization in the space of stationary distributions. Our algorithm solves a single convex minimization problem, which minimizes the divergence between the two state-transition distributions induced by the expert and the agent policy. Through an extensive set of offline LfO tasks, we show that LobsDICE outperforms strong baseline methods.\n"}}
{"id": "tYtQlIUcP4z", "cdate": 1640995200000, "mdate": 1680500759241, "content": {"title": "Learning Symmetric Rules with SATNet", "abstract": ""}}
{"id": "lbZV5Ok51C", "cdate": 1640995200000, "mdate": 1668992272333, "content": {"title": "Smoothness Analysis for Probabilistic Programs with Application to Optimised Variational Inference", "abstract": "We present a static analysis for discovering differentiable or more generally smooth parts of a given probabilistic program, and show how the analysis can be used to improve the pathwise gradient estimator, one of the most popular methods for posterior inference and model learning. Our improvement increases the scope of the estimator from differentiable models to non-differentiable ones without requiring manual intervention of the user; the improved estimator automatically identifies differentiable parts of a given probabilistic program using our static analysis, and applies the pathwise gradient estimator to the identified parts while using a more general but less efficient estimator, called score estimator, for the rest of the program. Our analysis has a surprisingly subtle soundness argument, partly due to the misbehaviours of some target smoothness properties when viewed from the perspective of program analysis designers. For instance, some smoothness properties are not preserved by function composition, and this makes it difficult to analyse sequential composition soundly without heavily sacrificing precision. We formulate five assumptions on a target smoothness property, prove the soundness of our analysis under those assumptions, and show that our leading examples satisfy these assumptions. We also show that by using information from our analysis instantiated for differentiability, our improved gradient estimator satisfies an important differentiability requirement and thus computes the correct estimate on average (i.e., returns an unbiased estimate) under a regularity condition. Our experiments with representative probabilistic programs in the Pyro language show that our static analysis is capable of identifying smooth parts of those programs accurately, and making our improved pathwise gradient estimator exploit all the opportunities for high performance in those programs."}}
{"id": "dKdZny_-dM", "cdate": 1640995200000, "mdate": 1680500759617, "content": {"title": "DemoDICE: Offline Imitation Learning with Supplementary Imperfect Demonstrations", "abstract": ""}}
{"id": "TiF6yIleAE", "cdate": 1640995200000, "mdate": 1680500759792, "content": {"title": "Scale Mixtures of Neural Network Gaussian Processes", "abstract": ""}}
{"id": "Q_1fDIMPqB8", "cdate": 1640995200000, "mdate": 1680500759319, "content": {"title": "LobsDICE: Offline Imitation Learning from Observation via Stationary Distribution Correction Estimation", "abstract": ""}}
{"id": "AeziWPSbcEq", "cdate": 1640995200000, "mdate": 1680500759754, "content": {"title": "Deep neural networks with dependent weights: Gaussian Process mixture limit, heavy tails, sparsity and compressibility", "abstract": ""}}
