{"id": "qY_OuoEkTf", "cdate": 1672531200000, "mdate": 1683885676642, "content": {"title": "Demixing Sines and Spikes Using Multiple Measurement Vectors", "abstract": ""}}
{"id": "CCkLo6N1CC", "cdate": 1640995200000, "mdate": 1683885852445, "content": {"title": "Super-Resolution DOA Estimation for Wideband Signals Using Non-Uniform Linear Arrays With No Focusing Matrix", "abstract": "We focus on developing an effective Direction Of Arrival (DOA) estimation method for wideband sources based on the super-resolution concept. In this letter, we represent the data model of a wideband DOA estimation problem in a new form. Then, using this model, we propose an atomic norm minimization problem that leads to an accurate wideband DOA estimation method with no need for any focusing matrices. Moreover, this method requires no initial estimate and can be implemented by non-uniform linear arrays. Numerical simulations show that in comparison to some well-known techniques, the proposed method generates outstanding accuracy and higher robustness to noise. The effectiveness of the method is also verified in presence of close adjacent sources."}}
{"id": "kNQzPoVCVOx", "cdate": 1577836800000, "mdate": 1683885852416, "content": {"title": "Incorporation of prior knowledge into sparse time dispersive OFDM channel estimation via weighted atomic norm minimisation", "abstract": "A new estimator for sparse time dispersive channels in pilot aided orthogonal frequency division multiplexing (OFDM) systems is developed by considering prior knowledge on channel time dispersions. T..."}}
{"id": "65fPtooB48G", "cdate": 1577836800000, "mdate": 1683885852415, "content": {"title": "Sparse Signal Reconstruction Using Blind Super-Resolution With Arbitrary Sampling", "abstract": "The problem of blind super-resolution of sparse signals using arbitrary sampling and the atomic lift is studied. Using the Prolate Spheroidal Wave Functions (PSWFs) and matrix atomic norm, a new Semi-Definite Program (SDP) is proposed. Unlike the previous results, the proposed new version of SDP can localize spikes with higher precision and no need for the magnitude recovery and integer sampling schemes. Numerical simulations show that our method outperforms the recent techniques with generating a lower Normalized Mean Square Error (NMSE)."}}
