{"id": "Jz9I_Mif7mm", "cdate": 1685532020951, "mdate": null, "content": {"title": "Delphic Offline Reinforcement Learning under Nonidentifiable Hidden Confounding", "abstract": "A prominent challenge of offline reinforcement learning (RL) is the issue of hidden confounding: unobserved variables may influence both the actions taken by the agent and the observed outcomes. Hidden confounding can compromise the validity of any causal conclusion drawn from data and presents a major obstacle to effective offline RL. In the present paper, we tackle the problem of hidden confounding in the nonidentifiable setting. We propose a definition of uncertainty due to hidden confounding bias, termed delphic uncertainty, which uses variation over world models compatible with the observations, and differentiate it from the well-known epistemic and aleatoric uncertainties. We derive a practical method for estimating the three types of uncertainties, and construct a pessimistic offline RL algorithm to account for them. Our method does not assume identifiability of the unobserved confounders, and attempts to reduce the amount of confounding bias. We demonstrate through extensive experiments and ablations the efficacy of our approach on a sepsis management benchmark, as well as on electronic health records. Our results suggest that nonidentifiable hidden confounding bias can be mitigated to improve offline RL solutions in practice."}}
{"id": "E-sb8SHo2LL", "cdate": 1681833044578, "mdate": null, "content": {"title": "Linearized Laplace Inference in Neural Additive Models", "abstract": "Deep neural networks are highly effective but suffer from a lack of interpretability due to their black-box nature. Neural additive models (NAMs) solve this by separating into additive sub-networks, revealing the interactions between features and predictions. In this paper, we approach the NAM from a Bayesian perspective in order to quantify the uncertainty in the recovered interactions. Linearized Laplace approximation enables inference of these interactions directly in function space and yields a tractable estimate of the marginal likelihood, which can be used to perform implicit feature selection through an empirical Bayes procedure. Empirically, we show that Laplace-approximated NAMs (LA-NAM) are both more robust to noise and easier to interpret than their non-Bayesian counterpart for tabular regression and classification tasks."}}
{"id": "EqgkuO8jI9b", "cdate": 1664806782362, "mdate": null, "content": {"title": "On the Importance of Clinical Notes in Multi-modal Learning for EHR Data", "abstract": "Understanding deep learning model behavior is critical to accepting machine learning-based decision support systems in the medical community. Previous works have shown that jointly using clinical notes with electronic health record (EHR) data improved predictive performance for patient monitoring in the intensive care unit (ICU). In this work, we explore the underlying reasons for these improvements. While relying on a basic attention-based model to allow for interpretability, we first confirm that performance significantly improves over state-of-the-art EHR data models when combining EHR data and clinical notes. We then provide an analysis showing improvements arise almost exclusively from a subset of notes containing broader context on patient state rather than clinician notes. We believe such findings highlight deep learning models for EHR data to be more limited by partially-descriptive data than by modeling choice, motivating a more data-centric approach in the field."}}
{"id": "miyZxvBxdoP", "cdate": 1663849894358, "mdate": null, "content": {"title": "Temporal Label Smoothing for Early Prediction of Adverse Events", "abstract": "Models that can predict adverse events ahead of time with low false-alarm rates are critical to the acceptance of decision support systems in the medical community. This challenging machine learning task remains typically treated as a simple binary classification, with few bespoke methods proposed to leverage temporal dependency across samples. We propose Temporal Label Smoothing (TLS), a novel learning strategy that modulates smoothing strength as a function of proximity to the event of interest. This regularization technique reduces model confidence at the class boundary, where the signal is often noisy or uninformative, thus allowing training to focus on clinically informative data points away from this boundary region. From a theoretical perspective, we also show that our method can be framed as an extension of multi-horizon prediction, a learning heuristic proposed in other early prediction work. TLS empirically matches or outperforms all competitor methods across all evaluation measures on various early prediction benchmark tasks. In particular, our approach significantly improves performance on clinically-relevant metrics such as event recall under low false-alarm rates."}}
{"id": "SnC9rUeqiqd", "cdate": 1623151071920, "mdate": null, "content": {"title": "HiRID-ICU-Benchmark --- A Comprehensive Machine Learning Benchmark on High-resolution ICU Data", "abstract": "The recent success of machine learning methods applied to time series collected from Intensive Care Units (ICU) exposes the lack of standardized machine learning benchmarks for developing and comparing such methods. While raw datasets, such as MIMIC-IV or eICU, can be freely accessed on Physionet, the choice of tasks and pre-processing is often chosen ad-hoc for each publication, limiting comparability across publications. In this work, we aim to improve this situation by providing a  benchmark covering a large spectrum of ICU-related tasks. Using the HiRID dataset, we define multiple clinically relevant tasks developed in collaboration with clinicians.  In addition, we provide a reproducible end-to-end pipeline to construct both data and labels. Finally, we provide an in-depth analysis of current state-of-the-art sequence modeling methods, highlighting some limitations of deep learning approaches for this type of data. With this benchmark, we hope to give the research community the possibility of a fair comparison of their work."}}
{"id": "rCxP4jvecqG", "cdate": 1609459200000, "mdate": 1653052607564, "content": {"title": "Neighborhood Contrastive Learning Applied to Online Patient Monitoring", "abstract": "Intensive care units (ICU) are increasingly looking towards machine learning for methods to provide online monitoring of critically ill patients. In machine learning, online monitoring is often for..."}}
{"id": "4rNGhuHMYf6", "cdate": 1609459200000, "mdate": 1653052607563, "content": {"title": "HiRID-ICU-Benchmark - A Comprehensive Machine Learning Benchmark on High-resolution ICU Data", "abstract": "The recent success of machine learning methods applied to time series collected from Intensive Care Units (ICU) exposes the lack of standardized machine learning benchmarks for developing and comparing such methods. While raw datasets, such as MIMIC-IV or eICU, can be freely accessed on Physionet, the choice of tasks and pre-processing is often chosen ad-hoc for each publication, limiting comparability across publications. In this work, we aim to improve this situation by providing a benchmark covering a large spectrum of ICU-related tasks. Using the HiRID dataset, we define multiple clinically relevant tasks developed in collaboration with clinicians. In addition, we provide a reproducible end-to-end pipeline to construct both data and labels. Finally, we provide an in-depth analysis of current state-of-the-art sequence modeling methods, highlighting some limitations of deep learning approaches for this type of data. With this benchmark, we hope to give the research community the possibility of a fair comparison of their work."}}
{"id": "xFp0rV8VrY", "cdate": 1546300800000, "mdate": 1653052607563, "content": {"title": "UBS: A Dimension-Agnostic Metric for Concept Vector Interpretability Applied to Radiomics", "abstract": "Understanding predictions in Deep Learning (DL) models is crucial for domain experts without any DL expertise in order to justify resultant decision-making process. As of today, medical models are often based on hand-crafted features such as radiomics, though their link with neural network features remains unclear. To address the lack of interpretability, approaches based on human-understandable concepts such as TCAV have been introduced. These methods have shown promising results, though they are unsuited for continuous value concepts and their introduced metrics do not adapt well to high-dimensional spaces. To bridge the gap with radiomics-based models, we implement a regression concept vector showing the impact of radiomic features on the predictions of deep networks. In addition, we introduce a new metric with improved scaling to high-dimensional spaces, allowing comparison across multiple layers."}}
