{"id": "sb7hzqEtpe", "cdate": 1685532018266, "mdate": null, "content": {"title": "On Preemption and Learning in Stochastic Scheduling", "abstract": "We study single-machine scheduling of jobs, each belonging to a job type that determines its duration distribution. We start by analyzing the scenario where the type characteristics are known and then move to two learning scenarios where the types are unknown: non-preemptive problems, where each started job must be completed before moving to another job; and preemptive problems, where job execution can be paused in the favor of moving to a different job. In both cases, we design algorithms that achieve sublinear excess cost, compared to the performance with known types, and prove lower bounds for the non-preemptive case. Notably, we demonstrate, both theoretically and through simulations, how preemptive algorithms can greatly outperform non-preemptive ones when the durations of different job types are far from one another, a phenomenon that does not occur when the type durations are known."}}
{"id": "L1mqXwF9vi", "cdate": 1685532016036, "mdate": null, "content": {"title": "Constant or logarithmic regret in asynchronous multiplayer bandits", "abstract": "Multiplayer bandits have recently been extensively studied because of their application to cognitive radio networks. \n    While the literature mostly considers synchronous players, radio networks (e.g. for IoT) tend to have asynchronous devices. This motivates the harder, asynchronous multiplayer bandits problem, which was first tackled with an explore-then-commit (ETC) algorithm (see Dakdouk, 2022), with a regret upper-bound in $\\Ocal(T^{\\frac{2}{3}})$. Before even considering decentralization, understanding the centralized case was still a challenge as it was unknown whether getting a regret smaller than $\\Omega(T^{\\frac{2}{3}})$ was possible. \n    We answer positively this question, as a natural extension of UCB exhibits a $\\Ocal(\\sqrt{T\\log(T)})$ minimax regret. \n    More importantly, we introduce Cautious Greedy, a centralized algorithm that yields constant instance-dependent regret if the optimal policy assigns at least one player on each arm (a situation that is proved to occur when arm means are close enough). Otherwise, its regret increases as the sum of $\\log(T)$ over some sub-optimality gaps. We provide lower bounds showing that Cautious Greedy is optimal in the data-dependent terms.\n   Therefore, we set up a strong baseline for asynchronous multiplayer bandits and suggest that learning the optimal policy in this problem might be easier than thought, at least with centralization."}}
{"id": "yRTebElmilN", "cdate": 1621630271822, "mdate": null, "content": {"title": "Shared Independent Component Analysis for Multi-Subject Neuroimaging", "abstract": "We consider shared response modeling, a multi-view learning problem where one wants to identify common components from multiple datasets or views. We introduce Shared Independent Component Analysis (ShICA) that models each\nview as a linear transform of shared independent components contaminated by additive Gaussian noise. We show that this model is identifiable if the components are either non-Gaussian or have enough diversity in noise variances. We then show that in some cases multi-set canonical correlation analysis can recover the correct unmixing matrices, but that even a small amount of sampling noise makes Multiset CCA fail. To solve this problem, we propose to use joint diagonalization after Multiset CCA, leading to a new approach called ShICA-J. We show via simulations that ShICA-J leads to improved results while being very fast to fit. While ShICA-J is based on second-order statistics, we further propose to leverage non-Gaussianity of the components using a maximum-likelihood method, ShICA-ML, that is both more accurate and more costly. Further, ShICA comes with a principled method for shared components estimation. Finally, we provide empirical evidence on fMRI and MEG datasets that ShICA yields more accurate estimation of the components\nthan alternatives."}}
{"id": "24-ZY0UZVKD", "cdate": 1621630271822, "mdate": null, "content": {"title": "Shared Independent Component Analysis for Multi-Subject Neuroimaging", "abstract": "We consider shared response modeling, a multi-view learning problem where one wants to identify common components from multiple datasets or views. We introduce Shared Independent Component Analysis (ShICA) that models each\nview as a linear transform of shared independent components contaminated by additive Gaussian noise. We show that this model is identifiable if the components are either non-Gaussian or have enough diversity in noise variances. We then show that in some cases multi-set canonical correlation analysis can recover the correct unmixing matrices, but that even a small amount of sampling noise makes Multiset CCA fail. To solve this problem, we propose to use joint diagonalization after Multiset CCA, leading to a new approach called ShICA-J. We show via simulations that ShICA-J leads to improved results while being very fast to fit. While ShICA-J is based on second-order statistics, we further propose to leverage non-Gaussianity of the components using a maximum-likelihood method, ShICA-ML, that is both more accurate and more costly. Further, ShICA comes with a principled method for shared components estimation. Finally, we provide empirical evidence on fMRI and MEG datasets that ShICA yields more accurate estimation of the components\nthan alternatives."}}
{"id": "o3ay_4t8HQ2", "cdate": 1609459200000, "mdate": 1653502940009, "content": {"title": "mvlearn: Multiview Machine Learning in Python", "abstract": "As data are generated more and more from multiple disparate sources, multiview data sets, where each sample has features in distinct views, have grown in recent years. However, no comprehensive package exists that enables non-specialists to use these methods easily. mvlearn is a Python library which implements the leading multiview machine learning methods. Its simple API closely follows that of scikit-learn for increased ease-of-use. The package can be installed from Python Package Index (PyPI) and the conda package manager and is released under the MIT open-source license. The documentation, detailed examples, and all releases are available at https://mvlearn.github.io/."}}
{"id": "OJbS0vko7Io", "cdate": 1609459200000, "mdate": 1653502940021, "content": {"title": "Unsupervised component analysis for neuroimaging data. (Analyse non-supervisée en composante de données d'imageries neuronales)", "abstract": "This thesis in computer science and mathematics is applied to the field ofneuroscience, and more particularly to the mapping of brain activity based on imaging electrophysiology. In this field, a rising trend is to experiment with naturalistic stimuli such as movie watching or audio track listening,rather than tightly controlled but outrageously simple stimuli. However, the analysis of these \"naturalistic\" stimuli and their effects requires a huge amount of images that remain hard and costly to acquire. Without mathematical modeling, theidentification of neural signal from the measurements is very hard if not impossible. However, the stimulations that elicit neural activity are challenging to model in this context, and therefore, the statistical analysis of the data using regression-based approaches is difficult. This has motivated the use of unsupervised learning methods that do not make assumptions about what triggers brain activations in the presented stimuli. In this thesis, we first consider the case of the shared response model (SRM), wheresubjects are assumed to share a common response. While this algorithm is usefulto perform dimension reduction, it is particularly costly on functional magneticresonance imaging (fMRI) data where thedimension can be very large. We considerably speed up thealgorithm and reduce its memory usage. However, SRM relies on assumptions thatare not biologically plausible. In contrast, independent component analysis (ICA) is more realistic but not suited to multi-subject datasets. In this thesis, we present a well-principled method called MultiViewICA that extends ICA to datasets containing multiple subjects. MultiViewICA is a maximum likelihood estimator. It comes with a closed-formlikelihood that can be efficiently optimized. However, it assumes the same amount of noise for all subjects. We therefore introduce ShICA, a generalization of MultiViewICA that comes with a more general noise model. In contrast to almost all ICA-based models, ShICA can separate Gaussian and non-Gaussian sources and comes with a minimum mean square error estimate of the common sources that weights each subject according to its estimated noise level. In practice, MultiViewICA and ShICA yield on magnetoencephalography and functional magnetic resonance imaging a more reliable estimateof the shared response than competitors. Lastly, we use independent component analysis as a basis to perform data augmentation. More precisely, we introduce CondICA, a data augmentation method that leverages a large amount of unlabeled fMRI data to build a generative model for labeled data using only a few labeled samples. CondICA yields an increase in decoding accuracy on eight large fMRI datasets. Our main contributions consist in the reduction of SRM's training time as well as in the introduction of two more realistic models for the analysis of brain activity of subjects exposed to naturalistic stimuli: MultiViewICA and ShICA. Lastly, our results showing that ICA can be used for data augmentation are promising. In conclusion, we present some directions that could guide future work. From apractical point of view, minor modifications of our methods could allow theanalysis of resting state data assuming a shared spatial organization instead of a shared response. From a theoretical perspective, future work could focus on understanding how dimension reduction and shared response identification can be achieved jointly."}}
{"id": "MZnRrrc5L7U", "cdate": 1609459200000, "mdate": 1653502940005, "content": {"title": "Brain topography beyond parcellations: Local gradients of functional maps", "abstract": ""}}
{"id": "BJf4t-lP-G0", "cdate": 1609459200000, "mdate": 1653502940008, "content": {"title": "An empirical evaluation of functional alignment using inter-subject decoding", "abstract": ""}}
{"id": "1QsA6BoR6FN", "cdate": 1609459200000, "mdate": 1653502940020, "content": {"title": "Shared Independent Component Analysis for Multi-Subject Neuroimaging", "abstract": "We consider shared response modeling, a multi-view learning problem where one wants to identify common components from multiple datasets or views. We introduce Shared Independent Component Analysis (ShICA) that models eachview as a linear transform of shared independent components contaminated by additive Gaussian noise. We show that this model is identifiable if the components are either non-Gaussian or have enough diversity in noise variances. We then show that in some cases multi-set canonical correlation analysis can recover the correct unmixing matrices, but that even a small amount of sampling noise makes Multiset CCA fail. To solve this problem, we propose to use joint diagonalization after Multiset CCA, leading to a new approach called ShICA-J. We show via simulations that ShICA-J leads to improved results while being very fast to fit. While ShICA-J is based on second-order statistics, we further propose to leverage non-Gaussianity of the components using a maximum-likelihood method, ShICA-ML, that is both more accurate and more costly. Further, ShICA comes with a principled method for shared components estimation. Finally, we provide empirical evidence on fMRI and MEG datasets that ShICA yields more accurate estimation of the componentsthan alternatives."}}
{"id": "tfSNui2Fol5", "cdate": 1577836800000, "mdate": 1653502940020, "content": {"title": "Modeling Shared responses in Neuroimaging Studies through MultiView ICA", "abstract": "Group studies involving large cohorts of subjects are important to draw general conclusions about brain functional organization. However, the aggregation of data coming from multiple subjects is challenging, since it requires accounting for large variability in anatomy, functional topography and stimulus response across individuals. Data modeling is especially hard for ecologically relevant conditions such as movie watching, where the experimental setup does not imply well-defined cognitive operations. We propose a novel MultiView Independent Component Analysis (ICA) model for group studies, where data from each subject are modeled as a linear combination of shared independent sources plus noise. Contrary to most group-ICA procedures, the likelihood of the model is available in closed form. We develop an alternate quasi-Newton method for maximizing the likelihood, which is robust and converges quickly. We demonstrate the usefulness of our approach first on fMRI data, where our model demonstrates improved sensitivity in identifying common sources among subjects. Moreover, the sources recovered by our model exhibit lower between-sessions variability than other methods. On magnetoencephalography (MEG) data, our method yields more accurate source localization on phantom data. Applied on 200 subjects from the Cam-CAN dataset, it reveals a clear sequence of evoked activity in sensor and source space."}}
