{"id": "fKxETo0JXz3", "cdate": 1640995200000, "mdate": 1668843582420, "content": {"title": "Weakening the Influence of Clothing: Universal Clothing Attribute Disentanglement for Person Re-Identification", "abstract": "Most existing Re-ID studies focus on the short-term cloth-consistent setting and thus dominate by the visual appearance of clothing. However, the same person would wear different clothes and different people would wear the same clothes in reality, which invalidates these methods. To tackle the challenge of clothes change, we propose a Universal Clothing Attribute Disentanglement network (UCAD) which can effectively weaken the influence of clothing (identity-unrelated) and force the model to learn identity-related features that are unrelated to the worn clothing. For further study of Re-ID in cloth-changing scenarios, we construct a large-scale dataset called CSCC with the following unique features: (1) Severe: A large number of people have cloth-changing over four seasons. (2) High definition: The resolution of the cameras ranges from 1920×1080 to 3840×2160, which ensures that the recorded people are clear. Furthermore, we provide two variants of CSCC considering different degrees of cloth-changing, namely moderate and severe, so that researchers can effectively evaluate their models from various aspects. Experiments on several cloth-changing datasets including our CSCC and short-term dataset Market-1501 prove the superiority of UCAD. The dataset is available at https://github.com/yomin-y/UCAD."}}
{"id": "_1Rr8HRjYT", "cdate": 1640995200000, "mdate": 1668843582242, "content": {"title": "Local Similarity Pattern and Cost Self-Reassembling for Deep Stereo Matching Networks", "abstract": "Although convolutional neural network based stereo matching architectures have made impressive achievements, there are still some limitations: 1) Convolutional Feature (CF) tends to capture appearance information, which is inadequate for accurate matching. 2) Due to the static filters, current convolution based disparity refinement modules often produce over-smooth results. In this paper, we present two schemes to address these issues, where some traditional wisdoms are integrated. Firstly, we introduce a pairwise feature for deep stereo matching networks, named LSP (Local Similarity Pattern). Through explicitly revealing the neighbor relationships, LSP contains rich structural information, which can be leveraged to aid CF for more discriminative feature description. Secondly, we design a dynamic self-reassembling refinement strategy and apply it to the cost distribution and the disparity map respectively. The former could be equipped with the unimodal distribution constraint to alleviate the over-smoothing problem, and the latter is more practical. The effectiveness of the proposed methods is demonstrated via incorporating them into two well-known basic architectures, GwcNet and GANet-deep. Experimental results on the SceneFlow and KITTI benchmarks show that our modules significantly improve the performance of the model. Code is available at https://github.com/SpadeLiu/Lac-GwcNet."}}
{"id": "Fw7s8mJVbh", "cdate": 1640995200000, "mdate": 1668843582451, "content": {"title": "Improving the Facial Expression Recognition and Its Interpretability via Generating Expression Pattern-map", "abstract": ""}}
{"id": "7fMAkyYIPh", "cdate": 1640995200000, "mdate": 1668843582227, "content": {"title": "Gated Domain-Invariant Feature Disentanglement for Domain Generalizable Object Detection", "abstract": "For Domain Generalizable Object Detection (DGOD), Disentangled Representation Learning (DRL) helps a lot by explicitly disentangling Domain-Invariant Representations (DIR) from Domain-Specific Representations (DSR). Considering the domain category is an attribute of input data, it should be feasible for networks to fit a specific mapping which projects DSR into feature channels exclusive to domain-specific information, and thus much cleaner disentanglement of DIR from DSR can be achieved simply on channel dimension. Inspired by this idea, we propose a novel DRL method for DGOD, which is termed Gated Domain-Invariant Feature Disentanglement (GDIFD). In GDIFD, a Channel Gate Module (CGM) learns to output channel gate signals close to either 0 or 1, which can mask out the channels exclusive to domain-specific information helpful for domain recognition. With the proposed GDIFD, the backbone in our framework can fit the desired mapping easily, which enables the channel-wise disentanglement. In experiments, we demonstrate that our approach is highly effective and achieves state-of-the-art DGOD performance."}}
{"id": "3xyUeWAyPd", "cdate": 1640995200000, "mdate": 1668843582404, "content": {"title": "GraftNet: Towards Domain Generalized Stereo Matching with a Broad-Spectrum and Task-Oriented Feature", "abstract": "Although supervised deep stereo matching networks have made impressive achievements, the poor generalization ability caused by the domain gap prevents them from being applied to real-life scenarios. In this paper, we propose to leverage the feature of a model trained on large-scale datasets to deal with the domain shift since it has seen various styles of images. With the cosine similarity based cost volume as a bridge, the feature will be grafted to an ordinary cost aggregation module. Despite the broad-spectrum representation, such a low-level feature contains much general information which is not aimed at stereo matching. To recover more task-specific information, the grafted feature is further input into a shallow network to be transformed before calculating the cost. Extensive experiments show that the model generalization ability can be improved significantly with this broad-spectrum and task-oriented feature. Specifically, based on two well-known architectures PSMNet and GANet, our methods are superior to other robust algorithms when transferring from SceneFlow to KITTI 2015, KITTI 2012, and Middlebury. Code is available at https://github.com/SpadeLiu/Graft-PSMNet."}}
{"id": "uMJ_6ZJML8", "cdate": 1609459200000, "mdate": 1668843582404, "content": {"title": "Depth completion towards different sensor configurations via relative depth map estimation and scale recovery", "abstract": ""}}
{"id": "qi8xeHsgf9Z", "cdate": 1609459200000, "mdate": 1668843582246, "content": {"title": "Two-Step Affine Transformation Prediction for Visual Object Tracking", "abstract": "The main drawback of correlation filter scheme is that it can only predict translation of the object, ignoring the other affine transformations such as rotation, aspect ratio change, and scale change. This paper tries to address this problem by a two-step affine transformation prediction method. The first step is to predict coarse target translation by the correlation filter model with adaptive model update rate generation. Compared with fixed update rate in existing correlation filter based trackers, the presented method generates the update rate by Long Short-Term Memory model with inputs of historical target templates. The second step maps well-designed features to affine transformation parameters. The designed features contain the information of affine transformation which makes the learning of non-linear mapping function possible. The training samples for on-line filter model update are transformed to the same pose, and they help the learnt filter to represent the object better than non-aligned samples. The proposed network is trained from end to end and achieves competitive performance when comparing with state-of-the-arts trackers on four benchmarks, OTB100, UAV123, VOT2018, and VOT2020."}}
{"id": "oc4ito0vWZ", "cdate": 1609459200000, "mdate": 1668843582248, "content": {"title": "Fractal Pyramid Networks", "abstract": "We propose a new network architecture, the Fractal Pyramid Networks (PFNs) for pixel-wise prediction tasks as an alternative to the widely used encoder-decoder structure. In the encoder-decoder structure, the input is processed by an encoding-decoding pipeline that tries to get a semantic large-channel feature. Different from that, our proposed PFNs hold multiple information processing pathways and encode the information to multiple separate small-channel features. On the task of self-supervised monocular depth estimation, even without ImageNet pretrained, our models can compete or outperform the state-of-the-art methods on the KITTI dataset with much fewer parameters. Moreover, the visual quality of the prediction is significantly improved. The experiment of semantic segmentation provides evidence that the PFNs can be applied to other pixel-wise prediction tasks, and demonstrates that our models can catch more global structure information."}}
{"id": "Rrrj5_2QxeD", "cdate": 1609459200000, "mdate": 1668843582410, "content": {"title": "Transductive Few-Shot Classification on the Oblique Manifold", "abstract": "Few-shot learning (FSL) attempts to learn with limited data. In this work, we perform the feature extraction in the Euclidean space and the geodesic distance metric on the Oblique Manifold (OM). Specially, for better feature extraction, we propose a non-parametric Region Self-attention with Spatial Pyramid Pooling (RSSPP), which realizes a trade-off between the generalization and the discriminative ability of the single image feature. Then, we embed the feature to OM as a point. Furthermore, we design an Oblique Distance-based Classifier (ODC) that achieves classification in the tangent spaces which better approximate OM locally by learnable tangency points. Finally, we introduce a new method for parameters initialization and a novel loss function in the transductive settings. Extensive experiments demonstrate the effectiveness of our algorithm and it outperforms state-of-the-art methods on the popular benchmarks: mini-ImageNet, tiered-ImageNet, and Caltech-UCSD Birds-200-2011 (CUB)."}}
{"id": "bB_lZKLhP1", "cdate": 1577836800000, "mdate": 1668843582248, "content": {"title": "Attributes-aided part detection and refinement for person re-identification", "abstract": ""}}
