{"id": "a80xRuEWAZz", "cdate": 1699431671247, "mdate": 1699431671247, "content": {"title": "A Survey on Deep Learning based Time Series Analysis with Frequency Transformation", "abstract": "Recently, frequency transformation (FT) has been increasingly incorporated into deep learning models to significantly enhance state-of-the-art accuracy and efficiency in time series analysis. The advantages of FT, such as high efficiency and a global view, have been rapidly explored and exploited in various time series tasks and applications, demonstrating the promising potential of FT as a new deep learning paradigm for time series analysis. Despite the growing attention and the proliferation of research in this emerging field, there is currently a lack of a systematic review and in-depth analysis of deep learning-based time series models with FT. It is also unclear why FT can enhance time series analysis and what its limitations in the field are. To address these gaps, we present a comprehensive review that systematically investigates and summarizes the recent research advancements in deep learning-based time series analysis with FT. Specifically, we explore the primary approaches used in current models that incorporate FT, the types of neural networks that leverage FT, and the representative FT-equipped models in deep time series analysis. We propose a novel taxonomy to categorize the existing methods in this field, providing a structured overview of the diverse approaches employed in incorporating FT into deep learning models for time series analysis. Finally, we highlight the advantages and limitations of FT for time series modeling and identify potential future research directions that can further contribute to the community of time series analysis."}}
{"id": "X4_91BZJVqJ", "cdate": 1698571144481, "mdate": 1698571144481, "content": {"title": "Cloth2Body: Generating 3D Human Body Mesh from 2D Clothing", "abstract": "In this paper, we define and study a new Cloth2Body probleIm which has a goal of generating 3D human body meshes from a 2D clothing image. Unlike the existing human mesh recovery problem, Cloth2Body needs to address new and emerging challenges raised by the partial observation of the input and the high diversity of the output. Indeed, there are three specific challenges. First, how to locate and pose human bodies into the clothes. Second, how to effectively estimate body shapes out of various clothing types. Finally, how to generate diverse and plausible results from a 2D clothing image. To this end, we propose an end-to-end framework that can accurately estimate 3D body mesh parameterized by pose and shape from a 2D clothing image. Along this line, we first utilize Kinematics-aware Pose Estimation to estimate body pose parameters. 3D skeleton is employed as a proxy followed by an inverse kinematics module to boost the estimation accuracy. We additionally design an adaptive depth trick to align the re-projected 3D mesh better with 2D clothing image by disentangling the effects of object size and camera extrinsic. Next, we propose Physics-informed Shape Estimation to estimate body shape parameters. 3D shape parameters are predicted based on partial body measurements estimated from RGB image, which not only improves pixel-wise human-cloth alignment, but also enables flexible user editing. Finally, we design Evolution-based pose generation method, a skeleton transplanting method inspired by genetic algorithms to generate diverse reasonable poses during inference. As shown by experimental results on both synthetic and real-world data, the proposed framework achieves state-of-the-art performance and can effectively recover natural and diverse 3D body meshes from 2D images that align well with clothing."}}
{"id": "VHvi-3pdw1", "cdate": 1676849635093, "mdate": 1676849635093, "content": {"title": "Prospecting the Career Development of Talents: A Survival Analysis Perspective", "abstract": "Thee study of career development has become more important during a time of rising competition. Even with the help of newly available big data in the ﬁeld of human resources, it is challenging to prospect the career development of talents in an effective manner, since the nature and structure of talent careers can change quickly. To this end, in this paper, we propose a novel survival analysis approach to model the talent career paths, with a focus on two critical issues in talent management, namely turnover and career progression. Specifically, for modeling the talent turnover behaviors, we formulate the prediction of survival status at a sequence of time intervals as a multi-task learning problem by considering the prediction at each time interval as a task. Also, we impose the ranking constraints to model both censored and uncensored data, and capture the intrinsic properties exhibited in general lifetime modeling with non-recurrent and recurrent events. Similarly, for modeling the talent career progression, each task concerns the prediction of a relative occupational level at each time interval. The ranking constraints imposed on different occupational levels can help to reduce the prediction error. Finally, we evaluate our approach with several state-of-the-art baseline methods on real-world talent data. The experimental results clearly demonstrate the effectiveness of the proposed models for predicting the turnover and career progression of talents."}}
{"id": "Cw-eOMlAi0V", "cdate": 1676550202611, "mdate": 1676550202611, "content": {"title": "Attentive Heterogeneous Graph Embedding for Job Mobility Prediction", "abstract": "Job mobility prediction is an emerging research topic that can benefit both organizations and talents in various ways, such as job recommendation, talent recruitment, and career planning. Nevertheless, most existing studies only focus on modeling the individual-level career trajectories of talents, while the impact of macro-level job transition relationships (e.g., talent flow among companies and job positions) has been largely neglected. To this end, in this paper we propose an enhanced approach to job mobility prediction based on a heterogeneous company-position network constructed from the massive career trajectory data. Specifically, we design an Attentive heterogeneous graph embedding for sequential prediction (Ahead) framework to predict the next career move of talents, which contains two components, namely an attentive heterogeneous graph embedding (AHGN) model and a Dual-GRU model for career path mining. In particular, the AHGN model is used to learn the comprehensive representation for company and position on the heterogeneous network, in which two kinds of aggregators are employed to aggregate the information from external and internal neighbors for a node. Afterwards, a novel type-attention mechanism is designed to automatically fuse the information of the two aggregators for updating node representations. Moreover, the Dual-GRU model is devised to model the parallel sequences that appear in pair, which can be used to capture the sequential interactive information between companies and positions. Finally, we conduct extensive experiments on a real-world dataset for evaluating our Ahead framework. The experimental results clearly validate the effectiveness of our approach compared with the state-of-the-art baselines in terms of job mobility prediction."}}
{"id": "n8aJUj0fy11", "cdate": 1676550008527, "mdate": 1676550008527, "content": {"title": "Talent Demand-Supply Joint Prediction with Dynamic Heterogeneous Graph Enhanced Meta-Learning", "abstract": "Talent demand and supply forecasting aims to model the variation of the labor market, which is crucial to companies for recruitment\nstrategy adjustment and to job seekers for proactive career path planning. However, existing approaches either focus on talent demand or supply forecasting, but overlook the interconnection between demand-supply sequences among different companies and positions. To this end, in this paper, we propose a Dynamic Heterogeneous Graph Enhanced Meta-learning (DH-GEM) framework for fine-grained talent demand-supply joint prediction. Specifically, we first propose a Demand-Supply Joint Encoder-Decoder (DSJED) and a Dynamic Company-Position Heterogeneous Graph Convolutional Network (DyCP-HGCN) to respectively capture the intrinsic correlation between demand and supply sequences and company-position pairs. Moreover, a Loss-Driven Sampling based Meta-learner (LDSM) is proposed to optimize long-tail forecasting tasks with a few training data. Extensive experiments have been conducted on three real-world datasets to demonstrate the effectiveness of our approach compared with five baselines. DH-GEM has been deployed as a core component of the intelligent human resource system of a cooperative partner."}}
{"id": "hxoJZAiQiV", "cdate": 1676549809337, "mdate": 1676549809337, "content": {"title": "Multi-Graph Convolutional Recurrent Network for Fine-Grained Lane-Level Traffic Flow Imputation", "abstract": "Traffic flow imputation provides a more-complete view of traffic flows, and thus is a fundamental function in building Intelligent Transportation Systems. The performance of traffic flow imputation has a big impact on a wide range of downstream applications, such as traffic forecasting and control. Therefore, in this paper, we propose a Multi-grAph Convolutional Recurrent netwOrk (MACRO\\footnote{Code available at https://github.com/Jingci/MACRO}) framework for supporting fine-grained lane-level traffic flow imputation, which can help to reconstruct more  complete traffic flows at the lane level. \nSpecifically, we first design a spatial dependency module to model the diversified spatial correlations within traffic flows, where multi-relation graphs are first constructed to consider correlations from various perspective, then a multi-graph convolution neural network is proposed to capture the integrated spatial dependencies of traffic flows and adequately propagate the observed traffic values to mitigate data sparsity problem from spatial domain.\n Also, to handle the temporally continuous data missing issue, we adopt a modified bi-directional recurrent neural network to capture traffic flows' temporal dependencies by considering both historical and future information, and employ a temporal decay mechanism to control the irregular information transfer between adjacent time slices. Moreover, a spatio-temporal knowledge integration module is devised to comprehensively integrate multi-resolution spatiotemporal\nknowledge for traffic flow imputation.\nFinally, extensive experiments on the real-world dataset demonstrate that the performance of MACRO outperforms several state-of-the-art baselines with respect to traffic flow imputation.\n"}}
{"id": "wUghPlYDsMm", "cdate": 1676520451639, "mdate": 1676520451639, "content": {"title": "Intelligent Electric Vehicle Charging Recommendation Based on Multi-Agent Reinforcement Learning", "abstract": "Electric Vehicle (EV) has become a preferable choice in the modern transportation system due to its environmental and energy sus- tainability. However, in many large cities, EV drivers often fail to find the proper spots for charging, because of the limited charg- ing infrastructures and the spatiotemporally unbalanced charg- ing demands. Indeed, the recent emergence of deep reinforcement learning provides great potential to improve the charging expe- rience from various aspects over a long-term horizon. In this pa- per, we propose a framework, named Multi-Agent Spatio-Temporal Reinforcement Learning (Master), for intelligently recommending public accessible charging stations by jointly considering various long-term spatiotemporal factors. Specifically, by regarding each charging station as an individual agent, we formulate this prob- lem as a multi-objective multi-agent reinforcement learning task. We first develop a multi-agent actor-critic framework with the centralized attentive critic to coordinate the recommendation be- tween geo-distributed agents. Moreover, to quantify the influence of future potential charging competition, we introduce a delayed access strategy to exploit the knowledge of future charging compe- tition during training. After that, to effectively optimize multiple learning objectives, we extend the centralized attentive critic to multi-critics and develop a dynamic gradient re-weighting strategy to adaptively guide the optimization direction. Finally, extensive experiments on two real-world datasets demonstrate that Master achieves the best comprehensive performance compared with nine baseline approaches."}}
{"id": "qGH8X2Yntv7", "cdate": 1676519417351, "mdate": 1676519417351, "content": {"title": "Multi-Agent Graph Convolutional Reinforcement Learning for Dynamic Electric Vehicle Charging Pricing", "abstract": "Electric Vehicles (EVs) have been emerging as a promising low- carbon transport target. While a large number of public charg- ing stations are available, the use of these stations is often im- balanced, causing many problems to Charging Station Operators (CSOs). To this end, in this paper, we propose a Multi-Agent Graph Convolutional ReinforcementLearning (MAGC) framework to enable CSOs to achieve more effective use ofthese stations by providing dy- namic pricing for each ofthe continuously arising charging requests with optimizing multiple long-term commercial goals. Specifically, we first formulate this charging station request-specific dynamic pricing problem as a mixed competitive-cooperative multi-agent re- inforcement learning task, where each charging station is regarded as an agent. Moreover, by modeling the whole charging market as a dynamic heterogeneous graph, we devise a multi-view hetero- geneous graph attention networks to integrate complex interplay between agents induced by their diversified relationships. Then, we propose a shared meta generator to generate individual cus- tomized dynamic pricing policies for large-scale yet diverse agents based on the extracted meta characteristics. Finally, we design a contrastive heterogeneous graph pooling representation module to learn a condensed yet effective state action representation to facilitate policy learning of large-scale agents. Extensive experi- ments on two real-world datasets demonstrate the effectiveness of MAGC and empirically show that the overall use of stations can be improved if all the charging stations in a charging market embrace our dynamic pricing policy."}}
{"id": "d3h9IDPuJg", "cdate": 1672531200000, "mdate": 1674059826908, "content": {"title": "Diagnostic Sparse Connectivity Networks With Regularization Template", "abstract": "Real-world dynamic systems and complex objects are often monitored with multivariate time series where each dimension represents a system signal. Performing accurate diagnostic for a group of dynamic systems while simultaneously taking into account their similarities/distinctions, is a non-trivial task. In this paper, we develop an adaptive regularization approach to learning sparse connectivity structures in complex dynamic systems. The learned connectivity networks shed lights on the structural compositions of the system and hence can serve as highly informative inputs for various machine learning tasks. In particular, we focus on high-dimensional and semi-supervised learning scenarios and present a joint learning method to recover system-wise connectivity patterns by adaptively constructing a shared, sparsity-inducing regularization template across all systems. The shared template can be intuitively interpreted and used as a modeling template for efficient analysis of new systems. Moreover, our approach can flexibly incorporate information such as must-links and cannot-links for constructing regularization templates. Overall, our approach, named <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">sparse adaptive regularization</i> (SAR), can extract structure-related connectivity features efficiently and effectively, and result in significant improvements for machine learning tasks in dynamic systems. We benchmark our approach against the state-of-the-art methods with real-world data. Our results demonstrate the superiority of our approach over the baselines in terms of accuracy, efficiency, and interpretability."}}
{"id": "BirKkq44fTi", "cdate": 1672531200000, "mdate": 1674233116088, "content": {"title": "Corporate Relative Valuation Using Heterogeneous Multi-Modal Graph Neural Network", "abstract": "Corporate relative valuation (CRV) refers to the process of comparing a company’s value from company products, core staff and other related information, so that we can assess the company’s market value, which is critical for venture capital firms. Traditional relative valuation methods heavily rely on tedious and expensive human efforts, especially for non-publicly listed companies. However, the availability of information about company’s invisible assets, such as patents, talent, and investors, enables a new paradigm to learn and evaluate corporate relative values automatically. Indeed, in this paper, we reveal that, the companies and their core members can natually be formed as a heterogeneous graph and the attributes of different nodes include semantically-rich multi-modal data, thereby we are able to extract a latent embedding for each company. The network embeddings can reflect domain experts’ behavior and are effective for corporate relative valuation. Along this line, we develop a heterogeneous multi-modal graph neural network method, named HM <inline-formula><tex-math notation=\"LaTeX\">$^{2}$</tex-math></inline-formula> , which deals with embedding challenges involving modal attribute encoding, multi-modal aggregation, and valuation prediction modules. Specifically, HM <inline-formula><tex-math notation=\"LaTeX\">$^{2}$</tex-math></inline-formula> first performs the representation learning for heterogeneous neighbors of the input company by taking relationships among nodes into consideration, which aggregates node attributes via linkage-aware multi-head attention mechanism, rather than multi-instance based methods. Then, HM <inline-formula><tex-math notation=\"LaTeX\">$^{2}$</tex-math></inline-formula> adopts the self-attention network to aggregate different modal embeddings for final prediction, and employs dynamic triplet loss with embeddings of competitors as the constraint. As a result, HM <inline-formula><tex-math notation=\"LaTeX\">$^{2}$</tex-math></inline-formula> can explore companies’ intrinsic properties to improve the CRV performance. Extensive experiments on real-world data demonstrate the effectiveness of the proposed HM <inline-formula><tex-math notation=\"LaTeX\">$^{2}$</tex-math></inline-formula> ."}}
