{"id": "rkeiQlBFPB", "cdate": 1569439778878, "mdate": null, "content": {"title": "Meta-Learning with Warped Gradient Descent", "abstract": "Learning an efficient update rule from data that promotes rapid learning of new tasks from the same distribution remains an open problem in meta-learning. Typically, previous works have approached this issue either by attempting to train a neural network that directly produces updates or by attempting to learn better initialisations or scaling factors for a gradient-based update rule. Both of these approaches pose challenges. On one hand, directly producing an update forgoes a useful inductive bias and can easily lead to non-converging behaviour. On the other hand, approaches that try to control a gradient-based update rule typically resort to computing gradients through the learning process to obtain their meta-gradients, leading to methods that can not scale beyond few-shot task adaptation. In this work, we propose Warped Gradient Descent (WarpGrad), a method that intersects these approaches to mitigate their limitations. WarpGrad meta-learns an efficiently parameterised preconditioning matrix that facilitates gradient descent across the task distribution. Preconditioning arises by interleaving non-linear layers, referred to as warp-layers, between the layers of a task-learner. Warp-layers are meta-learned without backpropagating through the task training process in a manner similar to methods that learn to directly produce updates. WarpGrad is computationally efficient, easy to implement, and can scale to arbitrarily large meta-learning problems. We provide a geometrical interpretation of the approach and evaluate its effectiveness in a variety of settings, including few-shot, standard supervised, continual and reinforcement learning."}}
{"id": "rsjWdhMguTB", "cdate": 1546300800000, "mdate": null, "content": {"title": "Post Disaster Mapping With Semantic Change Detection in Satellite Imagery.", "abstract": "Accurate road maps are important for timely disaster relief efforts and risk management. Current disaster mapping is done manually by volunteers following a disaster and the process is slow and error prone. We propose a framework for identifying accessible roads in post-disaster satellite imagery by detecting changes from pre-disaster imagery, in conjunction with OpenStreetMap data. We validate our results with data from Indonesia 2018 tsunami, obtained from DigitalGlobe."}}
{"id": "HyNUnv-ObB", "cdate": 1514764800000, "mdate": null, "content": {"title": "Breaking the Activation Function Bottleneck through Adaptive Parameterization", "abstract": "Standard neural network architectures are non-linear only by virtue of a simple element-wise activation function, making them both brittle and excessively large. In this paper, we consider methods for making the feed-forward layer more flexible while preserving its basic structure. We develop simple drop-in replacements that learn to adapt their parameterization conditional on the input, thereby increasing statistical efficiency significantly. We present an adaptive LSTM that advances the state of the art for the Penn Treebank and Wikitext-2 word-modeling tasks while using fewer parameters and converging in half as many iterations."}}
