{"id": "4WQf0n0Ho5l", "cdate": 1672531200000, "mdate": 1699289774361, "content": {"title": "Domain Generalization via Heckman-type Selection Models", "abstract": ""}}
{"id": "fk7RbGibe1", "cdate": 1663850184433, "mdate": null, "content": {"title": "Domain Generalization via Heckman-type Selection Models ", "abstract": "The domain generalization (DG) setup considers the problem where models are trained on data sampled from multiple domains and evaluated on test domains unseen during training. In this paper, we formulate DG as a sample selection problem where each domain is sampled from a common underlying population through non-random sampling probabilities that correlate with both the features and the outcome. Under this setting, the fundamental iid assumption of the empirical risk minimization (ERM) is violated, so it often performs worse on test domains whose non-random sampling probabilities differ from the domains in the training dataset. We propose a Selection-Guided DG (SGDG) framework to learn the selection probability of each domain and the joint distribution of the outcome and domain selection variables. The proposed SGDG is domain generalizable as it intends to minimize the risk under the population distribution. We theoretically proved that, under certain regular conditions, SGDG can achieve smaller risk than ERM. Furthermore, we present a class of parametric SGDG (HeckmanDG) estimators applicable to continuous, binary, and multinomial outcomes. We also demonstrated its efficacy empirically through simulations and experiments on a set of benchmark datasets comparing with other well-known DG methods."}}
{"id": "-bFuA8vv1gK", "cdate": 1640995200000, "mdate": 1676243650265, "content": {"title": "Fair Generalized Linear Models with a Convex Penalty", "abstract": "Despite recent advances in algorithmic fairness, methodologies for achieving fairness with generalized linear models (GLMs) have yet to be explored in general, despite GLMs being widely used in pra..."}}
{"id": "p2yWC7308iK", "cdate": 1609459200000, "mdate": 1676243650262, "content": {"title": "Dynamic Survival Analysis for EHR Data with Personalized Parametric Distributions", "abstract": "The widespread availability of high-dimensional electronic healthcare record (EHR) datasets has led to significant interest in using such data to derive clinical insights and make risk pre- diction..."}}
{"id": "YlBv3V5PB3P", "cdate": 1609459200000, "mdate": 1683883340456, "content": {"title": "Hierarchical segment-channel attention network for explainable multichannel signal classification", "abstract": ""}}
{"id": "VnQNylxLcnn", "cdate": 1577836800000, "mdate": 1682336969703, "content": {"title": "Outer-Points shaver: Robust graph-based clustering via node cutting", "abstract": ""}}
{"id": "C2R-XLscTG", "cdate": 1577836800000, "mdate": 1682336969688, "content": {"title": "Graph Structured Sparse Subset Selection", "abstract": ""}}
