{"id": "AaqLGCdwLN", "cdate": 1685577600000, "mdate": 1701846252666, "content": {"title": "Avoiding Detection by Hostile Nodes in Airborne Tactical Networks", "abstract": "Contemporary airborne radio networks are usually implemented using omnidirectional antennas. Unfortunately, such networks suffer from disadvantages such as easy detection by hostile aircraft and potential information leakage. In this paper, we present a novel mobile ad hoc network (MANET) routing protocol based on directional antennas and situation awareness data that utilizes adaptive multihop routing to avoid sending information in directions where hostile nodes are present. Our protocol is implemented in the OMNEST simulator and evaluated using two realistic flight scenarios involving 8 and 24 aircraft, respectively. The results show that our protocol has significantly fewer leaked packets than comparative protocols, but at a slightly higher cost in terms of longer packet lifetime."}}
{"id": "xJVLV65rJIc", "cdate": 1672531200000, "mdate": 1701846252693, "content": {"title": "MultiStream EvolveCluster", "abstract": "This paper proposes a novel multi-stream clustering algorithm, MultiStream EvolveCluster (MS-EC), that can be used for continuous and distributed monitoring and analysis of evolving time series phenomena. It can maintain evolving clustering solutions separately for each stream/view and consensus clustering solutions reflecting evolving interrelations among the streams. Each stream behavior can be analyzed by different clustering techniques using a distance measure and data granularity that is specially selected for it. The properties of the MultiStream EvolveCluster algorithm are studied and evaluated with respect to different consensus clustering techniques, distance measures, and cluster evaluation measures in synthetic and real-world smart building datasets. Our evaluation results show a stable algorithm performance in synthetic data scenarios. In the case of real-world data, the algorithm behavior demonstrates sensitivity to the individual streams’ data quality and the used consensus clustering technique."}}
{"id": "FmCyRQaBG2", "cdate": 1672531200000, "mdate": 1701846252642, "content": {"title": "HINTS: Human-Centered Intelligent Realities", "abstract": "During the last decade, we have witnessed a rapid development of extended reality (XR) technologies such as augmented reality (AR) and virtual reality (VR). Further, there have been tremendous advancements in artificial intelligence (AI) and machine learning (ML). These two trends will have a significant impact on future digital societies. The vision of an immersive, ubiquitous, and intelligent virtual space opens up new opportunities for creating an enhanced digital world in which the users are at the center of the development process, so-called intelligent realities (IRs). The “Human-Centered Intelligent Realities” (HINTS) profile project will develop concepts, principles, methods, algorithms, and tools for human-centered IRs, thus leading the way for future immersive, user-aware, and intelligent interactive digital environments. The HINTS project is centered around an ecosystem combining XR and communication paradigms to form novel intelligent digital systems. HINTS will provide users with new ways to understand, collaborate with, and control digital systems. These novel ways will be based on visual and data-driven platforms which enable tangible, immersive cognitive interactions within real and virtual realities. Thus, exploiting digital systems in a more efficient, effective, engaging, and resource-aware condition. Moreover, the systems will be equipped with cognitive features based on AI and ML, which allow users to engage with digital realities and data in novel forms. This paper describes the HINTS profile project and its initial results."}}
{"id": "1KlHw1d_9U", "cdate": 1672531200000, "mdate": 1701846252648, "content": {"title": "Preliminary Results on the use of Artificial Intelligence for Managing Customer Life Cycles", "abstract": "During the last decade we have witnessed how artificial intelligence (AI) have changed businesses all over the world. The customer life cycle framework is widely used in businesses and AI plays a role in each stage. However, implementing and generating value from AI in the customer life cycle is not always simple. When evaluating the AI against business impact and value it is critical to consider both the model performance and the policy outcome. Proper analysis of AI-derived policies must not be overlooked in order to ensure ethical and trustworthy AI. This paper presents a comprehensive analysis of the literature on AI in customer life cycles (CLV) from an industry perspective. The study included 31 of 224 analyzed peer-reviewed articles from Scopus search result. The results show a significant research gap regarding outcome evaluations of AI implementations in practice. This paper proposes that policy evaluation is an important tool in the AI pipeline and empathizes the significance of validating both policy outputs and outcomes to ensure reliable and trustworthy AI."}}
{"id": "WLE20VXPv49", "cdate": 1640995200000, "mdate": 1701846252623, "content": {"title": "Research Trends, Enabling Technologies and Application Areas for Big Data", "abstract": "The availability of large amounts of data in combination with Big Data analytics has transformed many application domains. In this paper, we provide insights into how the area has developed in the last decade. First, we identify seven major application areas and six groups of important enabling technologies for Big Data applications and systems. Then, using bibliometrics and an extensive literature review of more than 80 papers, we identify the most important research trends in these areas. In addition, our bibliometric analysis also includes trends in different geographical regions. Our results indicate that manufacturing and agriculture or forestry are the two application areas with the fastest growth. Furthermore, our bibliometric study shows that deep learning and edge or fog computing are the enabling technologies increasing the most. We believe that the data presented in this paper provide a good overview of the current research trends in Big Data and that this kind of information is very useful when setting strategic agendas for Big Data research."}}
{"id": "QxAZyK6-SSv", "cdate": 1640995200000, "mdate": 1701846252660, "content": {"title": "Recent Developments in Low-Power AI Accelerators: A Survey", "abstract": "As machine learning and AI continue to rapidly develop, and with the ever-closer end of Moore’s law, new avenues and novel ideas in architecture design are being created and utilized. One avenue is accelerating AI as close to the user as possible, i.e., at the edge, to reduce latency and increase performance. Therefore, researchers have developed low-power AI accelerators, designed specifically to accelerate machine learning and AI at edge devices. In this paper, we present an overview of low-power AI accelerators between 2019–2022. Low-power AI accelerators are defined in this paper based on their acceleration target and power consumption. In this survey, 79 low-power AI accelerators are presented and discussed. The reviewed accelerators are discussed based on five criteria: (i) power, performance, and power efficiency, (ii) acceleration targets, (iii) arithmetic precision, (iv) neuromorphic accelerators, and (v) industry vs. academic accelerators. CNNs and DNNs are the most popular accelerator targets, while Transformers and SNNs are on the rise."}}
{"id": "Mo0RAVyOeX", "cdate": 1640995200000, "mdate": 1701846252623, "content": {"title": "EvolveCluster: an evolutionary clustering algorithm for streaming data", "abstract": "Data has become an integral part of our society in the past years, arriving faster and in larger quantities than before. Traditional clustering algorithms rely on the availability of entire datasets to model them correctly and efficiently. Such requirements are not possible in the data stream clustering scenario, where data arrives and needs to be analyzed continuously. This paper proposes a novel evolutionary clustering algorithm, entitled EvolveCluster, capable of modeling evolving data streams. We compare EvolveCluster against two other evolutionary clustering algorithms, PivotBiCluster and Split-Merge Evolutionary Clustering, by conducting experiments on three different datasets. Furthermore, we perform additional experiments on EvolveCluster to further evaluate its capabilities on clustering evolving data streams. Our results show that EvolveCluster manages to capture evolving data stream behaviors and adapts accordingly."}}
{"id": "reZcyax_y5", "cdate": 1609459200000, "mdate": 1644854497744, "content": {"title": "Energy-aware very fast decision tree", "abstract": "Recently machine learning researchers are designing algorithms that can run in embedded and mobile devices, which introduces additional constraints compared to traditional algorithm design approaches. One of these constraints is energy consumption, which directly translates to battery capacity for these devices. Streaming algorithms, such as the Very Fast Decision Tree (VFDT), are designed to run in such devices due to their high velocity and low memory requirements. However, they have not been designed with an energy efficiency focus. This paper addresses this challenge by presenting the nmin adaptation method, which reduces the energy consumption of the VFDT algorithm with only minor effects on accuracy. nmin adaptation allows the algorithm to grow faster in those branches where there is more confidence to create a split, and delays the split on the less confident branches. This removes unnecessary computations related to checking for splits but maintains similar levels of accuracy. We have conducted extensive experiments on 29 public datasets, showing that the VFDT with nmin adaptation consumes up to 31% less energy than the original VFDT, and up to 96% less energy than the CVFDT (VFDT adapted for concept drift scenarios), trading off up to 1.7 percent of accuracy."}}
{"id": "SWEWc1ag_k5", "cdate": 1609459200000, "mdate": 1644854497746, "content": {"title": "Editorial to the Special Issue on Big Data in Industrial and Commercial Applications", "abstract": ""}}
{"id": "HtUX5Jae_1c", "cdate": 1609459200000, "mdate": 1644854497891, "content": {"title": "Blind Correction of Lateral Chromatic Aberration in Raw Bayer Data", "abstract": "Chromatic aberration is an error that occurs in color images due to the fact that camera lenses refract the light of different wavelengths in different angles. The common approach today to correct the error is to use a lookup table for each camera-lens combination, e.g., as in Adobe PhotoShop Lightroom or DxO Optics Pro. In this paper, we propose a method that corrects the chromatic aberration error without any priot knowledge of the camera-lens combination, and does the correction already on the bayer data, i.e., before the Raw image data is interpolated to an RGB image. We evaluate our method in comparison to DxO Optics Pro, a state-of-the-art tool based on lookup tables, using 25 test images and the variance of the color differences (VCD) metric. The results show that our blind method has a similar error correction performance as DxO Optics Pro, but without prior knowledge of the camera-lens setup."}}
