{"id": "CqC4WznweH", "cdate": 1582127620935, "mdate": null, "content": {"title": "Estimating 3D human shape under clothing from a single RGB image,", "abstract": "Estimation of naked human shape is essential in several applications such as virtual try-on. We propose an approach that estimates naked human 3D pose and shape, including non-skeletal shape information such as musculature and fat distribution, from a single RGB image. The proposed approach optimizes a parametric 3D human model using person silhouettes with clothing category, and statistical displacement models between clothed and naked body shapes associated with each clothing category. Experiments demonstrate that our approach estimates human shape more accurately than a prior method."}}
{"id": "8UStYchlz", "cdate": 1582127381074, "mdate": null, "content": {"title": "Gaze from Head: Gaze Estimation without Observing Eye", "abstract": "We propose a gaze estimation method not from eye observation but from head motion. This proposed method is based on physiological studies about the eye-head coordination, and the gaze direction is estimated from observation of head motion by using the eye-head coordination model trained by preliminarily collected data of gaze direction and head pose sequence. We collected gaze-head datasets of from people who walked around under real and VR environments, constructed the eye-head coordination models from those datasets, and evaluated them quantitatively. In addition, we con\ffirmed that there was no significant difference between the models from the real and VR datasets in their estimation accuracy."}}
{"id": "FmZ_8qWZla", "cdate": 1582127127919, "mdate": null, "content": {"title": "Statistical Analysis of Dual-task Gait Characteristics for Cognitive Score Estimation", "abstract": "Traditional approaches for the screening of cognitive function are often based on paper tests, such as Mini-Mental State Examination (MMSE), that evaluate the degree of cognitive impairment and provide a score of patient’s mental ability. Procedures for conducting paper tests require time investment involving a questioner and not suitable to be carried out frequently. Previous studies showed that dementia impaired patients are not capable of multi-tasking efficiently. Based on this observation an automated system utilizing Kinect device for collecting primarily patient’s gait data who carry out locomotion and calculus tasks individually (i.e., single-tasks) and then simultaneously (i.e., dual-task) was introduced. We installed this system in three elderly facilities and collected 10,833 behavior data from 90 subjects. We conducted analyses of the acquired information extracting 12 features of single- and dual-task performance developed a method for automatic dementia score estimation to investigate determined which characteristics are the most important. In result, a machine learning algorithm using single and dual-task performance classified subjects with an MMSE score of 23 or lower with a recall 0.753 and a specificity 0.799. We found the gait characteristics were important features in the score estimation, and referring to both single and dual-task features was effective."}}
{"id": "-m1qkrvXGn", "cdate": 1582126997861, "mdate": null, "content": {"title": "Early Detection of Lower MMSE Scores in Elderly Based on Dual-Task Gait", "abstract": "The dual-task paradigm is a promising procedure for estimating cognitive status and may also be collaterally used to reduce cognitive decline and prevent dementia. In this paper, we use the mini-mental state exam (MMSE) to the assess cognitive status in the elderly as a reference and investigate the potential of using machine learning for early detecting cognitive impairment in the elderly. Although many studies have suggested that dual-task performance, in which participants perform a cognitive task while walking, is associated with cognition, they only considered the correlation between cognitive parameters and simple gait feature, such as gait speed, through the statistical analysis. We instead use a Kinect sensor to capture participants' whole-body movements and extract a rich gait feature that has the ability to exhibit different tendencies of movements between healthy and cognitive-impaired elderlies. In our experiments, a classifier based on the dual-task gait feature achieved a higher performance than the one based on the single-task feature; the performance of the rich gait feature was better than that of a simple one, and; an optimal detection performance was achieved with an MMSE cutoff score of 25. We positively validated that the proposed method could early detect elderly with lower MMSE scores based on dual-task gait feature with a promising performance. Our approach can support early and automated diagnosis of cognitive impairment."}}
{"id": "HJbMkAbuWS", "cdate": 1167609600000, "mdate": null, "content": {"title": "Displaying a Moving Image By Multiple Steerable Projectors", "abstract": "This paper proposes a method for precise overlapping of projected images from multiple steerable projectors. When they are controlled simultaneously, two problems are revealed: (1) even a slight positional error of the projected image, which does not matter in the case of a single projector, causes misalignments of multiple projected images that can be perceived clearly when using multiple projectors; and (2) as the projectors usually do not have architectures for their synchronization it is impossible to display a moving image that is by tiling or overlaying precisely the multiple projected images. To overcome (1), a method is proposed that measures preliminarily the misalignments through every plane in the environment, and hence displays the image without the misalignment. For (2), a consideration and a new proposal for the synchronization of multiple projectors are also discussed."}}
{"id": "BkNluT-d-S", "cdate": 1104537600000, "mdate": null, "content": {"title": "Multi-Planar Projection by Fixed-Center Pan-Tilt Projectors", "abstract": "We describe a new steerable projector, whose projection center precisely corresponds with its rotation center, which we call a \"fixed-center pan-tilt (FC-PT) projector.\" This mechanism allows it be set up more easily to display graphics precisely on the planes in the environment than for other steerable projectors; wherever we would like to display graphics, all we have to do are locating the FC-PT projector in the environment, and directing it to the corners of the planes whose 2D sizes have been measured. Moreover, as the FC-PT projector can recognize automatically whether each plane is connected to others, it can display visual information that lies across the boundary line of two planes in a similar way to a paper poster folded along the planes."}}
