{"id": "paH6n6TQrSN", "cdate": 1640995200000, "mdate": 1682713377997, "content": {"title": "Time-series estimation from randomly time-warped observations", "abstract": ""}}
{"id": "Pe1Ipbg4psY", "cdate": 1577836800000, "mdate": 1682713377997, "content": {"title": "An Exploratory Method for Smooth/Transient Decomposition", "abstract": "We consider a separation problem where the observation consists of the sum of a high amplitude smooth signal and a low amplitude transient signal. We propose a method for decomposition that relies on solving instances of a `constrained filtering problem,' which is posed as a convex minimization problem. We provide a fast algorithm for solving the minimization problem, and demonstrate the potential of the scheme on a vital signs monitoring experiment using radar."}}
{"id": "Q4EqIpXfQ4p", "cdate": 1546300800000, "mdate": null, "content": {"title": "Signal Recovery From Norm Measurements", "abstract": "We consider the problem of recovering a signal from the norms of its linear transforms. We formulate the recovery as a minimization problem, and propose algorithms for solving the formulation. We discuss the convergence of the algorithms and compare their behaviors. We demonstrate the usefulness of the formulation/algorithm on the problem of recovering positions of points given their pairwise distances."}}
{"id": "SsXmsRITwVM", "cdate": 1514764800000, "mdate": null, "content": {"title": "Hierarchical Sparsity Within And Across Overlapping Groups", "abstract": "Recently, different penalties have been proposed for signals whose non-zero coefficients reside in a small number of groups, where within each group, only few of the coefficients are active. In this paper, we extend such a penalty, and introduce an additional layer of grouping on the coefficients. Specifically, we first partition the signal into groups, and then apply the penalty on the ℓ <sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</sub> norms of the groups. We discuss how this extended penalty can be used in energy minimization formulations, and demonstrate the effects of the proposed extension on a dereverberation experiment."}}
{"id": "QN1bj2AMTV_", "cdate": 1514764800000, "mdate": null, "content": {"title": "Sparsity Within and Across Overlapping Groups", "abstract": "Recently, penalty functions promoting signals that are sparse within and across groups have been proposed. In this letter, we propose a modified penalty function that offers additional flexibility in forming groups. We study the properties of the penalty function and propose a new algorithm that can be used in energy minimization formulations that employ it. We demonstrate the effects of using the penalty function on a simple linear inverse problem."}}
{"id": "zrJ-DPCEopN", "cdate": 1483228800000, "mdate": null, "content": {"title": "Optimization Methods for Synthetic Aperture Radar Imaging", "abstract": "We review recent developments in Synthetic Aperture Radar (SAR) image formation from an optimization perspective. Majority of these methods can be viewed as constrained least squares problems exploiting sparsity. We reviewed analytic and large scale numerical optimization based approaches in both deterministic and Bayesian frameworks. These methods offer substantial improvements in image quality, suppression of noise and clutter. Analytic methods also have the advantage of computational efficiency."}}
{"id": "AY3KSyJ0TUE", "cdate": 1483228800000, "mdate": null, "content": {"title": "A weakly-convex formulation for phaseless imaging", "abstract": "We consider the problem of reconstructing an object given magnitudes of linear measurements. We follow the `lifting' approach, but unlike previous work which use convex relaxations of the unit rank constraint, we use a weakly-convex matrix penalty. We derive a convergent algorithm and show that it is computationally more feasible than those obtained under convex relaxations. We demonstrate numerically that when the signal to noise ratio is high, the proposed algorithm can achieve almost error-free reconstruction with fewer measurements than when convex relaxation is employed."}}
{"id": "9mZXYvjXCxG", "cdate": 1483228800000, "mdate": null, "content": {"title": "Multichannel Linear Prediction for Blind Reverberant Audio Source Separation", "abstract": "A class of methods based on multichannel linear prediction (MCLP) can achieve effective blind dereverberation of a source, when the source is observed with a microphone array. We propose an inventive use of MCLP as a pre-processing step for blind source separation with a microphone array. We show theoretically that, under certain assumptions, such pre-processing reduces the original blind reverberant source separation problem to a non-reverberant one, which in turn can be effectively tackled using existing methods. We demonstrate our claims using real recordings obtained with an eight-microphone circular array in reverberant environments."}}
{"id": "312jJ3k6R", "cdate": 1483228800000, "mdate": null, "content": {"title": "A Penalty Function Promoting Sparsity Within and Across Groups", "abstract": "We introduce a new penalty function that promotes signals composed of a small number of active groups, where within each group, only a few high magnitude coefficients are nonzero. We derive the threshold function associated with the proposed penalty and study its properties. We discuss how the proposed penalty/threshold function can be useful for signals with isolated nonzeros, such as audio with isolated harmonics along the frequency axis, or reflection functions in exploration seismology where the nonzeros occur on the boundaries of subsoil layers. We demonstrate the use of the proposed penalty/threshold functions in a convex denoising and a nonconvex deconvolution formulation. We provide convergent algorithms for both formulations and compare the performance with state-of-the-art methods."}}
{"id": "t50RERgOzV", "cdate": 1451606400000, "mdate": null, "content": {"title": "A dereverberation formulation employing phase information", "abstract": "The dereverberation problem can be solved by attacking magnitudes of time-frequency transformation coefficients. In a spectrum frequency band, in harmonics, coefficients have a predictable pattern in phase. In this paper we propose a formulation for dereverberation problem which employs phase information in addition to magnitude information. In order to solve this problem we make use of a minimization problem. We solve the minimization problem with an iterative method. We discuss the performance of proposed method with experiments."}}
