{"id": "v7cy7dK-_SC", "cdate": 1640995200000, "mdate": 1682452317431, "content": {"title": "A Spatial SEIR Model for COVID-19 in South Africa", "abstract": "The virus SARS-CoV-2 has resulted in numerous modelling approaches arising rapidly to understand the spread of the disease COVID-19 and to plan for future interventions. Herein, we present an SEIR model with a spatial spread component as well as four infectious compartments to account for the variety of symptom levels and transmission rate. The model takes into account the pattern of spatial vulnerability in South Africa through a vulnerability index that is based on socioeconomic and health susceptibility characteristics. Another spatially relevant factor in this context is level of mobility throughout. The thesis of this study is that without the contextual spatial spread modelling, the heterogeneity in COVID-19 prevalence in the South African setting would not be captured. The model is illustrated on South African COVID-19 case counts and hospitalisations."}}
{"id": "j1Z7_AR1Pj", "cdate": 1609459200000, "mdate": 1682452317412, "content": {"title": "Modelling Representative Population Mobility for COVID-19 Spatial Transmission in South Africa", "abstract": "The COVID-19 pandemic starting in the first half of 2020 has changed the lives of everyone across the world. Reduced mobility was essential due to it being the largest impact possible against the spread of the little understood SARS-CoV-2 virus. To understand the spread, a comprehension of human mobility patterns is needed. The use of mobility data in modelling is thus essential to capture the intrinsic spread through the population. It is necessary to determine to what extent mobility data sources convey the same message of mobility within a region. This paper compares different mobility data sources by constructing spatial weight matrices at a variety of spatial resolutions and further compares the results through hierarchical clustering. We consider four methods for constructing spatial weight matrices representing mobility between spatial units, taking into account distance between spatial units as well as spatial covariates. This provides insight for the user into which data provides what type of information and in what situations a particular data source is most useful."}}
{"id": "Nm8_ZWvfduo", "cdate": 1546300800000, "mdate": null, "content": {"title": "Effective graph sampling of a nonlinear image transform", "abstract": ""}}
{"id": "JSiKgsZKumH", "cdate": 1514764800000, "mdate": null, "content": {"title": "Introduction to the Special Issue \"Uncertainty in Remote Sensing Image Analysis\"", "abstract": "Open Access Editorial Introduction to the Special Issue “Uncertainty in Remote Sensing Image Analysis” by Alfred Stein 1,* , Yong Ge 2,3 and Inger Fabris-Rotelli 4 1 Faculty of Geo-information Science and Earth Observation (ITC), University of Twente, 7531 LG Enschede, The Netherlands 2 State Key Laboratory of Resources & Environmental Information System, Institute of Geographical Sciences and Natural Resources Research, Chinese Academy of Sciences, Beijing 100101, China 3 University of Chinese Academy of Sciences, Beijing 100049, China 4 Department of Statistics, University of Pretoria, Pretoria 0002, South Africa * Author to whom correspondence should be addressed. Remote Sens. 2018 , 10 (12), 1975; https://doi.org/10.3390/rs10121975 Received: 4 December 2018 / Accepted: 5 December 2018 / Published: 7 December 2018 (This article belongs to the Special Issue Uncertainty in Remote Sensing Image Analysis ) View Full-Text Download PDF Cite This Paper Excerpt Note: In lieu of an abstract, this is an excerpt from the first page. Images obtained from satellites are of an increasing resolution. [...] View Full-Text This is an open access article distributed under the Creative Commons Attribution License which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited Share and Cite MDPI and ACS Style Stein, A.; Ge, Y.; Fabris-Rotelli, I. Introduction to the Special Issue “Uncertainty in Remote Sensing Image Analysis”. Remote Sens. 2018 , 10 , 1975. AMA Style Stein A, Ge Y, Fabris-Rotelli I. Introduction to the Special Issue “Uncertainty in Remote Sensing Image Analysis”. Remote Sensing . 2018; 10(12):1975. Chicago/Turabian Style Stein, Alfred; Ge, Yong; Fabris-Rotelli, Inger. 2018. \"Introduction to the Special Issue “Uncertainty in Remote Sensing Image Analysis”.\" Remote Sens. 10, no. 12: 1975. Find Other Styles Show more citation formats Show less citations formats Note that from the first issue of 2016, MDPI journals use article numbers instead of page numbers. See further details here . Article Metrics No No Article Access Statistics For more information on the journal statistics, click here . Multiple requests from the same IP address are counted as one view. Abstract views Pdf views Html views Article Access Map by Country/Region 1 #trendmd-suggestions { padding: 0px 0px 2em; } #trendmd-suggestions .trendmd-widget { font-size: inherit !important; } .trendmd-widget-container:before, .trendmd-widget-container:after {content: none!important;} .trendmd-widget-footer { border-top: 0px !important; } .trendmd-widget-list { padding-left: 0px !important; } .trendmd-widget-footer-inner-bottom { overflow: auto; } .trendmd-widget-cookie-notification { padding: 10px 10px 10px 35px !important; background-color: #f5f5f5 !important; } .trendmd-widget-cookie-notification__info { line-height: inherit !important; } .trendmd-widget-cookie-notification:before { position: absolute; left: 10px; font-size: 18px; font-family: 'Material Icons'; content: \"error_outline\"; -webkit-font-feature-settings: 'liga'; color: #333333; } Related Articles Search more from Scilit Search"}}
{"id": "VGgteCZqqKk", "cdate": 1420070400000, "mdate": null, "content": {"title": "Pulse Reformation Algorithm for Leakage of Connected Operators", "abstract": ""}}
{"id": "HEwVTPblUJ", "cdate": 1262304000000, "mdate": null, "content": {"title": "Properties of the Discrete Pulse Transform for Multi-Dimensional Arrays", "abstract": "This report presents properties of the Discrete Pulse Transform on multi-dimensional arrays introduced by the authors two or so years ago. The main result given here in Lemma 2.1 is also formulated in a paper to appear in IEEE Transactions on Image Processing. However, the proof, being too technical, was omitted there and hence it appears in full in this publication."}}
{"id": "FS0caB73HNf", "cdate": 1262304000000, "mdate": null, "content": {"title": "LULU Operators and Discrete Pulse Transform for Multidimensional Arrays", "abstract": "The LULU operators for sequences, that is <i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Ln</i> , <i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Un</i> and their compositions, are extended to multidimensional arrays in a way which preserves their essential properties, e.g., consistent separation, total variation and shape preservation. The power of the operators is demonstrated by deriving the discrete pulse transform (DPT), which is a hierarchical decomposition of the input array into pulses. Similar to its 1-D counterpart this transform satisfies a basic consistency property."}}
{"id": "joM05PJCXEc", "cdate": 1199145600000, "mdate": null, "content": {"title": "Discrete Pulse Transform of Images", "abstract": "The Discrete Pulse Transform (DPT) of images is defined by using a new class of LULU operators on multidimensional arrays. This transform generalizes the DPT of sequences and replicates its essential properties, e.g. total variation preservation. Furthermore, the discrete pulses in the transform capture the contrast in the original image on the boundary of their supports. Since images are perceived via the contrast between neighbour pixels, the DPT may be a convenient new tool for image analysis."}}
