{"id": "DY4jQ_VQlIV", "cdate": 1546300800000, "mdate": 1649616542754, "content": {"title": "Identifying Distinctive Acoustic and Spectral Features in Parkinson's Disease", "abstract": "In this paper we try to identify spectral and acoustic features that are distinctive of Parkinson’s disease patients’ speech. We investigate the contribution of several features’ families to a simple classification task that distinguishes between two balanced groups — patients with Parkinson’s disease and their age and gender matched group of Healthy Controls, both uttering sustained vowels. We achieve over 75% correct classification using a combination of acoustic and spectral features. We show that combining a few statistical functionals of these features yields very good results. This can be explained by two reasons: the first is that the statistics of Parkinson’s disease patients’ speech defer from those of Healthy people’s speech; the second and more important one is the gradual nature of the Parkinsonian speech that is manifested by the changes within an utterance. We speculate that the feature families that most contribute to the classification task are the most distinctive for detecting the disease and suggest testing this hypothesis by performing long-term analysis of both patient and healthy control subjects. Similar accuracy is obtained when analyzing spontaneous speech where each utterance is represented by a single normalized i-vector."}}
{"id": "YJ9oa22YKAP", "cdate": 1514764800000, "mdate": 1649616542748, "content": {"title": "Prosodic Features' Criterion for Hebrew", "abstract": "Prosody provides important information about intention and meaning, and carries clues regarding dialogue turns, phrase emphasis and even the physiological or emotional condition of the speaker. Prosody has been researched extensively by linguists and speech scientists; However, little attention has been given to formulating and ranking the acoustic features that represent prosodic information. This paper aims at defining a simple methodology that allows us to test whether a feature conveys prosodic information. This way, we can compare different features and rate them as prosodic or content related (In this paper the word “content” refers to the verbal information of the utterance.). We explore many features using a Hebrew dataset especially designed for validating prosodic features, and as the first step of our research we chose two prosody classes: neutral and question. We apply our methodology successfully and find that prosodic features indeed are invariant to the content of the utterance, while correlating with prosodic manifestations. We validate our methodology by showing that our ranking of prosodic features yields similar results to classification based feature selection."}}
{"id": "SHLXoQdV1X", "cdate": 1514764800000, "mdate": 1649616542755, "content": {"title": "Incremental On-Line Clustering of Speakers' Short Segments", "abstract": "This paper deals with clustering of speakers’ short segments, in a scenario where additional segments continue to arrive and should be constantly clustered together with previous segments that were already clustered. In realistic applications, it is not possible to cluster all segments every time a new segment arrives. Hence, incremental clustering is applied in an on-line mode. New segments can either belong to existing speakers, therefore, have to be assigned to one of the existing clusters, or they could belong to new speakers and thus new clusters should be formed. In this work we show that if there are enough segments per speaker in the off-line initial clustering process, it constitutes a good starting point for the incremental on-line clustering. In this case, incremental on-line clustering can be successfully applied based on the previously proposed mean-shift clustering algorithm with PLDA score as a similarity measure and with k-nearest neighbors (kNN) neighborhood selection."}}
{"id": "yT6JSuiPbyA", "cdate": 1483228800000, "mdate": 1649616542763, "content": {"title": "PLDA-based mean shift speakers' short segments clustering", "abstract": "Highlights • Use of PLDA as a criterion to choose the best i-vectors for the new mean. • Replacing the constant threshold for as the i-vector's neighborhood by the kNN which dramatically increased the stability of the system. Abstract This paper extends upon a previous work using Mean Shift algorithm to perform speaker clustering on i-vectors generated from short speech segments. In this paper we examine the effectiveness of probabilistic linear discriminant analysis (PLDA) scoring as the metric of the mean shift clustering algorithm in the presence of different numbers of speakers. Our proposed method, combined with k-nearest neighbors (kNN) for bandwidth estimation, yields better and more robust results in comparison to the cosine similarity with fixed neighborhood bandwidth for clustering segments of large numbers of speakers. In the case of 30 speakers, we achieved significant improvement in cluster and speaker purity with the PLDA-based mean shift algorithm compared to the cosine-based baseline system."}}
{"id": "aYX81P3twM", "cdate": 1451606400000, "mdate": 1649616542752, "content": {"title": "Cross-language phoneme mapping for phonetic search keyword spotting using multiple source languages", "abstract": "Performing Phonetic Search Keyword Spotting (PS KWS) in new languages when language resources are scarce is an interesting and challenging task. In a previous paper we reported a methodology that enabled PS KWS under these conditions utilizing cross-language phoneme mappings from another sufficiently resourced and well-trained source language. We performed phoneme recognition in the new target language with the acoustic model of the source language. The keyword search was performed over a phoneme lattice of the target language phonemes following a mapping from one language to the other. In the present work we extend this method and its capabilities by mapping two source language phoneme sets into one target language set and performing a combined lattice search. Testing the technique on English and Arabic as source languages yielded a 50% Detection Rate (DR) and a False Alarm Rate (FAR - measured in number of false alarms per hour per keyword) of 2 when Spanish was the target language, a DR of 36% and FAR of 4 when Dari was the target language and a DR of 35% and FAR of 6 with Farsi as the target language. These results indicate that combining two source languages is better than using a single language since the acoustic space is better represented. Searching in a combined lattice while employing adequate phoneme transformations significantly improves performance. Such a system can be used as an initial version of a PS KWS system in a new language when sufficient language resources are not available."}}
{"id": "6q8IT0wZFHQ", "cdate": 1451606400000, "mdate": 1649616542755, "content": {"title": "Intra-cluster training strategy for deep learning with applications to language identification", "abstract": "In this study we address the problem of training a neural network for language identification using speech samples in the form of i-vectors. Our approach involves training a classifier and analyzing the obtained confusion matrix. We cluster the languages by simultaneously clustering the columns and the rows of the confusion matrix. The language clusters are then used to define a modified cost function for training a neural-network that focuses on distinguishing between the true language and languages within the same cluster. The results show enhanced language identification on the NIST 2015 language identification dataset."}}
{"id": "-fJrB20EazY", "cdate": 1451606400000, "mdate": 1649616542770, "content": {"title": "On the Use of PLDA i-vector Scoring for Clustering Short Segments", "abstract": "This paper extends upon a previous work using Mean Shift algorithm to perform speaker clustering on i-vectors generated from short speech segments. In this paper we examine the effectiveness of probabilistic linear discriminant analysis (PLDA) scoring as the metric of the mean shift clustering algorithm in the presence of different number of speakers. Our proposed method, combined with k-nearest neighbors (kNN) for bandwidth estimation, yields better and more robust results in comparison to the cosine similarity with fixed neighborhood bandwidth for clustering segments of large number of speakers. In the case of 30 speakers, we achieved evaluation parameter of 72.1 with the PLDA-based mean shift algorithm compared to 65.9 with the cosine-based baseline system."}}
{"id": "hDARMZaKSa", "cdate": 1420070400000, "mdate": 1649616542758, "content": {"title": "Cross-language phoneme mapping for phonetic search keyword spotting in continuous speech of under-resourced languages", "abstract": "As automatic speech recognition-based applications become increasingly common in a wide variety of market segments, thereis a growing need to support more languages. However, for many languages, the language resources needed to train speechrecognition engines are either limited or completely non-existent, and the process of acquiring or constructing new languageresources is both long and costly. This paper suggests a methodology that enables Phonetic Search Keyword Spotting to beimplemented in a large speech database of any given under-resourced language using cross-language phoneme mappings toanother language. The phoneme mapping enables a speech recognition engine from a sufficiently resourced and well-trainedsource language to be used for phoneme recognition in the new target language. The keyword search is then performed overa lattice of target language phonemes. Three cross-language phoneme mapping techniques are examined: knowledge-based,data-driven and phoneme recognition performance-based. The results suggest that Phonetic Search Keyword Spotting basedon the cross-language phoneme mapping approach proposed herein can serve as a quick initial solution for validating keywordspotting applications in new, under-resourced languages."}}
{"id": "S7MagbSeHHn", "cdate": 1420070400000, "mdate": 1649616542759, "content": {"title": "Clustering short push-to-talk segments", "abstract": ""}}
{"id": "Cne-GUGVETX", "cdate": 946684800000, "mdate": 1649616542762, "content": {"title": "Complex dynamics of neuronal thresholds", "abstract": "We study an integrate and fire model of an adapting neuron. Using two dynamic thresholds, we account for the complex long-term behavior of single neurons under periodic pulsed inputs. We find that the pattern of temporal response is that of a staircase of inter-spike interval values. The characteristic time scales of transitions between these ISI values are of the order of tens of seconds. The temporal behavior of our system can be described as a path through the two-dimensional phase space of dynamic thresholds."}}
