{"id": "KZ1Hz4oOMI0", "cdate": 1588834425885, "mdate": null, "content": {"title": "Rank optimality for the Burer-Monteiro factorization", "abstract": "When solving large scale semidefinite programs that admit a low-rank solution, a very efficient heuristic is the Burer-Monteiro factorization: Instead of optimizing over the full matrix, one optimizes over its low-rank factors. This strongly reduces the number of variables to optimize, but destroys the convexity of the problem, thus possibly introducing spurious second-order critical points which can prevent local optimization algorithms from finding the solution. Boumal, Voroninski, and Bandeira [2018] have recently shown that, when the size of the factors is of the order of the square root of the number of linear constraints, this does not happen: For almost any cost matrix, second-order critical points are global solutions. In this article, we show that this result is essentially tight: For smaller values of the size, second-order critical points are not generically optimal, even when considering only semidefinite programs with a rank 1 solution."}}
{"id": "7MtqEg94_3V", "cdate": 1588834340601, "mdate": null, "content": {"title": "Exponential decay of scattering coefficients", "abstract": "The scattering transform is a deep representation, defined as a cascade of wavelet transforms followed by the application of a complex modulus. In her PhD, the author showed that, under some conditions on the wavelets, the norm of the scattering coefficients at a given layer only depends on the values of the signal outside a frequency band whose size is exponential in the depth of the layer. We give here a succinct presentation of this result, and slightly generalize it by removing one of the assumptions on the wavelets (namely the weak analyticity condition)."}}
{"id": "Fht-3Hm9NZ", "cdate": 1588834264457, "mdate": null, "content": {"title": "Phase retrieval with random Gaussian sensing vectors by alternating projections", "abstract": "We consider a phase retrieval problem, where we want to reconstruct a n-dimensional vector from its phaseless scalar products with m sensing vectors, independently sampled from complex normal distributions. We show that, with a suitable initalization procedure, the classical algorithm of alternating projections succeeds with high probability when m ≥ Cn, for some C > 0. We conjecture that this result is still true when no special initialization procedure is used, and present numerical experiments that support this conjecture."}}
{"id": "wB6ZkD5um9a", "cdate": 1588834183013, "mdate": null, "content": {"title": "Phase retrieval for imaging problems", "abstract": "We study convex relaxation algorithms for phase retrieval on imaging problems. We show that exploiting structural assumptions on the signal and the observations, such as sparsity, smoothness or positivity, can significantly speed-up convergence and improve recovery performance. We detail numerical results in molecular imaging experiments simulated using data from the Protein Data Bank (PDB)."}}
{"id": "DsqfRA3bd_", "cdate": 1588833978267, "mdate": null, "content": {"title": "Wavelet methods for shape perception in electro-sensing", "abstract": "This paper aims at presenting a new approach to the electro-sensing problem using wavelets. It provides an efficient algorithm for recognizing the shape of a target from micro-electrical impedance measurements. Stability and resolution capabilities of the proposed algorithm are quantified in numerical simulations."}}
{"id": "7m9hXnUvkQp", "cdate": 1588833812257, "mdate": null, "content": {"title": "Phase retrieval for wavelet transforms", "abstract": "This article describes a new algorithm that solves a particular phase retrieval problem, with important applications in audio processing: the reconstruction of a function from its scalogram, that is, from the modulus of its wavelet transform.\nIt is a multiscale iterative algorithm, that reconstructs the signal from low to high frequencies. It relies on a new reformulation of the phase retrieval problem, that involves the holomorphic extension of the wavelet transform. This reformulation allows to propagate phase information from low to high frequencies.\nNumerical results, on audio and non-audio signals, show that reconstruction is precise and stable to noise. The complexity of the algorithm is linear in the size of the signal, up to logarithmic factors. It can thus be applied to large signals."}}
{"id": "Be4rzvhmCAo", "cdate": 1588833714932, "mdate": null, "content": {"title": "Phase retrieval for the Cauchy wavelet transform", "abstract": "We consider the phase retrieval problem in which one tries to reconstruct a function from the modulus of its wavelet transform. We study the unicity and stability of the reconstruction.\nIn the case where the wavelets are Cauchy wavelets, we prove that the modulus of the wavelet transform uniquely determines the function up to a global phase. We show that the reconstruction operator is continuous but not uniformly continuous. We describe how to construct pairs of functions which are far away in L 2 -norm but whose wavelet transforms are very close, in modulus. The principle is to modulate the wavelet transform of a fixed initial function by a phase which varies slowly in both time and frequency. This construction seems to cover all the instabilities that we observe in practice; we give a partial formal justification to this fact.\nFinally, we describe an exact reconstruction algorithm and use it to numerically confirm our analysis of the stability question."}}
{"id": "uQjhCAdptOY", "cdate": 1588833594987, "mdate": null, "content": {"title": "Phase recovery, MaxCut and complex semidefinite programming", "abstract": "Phase retrieval seeks to recover a signal x ∈ C p from the amplitude |Ax| of linear measurements Ax ∈ C n . We cast the phase retrieval problem as a non-convex quadratic program over a complex phase vector and formulate a tractable relaxation (called PhaseCut) similar to the classical MaxCut semidefinite program. We solve this problem using a provably convergent block coordinate descent algorithm whose structure is similar to that of the original greedy algorithm in Gerchberg and Saxton [1972], where each iteration is a matrix vector product. Numerical results show the performance of this approach over three different phase retrieval problems, in comparison with greedy phase retrieval algorithms and matrix completion formulations."}}
{"id": "C6mOr40YRD", "cdate": 1420070400000, "mdate": null, "content": {"title": "Wavelet transform modulus : phase retrieval and scattering. (Transformée en ondelettes : reconstruction de phase et de scattering)", "abstract": "Automatically understanding the content of a natural signal, like a sound or an image, is in general a difficult task. In their naive representation, signals are indeed complicated objects, belonging to high-dimensional spaces. With a different representation, they can however be easier to interpret. This thesis considers a representation commonly used in these cases, in particular for theanalysis of audio signals: the modulus of the wavelet transform. To better understand the behaviour of this operator, we study, from a theoretical as well as algorithmic point of view, the corresponding inverse problem: the reconstruction of a signal from the modulus of its wavelet transform. This problem belongs to a wider class of inverse problems: phase retrieval problems. In a first chapter, we describe a new algorithm, PhaseCut, which numerically solves a generic phase retrieval problem. Like the similar algorithm PhaseLift, PhaseCut relies on a convex relaxation of the phase retrieval problem, which happens to be of the same form as relaxations of the widely studied problem MaxCut. We compare the performances of PhaseCut and PhaseLift, in terms of precision and complexity. In the next two chapters, we study the specific case of phase retrieval for the wavelet transform. We show that any function with no negative frequencies is uniquely determined (up to a global phase) by the modulus of its wavelet transform, but that the reconstruction from the modulus is not stable to noise, for a strong notion of stability. However, we prove a local stability property. We also present a new non-convex phase retrieval algorithm, which is specific to the case of the wavelet transform, and we numerically study its performances. Finally, in the last two chapters, we study a more sophisticated representation, built from the modulus of the wavelet transform: the scattering transform. Our goal is to understand which properties of a signal are characterized by its scattering transform. We first prove that the energy of scattering coefficients of a signal, at a given order, is upper bounded by the energy of the signal itself, convolved with a high-pass filter that depends on the order. We then study a generalization of the scattering transform, for stationary processes. We show that, in finite dimension, this generalized transform preserves the norm. In dimension one, we also show that the generalized scattering coefficients of a process characterize the tail of its distribution."}}
