{"id": "A4xNCe1ETFC", "cdate": 1609459200000, "mdate": 1628151530054, "content": {"title": "Convergent Communication, Sensing and Localization in 6G Systems: An Overview of Technologies, Opportunities and Challenges", "abstract": "Herein, we focus on convergent 6G communication, localization and sensing systems by identifying key technology enablers, discussing their underlying challenges, implementation issues, and recommending potential solutions. Moreover, we discuss exciting new opportunities for integrated localization and sensing applications, which will disrupt traditional design principles and revolutionize the way we live, interact with our environment, and do business. Regarding potential enabling technologies, 6G will continue to develop towards even higher frequency ranges, wider bandwidths, and massive antenna arrays. In turn, this will enable sensing solutions with very fine range, Doppler, and angular resolutions, as well as localization to cm-level degree of accuracy. Besides, new materials, device types, and reconfigurable surfaces will allow network operators to reshape and control the electromagnetic response of the environment. At the same time, machine learning and artificial intelligence will leverage the unprecedented availability of data and computing resources to tackle the biggest and hardest problems in wireless communication systems. As a result, 6G will be truly intelligent wireless systems that will provide not only ubiquitous communication but also empower high accuracy localization and high-resolution sensing services. They will become the catalyst for this revolution by bringing about a unique new set of features and service capabilities, where localization and sensing will coexist with communication, continuously sharing the available resources in time, frequency, and space. This work concludes by highlighting foundational research challenges, as well as implications and opportunities related to privacy, security, and trust."}}
{"id": "-YITaOjizL", "cdate": 1609459200000, "mdate": 1682350858618, "content": {"title": "Ontology-based Framework for Integration of Time Series Data: Application in Predictive Analytics on Data Center Monitoring Metrics", "abstract": ""}}
{"id": "vHIsb8HtPRa", "cdate": 1577836800000, "mdate": 1628151529910, "content": {"title": "Better Classifier Calibration for Small Data Sets", "abstract": "Classifier calibration does not always go hand in hand with the classifier's ability to separate the classes. There are applications where good classifier calibration, i.e. the ability to produce accurate probability estimates, is more important than class separation. When the amount of data for training is limited, the traditional approach to improve calibration starts to crumble. In this article we show how generating more data for calibration is able to improve calibration algorithm performance in many cases where a classifier is not naturally producing well-calibrated outputs and the traditional approach fails. The proposed approach adds computational cost but considering that the main use case is with small data sets this extra computational cost stays insignificant and is comparable to other methods in prediction time. From the tested classifiers the largest improvement was detected with the random forest and naive Bayes classifiers. Therefore, the proposed approach can be recommended at least for those classifiers when the amount of data available for training is limited and good calibration is essential."}}
{"id": "tF8_5wUzI1E", "cdate": 1577836800000, "mdate": 1628151530056, "content": {"title": "6G White Paper on Localization and Sensing", "abstract": "This white paper explores future localization and sensing opportunities for beyond 5G wireless communication systems by identifying key technology enablers and discussing their underlying challenges, implementation issues, and identifying potential solutions. In addition, we present exciting new opportunities for localization and sensing applications, which will disrupt traditional design principles and revolutionize the way we live, interact with our environment, and do business. Following the trend initiated in the 5G NR systems, 6G will continue to develop towards even higher frequency ranges, wider bandwidths, and massive antenna arrays. In turn, this will enable sensing solutions with very fine range, Doppler and angular resolutions, as well as localization to cm-level degree of accuracy. Moreover, new materials, device types, and reconfigurable surfaces will allow network operators to reshape and control the electromagnetic response of the environment. At the same time, machine learning and artificial intelligence will leverage the unprecedented availability of data and computing resources to tackle the biggest and hardest problems in wireless communication systems. 6G will be truly intelligent wireless systems that will not only provide ubiquitous communication but also empower high accuracy localization and high-resolution sensing services. They will become the catalyst for this revolution by bringing about a unique new set of features and service capabilities, where localization and sensing will coexist with communication, continuously sharing the available resources in time, frequency and space. This white paper concludes by highlighting foundational research challenges, as well as implications and opportunities related to privacy, security, and trust. Addressing these challenges will undoubtedly require an inter-disciplinary and concerted effort from the research community."}}
{"id": "XXMhhSBZ4d7", "cdate": 1577836800000, "mdate": 1628151530049, "content": {"title": "Better Classifier Calibration for Small Datasets", "abstract": "Classifier calibration does not always go hand in hand with the classifier’s ability to separate the classes. There are applications where good classifier calibration, i.e., the ability to produce accurate probability estimates, is more important than class separation. When the amount of data for training is limited, the traditional approach to improve calibration starts to crumble. In this article, we show how generating more data for calibration is able to improve calibration algorithm performance in many cases where a classifier is not naturally producing well-calibrated outputs and the traditional approach fails. The proposed approach adds computational cost but considering that the main use case is with small datasets this extra computational cost stays insignificant and is comparable to other methods in prediction time. From the tested classifiers, the largest improvement was detected with the random forest and naive Bayes classifiers. Therefore, the proposed approach can be recommended at least for those classifiers when the amount of data available for training is limited and good calibration is essential."}}
{"id": "X4xa33VEp4", "cdate": 1577836800000, "mdate": 1628151530053, "content": {"title": "6G White Paper on Machine Learning in Wireless Communication Networks", "abstract": "The focus of this white paper is on machine learning (ML) in wireless communications. 6G wireless communication networks will be the backbone of the digital transformation of societies by providing ubiquitous, reliable, and near-instant wireless connectivity for humans and machines. Recent advances in ML research has led enable a wide range of novel technologies such as self-driving vehicles and voice assistants. Such innovation is possible as a result of the availability of advanced ML models, large datasets, and high computational power. On the other hand, the ever-increasing demand for connectivity will require a lot of innovation in 6G wireless networks, and ML tools will play a major role in solving problems in the wireless domain. In this paper, we provide an overview of the vision of how ML will impact the wireless communication systems. We first give an overview of the ML methods that have the highest potential to be used in wireless networks. Then, we discuss the problems that can be solved by using ML in various layers of the network such as the physical layer, medium access layer, and application layer. Zero-touch optimization of wireless networks using ML is another interesting aspect that is discussed in this paper. Finally, at the end of each section, important research questions that the section aims to answer are presented."}}
{"id": "LDDsNpe99C", "cdate": 1577836800000, "mdate": 1628151529951, "content": {"title": "Better Multi-class Probability Estimates for Small Data Sets", "abstract": "Many classification applications require accurate probability estimates in addition to good class separation but often classifiers are designed focusing only on the latter. Calibration is the process of improving probability estimates by post-processing but commonly used calibration algorithms work poorly on small data sets and assume the classification task to be binary. Both of these restrictions limit their real-world applicability. Previously introduced Data Generation and Grouping algorithm alleviates the problem posed by small data sets and in this article, we will demonstrate that its application to multi-class problems is also possible which solves the other limitation. Our experiments show that calibration error can be decreased using the proposed approach and the additional computational cost is acceptable."}}
{"id": "IMJJ0w61UKe", "cdate": 1514764800000, "mdate": 1628151530212, "content": {"title": "Getting More Out of Small Data Sets - Improving the Calibration Performance of Isotonic Regression by Generating More Data", "abstract": ""}}
{"id": "HGN2xFfATmg", "cdate": 1451606400000, "mdate": 1628151530054, "content": {"title": "Spectrum Occupancy Measurements: A Survey and Use of Interference Maps", "abstract": "In order to provide meaningful data about spectrum use, occupancy measurements describing the utilization rate of a specific frequency band should be conducted over a specific area instead of a single location. This paper presents a comprehensive methodology for the measurement and analysis of spectrum occupancy. This paper surveys spectrum measurement campaigns and associated interference maps, introducing the latter as a tool for spectrum analysis and management based on measurement data. An interference map characterizes the spectrum use by defining the level of interference over an area of interest in a certain frequency band. Building on findings from practical measurement studies, guidelines for spectrum occupancy measurements are given. While many scientific spectrum occupancy measurement papers tend to be too optimistic about the significance and generality of the results, we propose a cautionary perspective on drawing strong conclusions based on the often limited amount of data gathered. The different phases of the spectrum occupancy measurement and analysis process are described and a thorough discussion of interpolation methods is provided. Means to improve the measurement accuracy are discussed, especially regarding spatial domain considerations and the impact of the sampling interval on the results. A practical example of an improved measurement system design covering all the phases of the measurement process and used at the Turku, Finland; Blacksburg, VA, USA; and Chicago, IL, USA, spectrum observatories is given. Using the improved design, more realistic spectrum occupancy data can be obtained to lay the foundation for spectrum management decisions."}}
{"id": "B3fzYjgPK1E", "cdate": 1451606400000, "mdate": 1628151530039, "content": {"title": "Instance Level Classification Confidence Estimation", "abstract": "Often the confidence of a classification prediction can be as important as the prediction itself although current classification confidence measures are not necessarily consistent between different data sets. Thus in this paper, we present an algorithm to predict instance level classification confidence that is more consistent between data sets and is intuitive to interpret. The results with five test cases show high correlation between true and predicted classification rate, i.e. the probability of assigning the correct class label, thus proving the validity of the proposed algorithm."}}
