{"id": "HkWb4DW_bS", "cdate": 1451606400000, "mdate": null, "content": {"title": "A Multi-step Inertial Forward-Backward Splitting Method for Non-convex Optimization", "abstract": "In this paper, we propose a multi-step inertial Forward--Backward splitting algorithm for minimizing the sum of two non-necessarily convex functions, one of which is proper lower semi-continuous while the other is differentiable with a Lipschitz continuous gradient. We first prove global convergence of the scheme with the help of the Kurdyka–Łojasiewicz property. Then, when the non-smooth part is also partly smooth relative to a smooth submanifold, we establish finite identification of the latter and provide sharp local linear convergence analysis. The proposed method is illustrated on a few problems arising from statistics and machine learning."}}
{"id": "H1-nAD-OWH", "cdate": 1451606400000, "mdate": null, "content": {"title": "Sparse Support Recovery with Non-smooth Loss Functions", "abstract": "In this paper, we study the support recovery guarantees of underdetermined sparse regression using the $\\ell_1$-norm as a regularizer and a non-smooth loss function for data fidelity. More precisely, we focus in detail on the cases of $\\ell_1$ and $\\ell_\\infty$ losses, and contrast them with the usual $\\ell_2$ loss.While these losses are routinely used to account for either sparse ($\\ell_1$ loss) or uniform ($\\ell_\\infty$ loss) noise models, a theoretical analysis of their performance is still lacking. In this article, we extend the existing theory from the smooth $\\ell_2$ case to these non-smooth cases. We derive a sharp condition which ensures that the support of the vector to recover is stable to small additive noise in the observations, as long as the loss constraint size is tuned proportionally to the noise level. A distinctive feature of our theory is that it also explains what happens when the support is unstable. While the support is not stable anymore, we identify an \"extended support\" and show that this extended support is stable to small additive noise. To exemplify the usefulness of our theory, we give a detailed numerical analysis of the support stability/instability of compressed sensing recovery with these different losses. This highlights different parameter regimes, ranging from total support stability to progressively increasing support instability."}}
{"id": "rJWoruWdWS", "cdate": 1388534400000, "mdate": null, "content": {"title": "Local Linear Convergence of Forward-Backward under Partial Smoothness", "abstract": "In this paper, we consider the Forward--Backward proximal splitting algorithm to minimize the sum of two proper closed convex functions, one of which having a Lipschitz continuous gradient and the other being partly smooth relatively to an active manifold $\\mathcal{M}$. We propose a generic framework in which we show that the Forward--Backward (i) correctly identifies the active manifold $\\mathcal{M}$ in a finite number of iterations, and then (ii) enters a local linear convergence regime that we characterize precisely. This gives a grounded and unified explanation to the typical behaviour that has been observed numerically for many problems encompassed in our framework, including the Lasso, the group Lasso, the fused Lasso and the nuclear norm regularization to name a few. These results may have numerous applications including in signal/image processing processing, sparse recovery and machine learning."}}
{"id": "SJ-F8vZ_ZS", "cdate": 1325376000000, "mdate": null, "content": {"title": "A quasi-Newton proximal splitting method", "abstract": "We describe efficient implementations of the proximity calculation for a useful class of functions; the implementations exploit the piece-wise linear nature of the dual problem. The second part of the paper applies the previous result to acceleration of convex minimization problems, and leads to an elegant quasi-Newton method. The optimization method compares favorably against state-of-the-art alternatives. The algorithm has extensive applications including signal processing, sparse regression and recovery, and machine learning and classification."}}
{"id": "SyZ6iJz_br", "cdate": 1136073600000, "mdate": null, "content": {"title": "Wire Structure Pattern Extraction and Tracking From X-Ray Images of Composite Mechanisms", "abstract": "This paper introduces a complete pipeline of image processing methods in order to analyze and track the internal structures of a composite material. As a first step, input Xray images are denoised, enhanced, separated into different morphological components, and geometrically filtered in order to isolate the interesting fiber inside the composite material. This requires the design of specific algorithms preserving very thin image details while being able to remove undesired image regions that may be sometimes large. For this purpose, we use state-of the-art techniques based on recent achievements in diffusion PDE’s and modern harmonic analysis tools. Then, the shapes of the remaining fibered composite are individually analyzed by the use of a tensor-based tracking algorithm. We illustrate how this set of techniques allows the dynamic analysis of the composite structure when submitted to external mechanical loads."}}
