{"id": "ZmaTC71IS0b", "cdate": 1690848000000, "mdate": 1695972502247, "content": {"title": "Deep Learning OFDM Receivers for Improved Power Efficiency and Coverage", "abstract": "In this article, we propose multiple machine learning (ML) based physical-layer receiver solutions for demodulating orthogonal frequency-division multiplexing (OFDM) signals that are subject to high level of nonlinear distortion. Specifically, three novel deep learning based convolutional neural network receivers are devised, containing layers in time- and/or frequency-domains, allowing to demodulate and decode the transmitted bits reliably despite the high error vector magnitude (EVM) in the transmit signal. Applicable training procedures are also described, such that the learned layers in the receiver processing properly generalize over different nonlinear distortion and multipath channel characteristics. Extensive set of numerical results is provided, in the context of 5G NR uplink (UL) incorporating also measured terminal power amplifier (PA) characteristics. The obtained results show that the proposed receiver systems are able to clearly outperform the classical linear minimum mean-squared error (LMMSE) receiver as well as the existing ML receiver approaches, especially when the EVM is high compared to modulation order. This is particularly so when the devised ML receiver is of hybrid nature with layers both in time and frequency. The proposed ML receivers can thus facilitate pushing the terminal PA systems deeper into saturation, and thereon improve the terminal power-efficiency, radiated power and network coverage. Through combining the obtained radio link performance results with link budget calculations, all carried out at the 28GHz mmWave band, it is shown that the proposed ML receivers can enhance the network coverage in terms of maximum UL link distances by close to 100%, when compared to classical LMMSE receiver based networks."}}
{"id": "o2BvaYMzSW", "cdate": 1677628800000, "mdate": 1682338394202, "content": {"title": "DeepTx: Deep Learning Beamforming With Channel Prediction", "abstract": ""}}
{"id": "t0YBaTEZqi", "cdate": 1640995200000, "mdate": 1682338394206, "content": {"title": "DeepTx: Deep Learning Beamforming with Channel Prediction", "abstract": ""}}
{"id": "EdseFrRHKE", "cdate": 1640995200000, "mdate": 1682338394209, "content": {"title": "Waveform Learning for Reduced Out-of-Band Emissions Under a Nonlinear Power Amplifier", "abstract": ""}}
{"id": "Lv6JYugHl6", "cdate": 1620565747614, "mdate": null, "content": {"title": "Deep learning for prediction of cardiac indices from photoplethysmographic waveform: A virtual database approach", "abstract": "Deep learning methods combined with large datasets have recently shown significant progress in solving several medical tasks. However, collecting and annotating large datasets can be a very cumbersome and expensive task. We tackle these problems with a virtual database approach where training data is generated using computer simulations of related phenomena. Specifically, we concentrate on the following problem: can cardiovascular indices such as aortic elasticity, diastolic and systolic blood pressures, and blood flow from heart be predicted continuously using wearable photoplethysmographic sensors? We simulate the blood flow using a haemodynamic model consisting of the entire human circulation. Repeated evaluation of the simulator allows us to create a database of “virtual subjects” with size that is only limited by available computational resources. Using this database, we train neural networks to predict the cardiac indices from photoplethysmographic signal waveform. We consider two approaches: neural networks based on predefined input features and deep convolutional neural networks taking waveform directly as the input. The performance of the methods is demonstrated using numerical examples, thus carrying out a preliminary assessment of the approaches. The results show improvements in accuracy compared with the previous methods. The improvements are especially significant with indices related to aortic elasticity and maximum blood flow. The proposed approach would provide new means to measure cardiovascular health continuously, for example, with a simple wrist device."}}
{"id": "ULH2my5MZNZ", "cdate": 1620565438832, "mdate": null, "content": {"title": "Pulse transit time estimation of aortic pulse wave velocity and blood pressure using machine learning and simulated training data", "abstract": "Recent developments in cardiovascular modelling allow us to simulate blood flow in an entire human body. Such model can also be used to create databases of virtual subjects, with sizes limited only by computational resources. In this work, we study if it is possible to estimate cardiovascular health indices using machine learning approaches. In particular, we carry out theoretical assessment of estimating aortic pulse wave velocity, diastolic and systolic blood pressure and stroke volume using pulse transit/arrival timings derived from photopletyshmography signals. For predictions, we train Gaussian process regression using a database of virtual subjects generated with a cardiovascular simulator. Simulated results provides theoretical assessment of accuracy for predictions of the health indices. For instance, aortic pulse wave velocity can be estimated with a high accuracy (r > 0.9) when photopletyshmography is measured from left carotid artery using a combination of foot-to-foot pulse transmit time and peak location derived for the predictions. Similar accuracy can be reached for diastolic blood pressure, but predictions of systolic blood pressure are less accurate (r > 0.75) and the stroke volume predictions are mostly contributed by heart rate."}}
{"id": "dg7JLFDDUPK", "cdate": 1620565134422, "mdate": null, "content": {"title": "Deep convolutional neural networks for estimating porous material parameters with ultrasound tomography", "abstract": "The feasibility of data based machine learning applied to ultrasound tomography is studied to estimate water-saturated porous material parameters. In this work, the data to train the neural networks is simulated by solving wave propagation in coupled poroviscoelastic-viscoelastic-acoustic media. As the forward model, a high-order discontinuous Galerkin method is considered, while deep convolutional neural networks are used to solve the parameter estimation problem. In the numerical experiment, the material porosity and tortuosity is estimated, while the remaining parameters which are of less interest are successfully marginalized in the neural networks-based inversion. Computational examples confirm the feasibility and accuracy of this approach.\n"}}
{"id": "zpJr0EnF2Ye", "cdate": 1620564732710, "mdate": null, "content": {"title": "Estimation of groundwater storage from seismic data using deep learning", "abstract": "Convolutional neural networks can provide a potential framework to characterize groundwater storage from seismic data. Estimation of key components, such as the amount of groundwater stored in an aquifer and delineate water table level, from active‐source seismic data are performed in this study. The data to train, validate and test the neural networks are obtained by solving wave propagation in a coupled poroviscoelastic–elastic media. A discontinuous Galerkin method is applied to model wave propagation, whereas a deep convolutional neural network is used for the parameter estimation problem. In the numerical experiment, the primary unknowns estimated are the amount of stored groundwater and water table level, while the remaining parameters, assumed to be of less of interest, are marginalized in the convolutional neural network‐based solution. Results, obtained through synthetic data, illustrate the potential of deep learning methods to extract additional aquifer information from seismic data, which otherwise would be impossible based on a set of reflection seismic sections or velocity tomograms"}}
{"id": "jU91KYI2cgr", "cdate": 1609459200000, "mdate": 1631090087824, "content": {"title": "DeepRx MIMO: Convolutional MIMO Detection with Learned Multiplicative Transformations", "abstract": "Recently, deep learning has been proposed as a potential technique for improving the physical layer performance of radio receivers. Despite the large amount of encouraging results, most works have not considered spatial multiplexing in the context of multiple-input and multiple-output (MIMO) receivers. In this paper, we present a deep learning-based MIMO receiver architecture that consists of a ResNet-based convolutional neural network, also known as DeepRx, combined with a so-called transformation layer, all trained together. We propose two novel alternatives for the transformation layer: a maximal ratio combining-based transformation, or a fully learned transformation. The former relies more on expert knowledge, while the latter utilizes learned multiplicative layers. Both proposed transformation layers are shown to clearly outperform the conventional baseline receiver, especially with sparse pilot configurations. To the best of our knowledge, these are some of the first results showing such high performance for a fully learned MIMO receiver."}}
{"id": "Sq_pHftBOcR", "cdate": 1609459200000, "mdate": 1682338383886, "content": {"title": "Deep Learning Based OFDM Physical-Layer Receiver for Extreme Mobility", "abstract": ""}}
