{"id": "lmLRNZU0MY", "cdate": 1681833045301, "mdate": null, "content": {"title": "Automatically Marginalized MCMC in Probabilistic Programming", "abstract": "Hamiltonian Monte Carlo (HMC) is a powerful algorithm to sample latent variables from Bayesian models. The advent of probabilistic programming languages (PPLs) frees users from writing inference algorithms and lets users focus on modeling. However, many models are difficult for HMC to solve directly, which often require tricks like model reparameterization. We propose to use automatic marginalization as part of the sampling process using HMC in a graphical model extracted from a PPL, which substantially improves sampling from real-world hierarchical models."}}
{"id": "noZlE2NW1EA", "cdate": 1681833044236, "mdate": null, "content": {"title": "Sample Average Approximation for Black-Box VI", "abstract": "We present a novel approach for black-box VI that bypasses the difficulties of stochastic gradient ascent, including the task of selecting step-sizes.\nOur approach involves using a sequence of sample average approximation (SAA) problems.\nSAA approximates the solution of stochastic optimization problems by transforming them into deterministic ones. \nWe use quasi-Newton methods and line search to solve each deterministic optimization problem and present a heuristic policy to automate hyperparameter selection. \nOur experiments show that our method simplifies the VI problem and achieves faster performance than existing methods."}}
{"id": "oPQBinIjBt", "cdate": 1665601708885, "mdate": null, "content": {"title": "On Possible Extensions to the Smalltalk Syntax", "abstract": "Even though changing it is fairly easy, the Smalltalk syntax has remained essentially stable for many decades. The reason is that people are cautious about side effects that could mess up something provably good. This doesn't mean that there aren't variations one might propose, but that the real task is to identify a coherent, non-distorting, set of extensions that increase the expressiveness of the language in favor of new possibilities related to areas such as interoperability, formal reasoning and mathematics."}}
{"id": "4hthTrA5MZD", "cdate": 1637576009128, "mdate": null, "content": {"title": "U-Statistics for Importance-Weighted Variational Inference", "abstract": "We propose the use of U-statistics to estimate the (gradients of) the importance-weighted evidence lower bound (IW-ELBO), a variational objective that uses multiple samples from a proposal distribution to lower-bound the log-likelihood.\nWe propose a complete U-statistic estimator, which has variance that is never higher than the standard IW-ELBO estimator, and, under certain conditions, the lowest variance of any unbiased estimator.\nHowever, it requires evaluating the objective on a large number of subsets of samples from the proposal distribution, which can be computationally expensive.\nWe propose to use incomplete U-statistics as practical alternatives.\nWe find empirically that both methods reduce estimator variance for its gradients with little computational cost, and lead to faster optimization."}}
{"id": "lwucW9PxZzK", "cdate": 1546300800000, "mdate": null, "content": {"title": "Inference of Demographic Attributes based on Mobile Phone Usage Patterns and Social Network Topology", "abstract": "Mobile phone usage provides a wealth of information, which can be used to better understand the demographic structure of a population. In this paper, we focus on the population of Mexican mobile phone users. We first present an observational study of mobile phone usage according to gender and age groups. We are able to detect significant differences in phone usage among different subgroups of the population. We then study the performance of different machine learning (ML) methods to predict demographic features (namely, age and gender) of unlabeled users by leveraging individual calling patterns, as well as the structure of the communication graph. We show how a specific implementation of a diffusion model, harnessing the graph structure, has significantly better performance over other node-based standard ML methods. We provide details of the methodology together with an analysis of the robustness of our results to changes in the model parameters. Furthermore, by carefully examining the topological relations of the training nodes (seed nodes) to the rest of the nodes in the network, we find topological metrics which have a direct influence on the performance of the algorithm."}}
{"id": "RFjhl27Twof", "cdate": 1546300800000, "mdate": null, "content": {"title": "Soft Constraints for Inference with Declarative Knowledge.", "abstract": "We develop a likelihood free inference procedure for conditioning a probabilistic model on a predicate. A predicate is a Boolean valued function which expresses a yes/no question about a domain. Our contribution, which we call predicate exchange, constructs a softened predicate which takes value in the unit interval [0, 1] as opposed to a simply true or false. Intuitively, 1 corresponds to true, and a high value (such as 0.999) corresponds to \"nearly true\" as determined by a distance metric. We define Boolean algebra for soft predicates, such that they can be negated, conjoined and disjoined arbitrarily. A softened predicate can serve as a tractable proxy to a likelihood function for approximate posterior inference. However, to target exact inference, we temper the relaxation by a temperature parameter, and add a accept/reject phase use to replica exchange Markov Chain Mont Carlo, which exchanges states between a sequence of models conditioned on predicates at varying temperatures. We describe a lightweight implementation of predicate exchange that it provides a language independent layer that can be implemented on top of existingn modeling formalisms."}}
{"id": "HJZU0cbuWH", "cdate": 1546300800000, "mdate": null, "content": {"title": "Predicate Exchange: Inference with Declarative Knowledge", "abstract": "Programming languages allow us to express complex predicates, but existing inference methods are unable to condition probabilistic models on most of them. To support a broader class of predicates, ..."}}
{"id": "29dDyU6BoV", "cdate": 1546300800000, "mdate": null, "content": {"title": "The Random Conditional Distribution for Higher-Order Probabilistic Inference.", "abstract": "The need to condition distributional properties such as expectation, variance, and entropy arises in algorithmic fairness, model simplification, robustness and many other areas. At face value however, distributional properties are not random variables, and hence conditioning them is a semantic error and type error in probabilistic programming languages. On the other hand, distributional properties are contingent on other variables in the model, change in value when we observe more information, and hence in a precise sense are random variables too. In order to capture the uncertain over distributional properties, we introduce a probability construct -- the random conditional distribution -- and incorporate it into a probabilistic programming language Omega. A random conditional distribution is a higher-order random variable whose realizations are themselves conditional random variables. In Omega we extend distributional properties of random variables to random conditional distributions, such that for example while the expectation a real valued random variable is a real value, the expectation of a random conditional distribution is a distribution over expectations. As a consequence, it requires minimal syntax to encode inference problems over distributional properties, which so far have evaded treatment within probabilistic programming systems and probabilistic modeling in general. We demonstrate our approach case studies in algorithmic fairness and robustness."}}
{"id": "wbgud4uxuNK", "cdate": 1514764800000, "mdate": null, "content": {"title": "Inference of Users Demographic Attributes based on Homophily in Communication Networks", "abstract": "Over the past decade, mobile phones have become prevalent in all parts of the world, across all demographic backgrounds. Mobile phones are used by men and women across a wide age range in both developed and developing countries. Consequently, they have become one of the most important mechanisms for social interaction within a population, making them an increasingly important source of information to understand human demographics and human behaviour. In this work we combine two sources of information: communication logs from a major mobile operator in a Latin American country, and information on the demographics of a subset of the users population. This allows us to perform an observational study of mobile phone usage, differentiated by age groups categories. This study is interesting in its own right, since it provides knowledge on the structure and demographics of the mobile phone market in the studied country. We then tackle the problem of inferring the age group for all users in the network. We present here an exclusively graph-based inference method relying solely on the topological structure of the mobile network, together with a topological analysis of the performance of the algorithm. The equations for our algorithm can be described as a diffusion process with two added properties: (i) memory of its initial state, and (ii) the information is propagated as a probability vector for each node attribute (instead of the value of the attribute itself). Our algorithm can successfully infer different age groups within the network population given known values for a subset of nodes (seed nodes). Most interestingly, we show that by carefully analysing the topological relationships between correctly predicted nodes and the seed nodes, we can characterize particular subsets of nodes for which our inference method has significantly higher accuracy."}}
{"id": "9bTy0ZI6ji", "cdate": 1514764800000, "mdate": null, "content": {"title": "Extending Stan for Deep Probabilistic Programming", "abstract": "Stan is a probabilistic programming language that is popular in the statistics community, with a high-level syntax for expressing probabilistic models. Stan differs by nature from generative probabilistic programming languages like Church, Anglican, or Pyro. This paper presents a comprehensive compilation scheme to compile any Stan model to a generative language and proves its correctness. We use our compilation scheme to build two new backends for the Stanc3 compiler targeting Pyro and NumPyro. Experimental results show that the NumPyro backend yields a 2.3x speedup compared to Stan in geometric mean over 26 benchmarks. Building on Pyro we extend Stan with support for explicit variational inference guides and deep probabilistic models. That way, users familiar with Stan get access to new features without having to learn a fundamentally new language."}}
