{"id": "B1A9GrC8HaK", "cdate": 1698563857116, "mdate": 1698563857116, "content": {"title": "Structure Flow-Guided Network for Real Depth Super-Resolution", "abstract": "Real depth super-resolution (DSR), unlike synthetic settings, is a challenging task due to the structural distortion and the edge noise caused by the natural degradation in real-world low-resolution (LR) depth maps. These defeats result in significant structure inconsistency between the depth map and the RGB guidance, which potentially confuses the RGB-structure guidance and thereby degrades the DSR quality. In this paper, we propose a novel structure flow-guided DSR framework, where a cross-modality flow map is learned to guide the RGB-structure information transferring for precise depth upsampling. Specifically, our framework consists of a cross-modality flow-guided upsampling network (CFUNet) and a flow-enhanced pyramid edge attention network (PEANet). CFUNet contains a trilateral self-attention module combining both the geometric and semantic correlations for reliable cross-modality flow learning. Then, the learned flow maps are combined with the grid-sampling mechanism for coarse high-resolution (HR) depth prediction. PEANet targets at integrating the learned flow map as the edge attention into a pyramid network to hierarchically learn the edge-focused guidance feature for depth edge refinement. Extensive experiments on real and synthetic DSR datasets verify that our approach achieves excellent performance compared to state-of-the-art methods."}}
{"id": "eGb63cP77c", "cdate": 1698563559817, "mdate": 1698563559817, "content": {"title": "Recurrent Structure Attention Guidance for Depth Super-Resolution", "abstract": "Image guidance is an effective strategy for depth super-resolution. Generally, most existing methods employ hand-crafted operators to decompose the high-frequency (HF) and low-frequency (LF) ingredients from low-resolution depth maps and guide the HF ingredients by directly concatenating them with image features. However, the hand-designed operators usually cause inferior HF maps (e.g., distorted or structurally missing) due to the diverse appearance of complex depth maps. Moreover, the direct concatenation often results in weak guidance because not all image features have a positive effect on the HF maps. In this paper, we develop a recurrent structure attention guided (RSAG) framework, consisting of two important parts. First, we introduce a deep contrastive network with multi-scale filters for adaptive frequency-domain separation, which adopts contrastive networks from large filters to small ones to calculate the pixel contrasts for adaptive high-quality HF predictions. Second, instead of the coarse concatenation guidance, we propose a recurrent structure attention block, which iteratively utilizes the latest depth estimation and the image features to jointly select clear patterns and boundaries, aiming at providing refined guidance for accurate depth recovery. In addition, we fuse the features of HF maps to enhance the edge structures in the decomposed LF maps. Extensive experiments show that our approach obtains superior performance compared with state-of-the-art depth super-resolution methods."}}
{"id": "ibYj1wIP9F", "cdate": 1672531200000, "mdate": 1684195899545, "content": {"title": "Dynamic Group Difference Coding Based on Thermal Infrared Face Image for Fever Screening", "abstract": "Recently, noncontact temperature measurement methods based on infrared face perception have received widely attentions since fever screening plays an important role in the early prediction of respiratory infections, such as SARS, H1N1, and COVID-19. However, the performance of these methods always significantly degrades when facing the changes of environment. Thus, the majority of these methods leverage the block-body and sensors to reduce the influence of environment changes. It is a pity that the increased instrument complexity leads to higher costs and failure rate. To address the aforementioned issues, this article presents a novel fever screening method, named dynamic group difference coding (DGDC), which is based on the analysis about the influencing factors. The key idea of DGDC is to compute the temperature differences between the target person and the recently passed crowd (dynamic group). Specifically, we develop the face temperature encoder (FTE) to describe the face temperature and thus construct the difference matrix of the embedding feature between the target person and the dynamic group. Multilayer perceptions (MLP) are employed to capture the intrinsic information by characterizing the difference matrix in vertical and horizontal directions, respectively. Finally, we provide a dataset of thermal infrared face (TIF) images and conduct extensive experiments to demonstrate the advantages of the proposed method over the competing methods."}}
{"id": "ZrmQHPmpRLk", "cdate": 1640995200000, "mdate": 1682343543835, "content": {"title": "CBi-GNN: Cross-Scale Bilateral Graph Neural Network for 3D Object Detection", "abstract": "3D object detection from LiDAR point clouds is a challenging task, since the point clouds are irregular and sparse. Existing one-stage methods mainly predict the 3D bounding box of 3D objects by extracting deep down-scaled features of point clouds from low-level (high-resolution, HR) feature maps to high-level (low-resolution, LR). Nonetheless, most of these methods ignore geometric context information of the down-scaled feature maps across scales, especially only using the LR feature will result in incomplete structure and less location accuracy of 3D objects. In this paper, we propose a novel cross-scale graph network-based one-stage 3D object detector to fully exploit the geometric contexts of the voxels between the down-scaled feature maps. Specifically, we first employ a 3D sparse convolution neural network to form different resolutions of feature maps of voxels. We then dynamically construct a cross-scale bilateral graph to search the neighbor non-empty voxels in the HR feature map with a fixed radius for each non-empty voxel in the LR feature map. In the constructed graph, we present a bilateral attention mechanism (i.e., self-attention and spatial attention) in the HR feature map and encode each non-empty voxel in the LR feature map by aggregating the HR features to obtain the attention features. In addition, we design a non-local part pooling operation to improve the score of the detected bounding box of 3D objects. Finally, we formulate a multi-task loss to train our network for regression of the 3D bounding box of the 3D objects. Experiments on the challenging KITTI’s 3D/BEV benchmark show that our proposed detector outperforms all one-stage 3D object detectors and is comparable to two-stage 3D object detectors. Our code is available at <uri xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">https://github.com/csjxchen/CBi-GNN</uri> ."}}
{"id": "ZKBCHSFDj7A", "cdate": 1640995200000, "mdate": 1682343544919, "content": {"title": "Emphasizing Closeness and Diversity Simultaneously for Deep Face Representation", "abstract": "Recent years have witnessed remarkable progress in deep face recognition due to the advancement of softmax-based methods. In this work, we first provide the analysis to reveal the working mechanism of softmax-based methods from the geometry view. Margin-based softmax methods enhance the feature discrimination by the extra margin. Mining-based softmax methods pay more attention to hard samples and try to enlarge their diversity during training. Both closeness and diversity are essential for discriminative features learning; however, we observe that most previous works dealing with hard samples fail to balance the relationship between closeness and diversity. Therefore, we propose a novel approach to tackle the above issue. Specifically, we design a two-branch cooperative network: the Elementary Representation Branch (ERB) and the Refined Representation Branch (RRB). ERB employs the margin-based softmax to guide the network to learn elementary features and measure the difficulty of training samples. RRB employs the proposed sampling strategy in conjunction with two loss terms to enhance closeness and diversity simultaneously. Extensive experimental results on popular benchmarks demonstrate the superiority of our proposed method over state-of-the-art methods."}}
{"id": "MPwnXIxnk1", "cdate": 1640995200000, "mdate": 1680056750697, "content": {"title": "Unsupervised Domain Adaptation for Point Cloud Semantic Segmentation via Graph Matching", "abstract": ""}}
{"id": "IuwOH9aqaN", "cdate": 1640995200000, "mdate": 1680056750449, "content": {"title": "Domain Disentangled Generative Adversarial Network for Zero-Shot Sketch-Based 3D Shape Retrieval", "abstract": ""}}
{"id": "GZ4mQ50Wbcl", "cdate": 1640995200000, "mdate": 1681555742421, "content": {"title": "Linearity-Aware Subspace Clustering", "abstract": ""}}
{"id": "FHk6snkf49", "cdate": 1640995200000, "mdate": 1680056750668, "content": {"title": "Generative Subgraph Contrast for Self-Supervised Graph Representation Learning", "abstract": ""}}
{"id": "Dxsrn3Qc9xy", "cdate": 1640995200000, "mdate": 1668277594133, "content": {"title": "Cross-view panorama image synthesis with progressive attention GANs", "abstract": ""}}
