{"id": "nS9N_tsbBT", "cdate": 1640995200000, "mdate": 1682332414241, "content": {"title": "Towards Agnostic Feature-based Dynamic Pricing: Linear Policies vs Linear Valuation with Unknown Noise", "abstract": "In feature-based dynamic pricing, a seller sets appropriate prices for a sequence of products (described by feature vectors) on the fly by learning from the binary outcomes of previous sales sessions (\"Sold\" if valuation $\\geq$ price, and \"Not Sold\" otherwise). Existing works either assume noiseless linear valuation or precisely-known noise distribution, which limits the applicability of those algorithms in practice when these assumptions are hard to verify. In this work, we study two more agnostic models: (a) a \"linear policy\" problem where we aim at competing with the best linear pricing policy while making no assumptions on the data, and (b) a \"linear noisy valuation\" problem where the random valuation is linear plus an unknown and assumption-free noise. For the former model, we show a $\\Theta(d^{1/3}T^{2/3})$ minimax regret up to logarithmic factors. For the latter model, we present an algorithm that achieves an $O(T^{3/4})$ regret and improve the best-known lower bound from $Omega(T^{3/5})$ to $\\Omega(T^{2/3})$. These results demonstrate that no-regret learning is possible for feature-based dynamic pricing under weak assumptions, but also reveal a disappointing fact that the seemingly richer pricing feedback is not significantly more useful than the bandit-feedback in regret reduction."}}
{"id": "JKOMRhzBrd", "cdate": 1640995200000, "mdate": 1682332414243, "content": {"title": "Doubly Fair Dynamic Pricing", "abstract": "We study the problem of online dynamic pricing with two types of fairness constraints: a \"procedural fairness\" which requires the proposed prices to be equal in expectation among different groups, and a \"substantive fairness\" which requires the accepted prices to be equal in expectation among different groups. A policy that is simultaneously procedural and substantive fair is referred to as \"doubly fair\". We show that a doubly fair policy must be random to have higher revenue than the best trivial policy that assigns the same price to different groups. In a two-group setting, we propose an online learning algorithm for the 2-group pricing problems that achieves $\\tilde{O}(\\sqrt{T})$ regret, zero procedural unfairness and $\\tilde{O}(\\sqrt{T})$ substantive unfairness over $T$ rounds of learning. We also prove two lower bounds showing that these results on regret and unfairness are both information-theoretically optimal up to iterated logarithmic factors. To the best of our knowledge, this is the first dynamic pricing algorithm that learns to price while satisfying two fairness constraints at the same time."}}
{"id": "ii5mGEbRo93", "cdate": 1621630089871, "mdate": null, "content": {"title": "Logarithmic Regret in Feature-based Dynamic Pricing", "abstract": "Feature-based dynamic pricing is an increasingly popular model of setting prices for highly differentiated products with applications in digital marketing, online sales, real estate and so on. The problem was formally studied as an online learning problem [Javanmard & Nazerzadeh, 2019] where a seller needs to propose prices on the fly for a sequence of $T$ products based on their features $x$ while having a small regret relative to the best ---\"omniscient\"--- pricing strategy she could have come up with in hindsight. We revisit this problem and provide two algorithms (EMLP and ONSP) for stochastic and adversarial feature settings, respectively, and prove the optimal $O(d\\log{T})$ regret bounds for both. In comparison, the best existing results are $O\\left(\\min\\left\\{\\frac{1}{\\lambda_{\\min}^2}\\log{T}, \\sqrt{T}\\right\\}\\right)$ and $O(T^{2/3})$ respectively, with $\\lambda_{\\min}$ being the smallest eigenvalue of $\\mathbb{E}[xx^T]$ that could be arbitrarily close to $0$.  We also prove an $\\Omega(\\sqrt{T})$ information-theoretic lower bound for a slightly more general setting, which demonstrates that \"knowing-the-demand-curve\" leads to an exponential improvement in feature-based dynamic pricing. "}}
{"id": "hxxWhDUN9v", "cdate": 1609459200000, "mdate": 1682332414229, "content": {"title": "Logarithmic Regret in Feature-based Dynamic Pricing", "abstract": ""}}
