{"id": "9qvpZ8Jqc2", "cdate": 1688698335459, "mdate": 1688698335459, "content": {"title": "Validation of Growing Knowledge Graphs by Abductive Text Evidences", "abstract": "This paper proposes a validation mechanism for newly added triples in a growing knowledge graph. Given a logical theory, a knowledge graph, a text corpus, and a new triple to be validated, this mechanism computes a sorted list of explana\u0002tions for the new triple to facilitate the validation of it, where an explanation, called an abductive text evidence, is a set ofpairs of the form (triple, window) where appending the set of triples on the left to the knowledge graph enforces entail\u0002ment of the new triple under the logical theory, while every\nsentence window on the right which is contained in the tex\u0002t corpus explains to some degree why the triple on the left\nis true. From the angle of practice, a special class of abductive text evidences called TEP-based abductive text evidence\nis proposed, which is constructed from explanation patternsseen before in the knowledge graph. Accordingly, a method\nfor computing the complete set of TEP-based abductive text evidences is proposed. Moreover, a method for sorting ab\u0002ductive text evidences based on distantly supervised learningis proposed. To evaluate the proposed validation mechanism,\nfour knowledge graphs with logical theories are constructed from the four great classical masterpieces of Chinese litera\u0002ture. Experimental results on these datasets demonstrate the efficiency and effectiveness of the proposed mechanism."}}
{"id": "xYL3525jvh", "cdate": 1640995200000, "mdate": 1675001402395, "content": {"title": "Teaching LTLf Satisfiability Checking to Neural Networks", "abstract": "Linear temporal logic over finite traces (LTLf) satisfiability checking is a fundamental and hard (PSPACE-complete) problem in the artificial intelligence community. We explore teaching end-to-end neural networks to check satisfiability in polynomial time. It is a challenge to characterize the syntactic and semantic features of LTLf via neural networks. To tackle this challenge, we propose LTLfNet, a recursive neural network that captures syntactic features of LTLf by recursively combining the embeddings of sub-formulae. LTLfNet models permutation invariance and sequentiality in the semantics of LTLf through different aggregation mechanisms of sub-formulae. Experimental results demonstrate that LTLfNet achieves good performance in synthetic datasets and generalizes across large-scale datasets. They also show that LTLfNet is competitive with state-of-the-art symbolic approaches such as nuXmv and CDLSC."}}
{"id": "tiFh2Sjv2d6", "cdate": 1640995200000, "mdate": 1675001402396, "content": {"title": "Bridging LTLf Inference to GNN Inference for Learning LTLf Formulae", "abstract": "Learning linear temporal logic on finite traces (LTLf) formulae aims to learn a target formula that characterizes the high-level behavior of a system from observation traces in planning. Existing approaches to learning LTLf formulae, however, can hardly learn accurate LTLf formulae from noisy data. It is challenging to design an efficient search mechanism in the large search space in form of arbitrary LTLf formulae while alleviating the wrong search bias resulting from noisy data. In this paper, we tackle this problem by bridging LTLf inference to GNN inference. Our key theoretical contribution is showing that GNN inference can simulate LTLf inference to distinguish traces. Based on our theoretical result, we design a GNN-based approach, GLTLf, which combines GNN inference and parameter interpretation to seek the target formula in the large search space. Thanks to the non-deterministic learning process of GNNs, GLTLf is able to cope with noise. We evaluate GLTLf on various datasets with noise. Our experimental results confirm the effectiveness of GNN inference in learning LTLf formulae and show that GLTLf is superior to the state-of-the-art approaches."}}
{"id": "gBhwrTOhqCN", "cdate": 1640995200000, "mdate": 1675001402408, "content": {"title": "A Noise-tolerant Differentiable Learning Approach for Single Occurrence Regular Expression with Interleaving", "abstract": "We study the problem of learning a single occurrence regular expression with interleaving (SOIRE) from a set of text strings possibly with noise. SOIRE fully supports interleaving and covers a large portion of regular expressions used in practice. Learning SOIREs is challenging because it requires heavy computation and text strings usually contain noise in practice. Most of the previous studies only learn restricted SOIREs and are not robust on noisy data. To tackle these issues, we propose a noise-tolerant differentiable learning approach SOIREDL for SOIRE. We design a neural network to simulate SOIRE matching and theoretically prove that certain assignments of the set of parameters learnt by the neural network, called faithful encodings, are one-to-one corresponding to SOIREs for a bounded size. Based on this correspondence, we interpret the target SOIRE from an assignment of the set of parameters of the neural network by exploring the nearest faithful encodings. Experimental results show that SOIREDL outperforms the state-of-the-art approaches, especially on noisy data."}}
{"id": "VXbNFuSc0-r", "cdate": 1640995200000, "mdate": 1675001402397, "content": {"title": "Enhancing Cross-lingual Natural Language Inference by Prompt-learning from Cross-lingual Templates", "abstract": ""}}
{"id": "DIKb5GZIVjr", "cdate": 1640995200000, "mdate": 1675001402405, "content": {"title": "Checking LTL Satisfiability via End-to-end Learning", "abstract": "Linear temporal logic (LTL) satisfiability checking is a fundamental and hard (PSPACE-complete) problem. In this paper, we explore checking LTL satisfiability via end-to-end learning, so that we can take only polynomial time to check LTL satisfiability. Existing approaches have shown that it is possible to leverage end-to-end neural networks to predict the Boolean satisfiability problem with performance considerably higher than random guessing. Inspired by these approaches, we study two interesting questions: can end-to-end neural networks check LTL satisfiability, and can neural networks capture the semantics of LTL? To this end, we train different neural networks for keeping three logical properties of LTL, i.e., recursive property, permutation invariance, and sequentiality. We demonstrate that neural networks can indeed capture some effective biases for checking LTL satisfiability. Besides, designing a special neural network keeping the logical properties of LTL can provide a better inductive bias. We also show the competitive results of neural networks compared with state-of-the-art approaches, i.e., nuXmv and Aalta, on large scale datasets."}}
{"id": "bY1FaRT0cCk", "cdate": 1609459200000, "mdate": 1675001402405, "content": {"title": "FL-MSRE: A Few-Shot Learning based Approach to Multimodal Social Relation Extraction", "abstract": "Social relation extraction (SRE for short), which aims to infer the social relation between two people in daily life, has been demonstrated to be of great value in reality. Existing methods for SRE consider extracting social relation only from unimodal information such as text or image, ignoring the high coupling of multimodal information. Moreover, previous studies overlook the serious unbalance distribution on social relations. To address these issues, this paper proposes FL-MSRE, a few-shot learning based approach to extracting social relations from both texts and face images. Considering the lack of multimodal social relation datasets, this paper also presents three multimodal datasets annotated from four classical masterpieces and corresponding TV series. Inspired by the success of BERT, we propose a strong BERT based baseline to extract social relation from text only. FL-MSRE is empirically shown to outperform the baseline significantly. This demonstrates that using face images benefits text-based SRE. Further experiments also show that using two faces from different images achieves similar performance as from the same image. This means that FL-MSRE is suitable for a wide range of SRE applications where the faces of two people can only be collected from different images."}}
{"id": "amdiYb0Pgpa", "cdate": 1609459200000, "mdate": 1675001402403, "content": {"title": "Iterative Visual Relationship Detection via Commonsense Knowledge Graph", "abstract": ""}}
{"id": "GGr8mw9Ve6", "cdate": 1609459200000, "mdate": 1675001402404, "content": {"title": "Enhancing Metaphor Detection by Gloss-based Interpretations", "abstract": ""}}
{"id": "8u33OFFjSF", "cdate": 1609459200000, "mdate": 1675001402402, "content": {"title": "A DQN-based Approach to Finding Precise Evidences for Fact Verification", "abstract": "Hai Wan, Haicheng Chen, Jianfeng Du, Weilin Luo, Rongzhen Ye. Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 1: Long Papers). 2021."}}
