{"id": "yib2N2iRTh", "cdate": 1681141039923, "mdate": 1681141039923, "content": {"title": "Group sparse Bayesian learning for data-driven discovery of explicit model forms with multiple parametric datasets", "abstract": "Extracting the explicit governing equations of a dynamic system from limited data has attracted increasing attention in the data-driven modeling community. Compared to black-box learning approaches, the sparse-regression-based learning method enables discovering an analytical model form from data, which is more appealing due to its white-box nature. However, distilling explicit equations from real-world measurements with data uncertainty is challenging, where many existing methods are less robust. Moreover, it is unclear how to efficiently learn a parametric system from multiple data sets with different parameters. This paper presents a group sparse Bayesian learning approaches to uncover the explicit model forms of a parametric dynamical system with estimated uncertainties. A deep neural network is constructed to improve the calculation of derivatives from noisy measurements. Group sparsity is leveraged to enable synchronous learning from a group of parametric datasets governed by the equations with the same functional form but different parameter settings. The proposed approach has been studied over a few linear/nonlinear ODE systems in explicit and implicit settings. In particular, a simplified parametric model of intracranial dynamics was identified from multiple synthetic datasets with different patient-specific parameters. The numerical results demonstrated the effectiveness of the proposed approach and the merit of synchronous learning from multiple datasets in a group sparsifying Bayesian setting."}}
{"id": "18KcrlPoF21", "cdate": 1681140750493, "mdate": 1681140750493, "content": {"title": "Super-resolution and denoising of fluid flow using physics-informed convolutional neural networks without high-resolution labels", "abstract": "High-resolution (HR) information of fluid flows, although preferable, is usually less accessible due to limited computational or experimental resources. In many cases, fluid data are generally sparse, incomplete, and possibly noisy. How to enhance spatial resolution and decrease the noise level of flow data is essential and practically useful. Deep learning (DL) techniques have been demonstrated to be effective for super-resolution (SR) tasks, which, however, primarily rely on sufficient HR labels for training. In this work, we present a novel physics-informed DL-based SR solution using convolutional neural networks (CNNs), which is able to produce HR flow fields from low-resolution (LR) inputs in high-dimensional parameter space. By leveraging the conservation laws and boundary conditions of fluid flows, the CNN-SR model is trained without any HR labels. Moreover, the proposed CNN-SR solution unifies the forward SR and inverse data assimilation for the scenarios where the physics is partially known, e.g., unknown boundary conditions. A new network structure is designed to enable not only the parametric SR but also the parametric inference for the first time. Several flow SR problems relevant to cardiovascular applications have been studied to demonstrate the proposed method's effectiveness and merit. A series of different LR scenarios, including LR input with Gaussian noises, non-Gaussian magnetic resonance imaging noises, and downsampled measurements given either well-posed or ill-posed physics, are investigated to illustrate the SR, denoising, and inference capabilities of the proposed method."}}
{"id": "Zn2zlyS-td8", "cdate": 1681140593418, "mdate": 1681140593418, "content": {"title": "Physics-constrained Bayesian neural network for fluid flow reconstruction with sparse and noisy data", "abstract": "In many applications, flow measurements are usually sparse and possibly noisy. The reconstruction of a high-resolution flow field from limited and imperfect flow information is significant yet challenging. In this work, we propose an innovative physics-constrained Bayesian deep learning approach to reconstruct flow fields from sparse, noisy velocity data, where equation-based constraints are imposed through the likelihood function and uncertainty of the reconstructed flow can be estimated. Specifically, a Bayesian deep neural network is trained on sparse measurement data to capture the flow field. In the meantime, the violation of physical laws will be penalized on a large number of spatiotemporal points where measurements are not available. A non-parametric variational inference approach is applied to enable efficient physics-constrained Bayesian learning. Several test cases on idealized vascular flows with synthetic measurement data are studied to demonstrate the merit of the proposed method."}}
{"id": "Xx1m8JumUeV", "cdate": 1681140440684, "mdate": 1681140440684, "content": {"title": "Surrogate modeling for fluid flows based on physics-constrained deep learning without simulation data", "abstract": "Numerical simulations on fluid dynamics problems primarily rely on spatially or/and temporally discretization of the governing equation using polynomials into a finite-dimensional algebraic system. Due to the multi-scale nature of the physics and sensitivity from meshing a complicated geometry, such process can be computational prohibitive for most real-time applications (e.g., clinical diagnosis and surgery planning) and many-query analyses (e.g., optimization design and uncertainty quantification). Therefore, developing a cost-effective surrogate model is of great practical significance. Deep learning (DL) has shown new promises for surrogate modeling due to its capability of handling strong nonlinearity and high dimensionality. However, the off-the-shelf DL architectures, success of which heavily relies on the large amount of training data and interpolatory nature of the problem, fail to operate when the data becomes sparse. Unfortunately, data is often insufficient in most parametric fluid dynamics problems since each data point in the parameter space requires an expensive numerical simulation based on the first principle, e.g., Navier–Stokes equations. In this paper, we provide a physics-constrained DL approach for surrogate modeling of fluid flows without relying on any simulation data. Specifically, a structured deep neural network (DNN) architecture is devised to enforce the initial and boundary conditions, and the governing partial differential equations (i.e., Navier–Stokes equations) are incorporated into the loss of the DNN to drive the training. Numerical experiments are conducted on a number of internal flows relevant to hemodynamics applications, and the forward propagation of uncertainties in fluid properties and domain geometry is studied as well. The results show excellent agreement on the flow field and forward-propagated uncertainties between the DL surrogate approximations and the first-principle numerical simulations."}}
{"id": "ZTK3SefE8_Z", "cdate": 1663850089729, "mdate": null, "content": {"title": "Symbolic Physics Learner: Discovering governing equations via Monte Carlo tree search", "abstract": "Nonlinear dynamics is ubiquitous in nature and commonly seen in various science and engineering disciplines. Distilling analytical expressions that govern nonlinear dynamics from limited data remains vital but challenging. To tackle this fundamental issue, we propose a novel Symbolic Physics Learner (SPL) machine to discover the mathematical structure of nonlinear dynamics. The key concept is to interpret mathematical operations and system state variables by computational rules and symbols, establish symbolic reasoning of mathematical formulas via expression trees, and employ a Monte Carlo tree search (MCTS) agent to explore optimal expression trees based on measurement data. The MCTS agent obtains an optimistic selection policy through the traversal of expression trees, featuring the one that maps to the arithmetic expression of underlying physics. Salient features of the proposed framework include search flexibility and enforcement of parsimony for discovered equations. The efficacy and superiority of the SPL machine are demonstrated by numerical examples, compared with state-of-the-art baselines."}}
{"id": "Vbfr1jiMxYS", "cdate": 1662812644442, "mdate": null, "content": {"title": "PatchGT: Transformer over Non-trainable Clusters for Learning Graph Representations", "abstract": "Recently the Transformer structure has shown good performances in graph learning tasks. However, these Transformer models directly work on graph nodes and may have difficulties learning high-level information. Inspired by the vision transformer, which applies to image patches, we propose a new Transformer-based graph neural network: Patch Graph Transformer (PatchGT). Unlike previous transformer-based models for learning graph representations, PatchGT learns from non-trainable graph patches, not from nodes directly. It can help save computation and improve the model performance. The key idea is to segment a graph into patches based on spectral clustering without any trainable parameters, with which the model can first use GNN layers to learn patch-level representations and then use Transformer layers to obtain graph-level representations. The architecture leverages the spectral information of graphs and combines the strengths of GNNs and Transformers. Further, We show the limitations of previous hierarchical trainable clusters theoretically and empirically. We also prove the proposed non-trainable spectral clustering method is permutation invariant and can help address the information bottlenecks in the graph. PatchGT achieves higher expressiveness than 1-WL-type GNNs, and the empirical study shows that PatchGT achieves competitive performances on benchmark datasets and provides interpretability to its predictions. The implementation of our algorithm is released at our GitHub repo: https://github.com/tufts-ml/PatchGT."}}
{"id": "_5rdhnrbl-z", "cdate": 1652737601081, "mdate": null, "content": {"title": "Bayesian Spline Learning for Equation Discovery of Nonlinear Dynamics with Quantified Uncertainty", "abstract": "Nonlinear dynamics are ubiquitous in science and engineering applications, but the physics of most complex systems is far from being fully understood. Discovering interpretable governing equations from measurement data can help us understand and predict the behavior of complex dynamic systems. Although extensive work has recently been done in this field, robustly distilling explicit model forms from very sparse data with considerable noise remains intractable. Moreover, quantifying and propagating the uncertainty of the identified system from noisy data is challenging, and relevant literature is still limited. To bridge this gap, we develop a novel Bayesian spline learning framework to identify parsimonious governing equations of nonlinear (spatio)temporal dynamics from sparse, noisy data with quantified uncertainty. The proposed method utilizes spline basis to handle the data scarcity and measurement noise, upon which a group of derivatives can be accurately computed to form a library of candidate model terms. The equation residuals are used to inform the spline learning in a Bayesian manner, where approximate Bayesian uncertainty calibration techniques are employed to approximate posterior distributions of the trainable parameters. To promote the sparsity, an iterative sequential-threshold Bayesian learning approach is developed, using the alternative direction optimization strategy to systematically approximate L0 sparsity constraints. The proposed algorithm is evaluated on multiple nonlinear dynamical systems governed by canonical ordinary and partial differential equations, and the merit/superiority of the proposed method is demonstrated by comparison with state-of-the-art methods."}}
{"id": "XctLdNfCmP", "cdate": 1632875553604, "mdate": null, "content": {"title": "Predicting Physics in Mesh-reduced Space with Temporal Attention", "abstract": "Auto-regressive sequence models for physics prediction are often restricted to low-dimensional systems, as memory cost increases with both spatial extents and sequence length. On the other hand, graph-based next-step prediction models have recently been very successful in modeling complex high-dimensional physical systems on irregular meshes, but suffer from error accumulation and drift, due to their short temporal attention span. In this paper, we present a method that marries the strengths of both approaches. We use a GNN to locally summarize features and create coarsened, compact mesh representation of the system state, onto which we apply a transformer-style temporal attention module. We use a second GNN to decode these predictions back to a full-sized graph and perform fine-scale updates. Our method outperforms a competitive GNN baseline on three complex fluid dynamics prediction tasks, from sonic shocks to vascular flow. We demonstrate stable rollouts without the need for training noise and show perfectly phase-stable predictions even for very long sequences. More broadly, we believe our approach paves the way to bringing the benefits of attention-based sequence models to solving high-dimensional complex physics tasks."}}
{"id": "H7KZcWfgdTH", "cdate": 1546300800000, "mdate": null, "content": {"title": "Adding Constraints to Bayesian Inverse Problems.", "abstract": "Using observation data to estimate unknown parameters in computational models is broadly important. This task is often challenging because solutions are non-unique due to the complexity of the model and limited observation data. However, the parameters or states of the model are often known to satisfy additional constraints beyond the model. Thus, we propose an approach to improve parameter estimation in such inverse problems by incorporating constraints in a Bayesian inference framework. Constraints are imposed by constructing a likelihood function based on fitness of the solution to the constraints. The posterior distribution of the parameters conditioned on (1) the observed data and (2) satisfaction of the constraints is obtained, and the estimate of the parameters is given by the maximum a posteriori estimation or posterior mean. Both equality and inequality constraints can be considered by this framework, and the strictness of the constraints can be controlled by constraint uncertainty denoting a confidence on its correctness. Furthermore, we extend this framework to an approximate Bayesian inference framework in terms of the ensemble Kalman filter method, where the constraint is imposed by re-weighing the ensemble members based on the likelihood function. A synthetic model is presented to demonstrate the effectiveness of the proposed method and in both the exact Bayesian inference and ensemble Kalman filter scenarios, numerical simulations show that imposing constraints using the method presented improves identification of the true parameter solution among multiple local minima."}}
