{"id": "pcmxREhKjQq", "cdate": 1483228800000, "mdate": 1668787492109, "content": {"title": "Gazing point dependent eye gaze estimation", "abstract": ""}}
{"id": "W8_8r84i6z", "cdate": 1451606400000, "mdate": 1668787492115, "content": {"title": "Sparsity-Induced Similarity Measure and Its Applications", "abstract": "The structures of feature vectors-based semisupervised/supervised learning have gained considerable interest in recent years due to their effectiveness for better object modeling and classification. In many machine learning and computer vision tasks, a critical issue is the similarity between two feature vectors. In this paper, we present a novel technique to measure similarities among feature vectors by decomposing each feature vector as an ℓ <sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sub>  sparse linear combination of the rest of the feature vectors. The main idea is that the coefficients in such sparse decomposition reflect the features' neighborhood structure, thus providing better similarity measures among the decomposed feature vector and the rest of the feature vectors. The proposed approach is applied to label propagation and action recognition, and is evaluated on several commonly used datasets. The experimental results show that the proposed sparsity-induced similarity measure significantly improves the performance of both label propagation and action recognition."}}
{"id": "r7AZc2IxOaB", "cdate": 1356998400000, "mdate": null, "content": {"title": "Categorization of Multiple Objects in a Scene Using a Biased Sampling Strategy.", "abstract": "Recently, various bag-of-features (BoF) methods show their good resistance to within-class variations and occlusions in object categorization. In this paper, we present a novel approach for multi-object categorization within the BoF framework. The approach addresses two issues in BoF related methods simultaneously: how to avoid scene modeling and how to predict labels of an image when multiple categories of objects are co-existing. We employ a biased sampling strategy which combines the bottom-up, biologically inspired saliency information and loose, top-down class prior information for object class modeling. Then this biased sampling component is further integrated with a multi-instance multi-label leaning and classification algorithm. With the proposed biased sampling strategy, we can perform multi-object categorization within an image without semantic segmentation. The experimental results on PASCAL VOC2007 and SUN09 show that the proposed method significantly improves the discriminative ability of BoF methods and achieves good performance in multi-object categorization tasks."}}
{"id": "oyRRDBr0iaQ", "cdate": 1356998400000, "mdate": 1668787492120, "content": {"title": "Categorization of Multiple Objects in a Scene Using a Biased Sampling Strategy", "abstract": ""}}
{"id": "CYgGrqCCw4", "cdate": 1325376000000, "mdate": 1668787492221, "content": {"title": "Multi-support-region image descriptors and its application to street landmark localization", "abstract": ""}}
{"id": "749e9AIZJy", "cdate": 1325376000000, "mdate": 1668787492214, "content": {"title": "A paradigm for handwriting-based intelligent tutors", "abstract": ""}}
{"id": "IbWR88ygxn", "cdate": 1293840000000, "mdate": 1668787492234, "content": {"title": "A unified context assessing model for object categorization", "abstract": ""}}
{"id": "h81-XRS9Ec", "cdate": 1262304000000, "mdate": 1668787492186, "content": {"title": "Locality preserving and global discriminant projection with prior information", "abstract": ""}}
{"id": "eZFhOZmrBx", "cdate": 1262304000000, "mdate": 1668787492218, "content": {"title": "Modeling Urban Scenes in the Spatial-Temporal Space", "abstract": ""}}
{"id": "dU0rv0dWdyE", "cdate": 1262304000000, "mdate": 1668787492256, "content": {"title": "Learning feature transforms for object detection from panoramic images", "abstract": ""}}
