{"id": "wwoSRGqdQRD", "cdate": 1672531200000, "mdate": 1695980115858, "content": {"title": "KoBBQ: Korean Bias Benchmark for Question Answering", "abstract": "The BBQ (Bias Benchmark for Question Answering) dataset enables the evaluation of the social biases that language models (LMs) exhibit in downstream tasks. However, it is challenging to adapt BBQ to languages other than English as social biases are culturally dependent. In this paper, we devise a process to construct a non-English bias benchmark dataset by leveraging the English BBQ dataset in a culturally adaptive way and present the KoBBQ dataset for evaluating biases in Question Answering (QA) tasks in Korean. We identify samples from BBQ into three classes: Simply-Translated (can be used directly after cultural translation), Target-Modified (requires localization in target groups), and Sample-Removed (does not fit Korean culture). We further enhance the cultural relevance to Korean culture by adding four new categories of bias specific to Korean culture and newly creating samples based on Korean literature. KoBBQ consists of 246 templates and 4,740 samples across 12 categories of social bias. Using KoBBQ, we measure the accuracy and bias scores of several state-of-the-art multilingual LMs. We demonstrate the differences in the bias of LMs in Korean and English, clarifying the need for hand-crafted data considering cultural differences."}}
{"id": "i1XEkm6_rEz", "cdate": 1672531200000, "mdate": 1702891166967, "content": {"title": "CReHate: Cross-cultural Re-annotation of English Hate Speech Dataset", "abstract": "Most NLP datasets neglect the cultural diversity among language speakers, resulting in a critical shortcoming in hate speech detection and other culturally sensitive tasks. To address this, we introduce CREHate, a CRoss-cultural English Hate speech dataset. To construct CREHate, we follow a two-step procedure: 1) culture-specific post collection and 2) cross-cultural annotation. We sample posts from the SBIC dataset, which predominantly represents North America, and collect posts from four geographically diverse English-speaking countries using culture-specific hate speech keywords that we retrieve from our survey. Annotations are then collected from those four English-speaking countries plus the US to establish representative labels for each country. Our analysis highlights statistically significant disparities in cross-cultural hate speech annotations. Only 56.2% of the posts in CREHate achieve consensus among all five countries, with a peak pairwise disagreement rate of 26%. The annotations show that label disagreements tend to come from the inherent cultural context, subjectivity, and ambiguity of the posts. Lastly, we develop cross-cultural hate speech classifiers that are more accurate at predicting each country's labels than the monocultural classifiers. This confirms the utility of CREHate for constructing culturally sensitive hate speech classifiers."}}
{"id": "tBD_BUdbtby", "cdate": 1640995200000, "mdate": 1680275488864, "content": {"title": "Translating Hanja Historical Documents to Contemporary Korean and English", "abstract": ""}}
{"id": "jBjSX4Efuqj", "cdate": 1640995200000, "mdate": 1681707824679, "content": {"title": "Models and Benchmarks for Representation Learning of Partially Observed Subgraphs", "abstract": "Subgraphs are rich substructures in graphs, and their nodes and edges can be partially observed in real-world tasks. Under partial observation, existing node- or subgraph-level message-passing produces suboptimal representations. In this paper, we formulate a novel task of learning representations of partially observed subgraphs. To solve this problem, we propose Partial Subgraph InfoMax (PSI) framework and generalize existing InfoMax models, including DGI, InfoGraph, MVGRL, and GraphCL, into our framework. These models maximize the mutual information between the partial subgraph's summary and various substructures from nodes to full subgraphs. In addition, we suggest a novel two-stage model with k-hop PSI, which reconstructs the representation of the full subgraph and improves its expressiveness from different local-global structures. Under training and evaluation protocols designed for this problem, we conduct experiments on three real-world datasets and demonstrate that PSI models outperform baselines."}}
{"id": "R-jY0yBvJO", "cdate": 1640995200000, "mdate": 1668694231165, "content": {"title": "Two-Step Question Retrieval for Open-Domain QA", "abstract": ""}}
{"id": "KymujcZCkI", "cdate": 1640995200000, "mdate": 1675481670120, "content": {"title": "HUE: Pretrained Model and Dataset for Understanding Hanja Documents of Ancient Korea", "abstract": ""}}
{"id": "32KyhxmvmO", "cdate": 1632875422973, "mdate": null, "content": {"title": "Learning Representations of Partial Subgraphs by Subgraph InfoMax", "abstract": "Subgraphs are important substructures of graphs, but learning their representations has not been studied well. Particularly, when we have partial subgraphs, existing node- or subgraph-level message-passing is likely to produce suboptimal representations. In this paper, we propose Intra- and Inter-Subgraph InfoMax, a model that learns subgraph representations under incomplete observation. Our model employs subgraph summaries at two different levels while maximizing the mutual information between the subgraph summaries and the node representations. By doing so, we reconstruct the representation of the underlying subgraph and improve its expressiveness from different angles of the local-global structure. We conduct experiments on three real-world datasets under training and evaluation protocols designed for this problem. Experimental results show that our model outperforms baselines in all settings."}}
