{"id": "qYgZ97L3US6", "cdate": 1680698079777, "mdate": null, "content": {"title": "Fast Dual-Graph Regularized Background Foreground Separation", "abstract": "Foreground-background separation is a crucial task in various applications such as computer vision, robotics, and surveillance. Robust Principal Component Analysis (RPCA) is a popular method for this task, which considers the static background as the low-rank component and the moving objects in the foreground as the sparse component. To enhance the performance of RPCA, graph regularization is typically used to incorporate the sophisticated geometry of the background and temporal correlation. However, handling the graph Laplacians can be challenging due to the substantial number of data points. In this study, we propose a novel dual-graph regularized foreground-background separation model based on Sobolev smoothness. Our model is solved using a fast numerical algorithm based on the matrix CUR decomposition. Experimental results on real datasets demonstrate that our proposed algorithm achieves state-of-the-art computational efficiency."}}
{"id": "LVqm5FJzIn", "cdate": 1672531200000, "mdate": 1681825832151, "content": {"title": "Federated Gradient Matching Pursuit", "abstract": "Traditional machine learning techniques require centralizing all training data on one server or data hub. Due to the development of communication technologies and a huge amount of decentralized data on many clients, collaborative machine learning has become the main interest while providing privacy-preserving frameworks. In particular, federated learning (FL) provides such a solution to learn a shared model while keeping training data at local clients. On the other hand, in a wide range of machine learning and signal processing applications, the desired solution naturally has a certain structure that can be framed as sparsity with respect to a certain dictionary. This problem can be formulated as an optimization problem with sparsity constraints and solving it efficiently has been one of the primary research topics in the traditional centralized setting. In this paper, we propose a novel algorithmic framework, federated gradient matching pursuit (FedGradMP), to solve the sparsity constrained minimization problem in the FL setting. We also generalize our algorithms to accommodate various practical FL scenarios when only a subset of clients participate per round, when the local model estimation at clients could be inexact, or when the model parameters are sparse with respect to general dictionaries. Our theoretical analysis shows the linear convergence of the proposed algorithms. A variety of numerical experiments are conducted to demonstrate the great potential of the proposed framework -- fast convergence both in communication rounds and computation time for many important scenarios without sophisticated parameter tuning."}}
{"id": "eYoZUotFhi", "cdate": 1668774565635, "mdate": 1668774565635, "content": {"title": "Deep Multi-Model Fusion for Single-Image Dehazing", "abstract": "This paper presents a deep multi-model fusion network to attentively integrate multiple models to separate layers and boost the performance in single-image dehazing. To do so, we first formulate the attentional feature integration module to maximize the integration of the convolutional neural network (CNN) features at different CNN layers and generate the attentional multi-level integrated features (AMLIF). Then, from the AMLIF, we further predict a haze-free result for an atmospheric scattering model, as well as for four haze-layer separation models, and then fuse the results together to produce the final haze-free image. To evaluate the effectiveness of our method, we compare our network with several state-of-the-art methods on two widely-used dehazing benchmark datasets, as well as on two sets of real-world hazy images. Experimental results demonstrate clear quantitative and qualitative improvements of our method over the state-of-the-arts."}}
{"id": "PKldFRTUcXH", "cdate": 1609459200000, "mdate": 1681825832191, "content": {"title": "Spatio-Temporal Super-Resolution Reconstruction of Remote Sensing Data", "abstract": "We present a spatio-temporal super-resolution method for reconstructing a sequence of observations collected by imaging satellites. A sequence of observations is assumed to be defined on a low resolution spatio-temporal grid. It is further assumed that the sequence is generated by blurring of a captured scene with a spatio-temporal convolution kernel and is degraded by noise. Our method simultaneously exhibits deconvolution of the sequence of images from the effects of spatio-temporal blur, denoising of the data, and upsampling of the low-resolution sequence to a high resolution spatiotemporal grid. We perform the super-resolution in the spacetime domain, as opposed to super-resolving the sequence separately and sequentially to a higher spatial and then temporal resolution grid. Simultaneous space-time optimization achieves a more efficient and more accurate reconstruction than reconstructing a sequence frame by frame. The proposed super-resolution methodology is based on total variation regularization and computes the solution using the alternating direction method of multipliers. Numerical results show our approach to be robust and computationally efficient."}}
{"id": "GCFxgtQfyvl", "cdate": 1609459200000, "mdate": null, "content": {"title": "Blind Hyperspectral Unmixing Based on Graph Total Variation Regularization", "abstract": "Remote sensing data from hyperspectral cameras suffer from limited spatial resolution, in which a single pixel of a hyperspectral image may contain information from several materials in the field of view. Blind hyperspectral image unmixing is the process of identifying the pure spectra of individual materials (i.e., endmembers) and their proportions (i.e., abundances) at each pixel. In this article, we propose a novel blind hyperspectral unmixing model based on the graph total variation (gTV) regularization, which can be solved efficiently by the alternating direction method of multipliers (ADMM). To further alleviate the computational cost, we apply the Nyström method to approximate a fully connected graph by a small subset of sampled points. Furthermore, we adopt the Merriman-Bence-Osher (MBO) scheme to solve the gTV-involved subproblem in ADMM by decomposing a gray-scale image into a bitwise form. A variety of numerical experiments on synthetic and real hyperspectral images are conducted, showcasing the potential of the proposed method in terms of identification accuracy and computational efficiency."}}
{"id": "Fo3CbWJAsOV", "cdate": 1609459200000, "mdate": null, "content": {"title": "A Novel Regularization Based on the Error Function for Sparse Recovery", "abstract": "Regularization plays an important role in solving ill-posed problems by adding extra information about the desired solution, such as sparsity. Many regularization terms usually involve some vector norms. This paper proposes a novel regularization framework that uses the error function to approximate the unit step function. It can be considered as a surrogate function for the $$L_0$$ L 0 norm. The asymptotic behavior of the error function with respect to its intrinsic parameter indicates that the proposed regularization can approximate the standard $$L_0$$ L 0 , $$L_1$$ L 1 norms as the parameter approaches to 0 and $$\\infty ,$$ ∞ , respectively. Statistically, it is also less biased than the $$L_1$$ L 1 approach. Incorporating the error function, we consider both constrained and unconstrained formulations to reconstruct a sparse signal from an under-determined linear system. Computationally, both problems can be solved via an iterative reweighted $$L_1$$ L 1 (IRL1) algorithm with guaranteed convergence. A large number of experimental results demonstrate that the proposed approach outperforms the state-of-the-art methods in various sparse recovery scenarios."}}
{"id": "88FelbjP_Np", "cdate": 1609459200000, "mdate": 1681825832149, "content": {"title": "Regularized Kaczmarz Algorithms for Tensor Recovery", "abstract": "Tensor recovery has recently arisen in a lot of application fields, such as transportation, medical imaging, and remote sensing. Under the assumption that signals possess sparse and/or low-rank structures, many tensor recovery methods have been developed to apply various regularization techniques together with the operator-splitting type of algorithms. Due to the unprecedented growth of data, it becomes increasingly desirable to use streamlined algorithms to achieve real-time computation, such as stochastic optimization algorithms that have recently emerged as an efficient family of methods in machine learning. In this work, we propose a novel algorithmic framework based on the Kaczmarz algorithm for tensor recovery. We provide thorough convergence analysis and its applications from the vector case to the tensor one. Numerical results on a variety of tensor recovery applications, including sparse signal recovery, low-rank tensor recovery, image inpainting, and deconvolution, illustrate the enormous potential of the proposed methods."}}
{"id": "2UkC3z100YX", "cdate": 1609459200000, "mdate": 1681825832150, "content": {"title": "Regularized Kaczmarz Algorithms for Tensor Recovery", "abstract": "Tensor recovery has recently arisen in a lot of application fields, such as transportation, medical imaging and remote sensing. Under the assumption that signals possess sparse and/or low-rank structures, many tensor recovery methods have been developed to apply various regularization techniques together with the operator-splitting type of algorithms. Due to the unprecedented growth of data, it becomes increasingly desirable to use streamlined algorithms to achieve real-time computation, such as stochastic optimization algorithms that have recently emerged as an efficient family of methods in machine learning. In this work, we propose a novel algorithmic framework based on the Kaczmarz algorithm for tensor recovery. We provide thorough convergence analysis and its applications from the vector case to the tensor one. Numerical results on a variety of tensor recovery applications, including sparse signal recovery, low-rank tensor recovery, image inpainting and deconvolution, illustrate the enormous potential of the proposed methods."}}
{"id": "x5UKVYJfAY", "cdate": 1577836800000, "mdate": null, "content": {"title": "Automatic prior shape selection for image edge detection with modified Mumford-Shah model.", "abstract": "Edge detection plays an important role in the field of image processing. In this paper, we propose a novel variational model to automatically and adaptively detect one or more prior shapes from the given dictionary to guide the edge detection process. In that way, we can effectively detect the shapes of interest from the test image. Moreover, an efficient algorithm based on the Alternating Direction Method of Multipliers (ADMM) is proposed to solve this model with guaranteed convergence. A variety of numerical experiments show that the proposed method has achieved ideal performance for edge detection in images with missing information, various types of noise and complicated background, and even multiple objects. Previous article in issue Next article in issue"}}
{"id": "tUkBMP1PPQ-", "cdate": 1577836800000, "mdate": null, "content": {"title": "A Novel Regularization Based on the Error Function for Sparse Recovery", "abstract": "Regularization plays an important role in solving ill-posed problems by adding extra information about the desired solution, such as sparsity. Many regularization terms usually involve some vector norm, e.g., $L_1$ and $L_2$ norms. In this paper, we propose a novel regularization framework that uses the error function to approximate the unit step function. It can be considered as a surrogate function for the $L_0$ norm. The asymptotic behavior of the error function with respect to its intrinsic parameter indicates that the proposed regularization can approximate the standard $L_0$, $L_1$ norms as the parameter approaches to $0$ and $\\infty,$ respectively. Statistically, it is also less biased than the $L_1$ approach. We then incorporate the error function into either a constrained or an unconstrained model when recovering a sparse signal from an under-determined linear system. Computationally, both problems can be solved via an iterative reweighted $L_1$ (IRL1) algorithm with guaranteed convergence. A large number of experimental results demonstrate that the proposed approach outperforms the state-of-the-art methods in various sparse recovery scenarios."}}
