{"id": "iuuaH7NW0y", "cdate": 1709251200000, "mdate": 1706415015584, "content": {"title": "Alleviating Video-length Effect for Micro-video Recommendation", "abstract": ""}}
{"id": "eiEGMm3yvK", "cdate": 1696118400000, "mdate": 1706415015615, "content": {"title": "GODDAG: Generating Origin-Destination Flow for New Cities Via Domain Adversarial Training", "abstract": "Origin-destination (OD) flow data, which reflects population mobility patterns in the city, is very important in many urban applications, such as urban planning and public resource allocation, etc. However, due to the high cost of money and time during device deployment and social surveys, it is challenging to obtain OD flow data, especially in developing cities and emerging cities where historical OD flow data is scarce. Therefore, it is necessary to investigate a method that can generate OD flow in cities where OD flow data are not available. The research on modeling population mobility in the city has a long history. Traditional gravity models, etc., are too simple to model the complex population mobility; recently proposed machine learning models and deep learning models are not applicable in cities where data are scarce because the parameters must be fitted with abundant data. To solve the problem of difficult access to OD flow data, we propose a method to learn mobility knowledge with ample data in the source city and generate OD flow data in new cities named <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">GODDAG</i> ( <bold xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><u>G</u></b> enerating <bold xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><u>O</u></b> rigin- <bold xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><u>D</u></b> estination Flow via <bold xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><u>D</u></b> omain <bold xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><u>A</u></b> dversarial Trainin <bold xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><u>g</u></b> ). Our proposed method consists of two parts, one is a GNN (graph neural networks) based mobility model generating OD flow between every two regions based on regional attributes such as census and POI distribution, and the other is a domain adversarial training strategy to make the model have better transfer ability between different cities. Extensive experiments are conducted on two real-world datasets to prove the validity of our methods."}}
{"id": "zfsnrLc5dc", "cdate": 1690848000000, "mdate": 1706415015615, "content": {"title": "UrbanKG: An Urban Knowledge Graph System", "abstract": ""}}
{"id": "zJlsX3K5v3", "cdate": 1672531200000, "mdate": 1706415015609, "content": {"title": "Road Planning for Slums via Deep Reinforcement Learning", "abstract": "Millions of slum dwellers suffer from poor accessibility to urban services due to inadequate road infrastructure within slums, and road planning for slums is critical to the sustainable development of cities. Existing re-blocking or heuristic methods are either time-consuming which cannot generalize to different slums, or yield sub-optimal road plans in terms of accessibility and construction costs. In this paper, we present a deep reinforcement learning based approach to automatically layout roads for slums. We propose a generic graph model to capture the topological structure of a slum, and devise a novel graph neural network to select locations for the planned roads. Through masked policy optimization, our model can generate road plans that connect places in a slum at minimal construction costs. Extensive experiments on real-world slums in different countries verify the effectiveness of our model, which can significantly improve accessibility by 14.3% against existing baseline methods. Further investigations on transferring across different tasks demonstrate that our model can master road planning skills in simple scenarios and adapt them to much more complicated ones, indicating the potential of applying our model in real-world slum upgrading. The code and data are available at https://github.com/tsinghua-fib-lab/road-planning-for-slums."}}
{"id": "zDT-n5jtXj-", "cdate": 1672531200000, "mdate": 1683810974031, "content": {"title": "Hierarchical Knowledge Graph Learning Enabled Socioeconomic Indicator Prediction in Location-Based Social Network", "abstract": "Socioeconomic indicators reflect location status from various aspects such as demographics, economy, crime and land usage, which play an important role in the understanding of location-based social networks (LBSNs). Especially, several existing works leverage multi-source data for socioeconomic indicator prediction in LBSNs, which however fail to capture semantic information as well as distil comprehensive knowledge therein. On the other hand, knowledge graph (KG), which distils semantic knowledge from multi-source data, has been popular in recent LBSN research, which inspires us to introduce KG for socioeconomic indicator prediction in LBSNs. Specifically, we first construct a location-based KG (LBKG) to integrate various kinds of knowledge from heterogeneous LBSN data, including locations and other related elements like point of interests (POIs), business areas as well as various relationships between them, such as spatial proximity and functional similarity. Then we propose a hierarchical KG learning model to capture both global knowledge from LBKG and domain knowledge from several sub-KGs. Extensive experiments on three datasets demonstrate our model’s superiority over state-of-the-art methods in socioeconomic indicators prediction. Our code is released at: https://github.com/tsinghua-fib-lab/KG-socioeconomic-indicator-prediction."}}
{"id": "tHmLx3FbQs", "cdate": 1672531200000, "mdate": 1706415015560, "content": {"title": "KnowSite: Leveraging Urban Knowledge Graph for Site Selection", "abstract": "Site selection determines optimal locations for new stores, which is of crucial importance for business success and urban development. Especially, the wide application of artificial intelligence with multi-source urban data makes intelligent site selection promising. Nevertheless, existing data-driven approaches heavily rely on feature engineering, which cannot take the complex relationships as well as the diverse influences of various semantics among data into consideration. Further, most approaches fail to reveal underlying factors for site decisions. To get rid of the dilemma, in this work, leveraging the knowledge graph (KG) technique, we propose a knowledge-driven model for site selection, short for KnowSite. Specifically, by empowering rich semantics in KG, we firstly construct an urban KG (UrbanKG) for site selection knowledge discovery with cities' key elements and complex relationships captured. Based on UrbanKG, we apply pre-training for semantic representations, and then design a generalized encoder-decoder structure for site decisions. KnowSite designs a graph neural network based encoder to adaptively model diverse influences, and further builds a relation path based decoder revealing the reasons behind site decisions. Extensive experiments on two datasets demonstrate that KnowSite outperforms representative baselines by more than 9% on precision. Moreover, KnowSite provides intuitive and convincing explanations for site decisions and sheds light on the site selection understanding."}}
{"id": "mN0fiSN7jtU", "cdate": 1672531200000, "mdate": 1706415015622, "content": {"title": "Complexity-aware Large Scale Origin-Destination Network Generation via Diffusion Model", "abstract": "The Origin-Destination~(OD) networks provide an estimation of the flow of people from every region to others in the city, which is an important research topic in transportation, urban simulation, etc. Given structural regional urban features, generating the OD network has become increasingly appealing to many researchers from diverse domains. However, existing works are limited in independent generation of each OD pair, i.e., flow of people from one region to another, overlooking the relations within the overall network. In this paper, we instead propose to generate the OD network, and design a graph denoising diffusion method to learn the conditional joint probability distribution of the nodes and edges within the OD network given city characteristics at region level. To overcome the learning difficulty of the OD networks covering over thousands of regions, we decompose the original one-shot generative modeling of the diffusion model into two cascaded stages, corresponding to the generation of network topology and the weights of edges, respectively. To further reproduce important network properties contained in the city-wide OD network, we design an elaborated graph denoising network structure including a node property augmentation module and a graph transformer backbone. Empirical experiments on data collected in three large US cities have verified that our method can generate OD matrices for new cities with network statistics remarkably similar with the ground truth, further achieving superior outperformance over competitive baselines in terms of the generation realism."}}
{"id": "lbW8ok5h8K", "cdate": 1672531200000, "mdate": 1694577453163, "content": {"title": "Spatio-temporal Diffusion Point Processes", "abstract": "Spatio-temporal point process (STPP) is a stochastic collection of events accompanied with time and space. Due to computational complexities, existing solutions for STPPs compromise with conditional independence between time and space, which consider the temporal and spatial distributions separately. The failure to model the joint distribution leads to limited capacities in characterizing the spatio-temporal entangled interactions given past events. In this work, we propose a novel parameterization framework for STPPs, which leverages diffusion models to learn complex spatio-temporal joint distributions. We decompose the learning of the target joint distribution into multiple steps, where each step can be faithfully described by a Gaussian distribution. To enhance the learning of each step, an elaborated spatio-temporal co-attention module is proposed to capture the interdependence between the event time and space adaptively. For the first time, we break the restrictions on spatio-temporal dependencies in existing solutions, and enable a flexible and accurate modeling paradigm for STPPs. Extensive experiments from a wide range of fields, such as epidemiology, seismology, crime, and urban mobility, demonstrate that our framework outperforms the state-of-the-art baselines remarkably. Further in-depth analyses validate its ability to capture spatio-temporal interactions, which can learn adaptively for different scenarios. The datasets and source code are available online: https://github.com/tsinghua-fib-lab/Spatio-temporal-Diffusion-Point-Processes."}}
{"id": "jX9q2Zxc7Y6", "cdate": 1672531200000, "mdate": 1683810974197, "content": {"title": "Knowledge-infused Contrastive Learning for Urban Imagery-based Socioeconomic Prediction", "abstract": "Monitoring sustainable development goals requires accurate and timely socioeconomic statistics, while ubiquitous and frequently-updated urban imagery in web like satellite/street view images has emerged as an important source for socioeconomic prediction. Especially, recent studies turn to self-supervised contrastive learning with manually designed similarity metrics for urban imagery representation learning and further socioeconomic prediction, which however suffers from effectiveness and robustness issues. To address such issues, in this paper, we propose a Knowledge-infused Contrastive Learning (KnowCL) model for urban imagery-based socioeconomic prediction. Specifically, we firstly introduce knowledge graph (KG) to effectively model the urban knowledge in spatiality, mobility, etc., and then build neural network based encoders to learn representations of an urban image in associated semantic and visual spaces, respectively. Finally, we design a cross-modality based contrastive learning framework with a novel image-KG contrastive loss, which maximizes the mutual information between semantic and visual representations for knowledge infusion. Extensive experiments of applying the learnt visual representations for socioeconomic prediction on three datasets demonstrate the superior performance of KnowCL with over 30% improvements on R2 compared with baselines. Especially, our proposed KnowCL model can apply to both satellite and street imagery with both effectiveness and transferability achieved, which provides insights into urban imagery-based socioeconomic prediction."}}
{"id": "iZBzV6DxJZ", "cdate": 1672531200000, "mdate": 1683810974207, "content": {"title": "Robust Preference-Guided Denoising for Graph based Social Recommendation", "abstract": "Graph Neural Network (GNN) based social recommendation models improve the prediction accuracy of user preference by leveraging GNN in exploiting preference similarity contained in social relations. However, in terms of both effectiveness and efficiency of recommendation, a large portion of social relations can be redundant or even noisy, e.g., it is quite normal that friends share no preference in a certain domain. Existing models do not fully solve this problem of relation redundancy and noise, as they directly characterize social influence over the full social network. In this paper, we instead propose to improve graph based social recommendation by only retaining the informative social relations to ensure an efficient and effective influence diffusion, i.e., graph denoising. Our designed denoising method is preference-guided to model social relation confidence and benefits user preference learning in return by providing a denoised but more informative social graph for recommendation models. Moreover, to avoid interference of noisy social relations, it designs a self-correcting curriculum learning module and an adaptive denoising strategy, both favoring highly-confident samples. Experimental results on three public datasets demonstrate its consistent capability of improving three state-of-the-art social recommendation models by robustly removing 10-40% of original relations. We release the source code at https://github.com/tsinghua-fib-lab/Graph-Denoising-SocialRec."}}
