{"id": "YHCU3GnmmW", "cdate": 1664816295803, "mdate": null, "content": {"title": "Medical Scientific Table-to-Text Generation with Synthetic Data under Data Sparsity Constraint", "abstract": "An efficient table-to-text summarization system can drastically reduce manual efforts to understand and summarise tabular data into textual reports. However, in practice, the problem is heavily impeded by data sparsity and the inability of the state-of-the-art natural language generation models (such as T5, PEGASUS, and GPT-Neo) to produce coherent and accurate outputs. This is particularly true in pre-clinical and clinical domains. In this paper, we propose a novel table-to-text approach and tackle these problems with the help of synthetic data generation as well as copy mechanism. Experiments show that the proposed method can boost the performance of copying concise and relevant information from tabular data to generate assay validation and toxicology reports."}}
{"id": "n56stJtuqzo", "cdate": 1609459200000, "mdate": 1636904447427, "content": {"title": "Self-Supervised Detection of Contextual Synonyms in a Multi-Class Setting: Phenotype Annotation Use Case", "abstract": "Contextualised word embeddings is a powerful tool to detect contextual synonyms. However, most of the current state-of-the-art (SOTA) deep learning concept extraction methods remain supervised and underexploit the potential of the context. In this paper, we propose a self-supervised pre-training approach which is able to detect contextual synonyms of concepts being training on the data created by shallow matching. We apply our methodology in the sparse multi-class setting (over 15,000 concepts) to extract phenotype information from electronic health records. We further investigate data augmentation techniques to address the problem of the class sparsity. Our approach achieves a new SOTA for the unsupervised phenotype concept annotation on clinical text on F1 and Recall outperforming the previous SOTA with a gain of up to 4.5 and 4.0 absolute points, respectively. After fine-tuning with as little as 20\\% of the labelled data, we also outperform BioBERT and ClinicalBERT. The extrinsic evaluation on three ICU benchmarks also shows the benefit of using the phenotypes annotated by our model as features."}}
{"id": "iC5zMgT6VJ", "cdate": 1609459200000, "mdate": 1636904446795, "content": {"title": "Self-Supervised Detection of Contextual Synonyms in a Multi-Class Setting: Phenotype Annotation Use Case", "abstract": "Jingqing Zhang, Luis Bolanos Trujillo, Tong Li, Ashwani Tanwar, Guilherme Freire, Xian Yang, Julia Ive, Vibhor Gupta, Yike Guo. Proceedings of the 2021 Conference on Empirical Methods in Natural Language Processing. 2021."}}
{"id": "NGeGqWc55RC", "cdate": 1609459200000, "mdate": 1636904446982, "content": {"title": "Clinical Utility of the Automatic Phenotype Annotation in Unstructured Clinical Notes: ICU Use Cases", "abstract": "Objective: Clinical notes contain information not present elsewhere, including drug response and symptoms, all of which are highly important when predicting key outcomes in acute care patients. We propose the automatic annotation of phenotypes from clinical notes as a method to capture essential information, which is complementary to typically used vital signs and laboratory test results, to predict outcomes in the Intensive Care Unit (ICU). Methods: We develop a novel phenotype annotation model to annotate phenotypic features of patients which are then used as input features of predictive models to predict ICU patient outcomes. We demonstrate and validate our approach conducting experiments on three ICU prediction tasks including in-hospital mortality, physiological decompensation and length of stay for over 24,000 patients by using MIMIC-III dataset. Results: The predictive models incorporating phenotypic information achieve 0.845 (AUC-ROC) to predict in-hospital mortality, 0.839 (AUC-ROC) for physiological decompensation and 0.430 (Kappa) for length of stay, all of which consistently outperform the baseline models leveraging only vital signs and laboratory test results. Moreover, we conduct a thorough interpretability study, showing that phenotypes provide valuable insights at the patient and cohort levels. Conclusion: The proposed approach demonstrates phenotypic information complements traditionally used vital signs and laboratory test results, improving significantly forecast of outcomes in the ICU."}}
{"id": "z0_qUZBGYUt", "cdate": 1577836800000, "mdate": 1636904446347, "content": {"title": "PEGASUS: Pre-training with Extracted Gap-sentences for Abstractive Summarization", "abstract": "Recent work pre-training Transformers with self-supervised objectives on large text corpora has shown great success when fine-tuned on downstream NLP tasks including text summarization. However, pr..."}}
{"id": "wAyPcPzsA9-", "cdate": 1546300800000, "mdate": 1636904446983, "content": {"title": "PEGASUS: Pre-training with Extracted Gap-sentences for Abstractive Summarization", "abstract": "Recent work pre-training Transformers with self-supervised objectives on large text corpora has shown great success when fine-tuned on downstream NLP tasks including text summarization. However, pre-training objectives tailored for abstractive text summarization have not been explored. Furthermore there is a lack of systematic evaluation across diverse domains. In this work, we propose pre-training large Transformer-based encoder-decoder models on massive text corpora with a new self-supervised objective. In PEGASUS, important sentences are removed/masked from an input document and are generated together as one output sequence from the remaining sentences, similar to an extractive summary. We evaluated our best PEGASUS model on 12 downstream summarization tasks spanning news, science, stories, instructions, emails, patents, and legislative bills. Experiments demonstrate it achieves state-of-the-art performance on all 12 downstream datasets measured by ROUGE scores. Our model also shows surprising performance on low-resource summarization, surpassing previous state-of-the-art results on 6 datasets with only 1000 examples. Finally we validated our results using human evaluation and show that our model summaries achieve human performance on multiple datasets."}}
{"id": "smzmz_m_ZiX", "cdate": 1546300800000, "mdate": 1636904447015, "content": {"title": "Unsupervised Annotation of Phenotypic Abnormalities via Semantic Latent Representations on Electronic Health Records", "abstract": "The extraction of phenotype information which is naturally contained in electronic health records (EHRs) has been found to be useful in various clinical informatics applications such as disease diagnosis. However, due to imprecise descriptions, lack of gold standards and the demand for efficiency, annotating phenotypic abnormalities on millions of EHR narratives is still challenging. In this work, we propose a novel unsupervised deep learning framework to annotate the phenotypic abnormalities from EHRs via semantic latent representations. The proposed framework takes the advantage of Human Phenotype Ontology (HPO), which is a knowledge base of phenotypic abnormalities, to standardize the annotation results. Experiments have been conducted on 52,722 EHRs from MIMIC-III dataset. Quantitative and qualitative analysis have shown the proposed framework achieves state-of-the-art annotation performance and computational efficiency compared with other methods."}}
{"id": "gYd7d4UIzmU", "cdate": 1546300800000, "mdate": 1636904446985, "content": {"title": "Integrating Semantic Knowledge to Tackle Zero-shot Text Classification", "abstract": "Jingqing Zhang, Piyawat Lertvittayakumjorn, Yike Guo. Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers). 2019."}}
{"id": "exAJVKp77O", "cdate": 1546300800000, "mdate": 1636904446683, "content": {"title": "Integrated Multi-omics Analysis Using Variational Autoencoders: Application to Pan-cancer Classification", "abstract": "Omics data are normally high dimensional with large number of molecular features and relatively small number of available samples with clinical labels. The “curse of dimensionality” makes it challenging to train a machine learning model using high dimensional omics data like DNA methylation and gene expression profiles. Here we propose an end-to-end deep learning model called OmiVAE to extract low dimensional features and classify samples from multi-omics data. OmiVAE combines the basic structure of variational autoencoders with a classifier to achieve task-oriented feature extraction and multi-class classification. The training procedure of OmiVAE is comprised of an unsupervised phase and a supervised phase. During the unsupervised phase, a hierarchical cluster structure of samples can be automatically formed without the need for labels. And in the supervised phase, OmiVAE achieved an average accuracy of 97.49% after 10-fold cross-validation among 33 tumour types and normal samples, which shows better performance than existing methods. The integrated model learned from multi-omics datasets outperformed those using only one type of omics data, which indicates that the complementary information from different omics datatypes provides useful insights for biomedical tasks like cancer classification."}}
{"id": "d22miK3Dm8", "cdate": 1546300800000, "mdate": 1636904446379, "content": {"title": "Unsupervised Annotation of Phenotypic Abnormalities via Semantic Latent Representations on Electronic Health Records", "abstract": "The extraction of phenotype information which is naturally contained in electronic health records (EHRs) has been found to be useful in various clinical informatics applications such as disease diagnosis. However, due to imprecise descriptions, lack of gold standards and the demand for efficiency, annotating phenotypic abnormalities on millions of EHR narratives is still challenging. In this work, we propose a novel unsupervised deep learning framework to annotate the phenotypic abnormalities from EHRs via semantic latent representations. The proposed framework takes the advantage of Human Phenotype Ontology (HPO), which is a knowledge base of phenotypic abnormalities, to standardize the annotation results. Experiments have been conducted on 52,722 EHRs from MIMIC-III dataset. Quantitative and qualitative analysis have shown the proposed framework achieves state-of-the-art annotation performance and computational efficiency compared with other methods."}}
