{"id": "XP_D6XdrOc7", "cdate": 1654719068991, "mdate": 1654719068991, "content": {"title": "Multi-Agent Motion Planning From Signal Temporal Logic Specifications", "abstract": "We tackle the challenging problem of multi-agent\ncooperative motion planning for complex tasks described using\nsignal temporal logic (STL), where robots can have nonlinear and\nnonholonomic dynamics. Existing methods in multi-agent motion\nplanning, especially those based on discrete abstractions and model\npredictive control (MPC), suffer from limited scalability with respect to the complexity of the task, the size of the workspace, and the\nplanning horizon. We present a method based on timed waypoints\nto address this issue. We show that timed waypoints can help abstract nonlinear behaviors of the system as safety envelopes around\nthe reference path defined by those waypoints. Then the search\nfor waypoints satisfying the STL specifications can be inductively\nencoded as a mixed-integer linear program. The agents following\nthe synthesized timed waypoints have their tasks automatically\nallocated, and are guaranteed to satisfy the STL specifications\nwhile avoiding collisions. We evaluate the algorithm on a wide\nvariety of benchmarks. Results show that it supports multi-agent\nplanning from complex specification over long planning horizons,\nand significantly outperforms state-of-the-art abstraction-based\nand MPC-based motion planning methods. The implementation\nis available at https://github.com/sundw2014/STLPlanning."}}
{"id": "gQBetxnU4Lk", "cdate": 1652737428864, "mdate": null, "content": {"title": "Learning-based Motion Planning in Dynamic Environments Using GNNs and Temporal Encoding", "abstract": "Learning-based methods have shown promising performance for accelerating motion planning, but mostly in the setting of static environments. For the more challenging problem of planning in dynamic environments, such as multi-arm assembly tasks and human-robot interaction, motion planners need to consider the trajectories of the dynamic obstacles and reason about temporal-spatial interactions in very large state spaces. We propose a GNN-based approach that uses temporal encoding and imitation learning with data aggregation for learning both the embeddings and the edge prioritization policies. Experiments show that the proposed methods can significantly accelerate online planning over state-of-the-art complete dynamic planning algorithms. The learned models can often reduce costly collision checking operations by more than 1000x, and thus accelerating planning by up to 95%, while achieving high success rates on hard instances as well. "}}
{"id": "P6_q1BRxY8Q", "cdate": 1601308193828, "mdate": null, "content": {"title": "Learning Safe Multi-agent Control with Decentralized Neural Barrier Certificates", "abstract": "We study the multi-agent safe control problem where agents should avoid collisions to static obstacles and collisions with each other while reaching their goals. Our core idea is to learn the multi-agent control policy jointly with  learning the control barrier functions as safety certificates. We propose a new joint-learning framework that can be implemented in a decentralized fashion, which can adapt to an arbitrarily large number of agents. Building upon this framework, we further improve the scalability by  incorporating neural network architectures  that are invariant to the quantity and permutation of neighboring agents. In addition, we propose a new spontaneous policy refinement method to further enforce the certificate condition during testing. We provide extensive experiments to demonstrate that our method significantly outperforms other leading multi-agent control approaches in terms of maintaining safety and completing original tasks. Our approach also shows substantial generalization capability in that the control policy can be trained with 8 agents in one scenario, while being used on other scenarios with up to 1024 agents in complex multi-agent environments and dynamics. Videos and source code can be found at https://realm.mit.edu/blog/learning-safe-multi-agent-control-decentralized-neural-barrier-certificates."}}
