{"id": "oVVnVFXGc1", "cdate": 1676024132612, "mdate": null, "content": {"title": "LEA: Latent Eigenvalue Analysis in application to high-throughput phenotypic drug screening", "abstract": "Understanding the phenotypic characteristics of cells in culture and detecting perturbations introduced by drug stimulation is of great importance for biomedical research. However, a thorough and comprehensive analysis of phenotypic heterogeneity is challenged by the complex nature of cell-level data. Here, we propose a novel Latent Eigenvalue Analysis (LEA) framework and apply it to high-throughput phenotypic profiling with single-cell and single-organelle granularity. Using the publicly available SARS-CoV-2 datasets stained with the multiplexed fluorescent cell-painting protocol, we demonstrate the power of the LEA approach in the investigation of phenotypic changes induced by more than 1800 drug compounds. As a result, LEA achieves a robust quantification of phenotypic changes introduced by drug treatment. Moreover, this quantification can be biologically supported by simulating clearly observable phenotypic transitions in a broad spectrum of use cases. In conclusion, LEA represents a new and broadly applicable approach for quantitative and interpretable analysis in routine drug screening practice."}}
{"id": "L6Je1Ag1mX", "cdate": 1664928776957, "mdate": null, "content": {"title": "Sorted eigenvalue comparison $d_{\\mathsf{Eig}}$: A simple alternative to $d_{\\mathsf{FID}}$", "abstract": "For $i = 1, 2$, let $\\mathbf{S}_i$ be the sample covariance of $\\mathbf{Z}_i$ with $n_i$ $p$-dimensional vectors. First, we theoretically justify an improved Fréchet Inception Distance ($d_{\\mathsf{FID}}$) algorithm that replaces np.trace(sqrtm($\\mathbf{S}_1 \\mathbf{S}_2$)) with np.sqrt(eigvals($\\mathbf{S}_1 \\mathbf{S}_2$)).sum(). With the appearance of unsorted eigenvalues in the improved  $d_{\\mathsf{FID}}$, we are then motivated to propose sorted eigenvalue comparison ($d_{\\mathsf{Eig}}$) as a simple alternative:  $d_{\\mathsf{Eig}}(\\mathbf{S}_1, \\mathbf{S}_2)^2=\\sum_{j=1}^p (\\sqrt{\\lambda_j^1} - \\sqrt{\\lambda_j^2})^2$, and $\\lambda_j^i$ is the $j$-th largest eigenvalue of $\\mathbf{S}_i$. Second, we present two main takeaways for the improved $d_{\\mathsf{FID}}$ and proposed $d_{\\mathsf{Eig}}$ . (i) $d_{\\mathsf{FID}}$: The error bound for computing non-negative eigenvalues of diagonalizable $\\mathbf S_1 \\mathbf S_2$  is reduced to $\\mathcal{O}(\\varepsilon) \\|\\mathbf S_1 \\| \\|\\mathbf S_1 \\mathbf S_2 \\|$, along with reducing the run time by $\\sim25\\%$. (ii) $d_{\\mathsf{Eig}}$: The error bound for computing non-negative eigenvalues of sample covariance $\\mathbf S_i$ is further tightened to $\\mathcal{O}(\\varepsilon) \\|\\mathbf S_i \\|$, with reducing $\\sim90\\%$ run time. Last, we discuss limitations and future work for $d_{\\mathsf{Eig}}$."}}
{"id": "HehY2ZX2Cz", "cdate": 1663849865557, "mdate": null, "content": {"title": "Sorted eigenvalue comparison $d_{\\mathsf{Eig}}$: A simple alternative to $d_{\\mathsf{FID}}$", "abstract": "For $i = 1, 2$, let $\\mathbf{S}_i$ be the sample covariance of $\\mathbf{Z}_i$ with $n_i$ $p$-dimensional vectors. First, we theoretically justify an improved Fréchet Inception Distance ($d_{\\mathsf{FID}}$) algorithm that replaces np.trace(sqrtm($\\mathbf{S}_1 \\mathbf{S}_2$)) with np.sqrt(eigvals($\\mathbf{S}_1 \\mathbf{S}_2$)).sum(). With the appearance of unsorted eigenvalues in the improved  $d_{\\mathsf{FID}}$, we are then motivated to propose sorted eigenvalue comparison ($d_{\\mathsf{Eig}}$) as a simple alternative:  $d_{\\mathsf{Eig}}(\\mathbf{S}_1, \\mathbf{S}_2)^2=\\sum_{j=1}^p (\\sqrt{\\lambda_j^1} - \\sqrt{\\lambda_j^2})^2$, and $\\lambda_j^i$ is the $j$-th largest eigenvalue of $\\mathbf{S}_i$. Second, we present two main takeaways for the improved $d_{\\mathsf{FID}}$ and proposed $d_{\\mathsf{Eig}}$ . (i) $d_{\\mathsf{FID}}$: The error bound for computing non-negative eigenvalues of diagonalizable $\\mathbf S_1 \\mathbf S_2$  is reduced to $\\mathcal{O}(\\varepsilon) \\|\\mathbf S_1 \\| \\|\\mathbf S_1 \\mathbf S_2 \\|$, along with reducing the run time by $\\sim25\\%$. (ii) $d_{\\mathsf{Eig}}$: The error bound for computing non-negative eigenvalues of sample covariance $\\mathbf S_i$ is further tightened to $\\mathcal{O}(\\varepsilon) \\|\\mathbf S_i \\|$, with reducing $\\sim90\\%$ run time. Taking a statistical viewpoint (random matrix theory) on $\\mathsf{S}_i$, we illustrate the asymptotic stability of its largest eigenvalues, i.e., rigidity estimates of $\\mathcal{O}(n_i^{-\\frac{1}{2}+\\alpha})$. Last, we discuss limitations and future work for $d_{\\mathsf{Eig}}$."}}
{"id": "mewQYgwbmM", "cdate": 1640995200000, "mdate": 1668771527928, "content": {"title": "Automated causal inference in application to randomized controlled clinical trials", "abstract": "Randomized controlled trials (RCTs) are considered as the gold standard for testing causal hypotheses in the clinical domain. However, the investigation of prognostic variables of patient outcome in a hypothesized cause-effect route is not feasible using standard statistical methods. Here, we propose a new automated causal inference method (AutoCI) built upon the invariant causal prediction (ICP) framework for the causal re-interpretation of clinical trial data. Compared to existing methods, we show that the proposed AutoCI allows to efficiently determine the causal variables with a clear differentiation on two real-world RCTs of endometrial cancer patients with mature outcome and extensive clinicopathological and molecular data. This is achieved via suppressing the causal probability of non-causal variables by a wide margin. In ablation studies, we further demonstrate that the assignment of causal probabilities by AutoCI remain consistent in the presence of confounders. In conclusion, these results confirm the robustness and feasibility of AutoCI for future applications in real-world clinical analysis."}}
{"id": "bnkWHh9PyR", "cdate": 1640995200000, "mdate": 1668771527931, "content": {"title": "Towards IID representation learning and its application on biomedical data", "abstract": "Due to the heterogeneity of real-world data, the widely accepted independent and identically distributed (IID) assumption has been criticized in recent studies on causality. In this paper, we argue that instead of being a questionable assumption, IID is a fundamental task-relevant property that needs to be learned. Consider $k$ independent random vectors $\\mathsf{X}^{i = 1, \\ldots, k}$, we elaborate on how a variety of different causal questions can be reformulated to learning a task-relevant function $\\phi$ that induces IID among $\\mathsf{Z}^i := \\phi \\circ \\mathsf{X}^i$, which we term IID representation learning. For proof of concept, we examine the IID representation learning on Out-of-Distribution (OOD) generalization tasks. Concretely, by utilizing the representation obtained via the learned function that induces IID, we conduct prediction of molecular characteristics (molecular prediction) on two biomedical datasets with real-world distribution shifts introduced by a) preanalytical variation and b) sampling protocol. To enable reproducibility and for comparison to the state-of-the-art (SOTA) methods, this is done by following the OOD benchmarking guidelines recommended from WILDS. Compared to the SOTA baselines supported in WILDS, the results confirm the superior performance of IID representation learning on OOD tasks. The code is publicly accessible via https://github.com/CTPLab/IID_representation_learning."}}
{"id": "B632Y0Ub1Ba", "cdate": 1640995200000, "mdate": 1668771527917, "content": {"title": "Automated causal inference in application to randomized controlled clinical trials", "abstract": "The invariant causal prediction (ICP) framework tries to determine the causal variables given an outcome variable, but considerable effort is needed to adapt existing ICP methods to the clinical domain. The authors propose an automated causal inference method that could potentially address the challenges of applying the ICP framework to complex clinical datasets."}}
{"id": "qKZH_U-tn9P", "cdate": 1638376402524, "mdate": null, "content": {"title": "Towards IID representation learning and its application on biomedical data", "abstract": "Due to the heterogeneity of real-world data, the widely accepted independent and identically distributed (IID) assumption has been criticized in recent studies on causality. In this paper, we argue that instead of being a questionable assumption,  IID is a fundamental task-relevant property that needs to be learned. Consider $k$ independent random vectors $\\mathsf{X}^{i = 1, \\ldots, k}$, we elaborate on how a variety of different causal questions can be reformulated to learning a task-relevant function $\\phi$ that induces IID among $\\mathsf{Z}^i :=  \\phi \\circ \\mathsf{X}^i$, which we term IID representation learning.\n\nFor proof of concept, we examine the IID representation learning on Out-of-Distribution (OOD) generalization tasks. Concretely, by utilizing the representation obtained via the learned function that induces IID, we conduct prediction of molecular characteristics (molecular prediction) on two biomedical datasets with real-world distribution shifts introduced by a) preanalytical variation and b) sampling protocol. To enable reproducibility and for comparison to the state-of-the-art (SOTA) methods, this is done by following the OOD benchmarking guidelines recommended from WILDS. Compared to the SOTA baselines supported in WILDS, the results confirm the superior performance of IID representation learning on OOD tasks. "}}
{"id": "cCwbeIZfOqX", "cdate": 1601308014767, "mdate": null, "content": {"title": "Visible and Invisible: Causal Variable Learning and its Application in a Cancer Study", "abstract": "Causal visual discovery is a fundamental yet challenging problem in many research fields. Given visual data and the outcome of interest, the goal is to infer the cause-effect relation. Aside from rich visual ('visible') variables, oftentimes, the outcome is also determined by 'invisible' variables, i.e. the variables from non-visual modalities that do not have visual counterparts. This $(\\textbf{visible}, \\textbf{invisible})$ combination is particularly common in the clinical domain.\n\nBuilt upon the promising invariant causal prediction (ICP) framework, we propose a novel $\\varepsilon$-ICP algorithm to resolve the (visible, invisible) setting. To efficiently discover $\\varepsilon$-plausible causal variables and to estimate the cause-effect relation, the $\\varepsilon$-ICP is learned under a min-min optimisation scheme. Driven by the need for clinical reliability and interpretability, the $\\varepsilon$-ICP is implemented with a typed neural-symbolic functional language. With the built-in program synthesis method, we can synthesize a type-safe program that is comprehensible to the clinical experts.\n\nFor concept validation of the $\\varepsilon$-ICP, we carefully design a series of synthetic experiments on the type of visual-perception tasks that are encountered in daily life. To further substantiate the proposed method, we demonstrate the application of $\\varepsilon$-ICP on a real-world cancer study dataset, Swiss CRC. This population-based cancer study has spanned over two decades, including 25$k$ fully annotated tissue micro-array (TMA) images with at least $3k \\times 3k$ resolution and a broad spectrum of clinical meta data for 533 patients. Both the synthetic and clinical experiments demonstrate the advantages of $\\varepsilon$-ICP over the state-of-the-art methods. Finally, we discuss the limitations and challenges to be addressed in the future.\n"}}
{"id": "BJej7kBYwS", "cdate": 1569439523321, "mdate": null, "content": {"title": "Divide-and-Conquer Adversarial Learning for High-Resolution Image Enhancement", "abstract": "This paper introduces a divide-and-conquer inspired adversarial learning (DACAL) approach for photo enhancement. The key idea is to decompose the photo enhancement process into hierarchically multiple sub-problems, which can be better conquered from bottom to up. On the top level, we propose a perception-based division to learn additive and multiplicative components, required to translate a low-quality image into its high-quality counterpart. On the intermediate level, we use a frequency-based division with generative adversarial network (GAN) to weakly supervise the photo enhancement process. On the lower level, we design dimension-based division that enables the GAN model to better approximates the distribution distance on multiple independent one-dimensional data to train the GAN model. While considering all three hierarchies, we develop a multiscale training approach to optimize the image enhancement process, suitable for high-resolution images, in a weakly-supervised manner. Both quantitative and qualitative results clearly demonstrate that the proposed DACAL achieves the state-of-the-art performance for high-resolution image enhancement."}}
{"id": "rrjpx0ixIn", "cdate": 1546300800000, "mdate": 1668771527880, "content": {"title": "Sliced Wasserstein Generative Models", "abstract": "In generative modeling, the Wasserstein distance (WD) has emerged as a useful metric to measure the discrepancy between generated and real data distributions. Unfortunately, it is challenging to approximate the WD of high-dimensional distributions. In contrast, the sliced Wasserstein distance (SWD) factorizes high-dimensional distributions into their multiple one-dimensional marginal distributions and is thus easier to approximate. In this paper, we introduce novel approximations of the primal and dual SWD. Instead of using a large number of random projections, as it is done by conventional SWD approximation methods, we propose to approximate SWDs with a small number of parameterized orthogonal projections in an end-to-end deep learning fashion. As concrete applications of our SWD approximations, we design two types of differentiable SWD blocks to equip modern generative frameworks---Auto-Encoders (AE) and Generative Adversarial Networks (GAN). In the experiments, we not only show the superiority of the proposed generative models on standard image synthesis benchmarks, but also demonstrate the state-of-the-art performance on challenging high resolution image and video generation in an unsupervised manner."}}
