{"id": "z8Q7E38WWLA", "cdate": 1682899200000, "mdate": 1682319038112, "content": {"title": "Capped L21-norm-based common spatial patterns for EEG signals classification applicable to BCI systems", "abstract": "The common spatial patterns (CSP) technique is an effective strategy for the classification of multichannel electroencephalogram (EEG) signals. However, the objective function expression of the conventional CSP algorithm is based on the L2-norm, which makes the performance of the method easily affected by outliers and noise. In this paper, we consider a new extension to CSP, which is termed capped L21-norm-based common spatial patterns (CCSP-L21), by using the capped L21-norm rather than the L2-norm for robust modeling. L21-norm considers the L1-norm sum which largely alleviates the influence of outliers and noise for the sake of robustness. The capped norm is further used to mitigate the effects of extreme outliers whose signal amplitude is much higher than that of the normal signal. Moreover, a non-greedy iterative procedure is derived to solve the proposed objective function. The experimental results show that the proposed method achieves the highest average recognition rates on the three real data sets of BCI competitions, which are 91.67%, 85.07%, and 82.04%, respectively. Graphical abstract Capped L21-norm-based common spatial patterns—a robust model for EEG signals classification"}}
{"id": "LE2kLkNtng5", "cdate": 1680307200000, "mdate": 1682319038007, "content": {"title": "Fuzzy Clustering With Knowledge Extraction and Granulation", "abstract": "Knowledge-based clustering algorithms can improve traditional clustering models by introducing domain knowledge to identify the underlying data structure. While there have been several approaches to clustering with the guidance of knowledge tidbits, most of them mainly focus on numeric knowledge without considering the uncertain nature of information. To capture the uncertainty of information, pure numeric knowledge tidbits are expanded to knowledge granules in this article. Then, two questions arise: how to obtain granular knowledge and how to use those knowledge granules in clustering. To the end, a novel knowledge extraction and granulation (KEG) method and a granular knowledge-based fuzzy clustering model are proposed in this study. First, inspired by the concept of natural neighbors, an automatic KEG is developed. In KEG, high-density points are filtered from the dataset and then merged with their natural neighbors to form several dense areas, i.e., granular knowledge. Furthermore, the granular knowledge expressed by interval or triangular numbers is leveraged into the clustering algorithm, which is the framework of fuzzy clustering with granular knowledge. To concretize this model into clustering algorithms, the classical fuzzy C-Means clustering algorithm has been selected to incorporate the granular knowledge produced by KEG. Then, the corresponding fuzzy C-Means clustering with interval knowledge granules (IKG-FCM) and triangular knowledge granules (TKG-FCM) are proposed. Experiments on synthetic and real-world datasets demonstrate that IKG-FCM and TKG-FCM always achieve better clustering performance with less time cost, especially on imbalanced data, compared with state-of-the-art algorithms."}}
{"id": "ppRxoVRCO4", "cdate": 1640995200000, "mdate": 1682319038059, "content": {"title": "Batch Crowdsourcing for Complex Tasks Based on Distributed Team Formation in E-Markets", "abstract": "Team formation has been extensively studied for complex task crowdsourcing in E-markets, in which a set of workers are hired to form a team to complete a complex task collaboratively. However, existing studies have two typical drawbacks: 1) each team is created for only one task, which may be costly and cannot accommodate crowdsourcing markets with a large number of tasks; and 2) most existing studies form teams in a centralized manner by the requesters, which may place a heavy burden on requesters. In fact, we observe that many complex tasks at real-world crowdsourcing platforms have similar skill requirements and workers are often connected through social networks. Therefore, this paper explores distributed team formation-based batch crowdsourcing for complex tasks to address the drawbacks in existing studies, in which similar tasks can be addressed in a batch to reduce computational costs and workers can self-organize through their social networks to form teams. To solve such an NP-hard problem, this paper presents two approaches: one is to form a fixed team for all tasks in the batch; the other is to form a basic team that can be dynamically adjusted for each task in the batch. In comparison, the former approach has lower computational complexity but the latter approach performs better in reducing the total payments by requesters. With the experiments on a real-world dataset comparing with previous benchmark approaches, it is shown that the presented approaches have better performance in saving the costs of forming teams, payments by requesters, and communication among team members; moreover, the presented approaches have higher success rate of tasks and much better scalability."}}
{"id": "i9KAShEy01", "cdate": 1640995200000, "mdate": 1682319038156, "content": {"title": "An intermediary utility-based service search and structure organization approach in service-oriented MAS", "abstract": ""}}
{"id": "e7jwG4WPDM", "cdate": 1640995200000, "mdate": 1682319038124, "content": {"title": "A Foraging Strategy with Risk Response for Individual Robots in Adversarial Environments", "abstract": "As an essential problem in robotics, foraging means that robots collect objects from a given environment and return them to a specified location. On many occasions, robots are required to perform foraging tasks in adversarial environments, such as battlefield rescue, where potential adversaries may damage robots with a certain probability. The longer an individual robot moves through adversarial environments, the higher the probability of being damaged by adversaries. The robot system can gain utility only when the robot brings carried objects back to a predetermined home station. Such a risk of being damaged makes returning home at different locations potentially relevant to the expected utility produced by the robot. Thus, the individual robot faces a dilemma when it responds to the potential risks in adversarial environments: whether to return the carried resources home or continue foraging tasks. In this article, two fundamental environment settings are discussed, homogeneous cases and heterogeneous cases. The former is analyzed as having both the optimal substructure property and the non-aftereffect property. Then, we present a dynamic programming (DP) algorithm that can find an optimal solution with polynomial time complexity. For the latter, it is proven that finding an optimal solution is \\( \\mathcal {NP} \\)-hard. We then propose a heuristic algorithm: A division hierarchical path planning (DHPP) algorithm that is based on the idea of dividing the foraging routes generated initially into a certain number of subroutes to dilute risks. Finally, these algorithms are extensively evaluated in simulations, concluding that in adversarial environments, they can significantly improve the productivity of an individual robot before it is damaged."}}
{"id": "2brEU5cDjZ5", "cdate": 1640995200000, "mdate": 1682319038167, "content": {"title": "A method for reducing cloud service request peaks based on game theory", "abstract": ""}}
{"id": "-LuhcPMEp9u", "cdate": 1640995200000, "mdate": 1682319038107, "content": {"title": "Euler common spatial pattern modulated with cross-frequency coupling", "abstract": "In the field of electroencephalogram (EEG)-based brain–computer interfaces (BCIs), the method of common spatial pattern (CSP) is formulated as a problem of eigen-decomposition of covariance matrices. Each sample value was mapped into a complex space using Euler representation, and the Euler common spatial pattern (e-CSP) approach was developed. Cross-frequency coupling (CFC) represents the interaction between different frequency bands, which can better control the complex brain network than a single frequency band and provides a new idea for research on EEG signals. In this paper, we apply amplitude–amplitude coupling (AAC) to reformulate the covariance matrices in e-CSP; as a result, the AAC-modulated e-CSP is proposed. More discriminative features are discovered with the proposed approach. The proposed method is validated based on the Cho’s dataset. The experimental results illustrate the discrimination ability of the proposed method."}}
{"id": "wPQXSo1jfeS", "cdate": 1609459200000, "mdate": 1682319038114, "content": {"title": "Group-Oriented Task Allocation for Crowdsourcing in Social Networks", "abstract": "Previous crowdsourcing studies often adopted the individual-oriented approach that outsources a task to an individual worker or team formation-based approach that outsources a task to an artificially formed team of workers. Nowadays, workers are often naturally organized into groups through social networks. To address such common issue of grouped workers in real crowdsourcing systems, this article explores a novel crowdsourcing paradigm in which the task allocation targets are naturally existing worker groups but not individual workers or artificially formed teams as before. Because a natural group might not possess all required skills and needs to coordinate with other groups in the social network contexts for performing a complex task, a concept of contextual crowdsourcing value is presented to measure a group's capacity to complete a task by coordinating with its contextual groups, which determines the priority that the group is assigned the task; then, the task allocation algorithms, including the allocations of groups and the workers actually participating in executing the task, are designed. The experiments on a real-world dataset show that our presented group-oriented approach can nearly always achieve better synergy performance, consistency performance, conflict performance, adaptability, and effectiveness on reducing costs, as compared with previous benchmark individual-oriented and team formation approaches."}}
{"id": "fqFPgkoJ7bs", "cdate": 1609459200000, "mdate": 1682319038173, "content": {"title": "Proximity-based group formation game model for community detection in social network", "abstract": ""}}
{"id": "_m-wZu7i3P3", "cdate": 1609459200000, "mdate": 1682319038095, "content": {"title": "Action Intention Understanding EEG Signal Classification Based on Improved Discriminative Spatial Patterns", "abstract": "i>Objective</i>. Action intention understanding EEG signal classification is indispensable for investigating human-computer interactions and intention understanding mechanisms. Numerous investigations on classification tasks extract classification features by using graph theory metrics; however, the classification results are usually not good. <i>Method</i>. To effectively implement the task of action intention understanding EEG signal classification, we proposed a new feature extraction method by improving discriminative spatial patterns. <i>Results</i>. The whole frequency band and fusion band achieved satisfactory classification accuracies. Compared with other authors&#x2019; methods for action intention understanding EEG signal classification, the new method performs more satisfactorily in some aspects. <i>Conclusions</i>. The new feature extraction method not only effectively avoids complex values when solving the generalized eigenvalue problem but also perfectly realizes appreciable classification accuracies. Fusing the classification features of different frequency bands is a useful strategy for the classification task."}}
