{"id": "DoT7XxFBw4z", "cdate": 1609459200000, "mdate": 1675518452460, "content": {"title": "Predicting with Structured Data: Graphs, Ranks, and Time Series", "abstract": "Yan Gu, Jiuding Duan, and Hisashi Kashima. An Intransitivity Model for Matchup and Pairwise Comparison. In Proceedings of the 25th International Conference on Pattern Recognition (ICPR), pp. 692-698, IEEE, 2020. DOI: 10.1109/ICPR48806.2021.9412462 ※　Jiuding Duan, Jiyi Li, Yukino Baba, and Hisashi Kashima. A generalized model for multidimensional intransitivity. In Proceedings of the Pacific-Asia Conference onKnowledge Discovery and Data Mining　(PAKDD), pp. 840-852. Springer, Cham, 2017. DOI:https://doi.org/10.1007/978-3-319-57529-2_65 ※　Jiuding Duan, Atsuto Seko, and Hisashi Kashima. \"\"Quantum Energy Prediction Using Graph Kernel.\"\" In Proceedings of 2015 IEEE International Conference on Systems, Man, and Cybernetics (IEEE SMC), pp. 1651-1656. IEEE, 2015. DOI: 10.1109/SMC.2015.291"}}
{"id": "6j0zDpWCJW", "cdate": 1609459200000, "mdate": 1653138079303, "content": {"title": "Learning to Rank for Multi-Step Ahead Time-Series Forecasting", "abstract": "Time-series forecasting is a fundamental problem associated with a wide range of engineering, financial, and social applications. The challenge arises from the complexity due to the time-variant property of time series and the inevitable diminishing utility of predictive models. Therefore, it is generally difficult to accurately predict values, especially in a multi-step ahead setting. However, in domains such as financial time series forecasting, an ex-ante prediction of the relative order of values in the near future is sufficient; i.e., the next 100 days can help make meaningful investment decisions. In this paper, we propose a dynamic prediction framework that makes it possible to make an ex-ante forecast of time series with a special focus on the relative ordering of the forecast within a forward-looking time horizon. Through the lens of the concordance index (CI), we compare the proposed method with conventional regression-based time-series forecasting methods, discriminative learning methods and hybrid methods. Moreover, we discuss the use of the proposed framework for different types of time series and under a variety of conditions. Extensive experimental results on financial time series across a majority of liquid asset classes show that the proposed framework outperforms the benchmark methods significantly."}}
{"id": "PF6m9wThpER", "cdate": 1577836800000, "mdate": 1653138079295, "content": {"title": "An Intransitivity Model for Matchup and Pairwise Comparison", "abstract": "Ranking is a ubiquitous problem setting that appears in many real-world applications. The superior players or objects in the ranking list are oftentimes estimated from matchups and pairwise comparisons. In order to predict the result of unobserved events, various models have been developed to integrate the matchup and pairwise comparison results into a single ranking list of players. Amongst these models, the Bradley-Terry model is the mainstream which achieves the goal by authorizing enriched probabilistic interpretation of players. However, the model suffers from its strong assumption of transitive relationships and becomes vulnerable in practice when intransitive relationships exist. In this paper, we propose a low-rank matrix approach to characterize all players and unify the related works on representation learning of players by rearranging the constructively. Our experimental results on synthetic datasets and real-world datasets show that the proposed model is competitive with the standard models in terms of out-of-sample predictive performance and consistency of model interpretation."}}
{"id": "VOcBUwQilh8", "cdate": 1483228800000, "mdate": 1653138079293, "content": {"title": "A Generalized Model for Multidimensional Intransitivity", "abstract": "Intransitivity is a critical issue in pairwise preference modeling. It refers to the intransitive pairwise preferences between a group of players or objects that potentially form a cyclic preference chain, and has been long discussed in social choice theory in the context of the dominance relationship. However, such multifaceted intransitivity between players and the corresponding player representations in high dimension are difficult to capture. In this paper, we propose a probabilistic model that joint learns the d-dimensional representation ( $$d > 1$$ ) for each player and a dataset-specific metric space that systematically captures the distance metric in $$\\mathbb {R}^d$$ over the embedding space. Interestingly, by imposing additional constraints in the metric space, our proposed model degenerates to former models used in intransitive representation learning. Moreover, we present an extensive quantitative investigation of the wide existence of intransitive relationships between objects in various real-world benchmark datasets. To the best of our knowledge, this investigation is the first of this type. The predictive performance of our proposed method on various real-world datasets, including social choice, election, and online game datasets, shows that our proposed method outperforms several competing methods in terms of prediction accuracy."}}
{"id": "2tqBLYGbH4", "cdate": 1420070400000, "mdate": 1653138079304, "content": {"title": "Quantum Energy Prediction Using Graph Kernel", "abstract": "Vectorial compound representation has played an important role in the recent progress in material property prediction based on machine learning methods. However, the material compounds are originally recorded in the material databases as non-vectorial graph units and space groups. The representation of compounds as handmade vectorial representations is challenging and crucial for the successful application of machine learning. In this study, we attempt to use the random walk graph kernel for material property prediction in which the kernel between graph objects can be automatically constructed from the non-vectorial graph representations in the material informatics databases. By constructing the graph representation efficiently from the raw geometric coordinate data using maximum spanning tree, our method achieves approximately the same prediction power as the conventional vectorial compound representation, and even outperforms it in situations where the number of labeled data is limited. This is well suited for the current material informatics practice where numerous potential material structures have not yet been discovered or annotated. Moreover, we demonstrate that our method maintains a flexible framework that allows the inclusion of domain knowledge, such as electromagnetism, by material scientists."}}
