{"id": "X_AJqHfE1H", "cdate": 1673287852742, "mdate": null, "content": {"title": "Vesselformer: Towards Complete 3D Vessel Graph Generation from Images", "abstract": "The reconstruction of graph representations from Images (Image-to-graph) is a frequent task, especially vessel graph extraction from biomedical images. Traditionally, this problem is tackled by a two-stage process: segmentation followed by skeletonization. However, the ambiguity in the heuristic-based pruning of the centerline graph from the skeleta makes it hard to achieve a compact yet faithful graph representation. Recently, \\textit{Relationformer} proposed an end-to-end solution to extract graphs directly from images. However, it does not consider edge features, particularly radius information, which is crucial in many applications such as flow simulation. Further, Relationformer predicts only patch-based graphs. In this work, we address these two shortcomings. We propose a task-specific token, namely radius-token, which explicitly focuses on capturing radius information between two nodes. Second, we propose an efficient algorithm to infer a large 3D graph from patch inference. Finally, we show experimental results on a synthetic vessel dataset and achieve the first 3D complete graph prediction. Code is available at \\url{https://github.com/chinmay5/vesselformer}.\n"}}
{"id": "qNM44eDNQa", "cdate": 1672531200000, "mdate": 1681725024451, "content": {"title": "Link Prediction for Flow-Driven Spatial Networks", "abstract": "Link prediction algorithms predict the existence of connections between nodes in network-structured data and are typically applied to refine the connectivity among nodes by proposing meaningful new links. In this work, we focus on link prediction for flow-driven spatial networks, which are embedded in a Euclidean space and relate to physical exchange and transportation processes (e.g., blood flow in vessels or traffic flow in road networks). To this end, we propose the Graph Attentive Vectors (GAV) link prediction framework. GAV models simplified dynamics of physical flow in spatial networks via an attentive, neighborhood-aware message-passing paradigm, updating vector embeddings in a constrained manner. We evaluate GAV on eight flow-driven spatial networks given by whole-brain vessel graphs and road networks. GAV demonstrates superior performances across all datasets and metrics and outperforms the current state-of-the-art on the ogbl-vessel benchmark by more than 18% (98.38 vs. 83.07 AUC)."}}
{"id": "P_Qin99_uQu", "cdate": 1672531200000, "mdate": 1681725024446, "content": {"title": "Clustering disease trajectories in contrastive feature space for biomarker discovery in age-related macular degeneration", "abstract": "Age-related macular degeneration (AMD) is the leading cause of blindness in the elderly. Current grading systems based on imaging biomarkers only coarsely group disease stages into broad categories and are unable to predict future disease progression. It is widely believed that this is due to their focus on a single point in time, disregarding the dynamic nature of the disease. In this work, we present the first method to automatically discover biomarkers that capture temporal dynamics of disease progression. Our method represents patient time series as trajectories in a latent feature space built with contrastive learning. Then, individual trajectories are partitioned into atomic sub-sequences that encode transitions between disease states. These are clustered using a newly introduced distance metric. In quantitative experiments we found our method yields temporal biomarkers that are predictive of conversion to late AMD. Furthermore, these clusters were highly interpretable to ophthalmologists who confirmed that many of the clusters represent dynamics that have previously been linked to the progression of AMD, even though they are currently not included in any clinical grading system."}}
{"id": "M6N7mXCcnU", "cdate": 1672531200000, "mdate": 1677745228983, "content": {"title": "The Liver Tumor Segmentation Benchmark (LiTS)", "abstract": ""}}
{"id": "2rekyGx9osHn", "cdate": 1672531200000, "mdate": 1677745230845, "content": {"title": "Learn-Morph-Infer: A new way of solving the inverse problem for brain tumor modeling", "abstract": ""}}
{"id": "8W1ar7zATN", "cdate": 1664090931394, "mdate": null, "content": {"title": "Graflow: Neural Blood Flow Solver for Vascular Graph", "abstract": "Simulating blood flow is paramount in identifying flow-based biomarkers for vascular-related diseases. A segmented vessel graph is used as a domain for the simulation. Traditionally, partial differential equations are solved with numerical methods. Here, we propose an alternative solver for the simulation of blood flow on a vascular graph leveraging geometric deep learning. Specifically, we reformulate the problem as an implicit function on the graph and learn the simulation by imposing the physics in the loss through a message passing layer. The resultant flow is accurate, fast, and applicable to various tasks."}}
{"id": "a3-QYAgcDBl", "cdate": 1663849858054, "mdate": null, "content": {"title": " Topologically faithful image segmentation via induced matching of persistence barcodes", "abstract": "Image segmentation is a largely researched field where neural networks find vast applications in many facets of technology.\nSome of the most popular approaches to train segmentation networks employ loss functions optimizing pixel-overlap, an objective that is \ninsufficient for many segmentation tasks. In recent years, their limitations fueled a growing interest in topology-aware methods, which aim to recover the correct topology of the segmented structures. However, so far, none of the existing approaches achieve a spatially correct matching between the topological features (persistence barcodes) of label (ground truth) and prediction (output of the neural network). \n\nIn this work, we propose the first topologically and feature-wise accurate metric and loss function for supervised image segmentation, which we term TopoMatch. We show how induced matchings guarantee the spatially correct matching between barcodes in a segmentation setting. Furthermore, we propose an efficient algorithm to compute TopoMatch for images. We show that TopoMatch is an interpretable metric to evaluate the topological correctness of segmentations. Moreover, we demonstrate how induced matchings can be used to train segmentation networks and improve the topological correctness of the segmentations across all 6 baseline datasets while preserving volumetric segmentation performance. "}}
{"id": "Vj0lqXNsdA8", "cdate": 1662289414099, "mdate": null, "content": {"title": "Structured Knowledge Graphs for Classifying Unseen Patterns in Radiographs", "abstract": "The presence of annotated datasets is crucial to the performance of modern machine learning algorithms. However, obtaining richly annotated datasets is not always possible, especially for novel or rare diseases. This becomes especially challenging in the realm of multi-label classification of chest radiographs, due to the presence of numerous unknown disease types and the limited information inherent to x-ray images. Ideally, we would like to develop models that can reliably label such unseen patterns (classes). In this work, we present a knowledge graph-based approach to predict such novel, unseen classes. Our method directly injects the semantic relationships between seen and unseen disease classes. Specifically, we propose a principled approach to parsing and processing a knowledge graph conditioned on the given task. We show that our method matches the labeling performance of the state-of-the-art while outperforming it on unseen classes by a  substantial 2% gain on chest X-ray classification. Crucially, we demonstrate that embedding disease-specific knowledge as a graph provides inherent explainability."}}
{"id": "3Krfu84W-Wx", "cdate": 1650656841329, "mdate": null, "content": {"title": "On the pitfalls of deep image segmentation for lightsheet microscopy", "abstract": "Fluorescence light sheet microscopy (LSM) of tissue cleared samples enables holistic 3D imaging of the human brain and the full murine body. While this novel imaging method creates high resolution scans and has led to an abundance of high-profile publications in the last 5 years, analysing them is not trivial and comes with complex obstacles. In this paper we present a review and discussion of our groups previous works to present best practices on both animal and human scans and guidelines to overcome these obstacles"}}
{"id": "u4YRjdzlcvH", "cdate": 1640995200000, "mdate": 1677745227899, "content": {"title": "Geometry-Aware Neural Solver for Fast Bayesian Calibration of Brain Tumor Models", "abstract": ""}}
