{"id": "oUigTwc7Cw5", "cdate": 1652737827164, "mdate": null, "content": {"title": "Efficient coding, channel capacity, and the emergence of retinal mosaics", "abstract": "Among the most striking features of retinal organization is the grouping of its output neurons, the retinal ganglion cells (RGCs), into a diversity of functional types. Each of these types exhibits a mosaic-like organization of receptive fields (RFs) that tiles the retina and visual space. Previous work has shown that many features of RGC organization, including the existence of ON and OFF cell types, the structure of spatial RFs, and their relative arrangement, can be predicted on the basis of efficient coding theory. This theory posits that the nervous system is organized to maximize information in its encoding of stimuli while minimizing metabolic costs.  Here, we use efficient coding theory to present a comprehensive account of mosaic organization in the case of natural videos as the retinal channel capacity---the number of simulated RGCs available for encoding---is varied. We show that  mosaic density increases with channel capacity up to a series of critical points at which, surprisingly, new cell types emerge. Each successive cell type focuses on increasingly high temporal frequencies and integrates signals over larger spatial areas. In addition, we show theoretically and in simulation that a transition from mosaic alignment to anti-alignment across pairs of cell types is observed with increasing output noise and decreasing input noise. Together, these results offer a unified perspective on the relationship between retinal mosaics, efficient coding, and channel capacity that can help to explain the stunning functional diversity of retinal cell types."}}
{"id": "8P9gwRD3kPj", "cdate": 1633602527876, "mdate": 1633602527876, "content": {"title": "Scene statistics and noise determine the relative arrangement of receptive field mosaics", "abstract": "Across a wide variety of species, cells in the retina specialized for signaling either increases (ON) or decreases (OFF) in light represent one of the most basic building blocks of visual computation. These cells coordinate to form mosaics, with each cell responsible for a small, minimally overlapping portion of visual space, but the ways in which these mosaics could be spatially coordinated with each other are relatively unknown. Here, we show how efficient coding theory, which hypothesizes that the nervous system minimizes the amount of redundant information it encodes, can predict the relative spatial arrangement of ON and OFF mosaics. The most information-efficient arrangements are determined both by levels of noise in the system and the statistics of natural images."}}
{"id": "QRKmEgSKgwW", "cdate": 1633602331164, "mdate": 1633602331164, "content": {"title": "Inter-mosaic coordination of retinal receptive fields", "abstract": "The output of the retina is organized into many detector grids, called ‘mosaics’, that signal different features of visual scenes to the brain. Each mosaic comprises a single type of retinal ganglion cell (RGC), whose receptive fields tile visual space. Many mosaics arise as pairs, signalling increments (ON) and decrements (OFF), respectively, of a particular visual feature. Here we use a model of efficient coding to determine how such mosaic pairs should be arranged to optimize the encoding of natural scenes. We find that information is maximized when these mosaic pairs are anti-aligned, meaning that the distances between the receptive field centres across mosaics are greater than expected by chance. We tested this prediction across multiple receptive field mosaics acquired using large-scale measurements of the light responses of rat and primate RGCs. ON and OFF RGC pairs with similar feature selectivity had anti-aligned receptive field mosaics, consistent with this prediction. ON and OFF RGC types that encode distinct features have independent mosaics. These results extend efficient coding theory beyond individual cells to predict how populations of diverse types of RGC are spatially arranged."}}
{"id": "SjxC07jABZ4", "cdate": 1621630320271, "mdate": null, "content": {"title": "Bubblewrap: Online tiling and real-time flow prediction on neural manifolds", "abstract": "While most classic studies of function in experimental neuroscience have focused on the coding properties of individual neurons, recent developments in recording technologies have resulted in an increasing emphasis on the dynamics of neural populations. This has given rise to a wide variety of models for analyzing population activity in relation to experimental variables, but direct testing of many neural population hypotheses requires intervening in the system based on current neural state, necessitating models capable of inferring neural state online. Existing approaches, primarily based on dynamical systems, require strong parametric assumptions that are easily violated in the noise-dominated regime and do not scale well to the thousands of data channels in modern experiments. To address this problem, we propose a method that combines fast, stable dimensionality reduction with a soft tiling of the resulting neural manifold, allowing dynamics to be approximated as a probability flow between tiles. This method can be fit efficiently using online expectation maximization, scales to tens of thousands of tiles, and outperforms existing methods when dynamics are noise-dominated or feature multi-modal transition probabilities. The resulting model can be trained at kiloHertz data rates, produces accurate approximations of neural dynamics within minutes, and generates predictions on submillisecond time scales. It retains predictive performance throughout many time steps into the future and is fast enough to serve as a component of closed-loop causal experiments."}}
{"id": "d2_vTtzZosX", "cdate": 1609459200000, "mdate": 1681661934940, "content": {"title": "Bubblewrap: Online tiling and real-time flow prediction on neural manifolds", "abstract": "While most classic studies of function in experimental neuroscience have focused on the coding properties of individual neurons, recent developments in recording technologies have resulted in an increasing emphasis on the dynamics of neural populations. This has given rise to a wide variety of models for analyzing population activity in relation to experimental variables, but direct testing of many neural population hypotheses requires intervening in the system based on current neural state, necessitating models capable of inferring neural state online. Existing approaches, primarily based on dynamical systems, require strong parametric assumptions that are easily violated in the noise-dominated regime and do not scale well to the thousands of data channels in modern experiments. To address this problem, we propose a method that combines fast, stable dimensionality reduction with a soft tiling of the resulting neural manifold, allowing dynamics to be approximated as a probability flow between tiles. This method can be fit efficiently using online expectation maximization, scales to tens of thousands of tiles, and outperforms existing methods when dynamics are noise-dominated or feature multi-modal transition probabilities. The resulting model can be trained at kiloHertz data rates, produces accurate approximations of neural dynamics within minutes, and generates predictions on submillisecond time scales. It retains predictive performance throughout many time steps into the future and is fast enough to serve as a component of closed-loop causal experiments."}}
{"id": "SWMoOKNChYe", "cdate": 1609459200000, "mdate": 1681169853533, "content": {"title": "Bubblewrap: Online tiling and real-time flow prediction on neural manifolds", "abstract": ""}}
{"id": "FZumIkQApt-", "cdate": 1609459200000, "mdate": 1681169853527, "content": {"title": "Deep Generative Analysis for Task-Based Functional MRI Experiments", "abstract": ""}}
{"id": "bokD_-S0YW", "cdate": 1577836800000, "mdate": 1681169853535, "content": {"title": "Online Neural Connectivity Estimation with Noisy Group Testing", "abstract": ""}}
{"id": "494DlPjMZe", "cdate": 1577836800000, "mdate": 1681661934999, "content": {"title": "Online Neural Connectivity Estimation with Noisy Group Testing", "abstract": "One of the primary goals of systems neuroscience is to relate the structure of neural circuits to their function, yet patterns of connectivity are difficult to establish when recording from large populations in behaving organisms. Many previous approaches have attempted to estimate functional connectivity between neurons using statistical modeling of observational data, but these approaches rely heavily on parametric assumptions and are purely correlational. Recently, however, holographic photostimulation techniques have made it possible to precisely target selected ensembles of neurons, offering the possibility of establishing direct causal links. Here, we propose a method based on noisy group testing that drastically increases the efficiency of this process in sparse networks. By stimulating small ensembles of neurons, we show that it is possible to recover binarized network connectivity with a number of tests that grows only logarithmically with population size under minimal statistical assumptions. Moreover, we prove that our approach, which reduces to an efficiently solvable convex optimization problem, can be related to Variational Bayesian inference on the binary connection weights, and we derive rigorous bounds on the posterior marginals. This allows us to extend our method to the streaming setting, where continuously updated posteriors allow for optional stopping, and we demonstrate the feasibility of inferring connectivity for networks of up to tens of thousands of neurons online. Finally, we show how our work can be theoretically linked to compressed sensing approaches, and compare results for connectivity inference in different settings."}}
{"id": "6jvdaHHTu0", "cdate": 1546300800000, "mdate": 1681169853526, "content": {"title": "Latent goal models for dynamic strategic interaction", "abstract": ""}}
