{"id": "2trZWf0924F", "cdate": 1514764800000, "mdate": 1684156186242, "content": {"title": "An Animal Detection Pipeline for Identification", "abstract": "This paper proposes a 5-component detection pipeline for use in a computer vision-based animal recognition system. The end result of our proposed pipeline is a collection of novel annotations of interest (AoI) with species and view-point labels. These AoIs, for example, could be fed as the focused input data into an appearance-based animal identification system. The goal of our method is to increase the reliability and automation of animal censusing studies and to provide better ecological information to conservationists. Our method is able to achieve a localization mAP of 81.67%, a species and viewpoint annotation classification accuracy of 94.28% and 87.11%, respectively, and an AoI accuracy of 72.75% across 6 animal species of interest. We also introduce the Wildlife Image and Localization Dataset (WILD), which contains 5,784 images and 12,007 labeled annotations across 28 classification species and a variety of challenging, real-world detection scenarios."}}
{"id": "rxjrgi9c6tA", "cdate": 1483228800000, "mdate": 1684156186278, "content": {"title": "Animal Population Censusing at Scale with Citizen Science and Photographic Identification", "abstract": ""}}
{"id": "I0kCfKdAtt", "cdate": 1483228800000, "mdate": 1681852931791, "content": {"title": "Wildbook: Crowdsourcing, computer vision, and data science for conservation", "abstract": "Photographs, taken by field scientists, tourists, automated cameras, and incidental photographers, are the most abundant source of data on wildlife today. Wildbook is an autonomous computational system that starts from massive collections of images and, by detecting various species of animals and identifying individuals, combined with sophisticated data management, turns them into high resolution information database, enabling scientific inquiry, conservation, and citizen science. We have built Wildbooks for whales (flukebook.org), sharks (whaleshark.org), two species of zebras (Grevy's and plains), and several others. In January 2016, Wildbook enabled the first ever full species (the endangered Grevy's zebra) census using photographs taken by ordinary citizens in Kenya. The resulting numbers are now the official species census used by IUCN Red List: http://www.iucnredlist.org/details/7950/0. In 2016, Wildbook partnered up with WWF to build Wildbook for Sea Turtles, Internet of Turtles (IoT), as well as systems for seals and lynx. Most recently, we have demonstrated that we can now use publicly available social media images to count and track wild animals. In this paper we present and discuss both the impact and challenges that the use of crowdsourced images can have on wildlife conservation."}}
{"id": "ApviV985LoZ", "cdate": 1483228800000, "mdate": 1686430696443, "content": {"title": "Identifying individual animals using ranking, verification, and connectivity", "abstract": "In this thesis we address the problem of identifying individual animals using images in the context of assisting an ecologist in performing a population census. We are motivated by events like the \"Great Zebra Count\" where thousands of images of zebras and giraffes were collected in Nairobi National Park over two days. By grouping all images that contain the same individual we can census these populations. This problem is challenging because images are collected outdoors and contain occlusion, lighting, and quality variations and because the animals exhibit viewpoint and pose variations."}}
{"id": "rdKomDiHp-9", "cdate": 1356998400000, "mdate": 1684156186106, "content": {"title": "HotSpotter - Patterned species instance recognition", "abstract": "We present HotSpotter, a fast, accurate algorithm for identifying individual animals against a labeled database. It is not species specific and has been applied to Grevy's and plains zebras, giraffes, leopards, and lionfish. We describe two approaches, both based on extracting and matching keypoints or “hotspots”. The first tests each new query image sequentially against each database image, generating a score for each database image in isolation, and ranking the results. The second, building on recent techniques for instance recognition, matches the query image against the database using a fast nearest neighbor search. It uses a competitive scoring mechanism derived from the Local Naive Bayes Nearest Neighbor algorithm recently proposed for category recognition. We demonstrate results on databases of more than 1000 images, producing more accurate matches than published methods and matching each query image in just a few seconds."}}
