{"id": "BzjLaVvr955", "cdate": 1686324869465, "mdate": null, "content": {"title": "Topology-Matching Normalizing Flows for Out-of-Distribution Detection in Robot Learning", "abstract": "To facilitate reliable deployments of autonomous robots in the real world, Out-of-Distribution (OOD) detection capabilities are often required. A powerful approach for OOD detection is based on density estimation with Normalizing Flows (NFs). However, we find that prior work with NFs attempts to match the complex target distribution topologically with naı̈ve base distributions leading to adverse implications. In this work, we circumvent this topological mismatch using an expressive class-conditional base distribution trained with an information-theoretic objective to match the required topology. The proposed method enjoys the merits of wide compatibility with existing learned models without any performance degradation and minimum computation overhead while enhancing OOD detection capabilities. We demonstrate superior results in density estimation and 2D object detection benchmarks in comparison with extensive baselines. Moreover, we showcase the applicability of the method with a real-robot deployment."}}
{"id": "liMd2P3kwI", "cdate": 1666083111510, "mdate": null, "content": {"title": "Virtual Reality via Object Pose Estimation and Active Learning: Realizing Telepresence Robots with Aerial Manipulation Capabilities", "abstract": "This article presents a novel telepresence system for advancing aerial manipulation in dynamic and\nunstructured environments. The proposed system not only features a haptic device, but also a virtual\nreality (VR) interface that provides real-time 3D displays of the robot’s workspace as well as a\nhaptic guidance to its remotely located operator. To realize this, multiple sensors namely a LiDAR,\ncameras and IMUs are utilized. For processing of the acquired sensory data, pose estimation pipelines\nare devised for industrial objects of both known and unknown geometries. We further propose an\nactive learning pipeline in order to increase the sample efficiency of a pipeline component that relies\non Deep Neural Networks (DNNs) based object detection. All these algorithms jointly address\nvarious challenges encountered during the execution of perception tasks in industrial scenarios.\nIn the experiments, exhaustive ablation studies are provided to validate the proposed pipelines.\nMethodologically, these results commonly suggest how an awareness of the algorithms’ own failures\nand uncertainty (”introspection”) can be used tackle the encountered problems. Moreover, outdoor\nexperiments are conducted to evaluate the effectiveness of the overall system in enhancing aerial\nmanipulation capabilities. In particular, with flight campaigns over days and nights, from spring to\nwinter, and with different users and locations, we demonstrate over 70 robust executions of pick-and-\nplace, force application and peg-in-hole tasks with the DLR cable-Suspended Aerial Manipulator\n(SAM). As a result, we show the viability of the proposed system in future industrial applications"}}
{"id": "eIk6eBz3Wlt", "cdate": 1624097052410, "mdate": null, "content": {"title": "Trust Your Robots! Predictive Uncertainty Estimation of Neural Networks with Sparse Gaussian Processes", "abstract": "This paper presents a probabilistic framework to obtain both reliable and fast uncertainty estimates for predictions with Deep Neural Networks (DNNs). Our main contribution is a practical and principled combination of DNNs with sparse Gaussian Processes (GPs). We prove theoretically that DNNs can be seen as a special case of sparse GPs, namely mixtures of GP experts (MoE-GP), and we devise a learning algorithm that brings the derived theory into practice. In experiments from two different robotic tasks -- inverse dynamics of a manipulator and object detection on a micro-aerial vehicle (MAV) -- we show the effectiveness of our approach in terms of predictive uncertainty, improved scalability, and run-time efficiency on a Jetson TX2. We thus argue that our approach can pave the way towards reliable and fast robot learning systems with uncertainty awareness."}}
{"id": "vmLdTIbUhvV", "cdate": 1577836800000, "mdate": null, "content": {"title": "Visual-Inertial Telepresence for Aerial Manipulation", "abstract": "This paper presents a novel telepresence system for enhancing aerial manipulation capabilities. It involves not only a haptic device, but also a virtual reality that provides a 3D visual feedback to a remotely-located teleoperator in real-time. We achieve this by utilizing onboard visual and inertial sensors, an object tracking algorithm and a pre-generated object database. As the virtual reality has to closely match the real remote scene, we propose an extension of a marker tracking algorithm with visual-inertial odometry. Both indoor and outdoor experiments show benefits of our proposed system in achieving advanced aerial manipulation tasks, namely grasping, placing, force exertion and peg-in-hole insertion."}}
{"id": "ihAvjhGQm2w", "cdate": 1577836800000, "mdate": null, "content": {"title": "Estimating Model Uncertainty of Neural Networks in Sparse Information Form", "abstract": "We present a sparse representation of model uncertainty for Deep Neural Networks (DNNs) where the parameter posterior is approximated with an inverse formulation of the Multivariate Normal Distribution (MND), also known as the information form. The key insight of our work is that the information matrix, i.e. the inverse of the covariance matrix tends to be sparse in its spectrum. Therefore, dimensionality reduction techniques such as low rank approximations (LRA) can be effectively exploited. To achieve this, we develop a novel sparsification algorithm and derive a cost-effective analytical sampler. As a result, we show that the information form can be scalably applied to represent model uncertainty in DNNs. Our exhaustive theoretical analysis and empirical evaluations on various benchmarks show the competitiveness of our approach over the current methods."}}
{"id": "egcHIm2PKqE", "cdate": 1577836800000, "mdate": null, "content": {"title": "Learning Multiplicative Interactions with Bayesian Neural Networks for Visual-Inertial Odometry", "abstract": "This paper presents an end-to-end multi-modal learning approach for monocular Visual-Inertial Odometry (VIO), which is specifically designed to exploit sensor complementarity in the light of sensor degradation scenarios. The proposed network makes use of a multi-head self-attention mechanism that learns multiplicative interactions between multiple streams of information. Another design feature of our approach is the incorporation of the model uncertainty using scalable Laplace Approximation. We evaluate the performance of the proposed approach by comparing it against the end-to-end state-of-the-art methods on the KITTI dataset and show that it achieves superior performance. Importantly, our work thereby provides an empirical evidence that learning multiplicative interactions can result in a powerful inductive bias for increased robustness to sensor failures."}}
{"id": "UUsU5TtCTvZ", "cdate": 1577836800000, "mdate": null, "content": {"title": "Bayesian Optimization Meets Laplace Approximation for Robotic Introspection", "abstract": "In robotics, deep learning (DL) methods are used more and more widely, but their general inability to provide reliable confidence estimates will ultimately lead to fragile and unreliable systems. This impedes the potential deployments of DL methods for long-term autonomy. Therefore, in this paper we introduce a scalable Laplace Approximation (LA) technique to make Deep Neural Networks (DNNs) more introspective, i.e. to enable them to provide accurate assessments of their failure probability for unseen test data. In particular, we propose a novel Bayesian Optimization (BO) algorithm to mitigate their tendency of under-fitting the true weight posterior, so that both the calibration and the accuracy of the predictions can be simultaneously optimized. We demonstrate empirically that the proposed BO approach requires fewer iterations for this when compared to random search, and we show that the proposed framework can be scaled up to large datasets and architectures."}}
{"id": "6uQqe_ziM02", "cdate": 1577836800000, "mdate": null, "content": {"title": "Visual-Inertial Telepresence for Aerial Manipulation", "abstract": "This paper presents a novel telepresence system for enhancing aerial manipulation capabilities. It involves not only a haptic device, but also a virtual reality that provides a 3D visual feedback to a remotely-located teleoperator in real-time. We achieve this by utilizing onboard visual and inertial sensors, an object tracking algorithm and a pregenerated object database. As the virtual reality has to closely match the real remote scene, we propose an extension of a marker tracking algorithm with visual-inertial odometry. Both indoor and outdoor experiments show benefits of our proposed system in achieving advanced aerial manipulation tasks, namely grasping, placing, force exertion and peg-in-hole insertion."}}
{"id": "-rgLQU70Ol8", "cdate": 1577836800000, "mdate": null, "content": {"title": "Estimating Model Uncertainty of Neural Networks in Sparse Information Form", "abstract": "We present a sparse representation of model uncertainty for Deep Neural Networks (DNNs) where the parameter posterior is approximated with an inverse formulation of the Multivariate Normal Distribu..."}}
{"id": "Bkxd9JBYPH", "cdate": 1569439632291, "mdate": null, "content": {"title": "Representing Model Uncertainty of Neural Networks in Sparse Information Form", "abstract": "This paper addresses the problem of representing a system's belief using multi-variate normal distributions (MND) where the underlying model is based on a deep neural network (DNN). The major challenge with DNNs is the computational complexity that is needed to obtain model uncertainty using MNDs. To achieve a scalable method, we propose a novel approach that expresses the parameter posterior in sparse information form. Our inference algorithm is based on a novel Laplace Approximation scheme, which involves a diagonal correction of the Kronecker-factored eigenbasis. As this makes the inversion of the information matrix intractable - an operation that is required for full Bayesian analysis, we devise a low-rank   approximation of this eigenbasis and a memory-efficient sampling scheme. We provide both a theoretical analysis and an empirical evaluation on various benchmark data sets, showing the superiority of our approach over existing methods."}}
