{"id": "IOQ5q64v0A_", "cdate": 1679911053234, "mdate": 1679911053234, "content": {"title": "Improved measurement of the shape of the electron", "abstract": "The electron is predicted to be slightly aspheric1, with a distortion characterized by the electric dipole moment (EDM), de. No experiment has ever detected this deviation. The standard model of particle physics predicts that de is far too small to detect2, being some eleven orders of magnitude smaller than the current experimental sensitivity. However, many extensions to the standard model naturally predict much larger values of de that should be detectable3. This makes the search for the electron EDM a powerful way to search for new physics and constrain the possible extensions. In particular, the popular idea that new supersymmetric particles may exist at masses of a few hundred GeV/c2 (where c is the speed of light) is difficult to reconcile with the absence of an electron EDM at the present limit of sensitivity2,4. The size of the EDM is also intimately related to the question of why the Universe has so little antimatter. If the reason is that some undiscovered particle interaction5 breaks the symmetry between matter and antimatter, this should result in a measurable EDM in most models of particle physics2. Here we use cold polar molecules to measure the electron EDM at the highest level of precision reported so far, providing a constraint on any possible new interactions. We obtain de = (−2.4 ± 5.7stat ± 1.5syst) × 10−28e cm, where e is the charge on the electron, which sets a new upper limit of |de| < 10.5 × 10−28e cm with 90 per cent confidence. This result, consistent with zero, indicates that the electron is spherical at this improved level of precision. Our measurement of atto-electronvolt energy shifts in a molecule probes new physics at the tera-electronvolt energy scale2."}}
{"id": "07G2b6io89", "cdate": 1679910906386, "mdate": 1679910906386, "content": {"title": "A term-rewriting system for computer quantum algebra", "abstract": "Existing computer algebra packages do not fully support quantum mechanics calculations in Dirac's notation. I present the foundation for building such support: a mathematical system for the symbolic manipulation of expressions used in the invariant formalism of quantum mechanics. I first describe the essential mathematical features of the Hilbert-space invariant formalism. This is followed by a formal characterisation of all possible algebraic expressions in this formalism. This characterisation is provided in the form of a set of terms. Rewrite rules over this set of terms are then developed that correspond to allowed manipulations of the algebraic expressions. This approach is contrasted with current attempts to build invariant quantum mechanics calculations into computer algebra systems."}}
{"id": "6a9nm-yFuJ0", "cdate": 1514764800000, "mdate": null, "content": {"title": "Kickstarting Deep Reinforcement Learning.", "abstract": "We present a method for using previously-trained 'teacher' agents to kickstart the training of a new 'student' agent. To this end, we leverage ideas from policy distillation and population based training. Our method places no constraints on the architecture of the teacher or student agents, and it regulates itself to allow the students to surpass their teachers in performance. We show that, on a challenging and computationally-intensive multi-task benchmark (DMLab-30), kickstarted training improves the data efficiency of new agents, making it significantly easier to iterate on their design. We also show that the same kickstarting pipeline can allow a single student agent to leverage multiple 'expert' teachers which specialize on individual tasks. In this setting kickstarting yields surprisingly large gains, with the kickstarted agent matching the performance of an agent trained from scratch in almost 10x fewer steps, and surpassing its final performance by 42 percent. Kickstarting is conceptually simple and can easily be incorporated into reinforcement learning experiments."}}
{"id": "hTd_vNxyOo", "cdate": 1420070400000, "mdate": null, "content": {"title": "An algorithm for discovering Lagrangians automatically from data.", "abstract": "An activity fundamental to science is building mathematical models. These models are used to both predict the results of future experiments and gain insight into the structure of the system under study. We present an algorithm that automates the model building process in a scientifically principled way. The algorithm can take observed trajectories from a wide variety of mechanical systems and, without any other prior knowledge or tuning of parameters, predict the future evolution of the system. It does this by applying the principle of least action and searching for the simplest Lagrangian that describes the system’s behaviour. By generating this Lagrangian in a human interpretable form, it can also provide insight into the workings of the system."}}
