{"id": "icfj6hsDHb", "cdate": 1685577600000, "mdate": 1693678385803, "content": {"title": "Orchestrating Image Retrieval and Storage Over a Cloud System", "abstract": "Since massive numbers of images are now being communicated from, and stored in different cloud systems, faster retrieval has become extremely important. This is more relevant, especially after COVID-19 in bandwidth-constrained environments. However, to the best of our knowledge, a coherent solution to overcome this problem is yet to be investigated in the literature. In this article, by customizing the Progressive JPEG method, we propose a new Scan Script to ensure Faster Image Retrieval. Furthermore, we also propose a new lossy PJPEG architecture to reduce the file size as a solution to overcome our Scan Script's drawback. In order to achieve an orchestration between them, we improve the scanning of Progressive JPEG's picture payloads to ensure Faster Image Retrieval using the change in bit pixels of distinct Luma and Chroma components ( <inline-formula><tex-math notation=\"LaTeX\">$Y$</tex-math></inline-formula> , <inline-formula><tex-math notation=\"LaTeX\">$C_{b}$</tex-math></inline-formula> , and <inline-formula><tex-math notation=\"LaTeX\">$C_{r}$</tex-math></inline-formula> ). The orchestration improves user experience even in bandwidth-constrained cases. We evaluate our proposed orchestration in a real-world setting across two continents encompassing a private cloud. Compared to existing alternatives, our proposed orchestration can improve user waiting time by up to 54% and decrease image size by up to 27%. Our proposed work is tested in cutting-edge cloud apps, ensuring up to 69% quicker loading time."}}
{"id": "_4c3gb2ELUV", "cdate": 1672531200000, "mdate": 1693677995616, "content": {"title": "Unmasking the Invisible: Finding Location-Specific Aggregated Air Quality Index with Smartphone-Captured Images", "abstract": "The prevalence and mobility of smartphones make these a widely used tool for environmental health research. However, their potential for determining aggregated air quality index (AQI) based on PM2.5 concentration in specific locations remains largely unexplored in the existing literature. In this paper, we thoroughly examine the challenges associated with predicting location-specific PM2.5 concentration using images taken with smartphone cameras. The focus of our study is on Dhaka, the capital of Bangladesh, due to its significant air pollution levels and the large population exposed to it. Our research involves the development of a Deep Convolutional Neural Network (DCNN), which we train using over a thousand outdoor images taken and annotated. These photos are captured at various locations in Dhaka, and their labels are based on PM2.5 concentration data obtained from the local US consulate, calculated using the NowCast algorithm. Through supervised learning, our model establishes a correlation index during training, enhancing its ability to function as a Picture-based Predictor of PM2.5 Concentration (PPPC). This enables the algorithm to calculate an equivalent daily averaged AQI index from a smartphone image. Unlike, popular overly parameterized models, our model shows resource efficiency since it uses fewer parameters. Furthermore, test results indicate that our model outperforms popular models like ViT and INN, as well as popular CNN-based models such as VGG19, ResNet50, and MobileNetV2, in predicting location-specific PM2.5 concentration. Our dataset is the first publicly available collection that includes atmospheric images and corresponding PM2.5 measurements from Dhaka. Our code and dataset will be made public when publishing the paper."}}
{"id": "FZ897_wVO1", "cdate": 1672531200000, "mdate": 1681147607331, "content": {"title": "Sherlock in OSS: A Novel Approach of Content-Based Searching in Object Storage System", "abstract": ""}}
{"id": "3260NkL1SA", "cdate": 1672531200000, "mdate": 1693678385845, "content": {"title": "'Khep': Exploring Factors that Influence The Preference of Contractual Rides to Ride-Sharing Apps in Bangladesh", "abstract": "With rapid urbanization and increasing traffic congestion in major cities, alternative modes of transportation have gained significant attention. The ride-sharing app revolution also has sparked a significant transformation in the transportation industry, along with “Khep”, an unusual ride-sharing approach where individuals negotiate fares directly with drivers personally, which has become a popular means of transportation. In this research, we investigate various factors that influence the preference for such unconventional contractual rides over ride-sharing apps, such as cultural norms, trust issues, affordability, and accessibility. Moreover, we explore the role of technology literacy, marketing strategies, and regulatory frameworks in shaping the adoption landscape. After conducting a survey and interviews, we conduct a thorough analysis to determine the expected findings and uncover meaningful insights regarding the utilization, preferences, and challenges within the ride-sharing industry in Bangladesh. The findings of this study reveal that cultural factors, such as the preference for bargaining and personal connections, strongly influence the popularity of contractual rides. Additionally, concerns related to safety, data privacy, and trust act as barriers to ride-sharing app adoption. Being associated with UN SDG Goals 11 and 9, the implications of this research extend beyond Bangladesh and can provide insights for policymakers, transportation companies, and technology developers seeking to understand the factors shaping the adoption of ride-sharing apps in similar contexts."}}
{"id": "2NVV5EJZ9rs", "cdate": 1640995200000, "mdate": 1681147607330, "content": {"title": "Note: Plant Leaf Disease Network (PLeaD-Net): Identifying Plant Leaf Diseases through Leveraging Limited-Resource Deep Convolutional Neural Network", "abstract": ""}}
