{"id": "6jS4kjzwqhb", "cdate": 1696408098928, "mdate": 1696408098928, "content": {"title": "An enhanced Conv-TasNet model for speech separation using a speaker distance-based loss function", "abstract": "This work addresses the problem of speech separation in the Spanish Language using pre-trained deep learning models. As with many speech processing tasks, large databases in other languages different from English are scarce. Therefore this work explores different training strategies using the Conv-TasNet model as a benchmark. A scale-invariant signal distortion ratio (SI-SDR) metric value of 9.9 dB was achieved for the best training strategy. Then, experimentally, we identified an inverse relationship between the speakers' similarity and the model's performance, so an improved ConvTasNet architecture was proposed. The enhanced Conv-TasNet model uses pre-trained speech embeddings to add a between-speakers cosine similarity term in the cost function, yielding an SI-SDR of 10.6 dB. Lastly, final experiments regarding real-time deployment show some drawbacks in the speakers' channel synchronization due to the need to process small speech segments where only one of the speakers appears."}}
{"id": "yGypeeNJZr", "cdate": 1696407931440, "mdate": 1696407931440, "content": {"title": "Analysis of the Clever Hans Effect in COVID-19 Detection Using Chest X-Ray Images and Bayesian Deep Learning", "abstract": "In recent months, the detection of COVID-19 from radiological images has become a research topic of significant interest. This is because previous results demonstrate the feasibility of the application, but literature has also reported some biases of the systems developed, which significantly limit their translation to the clinic. This paper deals with a set of explainability/interpretability techniques to analise spurious correlations during the inference, the consistency of the decisions, the uncertainty of the models, their performance, and certain biasing effects. For this purpose, we used two different off-the-shelf convolutional neural networks (DenseNet-121 and EfficientNet-B6) and their Bayesian counterparts. In view of the results, DenseNet is preferred in both its deteministic and stochastic versions, reaching BAcc over 97 % training with a large dataset (more than 70,000 images). However, results demonstrate that the artificial models are significantly affected by the Clever Hans effect, which is minimized pre-processing with a semantic segmentation of the lungs to guide the learning process towards an area with a causal relationship with the problem under study. Conclusions could also be extrapolated to the general context of pneumonia detection from plain chest X-Ray images."}}
{"id": "Dr6EHLb1x9W", "cdate": 1649352262779, "mdate": 1649352262779, "content": {"title": "Artificial Intelligence Applied to Chest X-Ray Images for the Automatic Detection of COVID-19. A Thoughtful Evaluation Approach", "abstract": "Current standard protocols used in the clinic for diagnosing COVID-19 include molecular or antigen tests, generally complemented by a plain chest X-Ray. The combined analysis aims to reduce the significant number of false negatives of these tests and provide complementary evidence about the presence and severity of the disease. However, the procedure is not free of errors, and the interpretation of the chest X-Ray is only restricted to radiologists due to its complexity. With the long term goal to provide new evidence for the diagnosis, this paper presents an evaluation of different methods based on a deep neural network. These are the first steps to develop an automatic COVID-19 diagnosis tool using chest X-Ray images to differentiate between controls, pneumonia, or COVID-19 groups. The paper describes the process followed to train a Convolutional Neural Network with a dataset of more than 79, 500 X-Ray images compiled from different sources, including more than 8, 500 COVID-19 examples. Three different experiments following three preprocessing schemes are carried out to evaluate and compare the developed models. The aim is to evaluate how preprocessing the data affects the results and improves its explainability. Likewise, a critical analysis of different variability issues that might compromise the system and its effects is performed. With the employed methodology, a 91.5% classification accuracy is obtained, with an 87.4% average recall for the worst but most explainable experiment, which requires a previous automatic segmentation of the lung region."}}
{"id": "VsM3YRxRLgI", "cdate": 1577836800000, "mdate": null, "content": {"title": "Multimodal and Multi-Output Deep Learning Architectures for the Automatic Assessment of Voice Quality Using the GRB Scale", "abstract": "This article addresses the automatic assessment of voice quality according to the GRB scale, based on the use of a variety of deep learning architectures for prediction purposes. The proposed architectures are multimodal, because they employ multiples sources of information; and also multi-output, because they simultaneously predict all the traits of the GRB scale. A feature engineering approach is followed, based on the use of deep neural networks and a set of well-established features such as MFCC, perturbation and complexity characteristics. Likewise, a representation learning is considered, using convolutional neural networks feed on modulation spectra extracted from voices. Finally, diverse loss functions are also investigated, including two surrogate ordinal classification, a conventional weighed categorical cross-entropy, and a mean square error function. Experiments are carried out in a dataset containing registers of the sustained phonation of three vowels. The best deep learning architecture provides a relative performance improvement of 6.25% for G, 14.1% for R and 18.1% for B, in comparison with recently published results using the same dataset."}}
{"id": "sRuBPaPUmcQ", "cdate": 1514764800000, "mdate": null, "content": {"title": "Protein Disorder Prediction using Jumping Motifs from Torsion Angles Dynamics in Ramachandran Plots", "abstract": "Disordered proteins are functional proteins that do not fold in a fixed 3D structure. The order/disorder prediction in protein sequences is an important task given the biological roles of disordered proteins. In the last decade many computational based methods have been proposed for the disorder identification but currently the most accurate strategies depend on the sequence alignment of large databases of proteins, making the methods slow and hard to apply on proteome-wide analysis. In this paper is proposed an innovative approach for linking the amino acid sequences with transition tendencies in their dihedral torsion angles. The aim is to characterize the dynamical angle variations along the protein chain, as a way of measuring the flexibility of the amino acids and its connection with the disorder state. The features are estimated from empirical propensities computed from Ramachandran Plots. The classification is performed using structural learning in the form of CRF (Conditional Random Fields). The performance is evaluated in terms of AUC (Area Under the ROC Curve), and three suitable performance metrics for unbalanced classification problems. The results show that the proposed method outperforms the most referenced alignment-free predictors and its performance is also competitive with the slower and mature alignment-based methods."}}
{"id": "QPGwp2bfR4", "cdate": 1514764800000, "mdate": null, "content": {"title": "ByoVoz Automatic Voice Condition Analysis System for the 2018 FEMH Challenge", "abstract": "This paper presents the methods and results used by the ByoVoz team for the design of an automatic voice condition analysis system, which was submitted to the 2018 Far East Memorial Hospital voice data challenge. The proposed methodology is based on a cascading scheme that firstly discriminates between pathological and normophonic voices, and then identifies the type of disorder. By using diverse feature selection techniques, a subset of complexity, spectral/cepstral and perturbation characteristics were identified for the proposed tasks. Then, several generative classification methodologies based on Gaussian Mixture Models and Gradient Boosting were employed to provide decisions about the input voices in the binary classification, and using one-vs-one classification systems based on Random Forests for the categorization according to the type of disorder. By using a 4-folds cross-validation approach on the training partition a sensitivity=0.93 and specificity=0.74 was obtained. Similarly, an unweighted average recall of 0.63 and an accuracy of 66% was obtained for the identification task. Using the scoring metric proposed in the challenge the final resulting score is of 0.77. When the testing partition was considered, a sensitivity of 0.92, specificity of 0.54, unweighted average recall of 0.61 and a score of 0.72 were obtained. This was the fifth best result in the competition."}}
{"id": "MplJCJZILF8", "cdate": 1483228800000, "mdate": null, "content": {"title": "Protein Disorder Prediction using Information Theory Measures on the Distribution of the Dihedral Torsion Angles from Ramachandran Plots", "abstract": "This paper addresses the problem of order/disorder prediction in protein sequences from alignment free methods. The proposed approach is based on a set of 11 information theory measures estimated from the distribution of the dihedral torsion angles in the amino acid chain. The aim is to characterize the energetically allowed regions for amino acids in the protein structures, as a way of measuring the rigidity/flexibility of every amino acid in the chain, and the effect of such rigidity on the disorder propensity. The features are estimated from empirical Ramachandran Plots obtained using the Protein Geometry Database. The proposed features are used in conjunction with well-established features in the state of the art for disorder prediction. The classification is performed using two different strategies: one based on conventional supervised methods and the other one based on structural learning. The performance is evaluated in terms of AUC (Area Under the ROC Curve), and three suitable performance metrics for unbalanced classification problems. The results show that the proposed scheme using conventional supervised methods is able to achieve results similar than well-known alignment free methods for disorder prediction. Moreover, the scheme based on structural learning outperforms the results obtained for all the methods evaluated, including three alignment-based methods."}}
{"id": "9cgcU5oq-g", "cdate": 1483228800000, "mdate": null, "content": {"title": "Automatic Feature Selection in the SOPFs Dissolution Profiles Prediction Problem", "abstract": "This work addressed the problem of dimensionality reduction in the drug dissolution profile prediction task. The learning problem is assumed as a multi-output learning task, since dissolution profiles are recorded in non-uniform sampling times, which avoid the use of basic function-on-scalar regression approaches. Ensemblebased tree methods are used for prediction, and also for the selection of the most relevant features, because they are able to deal with high dimensional feature spaces, when the number of training samples is small. All the drugs considered corresponds to rapid release solid oral pharmaceutical forms. Six different feature selection schemes were tested, including sequential feature selection and genetic algorithms, along with a feature scoring procedure, which was proposed in order to get a consensus about the best subset of variables. The performance was evaluated in terms of the similitude factor used in the drug industry for dissolution profile comparison. The feature selection methods were able to reduce the dimensionality of the feature space in 79.2%, without loss in the performance of the prediction system. The results confirm that in the dissolution profile prediction problem, especially for different solid oral pharmaceutical forms, variables from different components and phases of the drug development must be considered."}}
{"id": "O8sT9w7Zo_d", "cdate": 1451606400000, "mdate": null, "content": {"title": "Towards an automatic monitoring of the neurological state of Parkinson's patients from speech", "abstract": "The suitability of articulation measures and speech intelligibility is evaluated to estimate the neurological state of patients with Parkinson's disease (PD). A set of measures recently introduced to model the articulatory capability of PD patients is considered. Additionally, the speech intelligibility in terms of the word accuracy obtained from the Google® speech recognizer is included. Recordings of patients in three different languages are considered: Spanish, German, and Czech. Additionally, the proposed approach is tested on data recently used in the INTERSPEECH 2015 Computational Paralinguistics Challenge. According to the results, it is possible to estimate the neurological state of PD patients from speech with a Spearman's correlation of up to 0.72 with respect to the evaluations performed by neurologist experts."}}
{"id": "Xhouj2LK3C1", "cdate": 1420070400000, "mdate": null, "content": {"title": "Entropies from Markov Models as Complexity Measures of Embedded Attractors", "abstract": "This paper addresses the problem of measuring complexity from embedded attractors as a way to characterize changes in the dynamical behavior of different types of systems with a quasi-periodic behavior by observing their outputs. With the aim of measuring the stability of the trajectories of the attractor along time, this paper proposes three new estimations of entropy that are derived from a Markov model of the embedded attractor. The proposed estimators are compared with traditional nonparametric entropy measures, such as approximate entropy, sample entropy and fuzzy entropy, which only take into account the spatial dimension of the trajectory. The method proposes the use of an unsupervised algorithm to find the principal curve, which is considered as the “profile trajectory”, that will serve to adjust the Markov model. The new entropy measures are evaluated using three synthetic experiments and three datasets of physiological signals. In terms of consistency and discrimination capabilities, the results show that the proposed measures perform better than the other entropy measures used for comparison purposes."}}
