{"id": "FcJ3250Pbx4", "cdate": 1640995200000, "mdate": 1683751996430, "content": {"title": "Boosting human decision-making with AI-generated decision aids", "abstract": "Human decision-making is plagued by many systematic errors. Many of these errors can be avoided by providing decision aids that guide decision-makers to attend to the important information and integrate it according to a rational decision strategy. Designing such decision aids used to be a tedious manual process. Advances in cognitive science might make it possible to automate this process in the future. We recently introduced machine learning methods for discovering optimal strategies for human decision-making automatically and an automatic method for explaining those strategies to people. Decision aids constructed by this method were able to improve human decision-making. However, following the descriptions generated by this method is very tedious. We hypothesized that this problem can be overcome by conveying the automatically discovered decision strategy as a series of natural language instructions for how to reach a decision. Experiment 1 showed that people do indeed understand such procedural instructions more easily than the decision aids generated by our previous method. Encouraged by this finding, we developed an algorithm for translating the output of our previous method into procedural instructions. We applied the improved method to automatically generate decision aids for a naturalistic planning task (i.e., planning a road trip) and a naturalistic decision task (i.e., choosing a mortgage). Experiment 2 showed that these automatically generated decision-aids significantly improved people's performance in planning a road trip and choosing a mortgage. These findings suggest that AI-powered boosting might have potential for improving human decision-making in the real world."}}
{"id": "f-kqQTU0Pqc", "cdate": 1609459200000, "mdate": 1683751996430, "content": {"title": "Automatic discovery and description of human planning strategies", "abstract": "Scientific discovery concerns finding patterns in data and creating insightful hypotheses that explain these patterns. Traditionally, this process required human ingenuity, but with the galloping advances in artificial intelligence (AI) it becomes feasible to automate some parts of scientific discovery. In this work we leverage AI for strategy discovery for understanding human planning. In the state-of-the-art methods data about the process of human planning is often used to group similar behaviors together and formulate verbal descriptions of the strategies which might underlie those groups. Here, we automate these two steps. Our method utilizes a new algorithm, called Human-Interpret, that performs imitation learning to describe sequences of planning operations in terms of a procedural formula and then translates that formula to natural language. We test our method on a benchmark data set that researchers have previously scrutinized manually. We find that the descriptions of human planning strategies obtained automatically are about as understandable as human-generated descriptions. They also cover a substantial proportion of of relevant types of human planning strategies that had been discovered manually. Our method saves scientists' time and effort as all the reasoning about human planning is done automatically. This might make it feasible to more rapidly scale up the search for yet undiscovered cognitive strategies to many new decision environments, populations, tasks, and domains. Given these results, we believe that the presented work may accelerate scientific discovery in psychology, and due to its generality, extend to problems from other fields."}}
{"id": "OL7oP5xKvO", "cdate": 1609459200000, "mdate": 1683751996598, "content": {"title": "Automatic discovery of interpretable planning strategies", "abstract": "When making decisions, people often overlook critical information or are overly swayed by irrelevant information. A common approach to mitigate these biases is to provide decision-makers, especially professionals such as medical doctors, with decision aids, such as decision trees and flowcharts. Designing effective decision aids is a difficult problem. We propose that recently developed reinforcement learning methods for discovering clever heuristics for good decision-making can be partially leveraged to assist human experts in this design process. One of the biggest remaining obstacles to leveraging the aforementioned methods for improving human decision-making is that the policies they learn are opaque to people. To solve this problem, we introduce AI-Interpret: a general method for transforming idiosyncratic policies into simple and interpretable descriptions. Our algorithm combines recent advances in imitation learning and program induction with a new clustering method for identifying a large subset of demonstrations that can be accurately described by a simple, high-performing decision rule. We evaluate our new AI-Interpret algorithm and employ it to translate information-acquisition policies discovered through metalevel reinforcement learning. The results of three large behavioral experiments showed that providing the decision rules generated by AI-Interpret as flowcharts significantly improved people’s planning strategies and decisions across three different classes of sequential decision problems. Moreover, our fourth experiment revealed that this approach is significantly more effective at improving human decision-making than training people by giving them performance feedback. Finally, a series of ablation studies confirmed that our AI-Interpret algorithm was critical to the discovery of interpretable decision rules and that it is ready to be applied to other reinforcement learning problems. We conclude that the methods and findings presented in this article are an important step towards leveraging automatic strategy discovery to improve human decision-making. The code for our algorithm and the experiments is available at https://github.com/RationalityEnhancement/InterpretableStrategyDiscovery ."}}
{"id": "ruDRsh_utVY", "cdate": 1577836800000, "mdate": 1683751996596, "content": {"title": "Flexible Strategy Use in Soar's Tic-Tac-Toe", "abstract": "Modeling cognitive processes is one of the major tasks of cognitive science. This work presents a model of a study described in ”Flexible Strategy Use in Young Children’s Tic-Tac-Toe” (Crowley & Siegler, 1993) in which the authors made an attempt to characterize decision-making in a conflict-of-interests-like environment. In the experiments, kindergarten/primary school children and an algorithm-based opponent played a series of games in Tic-Tac-Toe. The outcomes seemed to indicate the existence of a hierarchy of rules that is constructed with experience. Although already tested algorithmically, the simulation detailed in the paper was applicable to a narrow class of problems only. The model shown in this work was built using a cognitive architecture, i.e. computer-based structure mimicking the general functioning of the human mind. Concretely, we used a rule-based system Soar that operates in mental rules paradigm and in most part replicated the results of the mentioned study."}}
{"id": "8JyQbWuJXdt", "cdate": 1546300800000, "mdate": 1683751996598, "content": {"title": "Flexible Strategy Use in ACT-R's Tic-Tac-Toe", "abstract": "Modeling cognitive processes is one of the major tasks of cognitive science. This work presents a computer model of a study described in \"Flexible Strategy Use in Young Children's Tic-Tac-Toe\" (Crowley & Siegler, 1993) in which authors made an attempt to characterize decision-making in a conflict-of-interests-like environment. In the experiments, kindergarten/primary school children and an algorithm-based opponent played a series of games in Tic-Tac-Toe. The outcomes seemed to indicate existence of a hierarchy of rules that is constructed with experience. Although already tested algorithmically, the simulation detailed in the paper was applicable to a narrow class of problems only. The model shown in this work was built using a cognitive architecture, i.e. computer-based structure mimicking general functioning of the human mind. We used a rule-based system ACT-R that operates in mental rules paradigm and successfully replicated results of the mentioned study."}}
{"id": "c03BVK8C4QN", "cdate": 1514764800000, "mdate": 1683751996601, "content": {"title": "Object [Re]Cognition with Similarity", "abstract": "We discuss the origin of the notion of similarity, basic concepts connected with it and some methods of representing this conception in mathematical setting. We present a framework of recognition that is based on multi-aspects similarity. The framework is implemented in form of a network of comparators, that processes similarity expressed in terms of fuzzy sets. Our approach introduces a new standard to the field of similarity computing and processing."}}
{"id": "Hg9QE_fVESt", "cdate": 1483228800000, "mdate": 1683751996598, "content": {"title": "A Framework for Analysis of Granular Neural Networks", "abstract": "Granular neural networks are neural networks which operate at the level of information granules. Granules, in turn, can be seen as collections of objects that exhibit similar structure or possess similar functionality. In this work we try to provide a comprehensive look at the problem of how granular, feed-forward neural networks conduct their computations, i.e. what is the interpretation for the connections and the neurons of such networks. The paper orbits around the assumption that the networks come from the superposition of their certain subnetworks which emulate membership functions for the granules. The superposition represents an aggregation of a certain number of granules into another one. This interpretation comes from a general granular tree-model that is constructed prior to the network and which describes a particular problem in a semantically understandable form."}}
