{"id": "NR93ROCQJTf", "cdate": 1687974463358, "mdate": 1687974463358, "content": {"title": "Knowledge Graph-based Question Answering with Electronic Health Records", "abstract": "Question Answering (QA) is a widely-used framework for developing and evaluating an intelligent machine. In this light, QA on Electronic Health Records (EHR), namely EHR QA, can work as a crucial milestone towards developing an intelligent agent in healthcare. EHR data are typically stored in a relational database, which can also be converted to a directed acyclic graph, allowing two approaches for EHR QA: Table-based QA and Knowledge Graph-based QA. We hypothesize that the graph-based approach is more suitable for EHR QA as graphs can represent relations between entities and values more naturally compared to tables, which essentially require JOIN operations. In this paper, we propose a graph-based EHR QA where natural language queries are converted to SPARQL instead of SQL. To validate our hypothesis, we create four EHR QA datasets (graph-based VS table-based, and simplified database schema VS original database schema), based on a table-based dataset MIMICSQL. We test both a simple Seq2Seq model and a state-of-the-art EHR QA model on all datasets where the graph-based datasets facilitated up to 34% higher accuracy than the table-based dataset without any modification to the model architectures. Finally, all datasets are open-sourced to encourage further EHR QA research in both directions."}}
{"id": "odfxM6t4ow", "cdate": 1672531200000, "mdate": 1681654968720, "content": {"title": "Deep Imbalanced Time-series Forecasting via Local Discrepancy Density", "abstract": ""}}
{"id": "tEyV6gwCECk", "cdate": 1663850258989, "mdate": null, "content": {"title": "Balancing MSE against Abrupt Changes for Time-Series Forecasting", "abstract": "Time-series forecasting models often encounter drastic changes in a given period of time (i.e., abrupt changes) which generally occur due to unexpected or unknown events. Despite their scarce occurrences in the training set, abrupt changes incur loss (i.e., MSE) that significantly contributes to the total loss. Therefore, they act as noisy training samples and prevent the model from learning generalizable sequence patterns, namely the normal states. Based on such an intuition, we propose a reweighting framework that down-weights the loss incurred by abrupt changes and up-weights those by normal states. For the reweighting framework, we first define a measurement termed Local Discrepancy (LD) which measures the degree of abruptness of a change in a given period of time. Then, we calculate how frequently the temporal changes appear in the training set based on LD (i.e., estimated LD density). Since normal states generally appear frequently compared to abrupt changes, they achieve higher LD density. Using such a property, we reweight the losses proportionally to the estimated LD density. Our reweighting framework is applicable to existing time-series forecasting models regardless of the architectures. Through extensive experiments on 12 time-series forecasting models over eight datasets with various in-output sequence lengths, we demonstrate that applying our reweighting framework reduces MSE by 10.1% on average and by up to 18.6% in the state-of-the-art model."}}
{"id": "CEbTvKc3eeK", "cdate": 1640995200000, "mdate": 1681654968937, "content": {"title": "Enemy Spotted: In-game Gun Sound Dataset for Gunshot Classification and Localization", "abstract": ""}}
{"id": "3cO77Z5ngb0", "cdate": 1609459200000, "mdate": 1681654969188, "content": {"title": "Knowledge Graph-based Question Answering with Electronic Health Records", "abstract": ""}}
{"id": "5nGcCVKLxRx", "cdate": 1577836800000, "mdate": 1684121984949, "content": {"title": "Joint Learning of Blind Video Denoising and Optical Flow Estimation", "abstract": "Many deep-learning-based image/video denoising models have been developed, and recently, several approaches for training a denoising neural network without using clean images have been proposed. However, Noise2Noise method requires paired noisy data, and obtaining them is occasionally difficult, whereas other existing models trained using unpaired noisy data deliver limited performance. Obtaining an accurate optical flow from noisy videos is also a difficult task because conven-tional optical flow estimation methods are primarily focused on estimating the optical flow using clean videos. This study proposes a new framework to fine-tune video denoising and optical flow estimation networks using unpaired noisy videos. These two networks are jointly tra-ined to realize synergy; an improvement in the denoising performance increases the accuracy of the flow estimation, and an improvement in the flow-estimation performance enhances the quality of the training data for the denoiser. Our experimental results reveal that proposed approach outperforms the existing training schemes in video denoising and also provides accurate optical flows even when the videos contain a considerable amount of noise."}}
{"id": "vlXUHao0Ik", "cdate": 1546300800000, "mdate": 1667407538495, "content": {"title": "What and Where to Translate: Local Mask-based Image-to-Image Translation", "abstract": "Recently, image-to-image translation has obtained significant attention. Among many, those approaches based on an exemplar image that contains the target style information has been actively studied, due to its capability to handle multimodality as well as its applicability in practical use. However, two intrinsic problems exist in the existing methods: what and where to transfer. First, those methods extract style from an entire exemplar which includes noisy information, which impedes a translation model from properly extracting the intended style of the exemplar. That is, we need to carefully determine what to transfer from the exemplar. Second, the extracted style is applied to the entire input image, which causes unnecessary distortion in irrelevant image regions. In response, we need to decide where to transfer the extracted style. In this paper, we propose a novel approach that extracts out a local mask from the exemplar that determines what style to transfer, and another local mask from the input image that determines where to transfer the extracted style. The main novelty of this paper lies in (1) the highway adaptive instance normalization technique and (2) an end-to-end translation framework which achieves an outstanding performance in reflecting a style of an exemplar. We demonstrate the quantitative and qualitative evaluation results to confirm the advantages of our proposed approach."}}
{"id": "SMExG720Tvd", "cdate": 1546300800000, "mdate": 1681654969449, "content": {"title": "Recommender System Using Sequential and Global Preference via Attention Mechanism and Topic Modeling", "abstract": ""}}
