{"id": "v9_aOi9Q8H8", "cdate": 1640995200000, "mdate": 1688670581082, "content": {"title": "FAST: Improving Controllability for Text Generation with Feedback Aware Self-Training", "abstract": "Controllable text generation systems often leverage control codes to direct various properties of the output like style and length. Inspired by recent work on causal inference for NLP, this paper reveals a previously overlooked flaw in these control code-based conditional text generation algorithms. Spurious correlations in the training data can lead models to incorrectly rely on parts of the input other than the control code for attribute selection, significantly undermining downstream generation quality and controllability. We demonstrate the severity of this issue with a series of case studies and then propose two simple techniques to reduce these correlations in training sets. The first technique is based on resampling the data according to an example's propensity towards each linguistic attribute (IPS). The second produces multiple counterfactual versions of each example and then uses an additional feedback mechanism to remove noisy examples (feedback aware self-training, FAST). We evaluate on 3 tasks -- news headline, meta review, and search ads generation -- and demonstrate that FAST can significantly improve the controllability and language quality of generated outputs when compared to state-of-the-art controllable text generation approaches."}}
{"id": "bnoH04OK58", "cdate": 1640995200000, "mdate": 1688670581074, "content": {"title": "DeepGen: Diverse Search Ad Generation and Real-Time Customization", "abstract": "Konstantin Golobokov, Junyi Chai, Victor Ye Dong, Mandy Gu, Bingyu Chi, Jie Cao, Yulan Yan, Yi Liu. Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing: System Demonstrations. 2022."}}
{"id": "_ftQobB_RKi", "cdate": 1609459200000, "mdate": 1688670581077, "content": {"title": "Automatic Construction of Enterprise Knowledge Base", "abstract": "Junyi Chai, Yujie He, Homa Hashemi, Bing Li, Daraksha Parveen, Ranganath Kondapally, Wenjin Xu. Proceedings of the 2021 Conference on Empirical Methods in Natural Language Processing: System Demonstrations. 2021."}}
{"id": "8FdNoo3j6B", "cdate": 1546300800000, "mdate": 1688670581084, "content": {"title": "Querying Enterprise Knowledge Graph With Natural Language", "abstract": ""}}
