{"id": "lPSyQW2A7yX", "cdate": 1702813575362, "mdate": 1702813575362, "content": {"title": "Multimodal Prompt Retrieval for Generative Visual Question Answering", "abstract": "Recent years have witnessed impressive results of pre-trained vision-language models on knowledge-intensive tasks such as visual question answering (VQA). Despite the recent advances in VQA, existing methods mainly adopt a discriminative formulation that predicts answers within a pre-defined label set, leading to easy overfitting on low-resource domains (e.g., medicine) and poor generalization under domain shift to another dataset. To tackle this limitation, we propose a novel generative model enhanced by multimodal prompt retrieval (MPR) that integrates retrieved prompts and multimodal features to generate answers in free text. Our generative model enables rapid zero-shot dataset adaptation to unseen data distributions and open-set answer labels across datasets. Our experiments on medical VQA tasks show that MPR outperforms its non-retrieval counterpart by up to 30% accuracy points in a few-shot domain adaptation setting."}}
{"id": "1HLgj_1hjd", "cdate": 1677628800000, "mdate": 1683882531213, "content": {"title": "Video Pivoting Unsupervised Multi-Modal Machine Translation", "abstract": "The main challenge in the field of unsupervised machine translation (UMT) is to associate source-target sentences in the latent space. As people who speak different languages share biologically similar visual systems, various unsupervised multi-modal machine translation (UMMT) models have been proposed to improve the performances of UMT by employing visual contents in natural images to facilitate alignment. Commonly, relation information is the important semantic in a sentence. Compared with images, videos can better present the interactions between objects and the ways in which an object transforms over time. However, current state-of-the-art methods only explore scene-level or object-level information from images without explicitly modeling objects relation; thus, they are sensitive to spurious correlations, which poses a new challenge for UMMT models. In this paper, we employ a spatial-temporal graph obtained from videos to exploit object interactions in space and time for disambiguation purposes and to promote latent space alignment in UMMT. Our model employs multi-modal back-translation and features pseudo-visual pivoting, in which we learn a shared multilingual visual-semantic embedding space and incorporate visually pivoted captioning as additional weak supervision. Experimental results on the VATEX Translation 2020 and HowToWorld datasets validate the translation capabilities of our model on both sentence-level and word-level and generalizes well when videos are not available during the testing phase."}}
{"id": "w3RxAXWsBB3", "cdate": 1640995200000, "mdate": 1680275488865, "content": {"title": "DEEP: DEnoising Entity Pre-training for Neural Machine Translation", "abstract": ""}}
{"id": "YnJRkDi63-", "cdate": 1640995200000, "mdate": 1679938899085, "content": {"title": "MIA 2022 Shared Task: Evaluating Cross-lingual Open-Retrieval Question Answering for 16 Diverse Languages", "abstract": ""}}
{"id": "YcYsBioaxL", "cdate": 1640995200000, "mdate": 1687248755186, "content": {"title": "GlobalWoZ: Globalizing MultiWoZ to Develop Multilingual Task-Oriented Dialogue Systems", "abstract": "Bosheng Ding, Junjie Hu, Lidong Bing, Mahani Aljunied, Shafiq Joty, Luo Si, Chunyan Miao. Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). 2022."}}
{"id": "0j_yVaCVt3v", "cdate": 1640995200000, "mdate": 1682360103090, "content": {"title": "Beyond Counting Datasets: A Survey of Multilingual Dataset Construction and Necessary Resources", "abstract": ""}}
{"id": "wcMnTx9SJs", "cdate": 1609459200000, "mdate": 1681681464565, "content": {"title": "Multilingual Multimodal Pre-training for Zero-Shot Cross-Lingual Transfer of Vision-Language Models", "abstract": "Po-Yao Huang, Mandela Patrick, Junjie Hu, Graham Neubig, Florian Metze, Alexander Hauptmann. Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. 2021."}}
{"id": "uOfTWygTM3R", "cdate": 1609459200000, "mdate": 1696988483308, "content": {"title": "Explicit Alignment Objectives for Multilingual Bidirectional Encoders", "abstract": "Junjie Hu, Melvin Johnson, Orhan Firat, Aditya Siddhant, Graham Neubig. Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. 2021."}}
{"id": "XlG5IgiVrD6", "cdate": 1609459200000, "mdate": 1636742060155, "content": {"title": "XTREME-R: Towards More Challenging and Nuanced Multilingual Evaluation", "abstract": "Sebastian Ruder, Noah Constant, Jan Botha, Aditya Siddhant, Orhan Firat, Jinlan Fu, Pengfei Liu, Junjie Hu, Dan Garrette, Graham Neubig, Melvin Johnson. Proceedings of the 2021 Conference on Empirical Methods in Natural Language Processing. 2021."}}
{"id": "UnvdO1yOORT", "cdate": 1609459200000, "mdate": 1696988483229, "content": {"title": "AfroMT: Pretraining Strategies and Reproducible Benchmarks for Translation of 8 African Languages", "abstract": ""}}
