{"id": "XPF1HHYwGp", "cdate": 1672531200000, "mdate": 1684352922476, "content": {"title": "Improved approximation algorithms for solving the squared metric k-facility location problem", "abstract": ""}}
{"id": "ylTdMO3xBoc", "cdate": 1640995200000, "mdate": 1683879173250, "content": {"title": "An approximation algorithm for lower-bounded k-median with constant factor", "abstract": "The lower-bounded k-median problem plays a key role in many applications related to privacy protection, which requires that the amount of assigned client to each facility should not be less than the requirement. Unfortunately, the lower-bounded clustering problem remains elusive under the widely studied k-median objective. Within this paper, we convert this problem to the capacitated facility location problem and successfully give a (516 + ϵ-approximation for this problem."}}
{"id": "SGgvXtZSvk", "cdate": 1640995200000, "mdate": 1682458579366, "content": {"title": "FLS: A New Local Search Algorithm for K-means with Smaller Search Space", "abstract": "The k-means problem is an extensively studied unsupervised learning problem with various applications in decision making and data mining. In this paper, we propose a fast and practical local search algorithm for the k-means problem. Our method reduces the search space of swap pairs from O(nk) to O(k^2), and applies random mutations to find potentially better solutions when local search falls into poor local optimum. With the assumption of data distribution that each optimal cluster has \"average\" size of \\Omega(n/k), which is common in many datasets and k-means benchmarks, we prove that our proposed algorithm gives a (100+\\epsilon)-approximate solution in expectation. Empirical experiments show that our algorithm achieves better performance compared to existing state-of-the-art local search methods on k-means benchmarks and large datasets."}}
{"id": "cKf5FG6tga", "cdate": 1609459200000, "mdate": 1684352922489, "content": {"title": "A local search algorithm for k-means with outliers", "abstract": ""}}
{"id": "CQYC_RslWK", "cdate": 1609459200000, "mdate": 1684352922476, "content": {"title": "Improved approximation for prize-collecting red-blue median", "abstract": ""}}
{"id": "sVobkPNQuM", "cdate": 1577836800000, "mdate": 1684352922476, "content": {"title": "An Improved Approximation Algorithm for the Prize-Collecting Red-Blue Median Problem", "abstract": "The red-blue median problem considers a set of red facilities, a set of blue facilities, and a set of clients located in some metric space. The goal is to open $$k_r$$ red facilities and $$k_b$$ blue facilities such that the sum of the distance from each client to its nearest opened facility is minimized, where $$k_r$$ , $$k_b\\ge 0$$ are two given integers. Designing approximation algorithms for this problem remains an active area of research due to its applications in various fields. However, in many applications, the existence of noisy data poses a big challenge for the problem. In this paper, we consider the prize-collecting red-blue median problem, where the noisy data can be removed by paying a penalty cost. The current best approximation for the problem is a ratio of 24, which was obtained by LP-rounding. We deal with this problem using a local search algorithm. We construct a layered structure of the swap pairs, which yields a $$(9+\\epsilon )$$ -approximation for the prize-collecting red-blue median problem. Our techniques generalize to a more general prize-collecting $$\\tau $$ -color median problem, where the facilities have $$\\tau $$ different types, and give a $$(4\\tau +1+\\epsilon )$$ -approximation for the problem for the case where $$\\tau $$ is a constant."}}
{"id": "oDdGoQmXqo", "cdate": 1577836800000, "mdate": 1684352922714, "content": {"title": "A Constant Factor Approximation for Lower-Bounded k-Median", "abstract": "The lower-bounded k-median problem considers a set C of clients, a set F of facilities, and a parameter B, the goal is to open k facilities and connect each client to an opened facility, such that each opened facility is connected with at least B clients and the total connection cost is minimized. The problem is known to admit an O(1)-approximation algorithm, while the constant is implicit and seems to be a very large constant. In this paper, we give an approach that converts the lower-bounded k-median problem to the capacitated facility location problem, which yields a $$(516+\\epsilon )$$ -approximation for the lower-bounded k-median problem."}}
