{"id": "aARZ68D9b6", "cdate": 1640995200000, "mdate": 1681689399862, "content": {"title": "Adversarial Bandits Robust to S-Switch Regret", "abstract": "We study the adversarial bandit problem under $S$ number of switching best arms for unknown $S$. For handling this problem, we adopt the master-base framework using the online mirror descent method (OMD). We first provide a master-base algorithm with basic OMD, achieving $\\tilde{O}(S^{1/2}K^{1/3}T^{2/3})$. For improving the regret bound with respect to $T$, we propose to use adaptive learning rates for OMD to control variance of loss estimators, and achieve $\\tilde{O}(\\min\\{\\mathbb{E}[\\sqrt{SKT\\rho_T(h^\\dagger)}],S\\sqrt{KT}\\})$, where $\\rho_T(h^\\dagger)$ is a variance term for loss estimators."}}
{"id": "HcgmszFzn2", "cdate": 1640995200000, "mdate": 1681689399788, "content": {"title": "Rotting Infinitely Many-Armed Bandits", "abstract": "We consider the infinitely many-armed bandit problem with rotting rewards, where the mean reward of an arm decreases at each pull of the arm according to an arbitrary trend with maximum rotting rat..."}}
{"id": "3cSOugiP5Xk", "cdate": 1640995200000, "mdate": 1681689399784, "content": {"title": "Rotting infinitely many-armed bandits", "abstract": "We consider the infinitely many-armed bandit problem with rotting rewards, where the mean reward of an arm decreases at each pull of the arm according to an arbitrary trend with maximum rotting rate $\\varrho=o(1)$. We show that this learning problem has an $\\Omega(\\max\\{\\varrho^{1/3}T,\\sqrt{T}\\})$ worst-case regret lower bound where $T$ is the horizon time. We show that a matching upper bound $\\tilde{O}(\\max\\{\\varrho^{1/3}T,\\sqrt{T}\\})$, up to a poly-logarithmic factor, can be achieved by an algorithm that uses a UCB index for each arm and a threshold value to decide whether to continue pulling an arm or remove the arm from further consideration, when the algorithm knows the value of the maximum rotting rate $\\varrho$. We also show that an $\\tilde{O}(\\max\\{\\varrho^{1/3}T,T^{3/4}\\})$ regret upper bound can be achieved by an algorithm that does not know the value of $\\varrho$, by using an adaptive UCB index along with an adaptive threshold value."}}
{"id": "5fVTUwVcpm", "cdate": 1609459200000, "mdate": 1681689399809, "content": {"title": "Scheduling Servers with Stochastic Bilinear Rewards", "abstract": "In this paper, we study scheduling in multi-class, multi-server queueing systems with stochastic rewards of job-server assignments following a bilinear model in feature vectors characterizing jobs and servers. A bilinear model allows capturing pairwise interactions of features of jobs and servers. Our goal is regret minimization for the objective of maximizing cumulative reward of job-server assignments over a time horizon against an oracle policy that has complete information about system parameters, while maintaining queueing system stable and allowing for different job priorities. The scheduling problem we study is motivated by various applications including matching in online platforms, such as crowdsourcing and labour platforms, and cluster computing systems. We study a scheduling algorithm based on weighted proportionally fair allocation criteria augmented with marginal costs for reward maximization, along with a linear bandit algorithm for estimating rewards of job-server assignments. For a baseline setting, in which jobs have identical mean service times, we show that our algorithm has a sub-linear regret, as well as a sub-linear bound on the mean queue length, in the time horizon. We show that similar bounds hold under more general assumptions, allowing for mean service times to be different across job classes and a time-varying set of server classes. We also show stability conditions for distributed iterative algorithms for computing allocations, which is of interest in large-scale system applications. We demonstrate the efficiency of our algorithms by numerical experiments using both synthetic randomly generated data and a real-world cluster computing data trace."}}
{"id": "2hQe06T1qjn", "cdate": 1514764800000, "mdate": 1681689399805, "content": {"title": "Research Hypothesis Generation Using Link Prediction in a Bipartite Graph", "abstract": "The large volume of scientific publications is likely to have hidden knowledge that can be used for suggesting new research topics. We propose an automatic method that is helpful for generating research hypotheses in the field of physics using the massive number of physics journal publications. We convert the text data of titles and abstract sections in publications to a bipartite graph, extracting words of physical matter composed of chemical elements and extracting related keywords in the articles. The proposed method predicts the formation of new links between matter and keyword nodes based on collaborative filtering and matter popularity. The formation of links represents research hypotheses, as it suggests the new possible relationships between physical matter and keywords for physical properties or phenomena. The suggested method has better performance than existing methods for link prediction in the entire bipartite graph and the subgraph that contains only a specific keyword, such as `antiferromagnetism' or `superconductivity.' Our suggested concept for generating research hypotheses can be easily extended to various other research topics or industrial topics using patent literature."}}
