{"id": "mAiTuIeWbxD", "cdate": 1668734785849, "mdate": null, "content": {"title": "Mitigating Lies in Vision-Language Models", "abstract": "In this work, we bring new insights into the honesty of vision-language models,\nparticularly in visual question answering (VQA). After a throughout revisit of the\nexisting ‘lie’ behavior in pure language models, our work makes an unprecedented\nextension of ’lies’ to vision-language models. The results indicate that the lie\nprefixes have a more obvious misleading effect on vision-language models than\non language models. We also propose a novel visual prefix and prove that the\nconsistent vision-language prefix is more threatening to vision-language models.\nTo defend the models from the stated ’lies’, we put forward an unsupervised\nframework based on Gaussian mixture modeling and obtain improvement with 3%\nagainst the language prefix and 12% against the vision-language prefix."}}
{"id": "HgQ-6pDG_0", "cdate": 1667413154580, "mdate": 1667413154580, "content": {"title": "ViP: Unified Certified Detection and Recovery for Patch Attack with Vision Transformers", "abstract": "Patch attack, which introduces a perceptible but localized change to the input image, has gained significant momentum in recent years. In this paper, we present a unified framework to analyze certified patch defense tasks, including both \\emph{certified detection} and \\emph{certified recovery}, leveraging the recently emerged Vision Transformers (ViTs). In addition to the existing patch defense setting where only one patch is considered, we provide the very first study on developing certified detection against the \\emph{dual patch attack}, in which the attacker is allowed to adversarially manipulate pixels in two different regions.\n\nBy building upon the latest progress in self-supervised ViTs with masked image modeling (\\ie, masked autoencoder (MAE)), our method achieves state-of-the-art performance in both certified detection and certified recovery of adversarial patches. Regarding certified detection, we improve the performance by up to $\\app16\\%$ on ImageNet without training on a single adversarial patch, and for the first time, can also tackle the more challenging dual patch setting. Our method largely \\emph{closes the gap} between detection-based certified robustness and clean image accuracy. Regarding certified recovery, our approach improves certified accuracy by $\\app2\\%$ on ImageNet across all attack sizes, attaining the new state-of-the-art performance."}}
{"id": "G1uywu6vNZe", "cdate": 1652737388100, "mdate": null, "content": {"title": "Exponential Family Model-Based Reinforcement Learning via Score Matching", "abstract": "We propose an optimistic model-based algorithm, dubbed SMRL, for finite-horizon episodic reinforcement learning (RL) when the transition model is specified by exponential family distributions with $d$ parameters and the reward is bounded and known. SMRL uses score matching, an unnormalized density estimation technique that enables efficient estimation of the model parameter by ridge regression. Under standard regularity assumptions, SMRL achieves $\\tilde O(d\\sqrt{H^3T})$ online regret, where $H$ is the length of each episode and $T$ is the total number of interactions (ignoring polynomial dependence on structural scale parameters). "}}
{"id": "_Yhqz23BkK", "cdate": 1640995200000, "mdate": 1708512913347, "content": {"title": "Exponential Family Model-Based Reinforcement Learning via Score Matching", "abstract": "We propose an optimistic model-based algorithm, dubbed SMRL, for finite-horizon episodic reinforcement learning (RL) when the transition model is specified by exponential family distributions with $d$ parameters and the reward is bounded and known. SMRL uses score matching, an unnormalized density estimation technique that enables efficient estimation of the model parameter by ridge regression. Under standard regularity assumptions, SMRL achieves $\\tilde O(d\\sqrt{H^3T})$ online regret, where $H$ is the length of each episode and $T$ is the total number of interactions (ignoring polynomial dependence on structural scale parameters)."}}
{"id": "9GqTPzU1va", "cdate": 1634067443350, "mdate": null, "content": {"title": "Exponential Family Model-Based Reinforcement Learning via Score Matching", "abstract": "We propose a optimistic model-based algorithm, dubbed SMRL, for finite-horizon episodic reinforcement learning (RL) when the transition model is specified by exponential family distributions with $d$ parameters and the reward is bounded and known. SMRL uses score matching, an unnormalized density estimation technique that enables efficient estimation of the model parameter by ridge regression. SMRL achieves $\\tilde O(d\\sqrt{H^3T})$ regret, where $H$ is the length of each episode and $T$ is the total number of interactions."}}
{"id": "j5BgC1Rxl3X", "cdate": 1609459200000, "mdate": 1696003340629, "content": {"title": "Exponential Family Model-Based Reinforcement Learning via Score Matching", "abstract": "We propose an optimistic model-based algorithm, dubbed SMRL, for finite-horizon episodic reinforcement learning (RL) when the transition model is specified by exponential family distributions with $d$ parameters and the reward is bounded and known. SMRL uses score matching, an unnormalized density estimation technique that enables efficient estimation of the model parameter by ridge regression. Under standard regularity assumptions, SMRL achieves $\\tilde O(d\\sqrt{H^3T})$ online regret, where $H$ is the length of each episode and $T$ is the total number of interactions (ignoring polynomial dependence on structural scale parameters)."}}
