{"id": "EWyhkNNKsd", "cdate": 1652737675126, "mdate": null, "content": {"title": "Lazy and Fast Greedy MAP Inference for Determinantal Point Process", "abstract": "The maximum a posteriori (MAP) inference for determinantal point processes (DPPs) is crucial for selecting diverse items in many machine learning applications. Although DPP MAP inference is NP-hard, the greedy algorithm often finds high-quality solutions, and many researchers have studied its efficient implementation. One classical and practical method is the lazy greedy algorithm, which is applicable to general submodular function maximization, while a recent fast greedy algorithm based on the Cholesky factorization is more efficient for DPP MAP inference. This paper presents how to combine the ideas of ``lazy'' and ``fast'', which have been considered incompatible in the literature. Our lazy and fast greedy algorithm achieves almost the same time complexity as the current best one and runs faster in practice. The idea of ``lazy + fast'' is extendable to other greedy-type algorithms. We also give a fast version of the double greedy algorithm for unconstrained DPP MAP inference. Experiments validate the effectiveness of our acceleration ideas."}}
{"id": "Icd51kE57-", "cdate": 1640995200000, "mdate": 1671929381807, "content": {"title": "Algorithmic Bayesian Persuasion with Combinatorial Actions", "abstract": "Bayesian persuasion is a model for understanding strategic information revelation: an agent with an informational advantage, called a sender, strategically discloses information by sending signals to another agent, called a receiver. In algorithmic Bayesian persuasion, we are interested in efficiently designing the sender's signaling schemes that lead the receiver to take action in favor of the sender. This paper studies algorithmic Bayesian-persuasion settings where the receiver's feasible actions are specified by combinatorial constraints, e.g., matroids or paths in graphs. We first show that constant-factor approximation is NP-hard even in some special cases of matroids or paths. We then propose a polynomial-time algorithm for general matroids by assuming the number of states of nature to be a constant. We finally consider a relaxed notion of persuasiveness, called CCE-persuasiveness, and present a sufficient condition for polynomial-time approximability."}}
{"id": "WdI6GRpdju8", "cdate": 1609459200000, "mdate": 1648736356649, "content": {"title": "Polynomial-time algorithms for submodular Laplacian systems", "abstract": "Let G = ( V , E ) be an undirected graph, L G ∈ R V × V be the associated Laplacian matrix, and b ∈ R V be a vector. Solving the Laplacian system L G x = b has numerous applications in theoretical computer science, machine learning, and network analysis. Recently, the notion of the Laplacian operator L F : R V → 2 R V for a submodular transformation F : 2 V → R + E was introduced, which can handle undirected graphs, directed graphs, hypergraphs, and joint distributions in a unified manner. In this study, we show that the submodular Laplacian system L F ( x ) ∋ b can be solved in polynomial time. Furthermore, we prove that even when the submodular Laplacian system has no solution, we can solve its regression form in polynomial time. Finally, we discuss potential applications of submodular Laplacian systems in machine learning and network analysis."}}
{"id": "oBinB_E3EW7", "cdate": 1577836800000, "mdate": null, "content": {"title": "Approximation Guarantees of Local Search Algorithms via Localizability of Set Functions", "abstract": "This paper proposes a new framework for providing approximation guarantees of local search algorithms. Local search is a basic algorithm design technique and is widely used for various combinatoria..."}}
{"id": "rJ-PSs-OZH", "cdate": 1546300800000, "mdate": null, "content": {"title": "Beyond Adaptive Submodularity: Approximation Guarantees of Greedy Policy with Adaptive Submodularity Ratio", "abstract": "We propose a new concept named adaptive submodularity ratio to study the greedy policy for sequential decision making. While the greedy policy is known to perform well for a wide variety of adaptiv..."}}
{"id": "HyWeUDZOWH", "cdate": 1514764800000, "mdate": null, "content": {"title": "Fast greedy algorithms for dictionary selection with generalized sparsity constraints", "abstract": "In dictionary selection, several atoms are selected from finite candidates that successfully approximate given data points in the sparse representation. We propose a novel efficient greedy algorithm for dictionary selection. Not only does our algorithm work much faster than the known methods, but it can also handle more complex sparsity constraints, such as average sparsity. Using numerical experiments, we show that our algorithm outperforms the known methods for dictionary selection, achieving competitive performances with dictionary learning algorithms in a smaller running time."}}
{"id": "SJEnpd-O-H", "cdate": 1451606400000, "mdate": null, "content": {"title": "Budgeted stream-based active learning via adaptive submodular maximization", "abstract": "Active learning enables us to reduce the annotation cost by adaptively selecting unlabeled instances to be labeled. For pool-based active learning, several effective methods with theoretical guarantees have been developed through maximizing some utility function satisfying adaptive submodularity. In contrast, there have been few methods for stream-based active learning based on adaptive submodularity. In this paper, we propose a new class of utility functions, policy-adaptive submodular functions, and prove this class includes many existing adaptive submodular functions appearing in real world problems. We provide a general framework based on policy-adaptive submodularity that makes it possible to convert existing pool-based methods to stream-based methods and give theoretical guarantees on their performance. In addition we empirically demonstrate their effectiveness comparing with existing heuristics on common benchmark datasets."}}
