{"id": "znuAbVHnYug", "cdate": 1514764800000, "mdate": 1683893377648, "content": {"title": "Single-Cell Transcriptomics Reveals Heterogeneity and Drug Response of Human Colorectal Cancer Organoids", "abstract": "Organoids are three-dimensional cell cultures that mimic organ functions and structures. The organoid model has been developed as a versatile in vitro platform for stem cell biology and diseases modeling. Tumor organoids are shown to share ~ 90% of genetic mutations with biopsies from same patients. However, it's not clear whether tumor organoids recapitulate the cellular heterogeneity observed in patient tumors. Here, we used single-cell RNA-Seq to investigate the transcriptomics of tumor organoids derived from human colorectal tumors, and applied machine learning methods to unbiasedly cluster subtypes in tumor organoids. Computational analysis reveals cancer heterogeneity sustained in tumor organoids, and the subtypes in organoids displayed high diversity. Furthermore, we treated the tumor organoids with a first-line cancer drug, Oxaliplatin, and investigated drug response in single-cell scale. Diversity of tumor cell populations in organoids were significantly perturbed by drug treatment. Single-cell analysis detected the depletion of chemosensitive subgroups and emergence of new drug tolerant subgroups after drug treatment. Our study suggests that the organoid model is capable of recapitulating clinical heterogeneity and its evolution in response to chemotherapy."}}
{"id": "yTfjdszMe2", "cdate": 1514764800000, "mdate": 1683893377625, "content": {"title": "Microbiota of Inflammatory Bowel Disease Models", "abstract": "Gut microbiome plays an important role in inflammatory bowel disease (IBD), a group of intestinal chronic inflammation conditions that affect a large population. The animal models of IBD have long been established on basis of pathological features, but their ability to recapitulate patient gut microbiota is unknown. We investigated and compared the composition and biodiversity of bacterial population in the fecal samples from rat models of the two IBD subtypes, and compared them with patient samples. Our analyses revealed that inflammation reduces overall microbiome diversity and increased variation between individuals. We identified specific microbial signatures associated with the two IBD subtypes that were consistent between the animal models and human IBD patients, suggesting that the animal models can partially recapitulate the microbiota in human diseases. Furthermore, metagenome prediction analysis suggested microbial functions that were likely altered by host-microbiota interactions in IBD models."}}
{"id": "y2CNwammx1", "cdate": 1388534400000, "mdate": 1683893377670, "content": {"title": "A Bio-inspired spatial patterning circuit", "abstract": "Lateral Inhibition (LI) is a widely conserved patterning mechanism in biological systems across species. Distinct from better-known Turing patterns, LI depend on cell-cell contact rather than diffusion. We built an in silico genetic circuit model to analyze the dynamic properties of LI. The model revealed that LI amplifies differences between neighboring cells to push them into opposite states, hence forming stable 2-D patterns. Inspired by this insight, we designed and implemented an electronic circuit that recapitulates LI patterning dynamics. This biomimetic system serve as a physical model to elucidate the design principle of generating robust patterning through spatial feedback, regardless of the underlying devices being biological or electrical."}}
{"id": "wtGRgEl5Eh", "cdate": 1388534400000, "mdate": 1683893377622, "content": {"title": "A metabolic signature of colon cancer initiating cells", "abstract": "Colon cancer initiating cells (CCICs) are more tumorigenic and metastatic than the majority of colorectal cancer (CRC) cells. CCICs have also been associated with stem cell-like properties. However, there is a lack of system-level understanding of what mechanisms distinguish CCICs from common CRC cells. We compared the transcriptomes of CD133+ CCICs and CD133- CRC cells from multiple sources, which identified a distinct metabolic signature for CD133 <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">high</sup> CCICs. High-resolution unbiased metabolomics was then performed to validate this CCIC metabolic signature. Specifically, levels of enzymes and metabolites involved in glycolysis, the citric acid (TCA) cycle, and cysteine and methionine metabolism are altered in CCICs. Analyses of the alterations further suggest an epigenetic link. This metabolic signature provides mechanistic insights into CCIC phenotypes and may serve as potential biomarkers and therapeutic targets for future CRC treatment."}}
{"id": "fn_2g190HW", "cdate": 1356998400000, "mdate": 1683893377645, "content": {"title": "Post-translational regulation enables robust p53 regulation", "abstract": "Background The tumor suppressor protein p53 plays important roles in DNA damage repair, cell cycle arrest and apoptosis. Due to its critical functions, the level of p53 is tightly regulated by a negative feedback mechanism to increase its tolerance towards fluctuations and disturbances. Interestingly, the p53 level is controlled by post-translational regulation rather than transcriptional regulation in this feedback mechanism. Results We analyzed the dynamics of this feedback to understand whether post-translational regulation provides any advantages over transcriptional regulation in regard to disturbance rejection. When a disturbance happens, even though negative feedback reduces the steady-state error, it can cause a system to become less stable and transiently overshoots, which may erroneously trigger downstream reactions. Therefore, the system needs to balance the trade-off between steady-state and transient errors. Feedback control and adaptive estimation theories revealed that post-translational regulation achieves a better trade-off than transcriptional regulation, contributing to a more steady level of p53 under the influence of noise and disturbances. Furthermore, post-translational regulation enables cells to respond more promptly to stress conditions with consistent amplitude. However, for better disturbance rejection, the p53- Mdm2 negative feedback has to pay a price of higher stochastic noise. Conclusions Our analyses suggest that the p53-Mdm2 feedback favors regulatory mechanisms that provide the optimal trade-offs for dynamic control."}}
