{"id": "VQTRV8-1KN", "cdate": 1672531200000, "mdate": 1683797924681, "content": {"title": "Near-Minimax-Optimal Risk-Sensitive Reinforcement Learning with CVaR", "abstract": "In this paper, we study risk-sensitive Reinforcement Learning (RL), focusing on the objective of Conditional Value at Risk (CVaR) with risk tolerance $\\tau$. Starting with multi-arm bandits (MABs), we show the minimax CVaR regret rate is $\\Omega(\\sqrt{\\tau^{-1}AK})$, where $A$ is the number of actions and $K$ is the number of episodes, and that it is achieved by an Upper Confidence Bound algorithm with a novel Bernstein bonus. For online RL in tabular Markov Decision Processes (MDPs), we show a minimax regret lower bound of $\\Omega(\\sqrt{\\tau^{-1}SAK})$ (with normalized cumulative rewards), where $S$ is the number of states, and we propose a novel bonus-driven Value Iteration procedure. We show that our algorithm achieves the optimal regret of $\\widetilde O(\\sqrt{\\tau^{-1}SAK})$ under a continuity assumption and in general attains a near-optimal regret of $\\widetilde O(\\tau^{-1}\\sqrt{SAK})$, which is minimax-optimal for constant $\\tau$. This improves on the best available bounds. By discretizing rewards appropriately, our algorithms are computationally efficient."}}
{"id": "NQrU6DLMuS", "cdate": 1664994273936, "mdate": null, "content": {"title": "Provable Benefits of Representational Transfer in Reinforcement Learning", "abstract": "We study the problem of representational transfer in RL, where an agent first pretrains offline in a number of source tasks to discover a shared representation, which is subsequently used to learn a good policy online in a target task. We propose a new notion of task relatedness between source and target tasks and develop a novel approach for representational transfer under this assumption. Concretely, we show that given generative access to a set of source tasks, we can discover a representation, using which subsequent linear RL techniques quickly converge to a near-optimal policy, with only online access to the target task. \nThe sample complexity is close to knowing the ground truth features in the target task and comparable to prior representation learning results in the source tasks. We complement our positive results with lower bounds without generative access and validate our findings with empirical evaluation on rich observation MDPs that requires deep exploration."}}
{"id": "sNKZaNkyi7Q", "cdate": 1663849859247, "mdate": null, "content": {"title": "Provable Benefits of Representational Transfer in Reinforcement Learning", "abstract": "We study the problem of representational transfer in RL, where an agent first pretrains in a number of source tasks to discover a shared representation, which is subsequently used to learn a good policy in a target task. We propose a new notion of task relatedness between source and target tasks, and develop a novel approach for representational transfer under this assumption. Concretely, we show that given a generative access to source tasks, we can discover a representation, using which subsequent linear RL techniques quickly converge to a near-optimal policy, with only online access to the target task. The sample complexity is close to knowing the ground truth features in the target task, and comparable to prior representation learning results in the source tasks. We complement our positive results with lower bounds without generative access, and validate our findings with empirical evaluation on rich observation MDPs that require deep exploration.\n"}}
{"id": "ByYFpTwgLGO", "cdate": 1652737395856, "mdate": null, "content": {"title": "Deep Multi-Modal Structural Equations For Causal Effect Estimation With Unstructured Proxies", "abstract": "Estimating the effect of intervention from observational data while accounting for confounding variables is a key task in causal inference. Oftentimes, the confounders are unobserved, but we have access to large amounts of additional unstructured data (images, text) that contain valuable proxy signal about the missing confounders. This paper argues that leveraging this unstructured data can greatly improve the accuracy of causal effect estimation. Specifically, we introduce deep multi-modal structural equations, a generative model for causal effect estimation in which confounders are latent variables and unstructured data are proxy variables. This model supports multiple multimodal proxies (images, text) as well as missing data. We empirically demonstrate that our approach outperforms existing methods based on propensity scores and corrects for confounding using unstructured inputs on tasks in genomics and healthcare. Our methods can potentially support the use of large amounts of data that were previously not used in causal inference"}}
{"id": "s9-D7JmKZc-", "cdate": 1640995200000, "mdate": 1683797925127, "content": {"title": "Doubly Robust Distributionally Robust Off-Policy Evaluation and Learning", "abstract": "Off-policy evaluation and learning (OPE/L) use offline observational data to make better decisions, which is crucial in applications where online experimentation is limited. However, depending enti..."}}
{"id": "laJqJ1yISwR", "cdate": 1640995200000, "mdate": 1683831828591, "content": {"title": "Deep Multi-Modal Structural Equations For Causal Effect Estimation With Unstructured Proxies", "abstract": "Estimating the effect of intervention from observational data while accounting for confounding variables is a key task in causal inference. Oftentimes, the confounders are unobserved, but we have access to large amounts of additional unstructured data (images, text) that contain valuable proxy signal about the missing confounders. This paper argues that leveraging this unstructured data can greatly improve the accuracy of causal effect estimation. Specifically, we introduce deep multi-modal structural equations, a generative model for causal effect estimation in which confounders are latent variables and unstructured data are proxy variables. This model supports multiple multimodal proxies (images, text) as well as missing data. We empirically demonstrate that our approach outperforms existing methods based on propensity scores and corrects for confounding using unstructured inputs on tasks in genomics and healthcare. Our methods can potentially support the use of large amounts of data that were previously not used in causal inference"}}
{"id": "El-Zw16ANUJ", "cdate": 1640995200000, "mdate": 1683797925479, "content": {"title": "Learning Bellman Complete Representations for Offline Policy Evaluation", "abstract": "We study representation learning for Offline Reinforcement Learning (RL), focusing on the important task of Offline Policy Evaluation (OPE). Recent work shows that, in contrast to supervised learni..."}}
{"id": "ZRljIMPwkJv", "cdate": 1577836800000, "mdate": 1682382600360, "content": {"title": "Scalable and Provably Accurate Algorithms for Differentially Private Distributed Decision Tree Learning", "abstract": "This paper introduces the first provably accurate algorithms for differentially private, top-down decision tree learning in the distributed setting (Balcan et al., 2012). We propose DP-TopDown, a general privacy preserving decision tree learning algorithm, and present two distributed implementations. Our first method NoisyCounts naturally extends the single machine algorithm by using the Laplace mechanism. Our second method LocalRNM significantly reduces communication and added noise by performing local optimization at each data holder. We provide the first utility guarantees for differentially private top-down decision tree learning in both the single machine and distributed settings. These guarantees show that the error of the privately-learned decision tree quickly goes to zero provided that the dataset is sufficiently large. Our extensive experiments on real datasets illustrate the trade-offs of privacy, accuracy and generalization when learning private decision trees in the distributed setting."}}
{"id": "7To28qdX0p3F", "cdate": 1546300800000, "mdate": null, "content": {"title": "Automatic localization and identification of mitochondria in cellular electron cryo-tomography using faster-RCNN", "abstract": "Background Cryo-electron tomography (cryo-ET) enables the 3D visualization of cellular organization in near-native state which plays important roles in the field of structural cell biology. However, due to the low signal-to-noise ratio (SNR), large volume and high content complexity within cells, it remains difficult and time-consuming to localize and identify different components in cellular cryo-ET. To automatically localize and recognize in situ cellular structures of interest captured by cryo-ET, we proposed a simple yet effective automatic image analysis approach based on Faster-RCNN. Results Our experimental results were validated using in situ cyro-ET-imaged mitochondria data. Our experimental results show that our algorithm can accurately localize and identify important cellular structures on both the 2D tilt images and the reconstructed 2D slices of cryo-ET. When ran on the mitochondria cryo-ET dataset, our algorithm achieved Average Precision >0.95. Moreover, our study demonstrated that our customized pre-processing steps can further improve the robustness of our model performance. Conclusions In this paper, we proposed an automatic Cryo-ET image analysis algorithm for localization and identification of different structure of interest in cells, which is the first Faster-RCNN based method for localizing an cellular organelle in Cryo-ET images and demonstrated the high accuracy and robustness of detection and classification tasks of intracellular mitochondria. Furthermore, our approach can be easily applied to detection tasks of other cellular structures as well."}}
{"id": "YzqjuRFqfHL", "cdate": 1514764800000, "mdate": null, "content": {"title": "Feature Decomposition Based Saliency Detection in Electron Cryo-Tomograms", "abstract": ""}}
