{"id": "iklmgEFH_n", "cdate": 1654637392765, "mdate": null, "content": {"title": "Towards Better Understanding of Self-Supervised Representations", "abstract": "Self-supervised learning methods have shown impressive results in downstream classification tasks. However, there is limited work in understanding and interpreting their learned representations. In this paper, we study the representation space of several state-of-the-art self-supervised models including SimCLR, SwaV, MoCo V2 and BYOL. Without the use of class label information, we first discover discriminative features that are highly active for various subsets of samples and correspond to unique physical attributes in images. We show that, using such discriminative features, one can compress the representation space of self-supervised models up to 50% without affecting downstream linear classification significantly. Next, we propose a sample-wise Self-Supervised Representation Quality Score (or, Q-Score) that can be computed without access to any label information. Q-Score, utilizes discriminative features to reliably predict if a given sample is likely to be mis-classified in the downstream classification task achieving AUPRC of 0.91 on SimCLR and BYOL trained on ImageNet-100. Q-Score can also be used as a regularization term to remedy low-quality representations leading up to 8% relative improvement in accuracy on all 4 self-supervised baselines on ImageNet-100, CIFAR-10, CIFAR-100 and STL-10. Moreover, through heatmap analysis, we show that Q-Score regularization enhances discriminative features and reduces feature noise, thus improving model interpretability."}}
{"id": "xO0A2qIzLvM", "cdate": 1609459200000, "mdate": 1642102044078, "content": {"title": "Ranking User-Generated Content via Multi-Relational Graph Convolution", "abstract": "The quality variance in user-generated content is a major bottleneck to serving communities on online platforms. Current content ranking methods primarily evaluate text and non-textual content features of each user post in isolation. In this paper, we demonstrate the utility of considering the implicit and explicit relational aspects across user content to assess their quality. First, we develop a modular platform-agnostic framework to represent the contrastive (or competing) and similarity-based relational aspects of user-generated content via independently induced content graphs. Second, we develop two complementary graph convolutional operators that enable feature contrast for competing content and feature smoothing/sharing for similar content. Depending on the edge semantics of each content graph, we embed its nodes via one of the above two mechanisms. We also show that our contrastive operator creates discriminative magnification across the embeddings of competing posts. Third, we show a surprising result-applying classical boosting techniques to combine final-layer embeddings across the content graphs significantly outperforms the typical stacking, fusion, or neighborhood embedding aggregation methods in graph convolutional architectures. We exhaustively validate our method via accepted answer prediction over fifty diverse Stack-Exchange (https://stackexchange.com/) websites with consistent relative gains of over 5% accuracy over state-of-the-art neural, multi-relational and textual baselines."}}
{"id": "pHIJjD0t-Hh", "cdate": 1609459200000, "mdate": 1642102044083, "content": {"title": "FuseRec: fusing user and item homophily modeling with temporal recommender systems", "abstract": "Recommender systems can benefit from a plethora of signals influencing user behavior such as her past interactions, her social connections, as well as the similarity between different items. However, existing methods are challenged when taking all this data into account and often do not exploit all available information. This is primarily due to the fact that it is non-trivial to combine the various information as they mutually influence each other. To address this shortcoming, here, we propose a ‘Fusion Recommender’ (FuseRec), which models each of these factors separately and later combines them in an interpretable manner. We find this general framework to yield compelling results on all three investigated datasets, Epinions, Ciao, and CiaoDVD, outperforming the state-of-the-art by more than 14% for Ciao and Epinions. In addition, we provide a detailed ablation study, showing that our combined model achieves accurate results, often better than any of its components individually. Our model also provides insights on the importance of each of the factors in different datasets."}}
{"id": "nIjRydqSOVE", "cdate": 1577836800000, "mdate": 1642102044077, "content": {"title": "Abusive Language Detection using Syntactic Dependency Graphs", "abstract": "Kanika Narang, Chris Brew. Proceedings of the Fourth Workshop on Online Abuse and Harms. 2020."}}
{"id": "C24dtSvZg7c", "cdate": 1577836800000, "mdate": 1642102044085, "content": {"title": "CrowdQM: Learning Aspect-Level User Reliability and Comment Trustworthiness in Discussion Forums", "abstract": "Community discussion forums are increasingly used to seek advice; however, they often contain conflicting and unreliable information. Truth discovery models estimate source reliability and infer information trustworthiness simultaneously in a mutual reinforcement manner, and can be used to distinguish trustworthy comments with no supervision. However, they do not capture the diversity of word expressions and learn a single reliability score for the user. CrowdQM addresses these limitations by modeling the fine-grained aspect-level reliability of users and incorporate semantic similarity between words to learn a latent trustworthy comment embedding. We apply our latent trustworthy comment for comment ranking for three diverse communities in Reddit and show consistent improvement over non-aspect based approaches. We also show qualitative results on learned reliability scores and word embeddings by our model."}}
{"id": "QKGPy6Iun0I", "cdate": 1546300800000, "mdate": 1639986496679, "content": {"title": "Discovering Archetypes to Interpret Evolution of Individual Behavior", "abstract": "In this paper, we aim to discover archetypical patterns of individual evolution in large social networks. In our work, an archetype comprises of $\\textit{progressive stages}$ of distinct behavior. We introduce a novel Gaussian Hidden Markov Model (G-HMM) Cluster to identify archetypes of evolutionary patterns. G-HMMs allow for: near limitless behavioral variation; imposing constraints on how individuals can evolve; different evolutionary rates; and are parsimonious. Our experiments with Academic and StackExchange dataset discover insightful archetypes. We identify four archetypes for researchers: $\\textit{Steady}$, $\\textit{Diverse, Evolving and Diffuse}$. We observe clear differences in the evolution of male and female researchers within the same archetype. Specifically, women and men differ within an archetype (e.g. Diverse) in how they start, how they transition and the time spent in mid-career. We also found that the differences in grant income are better explained by the differences in archetype than by differences in gender. For StackOverflow, discovered archetypes could be labeled as $\\textit{Experts, Seekers, Enthusiasts, and Facilitators}$. We have strong quantitative results with competing baselines for activity prediction and perplexity. For future session prediction, the proposed G-HMM cluster model improves by an average of $32\\%$ for different Stack Exchanges and $24\\%$ for Academic dataset. Our model also exhibits lower perplexity than the baselines."}}
{"id": "5FSnPgMY2j7", "cdate": 1546300800000, "mdate": 1642102044134, "content": {"title": "An Induced Multi-Relational Framework for Answer Selection in Community Question Answer Platforms", "abstract": "This paper addresses the question of identifying the best candidate answer to a question on Community Question Answer (CQA) forums. The problem is important because Individuals often visit CQA forums to seek answers to nuanced questions. We develop a novel induced relational graph convolutional network (IR-GCN) framework to address the question. We make three contributions. First, we introduce a modular framework that separates the construction of the graph with the label selection mechanism. We use equivalence relations to induce a graph comprising cliques and identify two label assignment mechanisms---label contrast, label sharing. Then, we show how to encode these assignment mechanisms in GCNs. Second, we show that encoding contrast creates discriminative magnification---enhancing the separation between nodes in the embedding space. Third, we show a surprising result---boosting techniques improve learning over familiar stacking, fusion, or aggregation approaches for neural architectures. We show strong results over the state-of-the-art neural baselines in extensive experiments on 50 StackExchange communities."}}
{"id": "8CYEBkxEBpP", "cdate": 1483228800000, "mdate": 1642102044135, "content": {"title": "Large-Scale Analysis of Email Search and Organizational Strategies", "abstract": "Email continues to be an important form of communication as well as a way to manage tasks and archive personal information. As the volume of email grows, organizing and finding relevant email remains challenging. In this paper, we present a large-scale log analysis of the activities that people perform on email mes-sages (accessing external information via links or attachments, responding to messages, and organizing messages), their search behavior, and their organizational practices in a popular web email client. First, we characterize general email activities as well as activities associated with search. We find that within search sessions, peo-ple are more likely to access information and respond to messag-es but less likely to organize. Second, we examine the relation-ship between characteristics of a person's mailbox and their search and organizational practices. People with larger mailboxes tend to organize more, respond a little more, and access infor-mation less. People with larger mailboxes and folder structures search more, but the number of folders has less influence on search. Third, we extend previous work on email organization (e.g., filers vs. pilers; cleaners vs. keepers) by examining the extent to which these strategies are evident in our large-scale analysis and influence email activities and search. People who rely heavily on one organizational strategy tend to use others less. People who organize less tend to search more. Finally, we de-scribe how these insights can influence the design of email search."}}
{"id": "phIl7Bap41f", "cdate": 1420070400000, "mdate": 1642102044085, "content": {"title": "Being Aware of the World: Toward Using Social Media to Support the Blind With Navigation", "abstract": "This paper lays the ground work for assistive navigation using wearable sensors and social sensors to foster situational awareness for the blind. Our system acquires social media messages to gauge the relevant aspects of an event and to create alerts. We propose social semantics that captures the parameters required for querying and reasoning an event-of-interest, such as what, where, who, when, severity, and action from the Internet of things, using an event summarization algorithm. Our approach integrates wearable sensors in the physical world to estimate user location based on metric and landmark localization. Streaming data from the cyber world are employed to provide awareness by summarizing the events around the user based on the situation awareness factor. It is illustrated using disaster and socialization event scenarios. Discovered local events are fed back using sound localization so that the user can actively participate in a social event or get early warning of any hazardous events. A feasibility evaluation of our proposed algorithm included comparing the output of the algorithm to ground truth, a survey with sighted participants about the algorithm output, and a sound localization user interface study with blind-folded sighted participants. Thus, our framework supports the navigation problem for the blind by combining the advantages of our real-time localization technologies so that the user is being made aware of the world, a necessity for independent travel."}}
{"id": "rkNR74bubB", "cdate": 1356998400000, "mdate": null, "content": {"title": "Network flows and the link prediction problem", "abstract": "Link prediction is used by many applications to recommend new products or social connections to people. Link prediction leverages information in network structure to identify missing links or predict which new one will form in the future. Recent research has provided a theoretical justification for the success of some popular link prediction heuristics, such as the number of common neighbors and the Adamic-Adar score, by showing that they estimate the distance between nodes in some latent feature space. In this paper we examine the link prediction task from the novel perspective of network flows. We show that how easily two nodes can interact with or influence each other depends not only on their position in the network, but also on the nature of the flow that mediates interactions between them. We show that different types of flows lead to different notions of network proximity, some of which are mathematically equivalent to existing link prediction heuristics. We measure the performance of different heuristics on the missing link prediction task in a variety of real-world social, technological and biological networks. We show that heuristics based on a random walk-type processes outperform the popular Adamic-Adar and the number of common neighbors heuristics in many networks."}}
