{"id": "r_2zid6Ufv", "cdate": 1680559489717, "mdate": 1680559489717, "content": {"title": "What Do Users Care About? Detecting Actionable Insights from User Feedback", "abstract": "Users often leave feedback on a myriad of aspects of a product which, if leveraged successfully, can help yield useful insights that can lead to further improvements down the line. Detecting actionable insights can be challenging owing to large amounts of data as well as the absence of labels in real-world scenarios. In this work, we present an aggregation and graph-based ranking strategy for unsupervised detection of these insights from real-world, noisy, user-generated feedback. Our proposed approach significantly outperforms strong baselines on two real-world user feedback datasets and one academic dataset."}}
{"id": "R1-2MVC2ms", "cdate": 1680559365654, "mdate": 1680559365654, "content": {"title": "Towards Cross-Domain Transferability of Text Generation Models for Legal Text", "abstract": "Legalese can often be filled with verbose domain-specific jargon which can make it challenging to understand and use for non-experts. Creating succinct summaries of legal documents often makes it easier for user comprehension. However, obtaining labeled data for every domain of legal text is challenging, which makes cross-domain transferability of text generation models for legal text, an important area of research. In this paper, we explore the ability of existing state-of-the-art T5 & BART-based summarization models to transfer across legal domains. We leverage publicly available datasets across four domains for this task, one of which is a new resource for summarizing privacy policies, that we curate and release for academic research. Our experiments demonstrate the low cross-domain transferability of these models, while also highlighting the benefits of combining different domains. Further, we compare the effectiveness of standard metrics for this task and illustrate the vast differences in their performance."}}
{"id": "_dkwo4l9D9", "cdate": 1680559266897, "mdate": 1680559266897, "content": {"title": "PerKGQA: Question Answering over Personalized Knowledge Graphs", "abstract": "Previous studies on question answering over knowledge graphs have typically operated over a single knowledge graph (KG). This KG is assumed to be known a priori and is leveraged similarly for all users’ queries during inference. However, such an assumption is not applicable to real-world settings, such as healthcare, where one needs to handle queries of new users over unseen KGs during inference. Furthermore, privacy concerns and high computational costs render it infeasible to query the single KG that has information about all users while answering a specific user’s query. The above concerns motivate our question answer- ing setting over personalized knowledge graphs (PERKGQA) where each user has restricted access to their KG. We observe that current state-of-the-art KGQA methods that require learning prior node representations fare poorly. We propose two complementary approaches, PATHCBR and PATHRGCN for PERKGQA. The former is a simple non-parametric tech- nique that employs case-based reasoning, while the latter is a parametric approach using graph neural networks. Our proposed methods circumvent learning prior representations, can generalize to unseen KGs, and outperform strong baselines on an academic and an internal dataset by 6.5% and 10.5%."}}
{"id": "Jxn0pLRksB", "cdate": 1672531200000, "mdate": 1703048302514, "content": {"title": "Document-Level Supervision for Multi-Aspect Sentiment Analysis Without Fine-grained Labels", "abstract": "Aspect-based sentiment analysis (ABSA) is a widely studied topic, most often trained through supervision from human annotations of opinionated texts. These fine-grained annotations include identifying aspects towards which a user expresses their sentiment, and their associated polarities (aspect-based sentiments). Such fine-grained annotations can be expensive and often infeasible to obtain in real-world settings. There is, however, an abundance of scenarios where user-generated text contains an overall sentiment, such as a rating of 1-5 in user reviews or user-generated feedback, which may be leveraged for this task. In this paper, we propose a VAE-based topic modeling approach that performs ABSA using document-level supervision and without requiring fine-grained labels for either aspects or sentiments. Our approach allows for the detection of multiple aspects in a document, thereby allowing for the possibility of reasoning about how sentiment expressed through multiple aspects comes together to form an observable overall document-level sentiment. We demonstrate results on two benchmark datasets from two different domains, significantly outperforming a state-of-the-art baseline."}}
{"id": "WqFGM4WGJj", "cdate": 1640995200000, "mdate": 1703048302616, "content": {"title": "PerKGQA: Question Answering over Personalized Knowledge Graphs", "abstract": ""}}
{"id": "6ffX08GHYml", "cdate": 1640995200000, "mdate": 1703048302538, "content": {"title": "Towards Cross-Domain Transferability of Text Generation Models for Legal Text", "abstract": ""}}
{"id": "5UK0ppMZXX", "cdate": 1640995200000, "mdate": 1703048302662, "content": {"title": "What Do Users Care About? Detecting Actionable Insights from User Feedback", "abstract": "Kasturi Bhattacharjee, Rashmi Gangadharaiah, Kathleen McKeown, Dan Roth. Proceedings of the 2022 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies: Industry Track. 2022."}}
{"id": "iSWZJ0NLvYs", "cdate": 1634439865422, "mdate": 1634439865422, "content": {"title": "Multi-Task Learning and Adapted Knowledge Models for Emotion-Cause", "abstract": "Detecting what emotions are expressed in text is a well-studied problem in natural language processing. However, research on finergrained emotion analysis such as what causes an emotion is still in its infancy. We present solutions that tackle both emotion recognition and emotion cause detection in a joint fashion. Considering that common-sense knowledge plays an important role in understanding implicitly expressed emotions and the reasons for those emotions, we propose novel methods that combine common-sense knowledge via adapted knowledge models with multi-task learning to perform joint emotion classification and emotion cause tagging. We show performance improvement on both tasks when including common-sense reasoning and a multitask framework. We provide a thorough analysis to gain insights into model performance."}}
{"id": "nedFSe_SysL", "cdate": 1609459200000, "mdate": 1631896934994, "content": {"title": "Multi-Task Learning and Adapted Knowledge Models for Emotion-Cause Extraction", "abstract": "Detecting what emotions are expressed in text is a well-studied problem in natural language processing. However, research on finer grained emotion analysis such as what causes an emotion is still in its infancy. We present solutions that tackle both emotion recognition and emotion cause detection in a joint fashion. Considering that common-sense knowledge plays an important role in understanding implicitly expressed emotions and the reasons for those emotions, we propose novel methods that combine common-sense knowledge via adapted knowledge models with multi-task learning to perform joint emotion classification and emotion cause tagging. We show performance improvement on both tasks when including common-sense reasoning and a multitask framework. We provide a thorough analysis to gain insights into model performance."}}
{"id": "Imx8jChVmZ", "cdate": 1609459200000, "mdate": 1631896934992, "content": {"title": "Multi-Task Learning and Adapted Knowledge Models for Emotion-Cause Extraction", "abstract": "Elsbeth Turcan, Shuai Wang, Rishita Anubhai, Kasturi Bhattacharjee, Yaser Al-Onaizan, Smaranda Muresan. Findings of the Association for Computational Linguistics: ACL-IJCNLP 2021. 2021."}}
