{"id": "KFSUyqJInaF", "cdate": 1677628800000, "mdate": 1682388269966, "content": {"title": "Estimating the effect of hitting strategies in baseball using counterfactual virtual simulation with deep learning", "abstract": "In baseball, every play on the field is quantitatively evaluated and the statistics have an effect on individual and team strategies. The weighted on base average (wOBA) is well known as a measure of a batter’s hitting contribution. However, this measure ignores the game situation, such as the runners on base, which coaches and batters are known to consider when employing multiple hitting strategies, yet, the effectiveness of these strategies is unknown. This is probably because (1) we cannot obtain the batter’s strategy and (2) it is difficult to estimate the effect of the strategies. Here, we propose a new method for estimating the effect using counterfactual batting simulation. The entire framework consists of two phases: (i) generate a counter-factual batter’s ability based on their actual performances and (ii) simulate games with the batting simulator. To realize (i), we propose a deep learning model that transforms batting ability when batting strategy is changed. This method can estimate the effects of various strategies, which has been traditionally difficult with actual game data. We found that, when the switching cost of batting strategies can be ignored, the use of different strategies increased runs. When the switching cost is considered, the conditions for"}}
{"id": "dyu5uJ6mki", "cdate": 1675587392592, "mdate": 1675587392592, "content": {"title": "Estimating counterfactual treatment outcomes over time in complex multi-agent scenarios", "abstract": "Evaluation of intervention in a multi-agent system, e.g., when humans should intervene in autonomous driving systems and when a player should pass to teammates for a good shot, is challenging in various engineering and scientific fields. Estimating the individual treatment effect (ITE) using counterfactual long-term prediction is practical to evaluate such interventions. However, most of the conventional frameworks did not consider the time-varying complex structure of multi-agent relationships and covariate counterfactual prediction. This may sometimes lead to erroneous assessments of ITE and interpretation problems. Here we propose an interpretable, counterfactual recurrent network in multi-agent systems to estimate the effect of the intervention. Our model leverages graph variational recurrent neural networks and theory-based computation with domain knowledge for the ITE estimation framework based on long-term prediction of multi-agent covariates and outcomes, which can confirm under the circumstances under which the intervention is effective. On simulated models of an automated vehicle and biological agents with time-varying confounders, we show that our methods achieved lower estimation errors in counterfactual covariates and the most effective treatment timing than the baselines. Furthermore, using real basketball data, our methods performed realistic counterfactual predictions and evaluated the counterfactual passes in shot scenarios."}}
{"id": "JCZTH2D511", "cdate": 1672531200000, "mdate": 1682388269918, "content": {"title": "Transformer-Based Neural Marked Spatio Temporal Point Process Model for Football Match Events Analysis", "abstract": "With recently available football match event data that record the details of football matches, analysts and researchers have a great opportunity to develop new performance metrics, gain insight, and evaluate key performance. However, most sports sequential events modeling methods and performance metrics approaches could be incomprehensive in dealing with such large-scale spatiotemporal data (in particular, temporal process), thereby necessitating a more comprehensive spatiotemporal model and a holistic performance metric. To this end, we proposed the Transformer-Based Neural Marked Spatio Temporal Point Process (NMSTPP) model for football event data based on the neural temporal point processes (NTPP) framework. In the experiments, our model outperformed the prediction performance of the baseline models. Furthermore, we proposed the holistic possession utilization score (HPUS) metric for a more comprehensive football possession analysis. For verification, we examined the relationship with football teams' final ranking, average goal score, and average xG over a season. It was observed that the average HPUS showed significant correlations regardless of not using goal and details of shot information. Furthermore, we show HPUS examples in analyzing possessions, matches, and between matches."}}
{"id": "tVf6cPSxn5y", "cdate": 1640995200000, "mdate": 1648698108099, "content": {"title": "How Does AI Play Football? An Analysis of RL and Real-world Football Strategies", "abstract": ""}}
{"id": "n12yGkHEUV", "cdate": 1640995200000, "mdate": 1682388269787, "content": {"title": "Automatic fault detection in race walking from a smartphone camera via fine-tuning pose estimation", "abstract": "Automatic fault detection is an important issue in sports. In race walking, researchers have attempted it using sensors and machine learning. However, there exists problems with sensor attachments, conflicting with referee’s judgement, and the model’s interpretability. Here, we propose a fault detection system via fine-tuning pose estimation from a smartphone camera and logistic regression models trained by referee’s judgement. Using normal race-walk and walking with intentional faults, we showed that the proposed system detected faults with an average accuracy of over 90%, and the model used grounds for detecting faults according to the rules of race walking."}}
{"id": "kN6_1hB9_6l", "cdate": 1640995200000, "mdate": 1668055514238, "content": {"title": "SoccerTrack: A Dataset and Tracking Algorithm for Soccer with Fish-eye and Drone Videos", "abstract": ""}}
{"id": "fpW2LOtFKz", "cdate": 1640995200000, "mdate": 1681523353054, "content": {"title": "Discriminant Dynamic Mode Decomposition for Labeled Spatiotemporal Data Collections", "abstract": ""}}
{"id": "dKkumgt6vX", "cdate": 1640995200000, "mdate": 1682388269905, "content": {"title": "Improving Dense Representation Learning by Superpixelization and Contrasting Cluster Assignment", "abstract": ""}}
{"id": "bUhAg1j2zB", "cdate": 1640995200000, "mdate": 1682388269786, "content": {"title": "Deep Reinforcement Learning in a Racket Sport for Player Evaluation With Technical and Tactical Contexts", "abstract": "Evaluating the performance of players in a dynamic competition is vital for achieving effective sports coaching. However, a quantitative evaluation of players in racket sports is difficult because it is derived from the integration of complex tactical and technical (i.e., whole-body movement) performances. In this study, we propose a new evaluation method for racket sports based on deep reinforcement learning, which can analyze the motion of a player in more detail, rather than only considering the results (i.e., scores). Our method uses historical data including information related to the tactical and technical performance of players to learn the next-score probability as a Q-function, which is used to value the actions of the players. We leverages long short-term memory model for the learning of Q-function with the poses of the players and the position of the shuttlecock as the input, which are identified by the AlphaPose and TrackNet algorithms, respectively. We verified our approach by comparing various baselines and demonstrated the effectiveness of our method through use cases that analyze the performance of the top badminton players in world-class events."}}
{"id": "YmBrmnG2c", "cdate": 1640995200000, "mdate": 1681523353052, "content": {"title": "Estimating counterfactual treatment outcomes over time in complex multi-agent scenarios", "abstract": ""}}
