{"id": "ugl-pQ_moUm", "cdate": 1577836800000, "mdate": null, "content": {"title": "Visualisation and knowledge discovery from interpretable models", "abstract": "Increasing number of sectors which affect human lives, are using Machine Learning (ML) tools. Hence the need for understanding their working mechanism and evaluating their fairness in decision-making, are becoming paramount, ushering in the era of Explainable AI (XAI). In this contribution we introduced a few intrinsically interpretable models which are also capable of dealing with missing values, in addition to extracting knowledge from the dataset and about the problem. These models are also capable of visualisation of the classifier and decision boundaries: they are the angle based variants of Learning Vector Quantization. We have demonstrated the algorithms on a synthetic dataset and a real-world one (heart disease dataset from the UCI repository). The newly developed classifiers helped in investigating the complexities of the UCI dataset as a multiclass problem. The performance of the developed classifiers were comparable to those reported in literature for this dataset, with additional value of interpretability, when the dataset was treated as a binary class problem."}}
{"id": "jSJlnhRWXd_", "cdate": 1577836800000, "mdate": null, "content": {"title": "Multi-agent Based Manifold Denoising", "abstract": "Manifold learning plays a central role in many Machine Learning (ML) methods where it assumes information lies on a low-dimensional manifold, but the presence of high dimensional noise may defect their performance. In this contribution, we propose a novel (swarm) algorithm to suppress the noise of manifolds of potentially varying dimensionalities. Inspired by colonial insects this method employs multiple agents with different strategies moving through the data space in parallel. During this process, they use local information to reconstruct the manifolds and then move data objects close to them. Moreover, principles of evolutionary game theory are used to encourage agents to select better strategies and hence optimize the hyper-parameters automatically. While other denoising techniques can be seen as single-agent approaches, the new algorithm is a multi-agent approach which makes it more flexible and suitable for scenarios including multiple manifolds. In the experiments, we simulate several situations from a simple manifold with a specific noise level, to more complex manifolds where there are variations on the density, noise level or dimensionalities. Furthermore, we demonstrate the improvement of the proposed algorithm for the performance of the Parzen Window (PW) density estimator."}}
{"id": "DxhV0uQsaF", "cdate": 1577836800000, "mdate": null, "content": {"title": "LAAT: Locally Aligned Ant Technique for detecting manifolds of varying density", "abstract": "Dimensionality reduction and clustering are often used as preliminary steps for many complex machine learning tasks. The presence of noise and outliers can deteriorate the performance of such preprocessing and therefore impair the subsequent analysis tremendously. In manifold learning, several studies indicate solutions for removing background noise or noise close to the structure when the density is substantially higher than that exhibited by the noise. However, in many applications, including astronomical datasets, the density varies alongside manifolds that are buried in a noisy background. We propose a novel method to extract manifolds in the presence of noise based on the idea of Ant colony optimization. In contrast to the existing random walk solutions, our technique captures points that are locally aligned with major directions of the manifold. Moreover, we empirically show that the biologically inspired formulation of ant pheromone reinforces this behavior enabling it to recover multiple manifolds embedded in extremely noisy data clouds. The algorithm performance in comparison to state-of-the-art approaches for noise reduction in manifold detection and clustering is demonstrated, on several synthetic and real datasets, including an N-body simulation of a cosmological volume."}}
{"id": "4Z-xhzIGDW_", "cdate": 1577836800000, "mdate": null, "content": {"title": "ASAP - A Sub-sampling Approach for Preserving Topological Structures", "abstract": ""}}
{"id": "iMADLc-OTk", "cdate": 1451606400000, "mdate": null, "content": {"title": "Low-Rank Kernel Space Representations in Prototype Learning", "abstract": "InSchleif, Frank-Michael supervisedBunte, Kerstin learningKaden, Marika feature vectors are often implicitly mapped to a high-dimensional space using the kernel trick with quadratic costs for the learning algorithm. The recently proposed random Fourier features provide an explicit mapping such that classical algorithms with often linear complexity can be applied. Yet, the random Fourier feature approach remains widely complex techniques which are difficult to interpret. Using Matrix Relevance Learning the linear mapping of the data for a better class separation can be learned by adapting a parametric Euclidean distance. Further, a low-rank representation of the input data can be obtained. We apply this technique to random Fourier feature encoded data to obtain a discriminative mapping of the kernel space. This explicit approach is compared with a differentiable kernel vector quantizer on the same but implicit kernel representation. Using multiple benchmark problems, we demonstrate that a parametric distance on a RBF encoding yields to better classification results and permits access to interpretable prediction models with visualization abilities."}}
{"id": "-md9LrBMT6G", "cdate": 1420070400000, "mdate": null, "content": {"title": "Sparse group factor analysis for biclustering of multiple data sources", "abstract": "Modelling methods that find structure in data are necessary with the current large volumes of genomic data, and there have been various efforts to find subsets of genes exhibiting consistent patterns over subsets of treatments. These biclustering techniques have focused on one data source, often gene expression data. We present a Bayesian approach for joint biclustering of multiple data sources, extending a recent method Group Factor Analysis (GFA) to have a biclustering interpretation with additional sparsity assumptions. The resulting method enables data-driven detection of linear structure present in parts of the data sources. Results: Our simulation studies show that the proposed method reliably infers bi-clusters from heterogeneous data sources. We tested the method on data from the NCI-DREAM drug sensitivity prediction challenge, resulting in an excellent prediction accuracy. Moreover, the predictions are based on several biclusters which provide insight into the data sources, in this case on gene expression, DNA methylation, protein abundance, exome sequence, functional connectivity fingerprints and drug sensitivity."}}
{"id": "SyE5Me-_WB", "cdate": 1388534400000, "mdate": null, "content": {"title": "Optimal Neighborhood Preserving Visualization by Maximum Satisfiability", "abstract": "We present a novel approach to low-dimensional neighbor embedding for visualization, based on formulating an information retrieval based neighborhood preservation cost function as Maximum satisfiability on a discretized output display. The method has a rigorous interpretation as optimal visualization based on the cost function. Unlike previous lowdimensional neighbor embedding methods, our formulation is guaranteed to yield globally optimal visualizations, and does so reasonably fast. Unlike previous manifold learning methods yielding global optima of their cost functions, our cost function and method are designed for low-dimensional visualization where evaluation and minimization of visualization errors are crucial. Our method performs well in experiments, yielding clean embeddings of datasets where a state-of-the-art comparison method yields poor arrangements. In a real-world case study for semi-supervised WLAN signal mapping in buildings we outperform state-of-the-art methods."}}
{"id": "LcE4w7XpdaW", "cdate": 1388534400000, "mdate": null, "content": {"title": "Correlation-based embedding of pairwise score data", "abstract": "Neighbor-preserving embedding of relational data in low-dimensional Euclidean spaces is studied. Contrary to variants of stochastic neighbor embedding that minimize divergence measures between estimated neighborhood probability distributions, the proposed approach fits configurations in the output space by maximizing correlation with potentially asymmetric or missing relationships in the input space. In addition to the linear Pearson correlation measure, the use of soft formulations of Spearman and Kendall rank correlation is investigated for optimizing embeddings like 2D point cloud configurations. We illustrate how this scale-invariant correlation-based framework of multidimensional scaling (cbMDS) helps going beyond distance-preserving scaling approaches and how the embedding results are characteristically different from recent neighborhood embedding techniques."}}
{"id": "WwarnhSVHzO", "cdate": 1356998400000, "mdate": null, "content": {"title": "Adaptive Matrices and Filters for Color Texture Classification", "abstract": "In this paper we introduce an integrative approach towards color texture classification and recognition using a supervised learning framework. Our approach is based on Generalized Learning Vector Quantization (GLVQ), extended by an adaptive distance measure, which is defined in the Fourier domain, and adaptive filter kernels based on Gabor filters. We evaluate the proposed technique on two sets of color texture images and compare results with those other methods achieve. The features and filter kernels learned by GLVQ improve classification accuracy and they are able to generalize much better for data previously unknown to the system."}}
{"id": "T9e80HDQqc", "cdate": 1356998400000, "mdate": null, "content": {"title": "Soft rank neighbor embeddings", "abstract": ""}}
