{"id": "AWZgXGmsbA", "cdate": 1663850164240, "mdate": null, "content": {"title": "Powderworld: A Platform for Understanding Generalization via Rich Task Distributions", "abstract": "One of the grand challenges of reinforcement learning is the ability to generalize to new tasks. However, general agents require a set of rich, diverse tasks to train on. Designing a `foundation environment' for such tasks is tricky -- the ideal environment would support a range of emergent phenomena, an expressive task space, and fast runtime. To take a step towards addressing this research bottleneck, this work presents Powderworld, a lightweight yet expressive simulation environment running directly on the GPU. Within Powderworld, two motivating task distributions are presented, one for world-modelling and one for reinforcement learning. Each contains hand-designed test tasks to examine generalization. Experiments indicate that increasing the environment's complexity improves generalization for world models, yet causes reinforcement learning agents to struggle. Powderworld aims to support the study of generalization by providing a source of diverse tasks arising from the same core rules."}}
{"id": "c39zYHHgQmy", "cdate": 1652737468560, "mdate": null, "content": {"title": "CLIPDraw: Exploring Text-to-Drawing Synthesis through Language-Image Encoders", "abstract": "CLIPDraw is an algorithm that synthesizes novel drawings from natural language input. It does not require any additional training; rather, a pre-trained CLIP language-image encoder is used as a metric for maximizing similarity between the given description and a generated drawing. Crucially, CLIPDraw operates over vector strokes rather than pixel images, which biases drawings towards simpler human-recognizable shapes. Results compare CLIPDraw with other synthesis-through-optimization methods, as well as highlight various interesting behaviors of CLIPDraw."}}
{"id": "ndP-LId1lTB", "cdate": 1640995200000, "mdate": 1682340017093, "content": {"title": "Powderworld: A Platform for Understanding Generalization via Rich Task Distributions", "abstract": ""}}
{"id": "Sg7hQHen5vp", "cdate": 1609459200000, "mdate": 1682340017150, "content": {"title": "AI Charades: Language Models as Interactive Game Environments", "abstract": ""}}
{"id": "P3GRAzVKkB1", "cdate": 1609459200000, "mdate": 1682340017151, "content": {"title": "Selecting for Selection: Learning To Balance Adaptive and Diversifying Pressures in Evolutionary Search", "abstract": ""}}
{"id": "C-8G0Ao3tL", "cdate": 1609459200000, "mdate": 1682340017160, "content": {"title": "CLIPDraw: Exploring Text-to-Drawing Synthesis through Language-Image Encoders", "abstract": ""}}
{"id": "4NEMUAR_aa", "cdate": 1609459200000, "mdate": 1682340017146, "content": {"title": "Population-Based Evolution Optimizes a Meta-Learning Objective", "abstract": ""}}
{"id": "ByeLBj0qFQ", "cdate": 1538087741900, "mdate": null, "content": {"title": "Unsupervised Image to Sequence Translation with Canvas-Drawer Networks", "abstract": "Encoding images as a series of high-level constructs, such as brush strokes or discrete shapes, can often be key to both human and machine understanding. In many cases, however, data is only available in pixel form. We present a method for generating images directly in a high-level domain (e.g.  brush strokes), without the need for real pairwise data.  Specifically, we train a ”canvas” network to imitate the mapping of high-level constructs to pixels, followed by a high-level ”drawing” network which is optimized through this mapping towards solving a desired image recreation or translation task.  We successfully discover sequential vector representations of symbols,  large sketches,  and 3D objects,  utilizing only pixel data.  We display applications of our method in image segmentation, and present several ablation studies comparing various configurations."}}
{"id": "SyX0IeWAW", "cdate": 1518730171967, "mdate": null, "content": {"title": "META LEARNING SHARED HIERARCHIES", "abstract": "We develop a metalearning approach for learning hierarchically structured poli- cies, improving sample efficiency on unseen tasks through the use of shared primitives—policies that are executed for large numbers of timesteps. Specifi- cally, a set of primitives are shared within a distribution of tasks, and are switched between by task-specific policies. We provide a concrete metric for measuring the strength of such hierarchies, leading to an optimization problem for quickly reaching high reward on unseen tasks. We then present an algorithm to solve this problem end-to-end through the use of any off-the-shelf reinforcement learning method, by repeatedly sampling new tasks and resetting task-specific policies. We successfully discover meaningful motor primitives for the directional movement of four-legged robots, solely by interacting with distributions of mazes. We also demonstrate the transferability of primitives to solve long-timescale sparse-reward obstacle courses, and we enable 3D humanoid robots to robustly walk and crawl with the same policy."}}
{"id": "nEuBxk4UUC", "cdate": 1514764800000, "mdate": 1668670782116, "content": {"title": "Unsupervised Image to Sequence Translation with Canvas-Drawer Networks", "abstract": "Encoding images as a series of high-level constructs, such as brush strokes or discrete shapes, can often be key to both human and machine understanding. In many cases, however, data is only available in pixel form. We present a method for generating images directly in a high-level domain (e.g. brush strokes), without the need for real pairwise data. Specifically, we train a \"canvas\" network to imitate the mapping of high-level constructs to pixels, followed by a high-level \"drawing\" network which is optimized through this mapping towards solving a desired image recreation or translation task. We successfully discover sequential vector representations of symbols, large sketches, and 3D objects, utilizing only pixel data. We display applications of our method in image segmentation, and present several ablation studies comparing various configurations."}}
