{"id": "OtG-cWHSZqu", "cdate": 1640995200000, "mdate": 1682335612393, "content": {"title": "Impact and dynamics of hate and counter speech online", "abstract": "Citizen-generated counter speech is a promising way to fight hate speech and promote peaceful, non-polarized discourse. However, there is a lack of large-scale longitudinal studies of its effectiveness for reducing hate speech. To this end, we perform an exploratory analysis of the effectiveness of counter speech using several different macro- and micro-level measures to analyze 131,366 political conversations that took place on German Twitter over four years. We report on the dynamic interactions of hate and counter speech over time and provide insights into whether, as in ‘classic’ bullying situations, organized efforts are more effective than independent individuals in steering online discourse. Taken together, our results build a multifaceted picture of the dynamics of hate and counter speech online. While we make no causal claims due to the complexity of discourse dynamics, our findings suggest that organized hate speech is associated with changes in public discourse and that counter speech—especially when organized—may help curb hateful rhetoric in online discourse."}}
{"id": "w2ICbP3DXIc", "cdate": 1577836800000, "mdate": 1682335612432, "content": {"title": "Countering hate on social media: Large scale classification of hate and counter speech", "abstract": "Hateful rhetoric is plaguing online discourse, fostering extreme societal movements and possibly giving rise to real-world violence. A potential solution to this growing global problem is citizen-generated counter speech where citizens actively engage in hate-filled conversations to attempt to restore civil non-polarized discourse. However, its actual effectiveness in curbing the spread of hatred is unknown and hard to quantify. One major obstacle to researching this question is a lack of large labeled data sets for training automated classifiers to identify counter speech. Here we made use of a unique situation in Germany where self-labeling groups engaged in organized online hate and counter speech. We used an ensemble learning algorithm which pairs a variety of paragraph embeddings with regularized logistic regression functions to classify both hate and counter speech in a corpus of millions of relevant tweets from these two groups. Our pipeline achieved macro F1 scores on out of sample balanced test sets ranging from 0.76 to 0.97---accuracy in line and even exceeding the state of the art. On thousands of tweets, we used crowdsourcing to verify that the judgments made by the classifier are in close alignment with human judgment. We then used the classifier to discover hate and counter speech in more than 135,000 fully-resolved Twitter conversations occurring from 2013 to 2018 and study their frequency and interaction. Altogether, our results highlight the potential of automated methods to evaluate the impact of coordinated counter speech in stabilizing conversations on social media."}}
{"id": "oG6guXjMawK", "cdate": 1577836800000, "mdate": 1682335612433, "content": {"title": "Countering hate on social media: Large scale classification of hate and counter speech", "abstract": ""}}
{"id": "S5xZjX6vz32", "cdate": 1577836800000, "mdate": 1682335612473, "content": {"title": "Impact and dynamics of hate and counter speech online", "abstract": "Citizen-generated counter speech is a promising way to fight hate speech and promote peaceful, non-polarized discourse. However, there is a lack of large-scale longitudinal studies of its effectiveness for reducing hate speech. To this end, we perform an exploratory analysis of the effectiveness of counter speech using several different macro- and micro-level measures to analyze 180,000 political conversations that took place on German Twitter over four years. We report on the dynamic interactions of hate and counter speech over time and provide insights into whether, as in `classic' bullying situations, organized efforts are more effective than independent individuals in steering online discourse. Taken together, our results build a multifaceted picture of the dynamics of hate and counter speech online. While we make no causal claims due to the complexity of discourse dynamics, our findings suggest that organized hate speech is associated with changes in public discourse and that counter speech -- especially when organized -- may help curb hateful rhetoric in online discourse."}}
{"id": "36p9KiETWq", "cdate": 1577836800000, "mdate": 1682335612376, "content": {"title": "Morphological Computation Increases From Lower- to Higher-Level of Biological Motor Control Hierarchy", "abstract": "Voluntary movements, like point-to-point or oscillatory human arm movements, are generated by the interaction of several structures. High-level neuronal circuits in the brain are responsible for planning and initiating a movement. Spinal circuits incorporate proprioceptive feedback to compensate for deviations from the desired movement. Muscle biochemistry and contraction dynamics generate movement driving forces and provide an immediate physical response to external forces, like a low-level decentralized controller. A simple central neuronal command like “initiate a movement” then recruits all these biological structures and processes leading to complex behavior, e.g., generate a stable oscillatory movement in resonance with an external spring-mass system. It has been discussed that the spinal feedback circuits, the biochemical processes, and the biomechanical muscle dynamics contribute to the movement generation, and, thus, take over some parts of the movement generation and stabilization which would otherwise have to be performed by the high-level controller. This contribution is termed morphological computation and can be quantified with information entropy-based approaches. However, it is unknown whether morphological computation actually differs between these different hierarchical levels of the control system. To investigate this, we simulated point-to-point and oscillatory human arm movements with a neuro-musculoskeletal model. We then quantify morphological comput..."}}
