{"id": "sqDbZ6GnvD7", "cdate": 1483228800000, "mdate": 1631558181059, "content": {"title": "Parallel Algorithms for the Computation of Cycles in Relative Neighborhood Graphs", "abstract": "We present parallel algorithms for computing cycle orders and cycle perimeters in relative neighborhood graphs. This parallel algorithm has wide-ranging applications from microscopic to macroscopic domains, e.g., in histopathological image analysis and wireless network routing. Our algorithm consists of the following steps (sub-algorithms): (1) Uniform partitioning of the graph vertices across processes, (2) Parallel Delaunay triangulation and (3) Parallel computation of the relative neighborhood graph and the cycle orders and perimeters. We evaluated our algorithm on a large dataset with 6.5 Million points and demonstrate excellent fixed-size scalability. We also demonstrate excellent isogranular scalability up to 131K processes. Our largest run was on a dataset with 13 billion points on 131K processes on ORNL's Cray XK7 Titan supercomputer."}}
{"id": "AdPYskXiECh", "cdate": 1388534400000, "mdate": 1631558181061, "content": {"title": "Kernel-Based Morphometry of Diffusion Tensor Images", "abstract": "Voxel-based group-wise statistical analysis of diffusion tensor imaging (DTI) is an integral component in most population-based neuroimaging studies such as those studying brain development during infancy or aging, or those investigating structural differences between healthy and diseased populations. The majority of studies using DTI limit themselves by testing only certain properties of the tensor that mainly include anisotropy and diffusivity. However, the pathology under study may affect other aspects like the orientation information provided by the tensors. Therefore, for detecting subtle pathological changes it is important to perform group-wise testing on the whole tensor, which encompasses the changes in anisotropy, diffusivity and orientation. This is rendered challenging by the fact that conventional linear statistics cannot be applied to tensors. Moreover, the pathology over the population is unknown and could be non-linear, further complicating the group-based statistical analysis. This chapter gives a perspective on performing voxel-wise morphometry of tensor data using kernel-based approach. The method is referred as Kernel-based morphometry (KBM) as it models the tensor distribution using kernel principal component analysis (kPCA), which linearizes the data in high dimensional space. Subsequently a Hotelling T 2 test is performed on the high dimensional kernelized data to determine statistical group differences. We apply this method on simulated and real datasets and show that KBM can effectively identify the underlying tensorial distribution. Thus it can potentially elucidate pathology-induced population differences, thereby establishing a kernelized full tensor framework for population studies."}}
{"id": "zDsWr3W-rm", "cdate": 1356998400000, "mdate": 1631558180824, "content": {"title": "Registration of multiple temporally related point sets using a novel variant of the coherent point drift algorithm: application to coronary tree matching", "abstract": "We present a novel algorithm for the registration of multiple temporally related point sets. Although our algorithm is derived in a general setting, our primary motivating application is coronary tree matching in multi-phase cardiac spiral CT. Our algorithm builds upon the fast, outlier-resistant Coherent Point Drift (CPD) algorithm, but incorporates temporal consistency constraints between the point sets, resulting in spatiotemporally smooth displacement fields. We preserve the speed and robustness of the CPD algorithm by using the technique of separable surrogates within an EM (Expectation-Maximization) optimization framework, while still minimizing a global registration cost function employing both spatial and temporal regularization. We demonstrate the superiority of our novel temporally consistent group-wise CPD algorithm over a straightforward pair-wise approach employing the original CPD algorithm, using coronary trees derived from both simulated and real cardiac CT data. In all the tested configurations and datasets, our method presents lower average error between tree landmarks compared to the pairwise method. In the worst case, the difference is around few micrometers but in the better case, our method divides by two the error from the pairwise method. This improvement is especially important for a dataset with numerous outliers. With a fixed set of parameter that has been tuned automatically, our algorithm yields better results than the original CPD algorithm which shows the capacity to register without <i>a priori</i> information on an unknown dataset."}}
{"id": "b5VHPDocJw", "cdate": 1325376000000, "mdate": 1631558181380, "content": {"title": "Patient-specific finite-element simulation of respiratory mechanics for radiotherapy guidance, a first evaluation study", "abstract": "During radiotherapy of lung tumors, the respiratory motion must be tracked to reduce radiation of healthy tissue. This is usually done by using a respiratory surrogate, but with limited accuracy. We investigate how patient-specific finite element models (FEM) of respiratory mechanics can predict the motion of the lungs. First, the anatomical models of the lungs and thorax are extracted from CT images automatically. Then, a biomechanical model is used to simulate the respiratory motion based on a novel thorax/lung interaction force that simulates the pleural cavity. Our model is not driven by image forces but by thoracic pressures personalized using a multivariate optimizer. The proposed model is validated on three DIR-Lab datasets, yielding a promising internal landmark error of 3.33 ± 0.60 mm. Our model may represent a tool for lung deformation prediction and therapy guidance."}}
{"id": "IF2JFgBZ38k", "cdate": 1325376000000, "mdate": 1631558181214, "content": {"title": "Automated detection of diagnostically relevant regions in H&E stained digital pathology slides", "abstract": "We present a computationally efficient method for analyzing H&E stained digital pathology slides with the objective of discriminating diagnostically relevant vs. irrelevant regions. Such technology is useful for several applications: (1) It can speed up computer aided diagnosis (CAD) for histopathology based cancer detection and grading by an order of magnitude through a triage-like preprocessing and pruning. (2) It can improve the response time for an interactive digital pathology workstation (which is usually dealing with several GByte digital pathology slides), e.g., through controlling adaptive compression or prioritization algorithms. (3) It can support the detection and grading workflow for expert pathologists in a semi-automated diagnosis, hereby increasing throughput and accuracy. At the core of the presented method is the statistical characterization of tissue components that are indicative for the pathologist's decision about malignancy vs. benignity, such as, nuclei, tubules, cytoplasm, etc. In order to allow for effective yet computationally efficient processing, we propose visual descriptors that capture the distribution of color intensities observed for nuclei and cytoplasm. Discrimination between statistics of relevant vs. irrelevant regions is learned from annotated data, and inference is performed via linear classification. We validate the proposed method both qualitatively and quantitatively. Experiments show a cross validation error rate of 1.4%. We further show that the proposed method can prune &asymp;90% of the area of pathological slides while maintaining 100% of all relevant information, which allows for a speedup of a factor of 10 for CAD systems."}}
{"id": "GexRV4xB6zR", "cdate": 1325376000000, "mdate": 1631558181226, "content": {"title": "A Personalized Biomechanical Model for Respiratory Motion Prediction", "abstract": "Time-resolved imaging of the thorax or abdominal area is affected by respiratory motion. Nowadays, one-dimensional respiratory surrogates are used to estimate the current state of the lung during its cycle, but with rather poor results. This paper presents a framework to predict the 3D lung motion based on a patient-specific finite element model of respiratory mechanics estimated from two CT images at end of inspiration (EI) and end of expiration (EE). We first segment the lung, thorax and sub-diaphragm organs automatically using a machine-learning algorithm. Then, a biomechanical model of the lung, thorax and sub-diaphragm is employed to compute the 3D respiratory motion. Our model is driven by thoracic pressures, estimated automatically from the EE and EI images using a trust-region approach. Finally, lung motion is predicted by modulating the thoracic pressures. The effectiveness of our approach is evaluated by predicting lung deformation during exhale on five DIR-Lab datasets. Several personalization strategies are tested, showing that an average error of 3.88 ±1.54 mm in predicted landmark positions can be achieved. Since our approach is generative, it may constitute a 3D surrogate information for more accurate medical image reconstruction and patient respiratory analysis."}}
{"id": "FIeFhZvFWr-", "cdate": 1325376000000, "mdate": null, "content": {"title": "Automated malignancy detection in breast histopathological images", "abstract": "Detection of malignancy from histopathological images of breast cancer is a labor-intensive and error-prone process. To streamline this process, we present an efficient Computer Aided Diagnostic system that can differentiate between cancerous and non-cancerous H&E (hemotoxylin&eosin) biopsy samples. Our system uses novel textural, topological and morphometric features taking advantage of the special patterns of the nuclei cells in breast cancer histopathological images. We use a Support Vector Machine classifier on these features to diagnose malignancy. In conjunction with the maximum relevance - minimum redundancy feature selection technique, we obtain high sensitivity and specificity. We have also investigated the effect of image compression on classification performance."}}
{"id": "Ty6TLYF9sd-", "cdate": 1293840000000, "mdate": 1631558181059, "content": {"title": "Network cycle features: Application to computer-aided Gleason grading of prostate cancer histopathological images", "abstract": "Features extracted from cell networks have become popular tools in histological image analysis. However, existing features do not take sufficient advantage of the cycle structure present within the cell networks. We introduce a new class of network cycle features that take advantage of such structures. We demonstrate the utility of these features for automated prostate cancer scoring using histological images. Prostate cancer is commonly scored by pathologists using the Gleason grading system and our automated system based upon network cycle features serves an important need in making this process less labor-intensive and more reproducible. Our system first extracts the cells from the histological images, computes networks from the cell locations and then computes features based upon statistics for the different cycles present in these networks. Using an SVM (Support Vector Machine) classifier on these features, we demonstrate the efficacy of our system in distinguishing between grade 3 and grade 4 prostate tumors. We also show the superiority of our approach over previously developed systems for this problem based upon texture features, fractal features and alternative network features."}}
{"id": "7pccDabfsAq", "cdate": 1293840000000, "mdate": 1631558181059, "content": {"title": "Facilitating 3D Spectroscopic Imaging through Automatic Prostate Localization in MR Images Using Random Walker Segmentation Initialized via Boosted Classifiers", "abstract": "Magnetic resonance imaging (MRI) plays a key role in the diagnosis, staging and treatment monitoring for prostate cancer. Automatic prostate localization in T2-weighted MR images could facilitate labor-intensive cancer imaging techniques such as 3D chemical shift MR spectroscopic imaging as well as advanced analysis techniques for diagnosis and treatment monitoring. We present a novel method for automatic segmentation of the prostate gland in MR images. Accurate prostate segmentation in MR imagery poses unique challenges. These include large variations in prostate anatomy and disease, intensity inhomogeneities, and near-field artifacts induced by endorectal coils. Our system meets these challenges with two key components. First is the automatic center detection of the prostate with a boosted classifier trained on intensity-based multi-level Gaussian Mixture Model Expectation Maximization (GMM-EM) segmentations of the raw MR images. The second is the use of a shape model in conjunction with Multi-Label Random Walker (MLRW) to constrain the seeding process within MLRW. Our system has been validated on a large database of non-isotropic T2-TSE (Turbo Spin Echo) and isotropic T2-SPACE (Sampling Perfection with Application Optimized Contrasts) images."}}
{"id": "zGiHl-7hz-O", "cdate": 1262304000000, "mdate": 1631558181061, "content": {"title": "A Learning-Based Approach to Evaluate Registration Success", "abstract": "Clinical trials are more and more relying on medical imaging technologies to quantify changes over time during longitudinal studies. This calls for having an unsupervised batch registration process. However, even good registration algorithms fail, whether that is because of a small capture range, local optima, or because the registration finds an optimum that is not meaningful since the input data contains different anatomical sites. We propose a new method to evaluate the success or failure of batch registrations, so that failed or suspicious registrations can be flagged and manually corrected. The evaluation is based on a support vector machine that evaluates features representing the “goodness” of the registration result. We devise the features to be the distance measured between optima produced by different similarity measures as well as optima resulting from registering subsections of the volumes. The features of 30 volume registrations have been labeled manually and used for the learning phase. Based on a test on unseen 67 volume pairs of varying anatomical sites, we are able to classify 90% of the registrations correctly."}}
