{"id": "FEq28TFwMNk", "cdate": 1672531200000, "mdate": 1684350664347, "content": {"title": "Efficient Flow-based Approximation Algorithms for Submodular Hypergraph Partitioning via a Generalized Cut-Matching Game", "abstract": "Despite there being significant work on developing spectral, and metric embedding based approximation algorithms for hypergraph generalizations of conductance, little is known regarding the approximability of hypergraph partitioning objectives beyond this. This work proposes algorithms for a general model of hypergraph partitioning that unifies both undirected and directed versions of many well-studied partitioning objectives. The first contribution of this paper introduces polymatroidal cut functions, a large class of cut functions amenable to approximation algorithms via metric embeddings and routing multicommodity flows. We demonstrate an $O(\\sqrt{\\log n})$-approximation, where $n$ is the number of vertices in the hypergraph, for these problems by rounding relaxations to metrics of negative-type. The second contribution of this paper generalizes the cut-matching game framework of Khandekar et. al. to tackle polymatroidal cut functions. This yields the first almost-linear time $O(\\log n)$-approximation algorithm for standard versions of undirected and directed hypergraph partitioning. A technical consequence of our construction is that a cut-matching game which greatly relaxes the set of allowed actions for both players can be used to partition hypergraphs with negligible impact on the approximation ratio. We believe this to be of independent interest."}}
{"id": "0bXJws7mDMX", "cdate": 1640995200000, "mdate": 1681491645537, "content": {"title": "Practical Almost-Linear-Time Approximation Algorithms for Hybrid and Overlapping Graph Clustering", "abstract": ""}}
{"id": "WlUSH13e-B6g", "cdate": 1546300800000, "mdate": 1664346296247, "content": {"title": "Minimum and Maximum Category Constraints in the Orienteering Problem with Time Windows", "abstract": "We introduce a new variation of the Orienteering Problem (OP), the Minimum-Maximum Category Constraints Orienteering Problem with Time Windows. In the Orienteering Problem we seek to determine a path from node $$ S $$ to node $$ T $$ in a weighted graph where each node has a score. The total weight of the path must not exceed a predetermined budget and the goal is to maximize the total score. In this variation, each Activity is associated with a category and the final solution is required to contain at least a minimum and at most a maximum of specific categories. This variation better captures the problem of tourists visiting cities. For example, the tourists can decide to visit exactly one restaurant at a specific time window and at least one park. We present a Replace Local Search and an Iterated Local Search which utilizes Stochastic Gradient Descent to identify the tightness of the constraints. We perform exhaustive experimental evaluation of our results against state of the art implementations for the unconstrained problem and examine how it performs against increasingly more restricting settings."}}
