{"id": "DggBzBhuPr9", "cdate": 1640995200000, "mdate": 1682458725066, "content": {"title": "Persuading Risk-Conscious Agents: A Geometric Approach", "abstract": "We consider a persuasion problem between a sender and a receiver whose utility may be nonlinear in her belief; we call such receivers risk-conscious. Such utility models arise when the receiver exhibits systematic biases away from expected-utility-maximization, such as uncertainty aversion (e.g., from sensitivity to the variance of the waiting time for a service). Due to this nonlinearity, the standard approach to finding the optimal persuasion mechanism using revelation principle fails. To overcome this difficulty, we use the underlying geometry of the problem to develop a convex optimization framework to find the optimal persuasion mechanism. We define the notion of full persuasion and use our framework to characterize conditions under which full persuasion can be achieved. We use our approach to study binary persuasion, where the receiver has two actions and the sender strictly prefers one of them at every state. Under a convexity assumption, we show that the binary persuasion problem reduces to a linear program, and establish a canonical set of signals where each signal either reveals the state or induces in the receiver uncertainty between two states. Finally, we discuss the broader applicability of our methods to more general contexts, and illustrate our methodology by studying information sharing of waiting times in service systems."}}
{"id": "jf3k9E7LB-O", "cdate": 1609459200000, "mdate": 1648845074487, "content": {"title": "Learning to Persuade on the Fly: Robustness Against Ignorance", "abstract": "We study a repeated persuasion setting between a sender and a receiver, where at each time t, the sender shares information about a payoff-relevant state with the receiver. The state at each time t is drawn independently and identically from an unknown distribution, and subsequent to receiving information about it, the receiver (myopically) chooses an action from a finite set. The sender seeks to persuade the receiver into choosing actions that are aligned with her preference by selectively sharing information about the state. In contrast to the standard persuasion setting, we focus on the case where neither the sender nor the receiver knows the distribution of the payoff relevant state. Instead, the sender learns this distribution over time by observing the state realizations. We adopt the assumption common in the literature on Bayesian persuasion that at each time period, prior to observing the realized state in that period, the sender commits to a signaling mechanism that maps each state to a possibly random action recommendation. Subsequent to the state observation, the sender recommends an action as per the chosen signaling mechanism."}}
{"id": "bHTdpA-K5aJ", "cdate": 1609459200000, "mdate": 1648845074470, "content": {"title": "Learning to Persuade on the Fly: Robustness Against Ignorance", "abstract": "We study a repeated persuasion setting between a sender and a receiver, where at each time $t$, the sender observes a payoff-relevant state drawn independently and identically from an unknown prior distribution, and shares state information with the receiver, who then myopically chooses an action. As in the standard setting, the sender seeks to persuade the receiver into choosing actions that are aligned with the sender's preference by selectively sharing information about the state. However, in contrast to the standard models, the sender does not know the prior, and has to persuade while gradually learning the prior on the fly. We study the sender's learning problem of making persuasive action recommendations to achieve low regret against the optimal persuasion mechanism with the knowledge of the prior distribution. Our main positive result is an algorithm that, with high probability, is persuasive across all rounds and achieves $O(\\sqrt{T\\log T})$ regret, where $T$ is the horizon length. The core philosophy behind the design of our algorithm is to leverage robustness against the sender's ignorance of the prior. Intuitively, at each time our algorithm maintains a set of candidate priors, and chooses a persuasion scheme that is simultaneously persuasive for all of them. To demonstrate the effectiveness of our algorithm, we further prove that no algorithm can achieve regret better than $\\Omega(\\sqrt{T})$, even if the persuasiveness requirements were significantly relaxed. Therefore, our algorithm achieves optimal regret for the sender's learning problem up to terms logarithmic in $T$."}}
{"id": "P9CwZiCQ7Qi", "cdate": 1609459200000, "mdate": 1648845074476, "content": {"title": "The Remarkable Robustness of the Repeated Fisher Market", "abstract": "In many settings, resources are allocated among agents repeatedly over time without the use of monetary transfers: consider, for example, allocating server-time to company employees, rooms to students, or food among food banks. Here, the central challenge is to allocate resources efficiently despite the absence of payments. In this work we study a simple online variant of the standard Fisher market, where we endow all agents with a budget of artificial credits, and then repeatedly run simultaneous first-price auctions for each item in each period. Owing to their simplicity, such mechanisms have been gaining in popularity, with several recent successful implementations, most notably, by Feeding America for US food banks. Our goal in this paper is to understand the incentive and efficiency properties of these mechanisms. Our main contribution in this work is to show that such simple mechanisms enjoy strong performance guarantees under minimal rationality assumptions. Formally, we consider a dynamic allocation setting, where multiple items are available in each period, and each agent's preference is a fractionally subadditive (XOS) valuation function, drawn independently from some underlying distributions. Agents start with some initial endowment of credits, and in each round, participate in simultaneous first-price auctions for each item. We benchmark the performance this mechanism against widely-adopted solution concepts from the literature on bargaining. In particular, we show that irrespective of the strategies of other agents, each agent can obtain a $1/2-o(1)$ approximation of their \\em ideal utility, i.e., the utility they derive from their favorite allocation subject to giving other agents their share (proportional to initial endowments) of the items. We do this by providing a lower-bound on the maximum value of each agent in the mechanism. Our results provide strong argument for a wider adoption of artificial currency mechanisms in several ways. First, our guarantees have frugal strategic and informational requirements - agents do not need to know the preferences or strategies of other participants in order to secure a half of their ideal utility. Second, the performance guarantees are independent of the cardinality of the type-space, and agnostic of the underlying type distributions. Finally, our results also yield operational insights into how the principal can choose the appropriate credit endowments in order to target a particular ideal utility profile."}}
{"id": "JxhPFF0kb7Y", "cdate": 1609459200000, "mdate": 1648845074455, "content": {"title": "Tractable Equilibria in Sponsored Search with Endogenous Budgets", "abstract": "Given the scale of the sponsored search market, it is practically important yet technically difficult to understand the interplay between bidders and the ad network and its effect on the long-run s..."}}
{"id": "JkjIkwCnPop", "cdate": 1609459200000, "mdate": 1648845074475, "content": {"title": "From Monetary to Nonmonetary Mechanism Design via Artificial Currencies", "abstract": "Nonmonetary mechanisms for repeated allocation and decision making are gaining widespread use in many real-world settings. Our aim in this work is to study the performance and incentive properties ..."}}
{"id": "cfU67pg0E_h", "cdate": 1577836800000, "mdate": 1648845074519, "content": {"title": "Information Design for Congested Social Services: Optimal Need-Based Persuasion", "abstract": "Social services often face the challenge of congestion due to their limited capacity relative to their demand. The congestion partly stems from the inclusionary intent of such services: a toll-free road is available to everyone, even those able to afford alternative tolled ones. A broad range of low- and middle-income households are eligible to apply for public housing. How can a social service provider reduce congestion and thus the efficiency loss associated with service delay? In this context, the two controls commonly used for managing congestion, pricing and centralized admission control, are inapplicable due to fairness and implementation considerations. However, the service provider may have control over the information about the system state that it shares with the users. Local traffic managers and public housing authorities have accurate information about the level of congestion for their corresponding services. As such, the service provider can leverage this informational advantage to persuade some of those with lower needs to forgo the service and reduce congestion in the system. In this paper, we study how effective such an informational lever is. To investigate this question, we develop a stylized model that captures the key features of such a system. We consider a single server queueing system where each user, upon arrival, decides to either wait for the service by joining an unobservable queue or seek her outside option. To capture the disparity that users face in the quality of their outside options, we categorize users into two groups: (1) high-needusers who have no feasible outside option and (2) low-needusers who have a viable alternative. Both types incur higher waiting costs upon joining a longer queue. A high-need user always joins as she does not have any other choice whereas a low-need user makes a joinor leavedecision to maximize her expected utility. Since an arriving user does not observe the queue, her decision relies on her belief about the queue size based on the information shared by the service provider. The service provider has complete information about the status of the queue and can commit to a signaling mechanism, as in the Bayesian persuasion framework of Kamenica and Gentzkow (2011). Because high-need users always join the queue, the service provider does not need to know user types to implement a signaling mechanism. The main contribution of this paper is the characterization of the Pareto-optimal signaling mechanisms and the comparison of their welfare against key benchmarks: full-information and no-information mechanisms, and centralized admission policies. To ensure welfare improvement for bothtypes, we focus on the notion of Pareto-dominance, and we show that under mild assumptions, any such signaling mechanism has a threshold structure. The welfare comparison establishes the following: if the user population is mainly composed of a single type, information design does not provide much improvement over full-information or no-information, whereas if the population has sufficient heterogeneity, information design can lead to substantial Pareto improvement in welfare; and with enough high-need users, the Pareto frontier of information design coincides with that of the strongest \"first-best\" benchmark, i.e, the Pareto-optimal centralized admission policy with knowledge of users' types and no incentive constraints. In other words, in such settings, information design plays the role of a coordination device to achieve first-best welfare."}}
{"id": "Qdg5slbKHtg", "cdate": 1577836800000, "mdate": 1648845074565, "content": {"title": "Information Design for Congested Social Services: Optimal Need-Based Persuasion", "abstract": "We study the effectiveness of information design in reducing congestion in social services catering to users with varied levels of need. In the absence of price discrimination and centralized admission, the provider relies on sharing information about wait times to improve welfare. We consider a stylized model with heterogeneous users who differ in their private outside options: low-need users have an acceptable outside option to the social service, whereas high-need users have no viable outside option. Upon arrival, a user decides to wait for the service by joining an unobservable first-come-first-serve queue, or leave and seek her outside option. To reduce congestion and improve social outcomes, the service provider seeks to persuade more low-need users to avail their outside option, and thus better serve high-need users. We characterize the Pareto-optimal signaling mechanisms and compare their welfare outcomes against several benchmarks. We show that if either type is the overwhelming majority of the population, information design does not provide improvement over sharing full information or no information. On the other hand, when the population is a mixture of the two types, information design not only Pareto dominates full-information and no-information mechanisms, in some regimes it also achieves the same welfare as the \"first-best\", i.e., the Pareto-optimal centralized admission policy with knowledge of users' types."}}
{"id": "sLRthkaYAXx", "cdate": 1546300800000, "mdate": 1648845074597, "content": {"title": "Optimal Signaling Mechanisms in Unobservable Queues", "abstract": "In many systems with limited service capacity, customers must wait in a queue for service. When customers cannot observe the queue, how should a revenue-maximizing service provider convey informati..."}}
{"id": "k9Vhebr1hyO", "cdate": 1546300800000, "mdate": 1648845074543, "content": {"title": "Persuading Risk-Conscious Agents: A Geometric Approach", "abstract": ""}}
