{"id": "OWwpTApJ5O", "cdate": 1698796800000, "mdate": 1696210467239, "content": {"title": "An active foveated gaze prediction algorithm based on a Bayesian ideal observer", "abstract": ""}}
{"id": "4lRGuJCqkPc", "cdate": 1680870567310, "mdate": null, "content": {"title": "Novelty and Lifted Helpful Actions in Generalized Planning", "abstract": "It has been shown recently that successful techniques in classical planning, such as goal-oriented heuristics and landmarks, can improve the ability to compute planning programs for generalized planning (GP) problems. In this work, we introduce the notion of action novelty rank, which computes novelty with respect to a planning program, and propose novelty-based generalized planning solvers, which prune a newly generated planning program if its most frequent action repetition is greater than a given bound $v$, implemented by novelty-based best-first search BFS($v$) and its progressive variant PGP($v$). Besides, we introduce lifted helpful actions in GP derived from action schemes, and propose new evaluation functions and structural program restrictions to scale up the search. Our experiments show that the new algorithms BFS($v$) and PGP($v$) outperform the state-of-the-art in GP over the standard generalized planning benchmarks. Practical findings on the above-mentioned methods in generalized planning are briefly discussed."}}
{"id": "zusQuRLOKE_", "cdate": 1677628800000, "mdate": 1681731358846, "content": {"title": "Image amodal completion: A survey", "abstract": ""}}
{"id": "UFiucwnDcU", "cdate": 1672531200000, "mdate": 1696210467237, "content": {"title": "Truck Speed Detection Through Video Streams", "abstract": "Accurately assessing the speed of vehicles is important for traffic management systems. This is especially the case for heavy goods vehicles such as lorries/trucks, since they cannot easily stop at short notice. Previous work has shown that deep learning can be used for identifying and distinguishing trucks on the road from other vehicles, e.g., [1], however accurately estimating their speed from roadside cameras remains a challenge. One solution we employ is using video data from the roadside cameras, then extracting the speeds of vehicles in the video from the Infra-Red Traffic Logger (TIRTL) systems, which are provided by the Department of Transport, Victoria. The TIRTL system is very accurate but expensive and only deployed at a few key locations around Melbourne. A solution that works at the edge and uses lightweight Internet-of-Things devices to produce accurate speed data is thus highly desirable. In this paper, we propose a Convolutional Neural Network (CNN) model using a light-weight Siamese backbone and associated feature correlations to track and detect the speed of trucks. We build a dataset that contains images with speed and bounding-box annotations to train the proposed model. To enable the model to maintain a high degree of accuracy with different camera setups, we train and test the proposed model using image augmentation. The results show our model has an average speed estimation error of 4.92% and an average Intersection over Union (IoU) of 75.8% whilst incorporating different intrinsic and extrinsic parameters based on image augmentation. Such a capability has the potential to change the way services are deployed across the road network to record vehicle types and speeds."}}
{"id": "T-hDKUHB2WC", "cdate": 1672531200000, "mdate": 1696210467238, "content": {"title": "Novelty and Lifted Helpful Actions in Generalized Planning", "abstract": "It has been shown recently that successful techniques in classical planning, such as goal-oriented heuristics and landmarks, can improve the ability to compute planning programs for generalized planning (GP) problems. In this work, we introduce the notion of action novelty rank, which computes novelty with respect to a planning program, and propose novelty-based generalized planning solvers, which prune a newly generated planning program if its most frequent action repetition is greater than a given bound $v$, implemented by novelty-based best-first search BFS($v$) and its progressive variant PGP($v$). Besides, we introduce lifted helpful actions in GP derived from action schemes, and propose new evaluation functions and structural program restrictions to scale up the search. Our experiments show that the new algorithms BFS($v$) and PGP($v$) outperform the state-of-the-art in GP over the standard generalized planning benchmarks. Practical findings on the above-mentioned methods in generalized planning are briefly discussed."}}
{"id": "IVo0zuRG_9", "cdate": 1672531200000, "mdate": 1681731358862, "content": {"title": "Amodal Intra-class Instance Segmentation: New Dataset and Benchmark", "abstract": "Images of realistic scenes often contain intra-class objects that are heavily occluded from each other, making the amodal perception task that requires parsing the occluded parts of the objects challenging. Although important for downstream tasks such as robotic grasping systems, the lack of large-scale amodal datasets with detailed annotations makes it difficult to model intra-class occlusions explicitly. This paper introduces a new amodal dataset for image amodal completion tasks, which contains over 255K images of intra-class occlusion scenarios, annotated with multiple masks, amodal bounding boxes, dual order relations and full appearance for instances and background. We also present a point-supervised scheme with layer priors for amodal instance segmentation specifically designed for intra-class occlusion scenarios. Experiments show that our weakly supervised approach outperforms the SOTA fully supervised methods, while our layer priors design exhibits remarkable performance improvements in the case of intra-class occlusion in both synthetic and real images."}}
{"id": "CyMgnEMjEvw", "cdate": 1672531200000, "mdate": 1696210467237, "content": {"title": "Novelty and Lifted Helpful Actions in Generalized Planning", "abstract": "It has been shown recently that successful techniques in classical planning, such as goal-oriented heuristics and landmarks, can improve the ability to compute planning programs for generalized planning (GP) problems. In this work, we introduce the notion of action novelty rank, which computes novelty with respect to a planning program, and propose novelty-based generalized planning solvers, which prune a newly generated planning program if its most frequent action repetition is greater than a given bound v, implemented by novelty-based best-first search BFS(v) and its progressive variant PGP(v). Besides, we introduce lifted helpful actions in GP derived from action schemes, and propose new evaluation functions and structural program restrictions to scale up the search. Our experiments show that the new algorithms BFS(v) and PGP(v) outperform the state-of-the-art in GP over the standard generalized planning benchmarks. Practical findings on the above-mentioned methods in generalized planning are briefly discussed."}}
{"id": "8MwkbabkAs", "cdate": 1640995200000, "mdate": 1666918277059, "content": {"title": "Image Amodal Completion: A Survey", "abstract": "Existing computer vision systems can compete with humans in understanding the visible parts of objects, but still fall far short of humans when it comes to depicting the invisible parts of partially occluded objects. Image amodal completion aims to equip computers with human-like amodal completion functions to understand an intact object despite it being partially occluded. The main purpose of this survey is to provide an intuitive understanding of the research hotspots, key technologies and future trends in the field of image amodal completion. Firstly, we present a comprehensive review of the latest literature in this emerging field, exploring three key tasks in image amodal completion, including amodal shape completion, amodal appearance completion, and order perception. Then we examine popular datasets related to image amodal completion along with their common data collection methods and evaluation metrics. Finally, we discuss real-world applications and future research directions for image amodal completion, facilitating the reader's understanding of the challenges of existing technologies and upcoming research trends."}}
{"id": "ddNydCbo_l1", "cdate": 1609459200000, "mdate": 1681731358842, "content": {"title": "Invertible Concept-based Explanations for CNN Models with Non-negative Concept Activation Vectors", "abstract": "Convolutional neural network (CNN) models for computer vision are powerful but lack explainability in their most basic form. This deficiency remains a key challenge when applying CNNs in important domains. Recent work on explanations through feature importance of approximate linear models has moved from input-level features (pixels or segments) to features from mid-layer feature maps in the form of concept activation vectors (CAVs). CAVs contain concept-level information and could be learned via clustering. In this work, we rethink the ACE algorithm of Ghorbani et~al., proposing an alternative invertible concept-based explanation (ICE) framework to overcome its shortcomings. Based on the requirements of fidelity (approximate models to target models) and interpretability (being meaningful to people), we design measurements and evaluate a range of matrix factorization methods with our framework. We find that non-negative concept activation vectors (NCAVs) from non-negative matrix factorization provide superior performance in interpretability and fidelity based on computational and human subject experiments. Our framework provides both local and global concept-level explanations for pre-trained CNN models."}}
{"id": "vFiW05xXfRv", "cdate": 1577836800000, "mdate": null, "content": {"title": "Optimal visual search based on a model of target detectability in natural images", "abstract": "To analyse visual systems, the concept of an ideal observer promises an optimal response for a given task. Bayesian ideal observers can provide optimal responses under uncertainty, if they are given the true distributions as input. In visual search tasks, prior studies have used signal to noise ratio (SNR) or psychophysics experiments to set the distributional parameters for simple targets on backgrounds with known patterns, however these methods do not easily translate to complex targets on natural scenes. Here, we develop a model of target detectability in natural images to estimate the parameters of target-present and target-absent distributions for a visual search task. We present a novel approach for approximating the foveated detectability of a known target in natural backgrounds based on biological aspects of human visual system. Our model considers both the uncertainty about target position and the visual system's variability due to its reduced performance in the periphery compared to the fovea. Our automated prediction algorithm uses trained logistic regression as a post processing phase of a pre-trained deep neural network. Eye tracking data from 12 observers detecting targets on natural image backgrounds are used as ground truth to tune foveation parameters and evaluate the model, using cross-validation. Finally, the model of target detectability is used in a Bayesian ideal observer model of visual search, and compared to human search performance."}}
