{"id": "gnfIbpA5KE", "cdate": 1694027545311, "mdate": 1694027545311, "content": {"title": "Training Feedforward Neural Nets in Hopfield-Energy-Based Configuration: A Two-Step Approach", "abstract": "We introduce Hopfield-Energy-Based Learning, a general learning framework that is inspired by energy-based models, to train feedforward neural nets. Our approach includes two training phases applied iteratively: first, the minimization of the internal energy, that captures dependencies between input samples and network parameters, is carried out in an unsupervised manner; second, the problem-dependent supervised external energy (e.g., cross-entropy loss) combined with partially reversed internal energy gradients are back-propagated in a standard manner. The intuition is that the first stage helps parameters to settle into the state that simply partitions data into clusters; while in the second stage, the network is allowed to deviate from that clustering a bit (hence gradient reversal) in order to converge to parameters that ultimately perform well on the task at hand. Notably, the data used for the two steps might not be one and the same (e.g., can come from different domains) and the approach naturally tailors itself to solve unsupervised domain adaptation problems without adopting any distribution alignment techniques. We also show that the proposed training strategy substantially improves the performance of several ConvNets on standard supervised classification tasks; showing improvements of at least 1.2% (2.64% on CIFAR-10, 4.5% on CIFAR-100, and 1.35% on ImageNet). Our formulation is general, performs well in practice, and holds promise for scenarios where labeled data is limited."}}
{"id": "lJhpOBgRWD", "cdate": 1682899200000, "mdate": 1681693340052, "content": {"title": "Ensemble diverse hypotheses and knowledge distillation for unsupervised cross-subject adaptation", "abstract": ""}}
{"id": "psNHHIc8Ei", "cdate": 1680047954578, "mdate": 1680047954578, "content": {"title": "Ensemble diverse hypotheses and knowledge distillation for unsupervised cross-subject adaptation", "abstract": "Recognizing human locomotion intent and activities is important for controlling wearable robots while walking in complex environments. However, human-robot interface signals are usually user-dependent, which causes the classifier trained on source subjects to perform poorly on new subjects. To address this issue, this paper designs the ensemble diverse hypotheses and knowledge distillation (EDHKD) method to realize unsupervised cross-subject adaptation. EDH mitigates the divergence between labeled data of source subjects and unlabeled data of target subjects to accurately classify the locomotion modes of target subjects without labeling data. Compared to previous domain adaptation methods based on the single learner, which may only learn a subset of features from input signals, EDH can learn diverse features by incorporating multiple diverse feature generators and thus increases the accuracy and decreases the variance of classifying target data, but it sacrifices the efficiency. To solve this problem, EDHKD (student) distills the knowledge from the EDH (teacher) to a single network to re- main efficient and accurate. The performance of the EDHKD is theoretically proved and experimentally validated on a 2D moon dataset and two public human locomotion datasets. Experimental results show that the EDHKD outperforms all other methods. The EDHKD can classify target data with 96.9%, 94.4%, and 97.4% average accuracy on the above three datasets with a short computing time (1 ms). Compared to a benchmark (BM) method, the EDHKD increases by 1.3% and 7.1% average accuracy for classifying the locomotion modes of target subjects. The EDHKD also stabilizes the learning curves. Therefore, the EDHKD is significant for increasing the generalization ability and efficiency of the human intent prediction and human activity recognition system, which will improve human-robot interactions."}}
{"id": "r87egpBNGQq", "cdate": 1648670135699, "mdate": 1648670135699, "content": {"title": "Linked Dynamic Graph CNN: Learning through Point Cloud by Linking Hierarchical Features", "abstract": "Learning through a point cloud is attractive be-cause a point cloud contains geometric data and can help robots understand environments in a robust manner. However, a point cloud is sparse, unstructured and unordered, and its accurate recognition by a traditional convolutional neural network (CNN) or a recurrent neural network (RNN) is difficult. Hence, the present paper proposes a linked dynamic graph CNN (LDGCNN) to directly classify and segment a point cloud. The present work removes the transformation network, links hierarchical features from dynamic graphs, freezes the feature extractor, and retrains the classifier in order to increase the performance of LDGCNN. Also, the paper describes LDGCNN using theoretical analysis and visualization. The LDGCNN is able to classify a point cloud consisting of 1024 three dimensional points without normal vectors in the ModelNet40 dataset, achieving 92.9% accuracy, which is better than the state-of-art. The LDGCNN also achieves state-of-the-art segmentation performance in the ShapeNet dataset."}}
{"id": "B6MgReN4fmc", "cdate": 1648669686035, "mdate": 1648669686035, "content": {"title": "Gaussian-guided feature alignment for unsupervised cross-subject adaptation", "abstract": "Human activities recognition (HAR) and human intent recognition (HIR) are important for medical diagnosis and human-robot interaction. HAR and HIR usually rely on the signals of some wearable sensors, such as inertial measurement unit (IMU), but these signals may be user-dependent, which degrades the performance of the recognition algorithm on new subjects. Traditional supervised learning methods require labeling signals and training specific classifiers for each new subject, which is burdensome. To deal with this problem, this paper proposes a novel non-adversarial cross-subject adaptation method called Gaussian-guided feature alignment (GFA). The proposed GFA metric quantifies the discrepancy between the labeled features of source subjects and the unlabeled features of target subjects so that minimizing the GFA metric leads to the alignment of the source and target features. The GFA metric is estimated by calculating the divergence between the feature distribution and Gaussian distribution, as well as the mean squared error of the mean and variance between source and target features. This paper analytically proves the effect of the GFA metric and validates its performance using three public human activity datasets. Experimental results show that the proposed GFA achieves 1% higher target classification accuracy and 0.5% lower variance than state-of-the-art methods in case of cross-subject validation. These results indicate that the proposed GFA is feasible for improving the generalization of the HAR and HIR."}}
{"id": "ojuY7U4vQ3I", "cdate": 1640995200000, "mdate": 1681693340054, "content": {"title": "Ensemble diverse hypotheses and knowledge distillation for unsupervised cross-subject adaptation", "abstract": "Recognizing human locomotion intent and activities is important for controlling the wearable robots while walking in complex environments. However, human-robot interface signals are usually user-dependent, which causes that the classifier trained on source subjects performs poorly on new subjects. To address this issue, this paper designs the ensemble diverse hypotheses and knowledge distillation (EDHKD) method to realize unsupervised cross-subject adaptation. EDH mitigates the divergence between labeled data of source subjects and unlabeled data of target subjects to accurately classify the locomotion modes of target subjects without labeling data. Compared to previous domain adaptation methods based on the single learner, which may only learn a subset of features from input signals, EDH can learn diverse features by incorporating multiple diverse feature generators and thus increases the accuracy and decreases the variance of classifying target data, but it sacrifices the efficiency. To solve this problem, EDHKD (student) distills the knowledge from the EDH (teacher) to a single network to remain efficient and accurate. The performance of the EDHKD is theoretically proved and experimentally validated on a 2D moon dataset and two public human locomotion datasets. Experimental results show that the EDHKD outperforms all other methods. The EDHKD can classify target data with 96.9%, 94.4%, and 97.4% average accuracy on the above three datasets with a short computing time (1 ms). Compared to a benchmark (BM) method, the EDHKD increases 1.3% and 7.1% average accuracy for classifying the locomotion modes of target subjects. The EDHKD also stabilizes the learning curves. Therefore, the EDHKD is significant for increasing the generalization ability and efficiency of the human intent prediction and human activity recognition system, which will improve human-robot interactions."}}
{"id": "QOLbtxUtgA", "cdate": 1640995200000, "mdate": 1681693340064, "content": {"title": "Fuzzy Logic-Driven Variable Time-Scale Prediction-Based Reinforcement Learning for Robotic Multiple Peg-in-Hole Assembly", "abstract": "Reinforcement learning (RL) has been increasingly used for single peg-in-hole assembly, where assembly skill is learned through interaction with the assembly environment in a manner similar to skills employed by human beings. However, the existing RL algorithms are difficult to apply to the multiple peg-in-hole assembly because the much more complicated assembly environment requires sufficient exploration, resulting in a long training time and less data efficiency. To this end, this article focuses on how to predict the assembly environment and how to use the predicted environment in assembly action control to improve the data efficiency of the RL algorithm. Specifically, first, the assembly environment is exactly predicted by a variable time-scale prediction (VTSP) defined as general value functions (GVFs), reducing the unnecessary exploration. Second, we propose a fuzzy logic-driven variable time-scale prediction-based reinforcement learning (FLDVTSP-RL) for assembly action control to improve the efficiency of the RL algorithm, in which the predicted environment is mapped to the impedance parameter in the proposed impedance action space by a fuzzy logic system (FLS) as the action baseline. To demonstrate the effectiveness of VTSP and the data efficiency of the FLDVTSP-RL methods, a dual peg-in-hole assembly experiment is set up; the results show that FLDVTSP-deep Q-learning (DQN) decreases the assembly time about 44% compared with DQN and FLDVTSP-deep deterministic policy gradient (DDPG) decreases the assembly time about 24% compared with DDPG. <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Note to Practitioners</i> —The complicated assembly environment of the multiple peg-in-hole assembly results in a contact state that cannot be recognized exactly from the force sensor. Therefore, contact-model-based methods that require tuning of the control parameters based on the contact state recognition cannot be applied directly in this complicated environment. Recently, reinforcement learning (RL) methods without contact state recognition have recently attracted scientific interest. However, the existing RL methods still rely on numerous explorations and a long training time, which cannot be directly applied to real-world tasks. This article takes inspiration from the manner in which human beings can learn assembly skills with a few trials, which relies on the variable time-scale predictions (VTSPs) of the environment and the optimized assembly action control strategy. Our proposed fuzzy logic-driven variable time-scale prediction-based reinforcement learning (FLDVTSP-RL) can be implemented in two steps. First, the assembly environment is predicted by the VTSP defined as general value functions (GVFs). Second, assembly action control is realized in an impedance action space with a baseline defined by the impedance parameter mapped from the predicted environment by the fuzzy logic system (FLS). Finally, a dual peg-in-hole assembly experiment is conducted; compared with deep Q-learning (DQN), FLDVTSP-DQN can decrease the assembly time about 44%; compared with deep deterministic policy gradient (DDPG), FLDVTSP-DDPG can decrease the assembly time about 24%."}}
{"id": "NVDY5sf87Ev", "cdate": 1640995200000, "mdate": 1681693340060, "content": {"title": "Preserving Domain Private Representation via Mutual Information Maximization", "abstract": "Recent advances in unsupervised domain adaptation have shown that mitigating the domain divergence by extracting the domain-invariant representation could significantly improve the generalization of a model to an unlabeled data domain. Nevertheless, the existing methods fail to effectively preserve the representation that is private to the label-missing domain, which could adversely affect the generalization. In this paper, we propose an approach to preserve such representation so that the latent distribution of the unlabeled domain could represent both the domain-invariant features and the individual characteristics that are private to the unlabeled domain. In particular, we demonstrate that maximizing the mutual information between the unlabeled domain and its latent space while mitigating the domain divergence can achieve such preservation. We also theoretically and empirically validate that preserving the representation that is private to the unlabeled domain is important and of necessity for the cross-domain generalization. Our approach outperforms state-of-the-art methods on several public datasets."}}
{"id": "CxKt5O1TqY", "cdate": 1640995200000, "mdate": 1681693340054, "content": {"title": "Gaussian-guided feature alignment for unsupervised cross-subject adaptation", "abstract": ""}}
{"id": "0vjbzGys04W", "cdate": 1640995200000, "mdate": 1681693340057, "content": {"title": "A Model for Estimating the Leg Mechanical Work Required to Walk With an Elastically Suspended Backpack", "abstract": "The mechanical work performed by the individual legs affects the metabolic cost of locomotion. The effects of an elastically suspended backpack (ESB) on the mechanical work performed by the individual legs have not yet been quantified. This article explores the impact of variables, such as the stiffness and damper of an ESB, walking speed, and load mass, on the leg mechanical work (LMW). A model integrating an improved bipedal walking submodel and a spring−mass−damper submodel is proposed to estimate the mechanical work performed by the individual legs (LMW model). Experimental data were collected to estimate the accuracy of the proposed model. Seven subjects walked with a loaded ESB prototype at speeds ranging from 3.6 to 6.0 km/h with the suspension engaged and with the suspension locked out. The measured mechanical work performed by the individual legs was compared to the LMW model estimates. The proposed model estimates corresponded well with the empirical results (average <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">R</i> <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</sup> = 0.909; estimated average error 3.6%). The LMW model was then used to simulate the effects of variables. The ESB produces positive or negative effects under different variables. With increasing ESB stiffness, the ESB first produces positive effects, then negative effects, and finally approaches the rigid backpack effect. The ESB damper also affects the magnitude of the effect. The smaller the damping, the larger the effect. These results could assist engineers trying to design ESB to minimize the mechanical work performed by the legs which may also minimize the metabolic energy cost."}}
