{"id": "vUQLfjYuPob", "cdate": 1640995200000, "mdate": 1682690625163, "content": {"title": "Super Resolution for Turbulent Flows in 2D: Stabilized Physics Informed Neural Networks", "abstract": "We propose a new design of a neural network for solving a zero shot super resolution problem for turbulent flows. We embed Luenberger-type observer into the network's architecture to inform the network of the physics of the process, and to provide error correction and stabilization mechanisms. In addition, to compensate for decrease of observer's performance due to the presence of unknown destabilizing forcing, the network is designed to estimate the contribution of the unknown forcing implicitly from the data over the course of training. By running a set of numerical experiments, we demonstrate that the proposed network does recover unknown forcing from data and is capable of predicting turbulent flows in high resolution from low resolution noisy observations."}}
{"id": "sg0XDccWCY", "cdate": 1640995200000, "mdate": 1682690625216, "content": {"title": "Optimal Sensor Placement for Atmospheric Inverse Modelling", "abstract": "For large scale monitoring of the environment, the number of possible pollution sources can be larger than the number of sensors. For optimal sensor placement under various wind fields in source inversion problems, this paper proposes a framework under non-Gaussian priors for the detection and inversion estimate of emission rates. The optimization framework with non-Gaussian prior utilizes a bi-level optimization expression with inner quadratic programming. The proposed truncated Gaussian prior is to incorporate non-negativity of emission rates, but it poses a challenge in optimization. We preliminarily investigate the bi-level optimization with a Gaussian plume model example. The Karush–Kuhn–Tucker conditions of the inner quadratic programming are considered for solving the bi-level optimization. The efficiency of the proposed optimization framework is demonstrated by numerical results to optimally place sensors and quantify emission rates."}}
{"id": "Pf5KQbnHhGD", "cdate": 1640995200000, "mdate": 1682690625169, "content": {"title": "Super Resolution for Turbulent Flows in 2D: Stabilized Physics Informed Neural Networks", "abstract": "We propose a new design of a neural network for solving a zero shot super resolution problem for turbulent flows. We embed Luenberger-type observer into the network’s architecture to inform the network of the physics of the process, and to provide error correction and stabilization mechanisms. In addition, to compensate for decrease of observer’s performance due to the presence of unknown destabilizing forcing, the network is designed to estimate the contribution of the unknown forcing implicitly from the data over the course of training. By running a set of numerical experiments, we demonstrate that the proposed network does recover unknown forcing from data and is capable of predicting turbulent flows in high resolution from low resolution noisy observations."}}
{"id": "A84qthMSzWl", "cdate": 1640995200000, "mdate": 1675224333611, "content": {"title": "Multi-task Learning for Source Attribution and Field Reconstruction for Methane Monitoring", "abstract": "Inferring the source information of greenhouse gases, such as methane, from spatially sparse sensor observations is an essential element in mitigating climate change. While it is well understood that the complex behavior of the atmospheric dispersion of such pollutants is governed by the Advection-Diffusion equation, it is difficult to directly apply the governing equations to identify the source location and magnitude (inverse problem) because of the spatially sparse and noisy observations, i.e., the pollution concentration is known only at the sensor locations and sensors sensitivity is limited. Here, we develop a multi-task learning framework that can provide high-fidelity reconstruction of the concentration field and identify emission characteristics of the pollution sources such as their location, emission strength, etc. from sparse sensor observations. We demonstrate that our proposed framework is able to achieve accurate reconstruction of the methane concentrations from sparse sensor measurements as well as precisely pin-point the location and emission strength of these pollution sources."}}
{"id": "70nqWaG7AW", "cdate": 1640995200000, "mdate": 1682347042535, "content": {"title": "Multi-task Learning for Source Attribution and Field Reconstruction for Methane Monitoring", "abstract": "Inferring the source information of greenhouse gases, such as methane, from spatially sparse sensor observations is an essential element in mitigating climate change. While it is well understood that the complex behavior of the atmospheric dispersion of such pollutants is governed by the Advection-Diffusion equation, it is difficult to directly apply the governing equations to identify the source location and magnitude (inverse problem) because of the spatially sparse and noisy observations, i.e., the pollution concentration is known only at the sensor locations and sensors sensitivity is limited. Here, we develop a multi-task learning framework that can provide high-fidelity reconstruction of the concentration field and identify emission characteristics of the pollution sources such as their location, emission strength, etc. from sparse sensor observations. We demonstrate that our proposed framework is able to achieve accurate reconstruction of the methane concentrations from sparse sensor measurements as well as precisely pin-point the location and emission strength of these pollution sources."}}
{"id": "sQaAfZxifx", "cdate": 1609459200000, "mdate": 1682690625177, "content": {"title": "Generative Adversarial Network for Probabilistic Forecast of Random Dynamical System", "abstract": "We present a deep learning model for data-driven simulations of random dynamical systems without a distributional assumption. The deep learning model consists of a recurrent neural network, which aims to learn the time marching structure, and a generative adversarial network (GAN) to learn and sample from the probability distribution of the random dynamical system. Although GANs provide a powerful tool to model a complex probability distribution, the training often fails without a proper regularization. Here, we propose a regularization strategy for a GAN based on consistency conditions for the sequential inference problems. First, the maximum mean discrepancy (MMD) is used to enforce the consistency between conditional and marginal distributions of a stochastic process. Then, the marginal distributions of the multiple-step predictions are regularized by using MMD or from multiple discriminators. The behavior of the proposed model is studied by using three stochastic processes with complex noise structures."}}
{"id": "5bTsfMPDKJ", "cdate": 1609459200000, "mdate": 1682690625171, "content": {"title": "S3RP: Self-Supervised Super-Resolution and Prediction for Advection-Diffusion Process", "abstract": "We present a super-resolution model for an advection-diffusion process with limited information. While most of the super-resolution models assume high-resolution (HR) ground-truth data in the training, in many cases such HR dataset is not readily accessible. Here, we show that a Recurrent Convolutional Network trained with physics-based regularizations is able to reconstruct the HR information without having the HR ground-truth data. Moreover, considering the ill-posed nature of a super-resolution problem, we employ the Recurrent Wasserstein Autoencoder to model the uncertainty."}}
{"id": "-tMH3UmbRDV", "cdate": 1609459200000, "mdate": 1682690625208, "content": {"title": "Variational Inference Formulation for a Model-Free Simulation of a Dynamical System with Unknown Parameters by a Recurrent Neural Network", "abstract": "We propose a recurrent neural network for a “model-free” simulation of a dynamical system with unknown parameters without prior knowledge. The deep learning model aims to jointly learn the nonlinear time marching operator and the effects of the unknown parameters from a time series data. We assume that the time series data set consists of an ensemble of trajectories for a range of the parameters. The learning task is formulated as a statistical inference problem by considering the unknown parameters as random variables. A latent variable is introduced to model the effects of the unknown parameters, and a variational inference method is employed to simultaneously train probabilistic models for the time marching operator and an approximate posterior distribution for the latent variable. Unlike the classical variational inference, where a factorized distribution is used to approximate the posterior, we employ a feedforward neural network supplemented by an encoder recurrent neural network to develop a more flexible probabilistic model. The approximate posterior distribution makes an inference on a trajectory to identify the effects of the unknown parameters. The time marching operator is approximated by a recurrent neural network, which takes a latent state sampled from the approximate posterior distribution as one of the input variables, to compute the time evolution of the probability distribution conditioned on the latent variable. In the numerical experiments, it is shown that the proposed variational inference model makes a more accurate simulation compared to the standard recurrent neural networks. It is found that the proposed deep learning model is capable of correctly identifying the dimensions of the random parameters and learning a representation of complex time series data."}}
{"id": "-STptMcsAr", "cdate": 1577836800000, "mdate": 1682690625212, "content": {"title": "Variational inference formulation for a model-free simulation of a dynamical system with unknown parameters by a recurrent neural network", "abstract": "We propose a recurrent neural network for a \"model-free\" simulation of a dynamical system with unknown parameters without prior knowledge. The deep learning model aims to jointly learn the nonlinear time marching operator and the effects of the unknown parameters from a time series dataset. We assume that the time series data set consists of an ensemble of trajectories for a range of the parameters. The learning task is formulated as a statistical inference problem by considering the unknown parameters as random variables. A latent variable is introduced to model the effects of the unknown parameters, and a variational inference method is employed to simultaneously train probabilistic models for the time marching operator and an approximate posterior distribution for the latent variable. Unlike the classical variational inference, where a factorized distribution is used to approximate the posterior, we employ a feedforward neural network supplemented by an encoder recurrent neural network to develop a more flexible probabilistic model. The approximate posterior distribution makes an inference on a trajectory to identify the effects of the unknown parameters. The time marching operator is approximated by a recurrent neural network, which takes a latent state sampled from the approximate posterior distribution as one of the input variables, to compute the time evolution of the probability distribution conditioned on the latent variable. In the numerical experiments, it is shown that the proposed variational inference model makes a more accurate simulation compared to the standard recurrent neural networks. It is found that the proposed deep learning model is capable of correctly identifying the dimensions of the random parameters and learning a representation of complex time series data."}}
{"id": "qW3y1i-I2iQ", "cdate": 1546300800000, "mdate": 1682690625206, "content": {"title": "Data-driven Reconstruction of Nonlinear Dynamics from Sparse Observation", "abstract": "We present a data-driven model to reconstruct nonlinear dynamics from a very sparse times series data, which relies on the strength of the echo state network (ESN) in learning nonlinear representation of data. With an assumption of the universal function approximation capability of ESN, it is shown that the reconstruction problem can be formulated as a fixed-point problem, in which the trajectory of the dynamical system is a fixed point of the ESN. An under-relaxed fixed-point iteration is proposed to reconstruct the nonlinear dynamics from a sparse observation. The proposed fixed-point ESN is tested against both univariate and multivariate chaotic dynamical systems by randomly removing up to 95% of the data. It is shown that the fixed-point ESN is able to reconstruct the complex dynamics from only 5 ~ 10% of the data. For a relatively simple non-chaotic dynamical system, the numerical experiments on a forced van der Pol oscillator show that it is possible to reconstruct the nonlinear dynamics from only 1~2% of the data."}}
