{"id": "VZ5EaTI6dqa", "cdate": 1663850500386, "mdate": null, "content": {"title": "Scale-invariant Bayesian Neural Networks with Connectivity Tangent Kernel", "abstract": "Studying the loss landscapes of neural networks is critical to identifying generalizations and avoiding overconfident predictions. Flatness, which measures the perturbation resilience of pre-trained parameters for loss values, is widely acknowledged as an essential predictor of generalization. While the concept of flatness has been formalized as a PAC-Bayes bound, it has been observed that the generalization bounds can vary arbitrarily depending on the scale of the model parameters. Despite previous attempts to address this issue, generalization bounds remain vulnerable to function-preserving scaling transformations or are limited to impractical network structures. In this paper, we introduce new PAC-Bayes prior and posterior distributions invariant to scaling transformations, achieved through the \\textit{decomposition of perturbations into scale and connectivity components}. In this way, this approach expands the range of networks to which the resulting generalization bound can be applied, including those with practical transformations such as weight decay with batch normalization. Moreover, we demonstrate that scale-dependency issues of flatness can adversely affect the uncertainty calibration of Laplace approximation, and we propose a solution using our invariant posterior. Our proposed invariant posterior allows for effective measurement of flatness and calibration with low complexity while remaining invariant to practical parameter transformations, also applying it as a reliable predictor of neural network generalization."}}
{"id": "Xa90WV1Nn8s", "cdate": 1577836800000, "mdate": null, "content": {"title": "Tree search network for sparse estimation.", "abstract": "We consider the classical sparse estimation problem of recovering a synthetic sparse signal x 0 given measurement vector y "}}
{"id": "mxpU_4o5Bey", "cdate": 1546300800000, "mdate": null, "content": {"title": "Fourier Phase Retrieval With Extended Support Estimation via Deep Neural Network.", "abstract": "We consider the problem of sparse phase retrieval from Fourier transform magnitudes to recover the <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> -sparse signal vector and its support <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\mathcal {T}$</tex-math></inline-formula> . We exploit extended support estimate <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\mathcal {E}$</tex-math></inline-formula> with size larger than <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> satisfying <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\mathcal {E} \\supseteq \\mathcal {T}$</tex-math></inline-formula> and obtained by a trained deep neural network (DNN). To make the DNN learnable, it provides <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\mathcal {E}$</tex-math></inline-formula> as the union of equivalent solutions of <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\mathcal {T}$</tex-math></inline-formula> by utilizing modulo Fourier invariances. Set <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\mathcal {E}$</tex-math></inline-formula> can be estimated with short running time via the DNN, and support <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\mathcal {T}$</tex-math></inline-formula> can be determined from the DNN output rather than from the full index set by applying hard thresholding to <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\mathcal {E}$</tex-math></inline-formula> . Thus, the DNN-based extended support estimation improves the reconstruction performance of the signal with a low complexity burden dependent on <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> . Numerical results verify that the proposed scheme has a superior performance with lower complexity compared to local search-based greedy sparse phase retrieval and a state-of-the-art variant of the Fienup method."}}
{"id": "ff6ptiMNr4H", "cdate": 1546300800000, "mdate": null, "content": {"title": "Tree Search Network for Sparse Regression.", "abstract": "We consider the classical sparse regression problem of recovering a sparse signal $x_0$ given a measurement vector $y = \\Phi x_0+w$. We propose a tree search algorithm driven by the deep neural network for sparse regression (TSN). TSN improves the signal reconstruction performance of the deep neural network designed for sparse regression by performing a tree search with pruning. It is observed in both noiseless and noisy cases, TSN recovers synthetic and real signals with lower complexity than a conventional tree search and is superior to existing algorithms by a large margin for various types of the sensing matrix $\\Phi$, widely used in sparse regression."}}
{"id": "_o2ht6TZ7p", "cdate": 1546300800000, "mdate": null, "content": {"title": "Greedy subspace pursuit for joint sparse recovery.", "abstract": "In the joint sparse recovery, where the objective is to recover a signal matrix X 0 of size n × l or a set Ω of its nonzero row indices from incomplete measurements, subspace-based greedy algorithms improving MUSIC such as subspace-augmented MUSIC and sequential compressive MUSIC have been proposed to improve the reconstruction performance of X 0 and Ω with a computational efficiency even when rank ( X 0 ) ≤ k ≔ | Ω | . However, the main limitation of the MUSIC-like methods is that they most likely fail to recover the signal when a partial support estimate of k − rank ( X 0 ) indices for their input is not fully correct. We proposed a computationally efficient algorithm called two-stage iterative method to detect the remained support (T-IDRS), its special version termed by two-stage orthogonal subspace matching pursuit (TSMP), and its variant called TSMP with sparse Bayesian learning (TSML) by exploiting more than the sparsity k to estimate the signal matrix. They improve on the MUSIC-like methods such that these are guaranteed to recover the signal and its support while the existing MUSIC-like methods will fail in the practically significant case of MMV when rank ( X 0 ) ∕ k is sufficiently small. Numerical simulations demonstrate that the proposed schemes have low complexities and most likely outperform other related methods. A condition of the minimum m required for TSMP to recover the signal matrix is derived in the noiseless case to be applicable to a wide class of the sensing matrix."}}
{"id": "TIjKQkIOOG", "cdate": 1546300800000, "mdate": null, "content": {"title": "Fourier Phase Retrieval with Extended Support Estimation via Deep Neural Network.", "abstract": "We consider the problem of sparse phase retrieval from Fourier transform magnitudes to recover the $k$-sparse signal vector and its support $\\mathcal{T}$. We exploit extended support estimate $\\mathcal{E}$ with size larger than $k$ satisfying $\\mathcal{E} \\supseteq \\mathcal{T}$ and obtained by a trained deep neural network (DNN). To make the DNN learnable, it provides $\\mathcal{E}$ as the union of equivalent solutions of $\\mathcal{T}$ by utilizing modulo Fourier invariances. Set $\\mathcal{E}$ can be estimated with short running time via the DNN, and support $\\mathcal{T}$ can be determined from the DNN output rather than from the full index set by applying hard thresholding to $\\mathcal{E}$. Thus, the DNN-based extended support estimation improves the reconstruction performance of the signal with a low complexity burden dependent on $k$. Numerical results verify that the proposed scheme has a superior performance with lower complexity compared to local search-based greedy sparse phase retrieval and a state-of-the-art variant of the Fienup method."}}
{"id": "PBkiWS63Y28", "cdate": 1546300800000, "mdate": null, "content": {"title": "Bayesian Approach with Extended Support Estimation for Sparse Regression.", "abstract": "A greedy algorithm called Bayesian multiple matching pursuit (BMMP) is proposed to estimate a sparse signal vector and its support given $m$ linear measurements. Unlike the maximum a posteriori (MAP) support detection, which was proposed by Lee to estimate the support by selecting an index with the maximum likelihood ratio of the correlation given by a normalized version of the orthogonal matching pursuit (OMP), the proposed method uses the correlation given by the matching pursuit proposed by Davies and Eldar. BMMP exploits the diversity gain to estimate the support by considering multiple support candidates, each of which is obtained by iteratively selecting an index set with a size different for each candidate. In particular, BMMP considers an extended support estimate whose maximal size is $m$ in the process to obtain each of the support candidates. It is observed that BMMP outperforms other state-of-the-art methods and approaches the ideal limit of the signal sparsity in our simulation setting."}}
{"id": "z2LsoIjqVQ5", "cdate": 1325376000000, "mdate": null, "content": {"title": "Real-time video watermarking system on the compressed domain for high-definition video contents: Practical issues.", "abstract": "Everyday, we encounter high-quality multimedia contents from HDTV broadcasting, DVD, and high-speed Internet services. These contents are, unhappily, processed and distributed without protection. This paper proposes a practical video watermarking technique on the compressed domain that is real-time and robust against video processing attacks. In particular, we focus on video processing that is commonly used in practice such as downscaling resolution, framerate changing, and transcoding. Most previous watermarking algorithms are unable to survive when these processings are strong or composite. We extract low frequency coefficients of frames in fast by partly decoding videos and apply a quantization index modulation scheme to embed and detect the watermark. On an Intel architecture computer, we implement a prototype system and measure performance against video processing attacks frequently occur in the real world. Simulation results show that our video watermarking system satisfies real-time requirements and is robust to protect the copyright of HD video contents."}}
{"id": "kzMwZq5B1NH", "cdate": 1293840000000, "mdate": null, "content": {"title": "Region-based tampering detection and recovery using homogeneity analysis in quality-sensitive imaging.", "abstract": "This paper presents a region-based tampering detection and restoring scheme that exploits both lossless (reversible) data hiding and image homogeneity analysis for image authentication and integrity verification. The proposed scheme enables the detection of a tampered region and then recovers it by using the embedded information selected as the recovery feature. Moreover, since reversibility helps in taking the correct decision during image analysis, it is highly desired in quality-sensitive imaging such as medical imaging and satellite imaging, where even minimal distortion introduced by embedding data is unacceptable. To extract the recovery feature, we analyze the image homogeneity using quad-tree decomposition, which adaptively divides a square image into several variable-sized blocks, and choose the average value of each block as the feature. This makes the length of the feature more efficient while ensuring that the visual quality of the restored image is better than that in the case of the conventional fixed-size block-based approach. Through experiments on 8-bit, 12-bit, and 16-bit images, we demonstrate the effectiveness of tampering localization of the proposed method and show that restoration is achieved with high visual quality. Highlights ► We model region-based image tampering detection and restoring scheme. ► We utilize reversible data hiding technique and image homogeneity analysis. ► Effectiveness of tampering localization is examined for 8-,12-,16-bit images. ► Recovery performance for the tampered edge and texture areas is outstanding. Previous article in issue Next article in issue"}}
{"id": "zsO_hbfKSCl", "cdate": 1262304000000, "mdate": null, "content": {"title": "Digital Cinema Watermarking for Estimating the Position of the Pirate.", "abstract": "Many illegal copies of digital video productions for cinema release can be found on the Internet before their official release. During the illegal copying of cinema footage, composite geometric distortions commonly occur due to the angle of the camcorder relative to the screen. We propose a novel video watermarking based on spread spectrum way that satisfies the requirements for protecting digital cinema. It enables the detector to not only extract the embedded message but also estimate the position where the camcorder recording is made. It is sure that the proposed position estimating model (PEM) can judge the seat in a theater with a mean absolute error (MAE) of (33.84, 9.53, 50.38) cm. Experimental results using various types of films show that the presented method provides the mathematical model for detecting and investigating the position of the pirate."}}
