{"id": "H3dTQHKN4QC", "cdate": 1696046929202, "mdate": 1696046929202, "content": {"title": "Detecting Intents of Fake News Using Uncertainty-Aware Deep Reinforcement Learning", "abstract": "Intent mining is critical for controlling the spread of false information across online social networks (OSNs). To this end, we develop deep reinforcement learning (DRL) agents guided by a delayed reward based on intent prediction using a classifier of long short-term memory (LSTM). Additionally, we incorporate an uncertainty-aware function that leverages subjective opinions derived from Subjective Logic (SL). Through evaluation using an annotated fake news tweet dataset, our results demonstrate that our intent classification framework surpasses competing methods in terms of intent accuracy. Our intent mining solutions using DRL algorithms can support effective and efficient intervention strategies for fake news spreading on OSNs."}}
{"id": "-TbGvmYHJPZ", "cdate": 1680307200000, "mdate": 1681760977390, "content": {"title": "DeepProbCEP: A neuro-symbolic approach for complex event processing in adversarial settings", "abstract": ""}}
{"id": "WKl5OI1lvDD", "cdate": 1672531200000, "mdate": 1681760977390, "content": {"title": "Interactive Web-Based Visual Analysis on Network Traffic Data", "abstract": "Network traffic data analysis is important for securing our computing environment and data. However, analyzing network traffic data requires tremendous effort because of the complexity of continuously changing network traffic patterns. To assist the user in better understanding and analyzing the network traffic data, an interactive web-based visualization system is designed using multiple coordinated views, supporting a rich set of user interactions. For advancing the capability of analyzing network traffic data, feature extraction is considered along with uncertainty quantification to help the user make precise analyses. The system allows the user to perform a continuous visual analysis by requesting incrementally new subsets of data with updated visual representation. Case studies have been performed to determine the effectiveness of the system. The results from the case studies support that the system is well designed to understand network traffic data by identifying abnormal network traffic patterns."}}
{"id": "9-qELjFxd5", "cdate": 1672531200000, "mdate": 1681760977392, "content": {"title": "Uncertainty-Aware Reward-based Deep Reinforcement Learning for Intent Analysis of Social Media Information", "abstract": "Due to various and serious adverse impacts of spreading fake news, it is often known that only people with malicious intent would propagate fake news. However, it is not necessarily true based on social science studies. Distinguishing the types of fake news spreaders based on their intent is critical because it will effectively guide how to intervene to mitigate the spread of fake news with different approaches. To this end, we propose an intent classification framework that can best identify the correct intent of fake news. We will leverage deep reinforcement learning (DRL) that can optimize the structural representation of each tweet by removing noisy words from the input sequence when appending an actor to the long short-term memory (LSTM) intent classifier. Policy gradient DRL model (e.g., REINFORCE) can lead the actor to a higher delayed reward. We also devise a new uncertainty-aware immediate reward using a subjective opinion that can explicitly deal with multidimensional uncertainty for effective decision-making. Via 600K training episodes from a fake news tweets dataset with an annotated intent class, we evaluate the performance of uncertainty-aware reward in DRL. Evaluation results demonstrate that our proposed framework efficiently reduces the number of selected words to maintain a high 95\\% multi-class accuracy."}}
{"id": "zIdBjH-N8vv", "cdate": 1640995200000, "mdate": 1681760977432, "content": {"title": "SOLBP: Second-Order Loopy Belief Propagation for Inference in Uncertain Bayesian Networks", "abstract": "In second-order uncertain Bayesian networks, the conditional probabilities are only known within distributions, i.e., probabilities over probabilities. The delta-method has been applied to extend exact first-order inference methods to propagate both means and variances through sum-product networks derived from Bayesian networks, thereby characterizing epistemic uncertainty, or the uncertainty in the model itself. Alternatively, second-order belief propagation has been demonstrated for polytrees but not for general directed acyclic graph structures. In this work, we extend Loopy Belief Propagation to the setting of second-order Bayesian networks, giving rise to Second-Order Loopy Belief Propagation (SOLBP). For second-order Bayesian networks, SOLBP generates inferences consistent with those generated by sum-product networks, while being more computationally efficient and scalable."}}
{"id": "y9RLQv9qoF", "cdate": 1640995200000, "mdate": 1681760977434, "content": {"title": "Uncertain Bayesian Networks: Learning from Incomplete Data", "abstract": "When the historical data are limited, the conditional probabilities associated with the nodes of Bayesian networks are uncertain and can be empirically estimated. Second order estimation methods provide a framework for both estimating the probabilities and quantifying the uncertainty in these estimates. We refer to these cases as uncer tain or second-order Bayesian networks. When such data are complete, i.e., all variable values are observed for each instantiation, the conditional probabilities are known to be Dirichlet-distributed. This paper improves the current state-of-the-art approaches for handling uncertain Bayesian networks by enabling them to learn distributions for their parameters, i.e., conditional probabilities, with incomplete data. We extensively evaluate various methods to learn the posterior of the parameters through the desired and empirically derived strength of confidence bounds for various queries."}}
{"id": "uGYSYPMKHM", "cdate": 1640995200000, "mdate": 1681760977394, "content": {"title": "BigEye: Detection and Summarization of Key Global Events From Distributed Crowdsensed Data", "abstract": "Social media postings using smartphones (referred to as crowd-sensed data) can often facilitate real-time detection of key physical events in applications like disaster recovery or in smart cities. These postings also often contain visual content (e.g., images) that can be used to obtain zoomed-in views of such events. These crowd-sensed data are likely to be of large volume and distributed across a plurality of producers (e.g., cloudlets). Blindly transferring this large volume of raw data from the producers to a consumer will induce information overload and consume very high bandwidth. The problem is exacerbated in scenarios with limited bandwidth (e.g., after a disaster). In this article, we design <monospace xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">BigEye</monospace> , a novel framework that only transfers very limited data from the distributed producers to a central summarizer, and yet supports: 1) highly accurate detection and 2) concise visual summarization of key events of global interest. In realizing <monospace xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">BigEye</monospace> , we address several challenges including: 1) identifying events that have the highest global interest via the transfer of appropriate limited metadata from the producers to the summarizer; 2) reconciling metadata that could be inconsistent across the producers; and 3) the timely retrieval of visual summaries of the key events given bandwidth constraints. We show that <monospace xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">BigEye</monospace> achieves the same accuracy in detecting key events, as a system, where all data are available centrally while transferring only 1% of the raw data volume. Compared to the baseline approaches, <monospace xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">BigEye</monospace> ’s parallelized transfer of visual content reduces the average delay by 67%."}}
{"id": "rtYZ72UrpIB", "cdate": 1640995200000, "mdate": 1674127796247, "content": {"title": "A Survey on Uncertainty Reasoning and Quantification for Decision Making: Belief Theory Meets Deep Learning", "abstract": "An in-depth understanding of uncertainty is the first step to making effective decisions under uncertainty. Deep/machine learning (ML/DL) has been hugely leveraged to solve complex problems involved with processing high-dimensional data. However, reasoning and quantifying different types of uncertainties to achieve effective decision-making have been much less explored in ML/DL than in other Artificial Intelligence (AI) domains. In particular, belief/evidence theories have been studied in KRR since the 1960s to reason and measure uncertainties to enhance decision-making effectiveness. We found that only a few studies have leveraged the mature uncertainty research in belief/evidence theories in ML/DL to tackle complex problems under different types of uncertainty. In this survey paper, we discuss several popular belief theories and their core ideas dealing with uncertainty causes and types and quantifying them, along with the discussions of their applicability in ML/DL. In addition, we discuss three main approaches that leverage belief theories in Deep Neural Networks (DNNs), including Evidential DNNs, Fuzzy DNNs, and Rough DNNs, in terms of their uncertainty causes, types, and quantification methods along with their applicability in diverse problem domains. Based on our in-depth survey, we discuss insights, lessons learned, limitations of the current state-of-the-art bridging belief theories and ML/DL, and finally, future research directions."}}
{"id": "jPBYBSnUdFy", "cdate": 1640995200000, "mdate": 1681760977474, "content": {"title": "Uncertainty-Aware Quickest Change Detection: An Experimental Study", "abstract": "In this work, we study the problem of Quickest Change Detection which aims to detect when a stream of observations transitions from being drawn from a pre-change distribution to a post-change distribution as quickly as possible. Traditionally, either information is completely known about the distributions, or no information is known and their parameters are estimated using frequentist approaches, e.g., Generalized Likelihood Ratio test. Recently, the Uncertain Likelihood Ratio (ULR) test was proposed for the QCD problem which relaxes both of these assumptions to form a Bayesian test that allows for no knowledge, partial knowledge, and full knowledge of the parameters of the distributions. In this work, we extend the ULR test to improve the order of operations required to compute the test statistic using a windowing method to form the Windowed Uncertain Likelihood Ratio (W-ULR) algorithm. We then applied it to multivariate Gaussian observations and empirically evaluated the average detection delay and missed detections for various false alarm rates under various operating conditions. The results show that the W-ULR outperforms the (windowed) GLR test, which is consistent with the initial findings."}}
{"id": "hHQdff9zzZ", "cdate": 1640995200000, "mdate": 1681760977501, "content": {"title": "PPO-UE: Proximal Policy Optimization via Uncertainty-Aware Exploration", "abstract": "Proximal Policy Optimization (PPO) is a highly popular policy-based deep reinforcement learning (DRL) approach. However, we observe that the homogeneous exploration process in PPO could cause an unexpected stability issue in the training phase. To address this issue, we propose PPO-UE, a PPO variant equipped with self-adaptive uncertainty-aware explorations (UEs) based on a ratio uncertainty level. The proposed PPO-UE is designed to improve convergence speed and performance with an optimized ratio uncertainty level. Through extensive sensitivity analysis by varying the ratio uncertainty level, our proposed PPO-UE considerably outperforms the baseline PPO in Roboschool continuous control tasks."}}
