{"id": "sjl9orI6IPN", "cdate": 1483228800000, "mdate": null, "content": {"title": "A Data-Driven Decision-Support Tool for Population Health Policies.", "abstract": "Epidemiological models are key tools in assessing intervention policies for population health management. Statistical models, fitted with survey or health system data, can be combined with lab and field studies to provide reliable predictions of future population-level disease dynamics distributions and the effects of interventions. All too often, however, the end result of epidemiological modeling and cost-effectiveness studies is in the form of a report or journal paper. These are inherently limited in their coverage of locations, policy options, and derived outcome measures. Here, we describe a tool to support population health policy planning. The tool allows users to explore simulations of various policies, to view and compare interventions spanning multiple variables, time points, and locations. The design's modular architecture, and data representation separate the modeling methods, the outcome measures calculations, and the visualizations, making each component easily replaceable. These advantages make it extremely versatile and suitable for multiple uses."}}
{"id": "RWNNd-loJGh", "cdate": 1483228800000, "mdate": 1695954317948, "content": {"title": "A Data-Driven Decision-Support Tool for Population Health Policies", "abstract": "Epidemiological models are key tools in assessing intervention policies for population health management. Statistical models, fitted with survey or health system data, can be combined with lab and field studies to provide reliable predictions of future population-level disease dynamics distributions and the effects of interventions. All too often, however, the end result of epidemiological modeling and cost-effectiveness studies is in the form of a report or journal paper. These are inherently limited in their coverage of locations, policy options, and derived outcome measures. Here, we describe a tool to support population health policy planning. The tool allows users to explore simulations of various policies, to view and compare interventions spanning multiple variables, time points, and locations. The design's modular architecture, and data representation separate the modeling methods, the outcome measures calculations, and the visualizations, making each component easily replaceable. These advantages make it extremely versatile and suitable for multiple uses."}}
{"id": "L1ZnXtrzc2", "cdate": 1451606400000, "mdate": 1695954317946, "content": {"title": "Common modulation of limbic network activation underlies musical emotions as they unfold", "abstract": ""}}
{"id": "DeR1xlk6wDm", "cdate": 1451606400000, "mdate": null, "content": {"title": "Common modulation of limbic network activation underlies musical emotions as they unfold.", "abstract": "Music is a powerful means for communicating emotions among individuals. Here we reveal that this continuous stream of affective information is commonly represented in the brains of different listeners and that particular musical attributes mediate this link. We examined participants' brain responses to two naturalistic musical pieces using functional Magnetic Resonance imaging (fMRI). Following scanning, as participants listened to the musical pieces for a second time, they continuously indicated their emotional experience on scales of valence and arousal. These continuous reports were used along with a detailed annotation of the musical features, to predict a novel index of Dynamic Common Activation (DCA) derived from ten large-scale data-driven functional networks. We found an association between the unfolding music-induced emotionality and the DCA modulation within a vast network of limbic regions. The limbic-DCA modulation further corresponded with continuous changes in two temporal musical features: beat-strength and tempo. Remarkably, this “collective limbic sensitivity” to temporal features was found to mediate the link between limbic-DCA and the reported emotionality. An additional association with the emotional experience was found in a left fronto-parietal network, but only among a sub-group of participants with a high level of musical experience (> 5 years). These findings may indicate two processing-levels underlying the unfolding of common music emotionality; (1) a widely shared core-affective process that is confined to a limbic network and mediated by temporal regularities in music and (2) an experience based process that is rooted in a left fronto-parietal network that may involve functioning of the ‘mirror-neuron system’. Previous article in issue Next article in issue"}}
{"id": "v0lqKq4gkF", "cdate": 1388534400000, "mdate": 1695954317973, "content": {"title": "Estimating the Impact of Prevention Action: A simulation Model of Cervical Cancer Progression", "abstract": "Cervical cancer is one of the highest occurring cancers for women in East Africa. Many studies have shown that disease occurrences and particularly the number of deaths due to the disease can be reduced significantly by screening and vaccination. East Africa and Kenya in particular are undergoing change and taking actions to reduce disease levels. However, up until today disease level in the different districts in Kenya is not known nor what be the prevalence of disease when prevention actions take place. In this paper we propose a novel Bayesian model for estimating disease levels based on available partial reports and demographic information. The result is a simulation engine that provides estimations of the impact of various potential prevention actions."}}
{"id": "0aT-Wa-xXKO", "cdate": 1388534400000, "mdate": null, "content": {"title": "Estimating the Impact of Prevention Action: A simulation Model of Cervical Cancer Progression.", "abstract": "Cervical cancer is one of the highest occurring cancers for women in East Africa. Many studies have shown that disease occurrences and particularly the number of deaths due to the disease can be reduced significantly by screening and vaccination. East Africa and Kenya in particular are undergoing change and taking actions to reduce disease levels. However, up until today disease level in the different districts in Kenya is not known nor what be the prevalence of disease when prevention actions take place. In this paper we propose a novel Bayesian model for estimating disease levels based on available partial reports and demographic information. The result is a simulation engine that provides estimations of the impact of various potential prevention actions."}}
{"id": "z3Twouu1adg", "cdate": 1293840000000, "mdate": 1695954317945, "content": {"title": "Smarter log analysis", "abstract": "Modern computer systems generate an enormous number of logs. IBM Mining Effectively Large Output Data Yield (MELODY) is a unique and innovative solution for handling these logs and filtering out the anomalies and failures. MELODY can detect system errors early on and avoid subsequent crashes by identifying the root causes of such errors. By analyzing the logs leading up to a problem, MELODY can pinpoint when and where things went wrong and visually present them to the user, ensuring that corrections are accurately and effectively done. We present the MELODY solution and describe its architecture, algorithmic components, functions, and benefits. After being trained on a large portion of relevant data, MELODY provides alerts of abnormalities in newly arriving log files or in streams of logs. The solution is being used by IBM services groups that support IBM xSeries® servers on a regular basis. MELODY was recently tested with ten large IBM customers who use zSeries® machines and was found to be extremely useful for the information technology experts in those companies. They found that the solution's ability to reduce extensively large log data to manageable sets of highlighted messages saved them time and helped them make better use of the data."}}
{"id": "PCETIFwIm3", "cdate": 1293840000000, "mdate": null, "content": {"title": "Smarter log analysis.", "abstract": "Modern computer systems generate an enormous number of logs. IBM Mining Effectively Large Output Data Yield (MELODY) is a unique and innovative solution for handling these logs and filtering out the anomalies and failures. MELODY can detect system errors early on and avoid subsequent crashes by identifying the root causes of such errors. By analyzing the logs leading up to a problem, MELODY can pinpoint when and where things went wrong and visually present them to the user, ensuring that corrections are accurately and effectively done. We present the MELODY solution and describe its architecture, algorithmic components, functions, and benefits. After being trained on a large portion of relevant data, MELODY provides alerts of abnormalities in newly arriving log files or in streams of logs. The solution is being used by IBM services groups that support IBM xSeries® servers on a regular basis. MELODY was recently tested with ten large IBM customers who use zSeries® machines and was found to be extremely useful for the information technology experts in those companies. They found that the solution's ability to reduce extensively large log data to manageable sets of highlighted messages saved them time and helped them make better use of the data."}}
{"id": "rybIxDZOWr", "cdate": 1199145600000, "mdate": null, "content": {"title": "Kernel-ARMA for Hand Tracking and Brain-Machine interfacing During 3D Motor Control", "abstract": "Using machine learning algorithms to decode intended behavior from neural activity serves a dual purpose. First, these tools can be used to allow patients to interact with their environment through a Brain-Machine Interface (BMI). Second, analysis of the characteristics of such methods can reveal the significance of various features of neural activity, stimuli and responses to the encoding-decoding task. In this study we adapted, implemented and tested a machine learning method, called Kernel Auto-Regressive Moving Average (KARMA), for the task of inferring movements from neural activity in primary motor cortex. Our version of this algorithm is used in an on-line learning setting and is updated when feedback from the last inferred sequence become available. We first used it to track real hand movements executed by a monkey in a standard 3D motor control task. We then applied it in a closed-loop BMI setting to infer intended movement, while arms were restrained, allowing a monkey to perform the task using the BMI alone. KARMA is a recurrent method that learns a nonlinear model of output dynamics. It uses similarity functions (termed kernels) to compare between inputs. These kernels can be structured to incorporate domain knowledge into the method. We compare KARMA to various state-of-the-art methods by evaluating tracking performance and present results from the KARMA based BMI experiments."}}
{"id": "A-fBUjIS8w6", "cdate": 1199145600000, "mdate": null, "content": {"title": "Kernel-ARMA for Hand Tracking and Brain-Machine interfacing During 3D Motor Control.", "abstract": "Using machine learning algorithms to decode intended behavior from neural activity serves a dual purpose. First, these tools can be used to allow patients to interact with their environment through a Brain-Machine Interface (BMI). Second, analysis of the characteristics of such methods can reveal the significance of various features of neural activity, stimuli and responses to the encoding-decoding task. In this study we adapted, implemented and tested a machine learning method, called Kernel Auto-Regressive Moving Average (KARMA), for the task of inferring movements from neural activity in primary motor cortex. Our version of this algorithm is used in an on-line learning setting and is updated when feedback from the last inferred sequence become available. We first used it to track real hand movements executed by a monkey in a standard 3D motor control task. We then applied it in a closed-loop BMI setting to infer intended movement, while arms were restrained, allowing a monkey to perform the task using the BMI alone. KARMA is a recurrent method that learns a nonlinear model of output dynamics. It uses similarity functions (termed kernels) to compare between inputs. These kernels can be structured to incorporate domain knowledge into the method. We compare KARMA to various state-of-the-art methods by evaluating tracking performance and present results from the KARMA based BMI experiments."}}
