{"id": "2aP_ZACcTA", "cdate": 1696047035078, "mdate": 1696047035078, "content": {"title": "Authentic Dialogue Generation to Improve Youth's Awareness of Cybergrooming for Online Safety", "abstract": "This paper deals with a cybergrooming and sexual misconduct topic in artificial intelligence-based educational programs. Although cybergrooming has been recognized as a cybercrime, there is a lack of programs to protect youth from cybergrooming. We present a generative chatbot framework, SERI (Stop cybERgroomIng), that can generate fluent authentic conversations in the context of cybergrooming between a perpetrator chatbot and a potential victim chatbot. Furthermore, we propose deep-reinforcement-learning-based dialogue generation with a stage-related reward to lead the conversation to the expected stage. We also minimize potential ethical issues introduced by the perverted languages when deploying the chatbots for cybersecurity education programs. We evaluated the conversations of SERI with open-source referenced, unreferenced metrics and human evaluation. We developed SERI as a platform for deploying perpetrator chatbot to interact with youth users to observe their responses and collect reactions when they are asked for private or sensitive information by the perpetrator."}}
{"id": "JPe9zPbrI3e", "cdate": 1696046685236, "mdate": 1696046685236, "content": {"title": "SERI: Generative Chatbot Framework for Cybergrooming Prevention", "abstract": "Cybergrooming refers to a crime to lure potential victims, particularly youth, by establishing personal trust relationships with them for sexual abuse or exploitation. Although cybergrooming is recognized as one of the serious social issues, there has been a lack of proactive programs to protect the youth. In this paper, we present a generative chatbot framework, called SERI Stop cybERgroomIng), that can generate authentic conversations between a perpetrator chatbot and a potential victim chatbot. The SERI is designed to provide a safe and authentic environment for enhancing youth's sensitivity and awareness of subtle cues of cybergrooming without exposing unnecessary ethical issues caused by potentially offensive or upsetting languages. The SERI is developed as a pre-stage before the perpetrator chatbot is deployed to chatting with an actual human youth user to observe how the youth user can respond to a stranger or acquaintance asking for sensitive or private information. Hence, to evaluate the quality of the conversations generated by the SERI, we use open-source, referenced, and unreferenced metrics to assess the generated conversations automatically. In addition, we evaluated the quality of the conversation based on the human evaluation method. Our results show that the SERI can generate authentic conversations between the two chatbots compared to the original conversations from the used dataset in perplexity and MaUde scores."}}
{"id": "IAIrNRktVWR", "cdate": 1663850205674, "mdate": null, "content": {"title": "Multimedia Generative Script Learning for Task Planning", "abstract": "Goal-oriented generative script learning aims to generate subsequent steps to reach a particular goal, which is an essential task to assist robots or humans in performing stereotypical activities in daily life. However, an important aspect of this process is the ability to capture historical states visually, which provides detailed information that is not covered by text and will guide subsequent steps. Therefore, we propose a new task, Multimedia Generative Script Learning, to generate subsequent steps by tracking historical states in both text and vision modalities, as well as presenting the first benchmark containing 5,652 tasks and 79,089 steps with descriptive images. This task is challenging in three aspects: the multimedia challenge of capturing the visual states in images, the induction challenge of performing unseen tasks, and the diversity challenge of covering different information in individual steps. We propose to encode visual state changes through a selective multimedia encoder to address the multimedia challenge, transfer knowledge from previously observed tasks using a retrieval-augmented decoder to overcome the induction challenge, and further present distinct information at each step by optimizing a diversity-oriented contrastive learning objective.  We define metrics to evaluate both generation quality and inductive quality. Experiment results demonstrate that our approach significantly outperforms strong baselines."}}
{"id": "raDf3qKzYb5", "cdate": 1647024531855, "mdate": null, "content": {"title": "Efficient Federated Learning on Knowledge Graphs via Privacy-preserving Relation Embedding Aggregation", "abstract": "Federated Learning (FL) on knowledge graphs (KGs) has yet to be as well studied as other domains, such as computer vision and natural language processing. A recent study FedE first proposes an FL framework  that shares entity embeddings of KGs across all clients. However, compared with model sharing in vanilla FL, entity embedding sharing from FedE would incur severe privacy leakage. Specifically, the known entity embedding can be used to infer whether a specific relation between two entities exists in a private client. In this paper, we first develop a novel attack that aims to recover the original data based on embedding information, which is further used to evaluate the vulnerabilities of FedE. Furthermore, we propose a Federated learning paradigm with privacy-preserving Relation embedding aggregation (FedR) to tackle the privacy issue in FedE. Compared to entity embedding sharing, relation embedding sharing policy can significantly reduce the communication cost due to its smaller size of queries. We conduct extensive experiments to evaluate FedR with five different embedding learning models and three benchmark KG datasets. Compared to FedE, FedR achieves similar utility and significant (nearly 2 X) improvements in both privacy and efficiency on link prediction task. "}}
{"id": "Sk4mXXW_br", "cdate": 1546300800000, "mdate": null, "content": {"title": "Cross-lingual Multi-Level Adversarial Transfer to Enhance Low-Resource Name Tagging", "abstract": "Lifu Huang, Heng Ji, Jonathan May. Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers). 2019."}}
{"id": "SJVuZmWdZS", "cdate": 1546300800000, "mdate": null, "content": {"title": "Biomedical Event Extraction based on Knowledge-driven Tree-LSTM", "abstract": "Diya Li, Lifu Huang, Heng Ji, Jiawei Han. Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers). 2019."}}
{"id": "ryZ8pXbd-r", "cdate": 1514764800000, "mdate": null, "content": {"title": "Tracking State Changes in Procedural Text: a Challenge Dataset and Models for Process Paragraph Comprehension", "abstract": "We present a new dataset and models for comprehending paragraphs about processes (e.g., photosynthesis), an important genre of text describing a dynamic world. The new dataset, ProPara, is the first to contain natural (rather than machine-generated) text about a changing world along with a full annotation of entity states (location and existence) during those changes (81k datapoints). The end-task, tracking the location and existence of entities through the text, is challenging because the causal effects of actions are often implicit and need to be inferred. We find that previous models that have worked well on synthetic data achieve only mediocre performance on ProPara, and introduce two new neural models that exploit alternative mechanisms for state prediction, in particular using LSTM input encoding and span prediction. The new models improve accuracy by up to 19%. The dataset and models are available to the community at this http URL"}}
{"id": "ryElAseuZr", "cdate": 1514764800000, "mdate": null, "content": {"title": "Paper Abstract Writing through Editing Mechanism", "abstract": ""}}
{"id": "r1NcaWGubS", "cdate": 1514764800000, "mdate": null, "content": {"title": "Entity-aware Image Caption Generation", "abstract": "Image captioning approaches currently generate descriptions which lack specific information, such as named entities that are involved in the images. In this paper we propose a new task which aims to generate informative image captions, given images and hashtags as input. We propose a simple, but effective approach in which we, first, train a CNN-LSTM model to generate a template caption based on the input image. Then we use a knowledge graph based collective inference algorithm to fill in the template with specific named entities retrieved via the hashtags. Experiments on a new benchmark dataset collected from Flickr show that our model generates news-style image descriptions with much richer information. The METEOR score of our model almost triples the score of the baseline image captioning model on our benchmark dataset, from 4.8 to 13.60."}}
{"id": "SJb7nWzO-S", "cdate": 1514764800000, "mdate": null, "content": {"title": "Genre Separation Network with Adversarial Training for Cross-genre Relation Extraction", "abstract": ""}}
