{"id": "cukyY__8ZV", "cdate": 1640995200000, "mdate": 1680100733367, "content": {"title": "Robust Nonparametric Distribution Forecast with Backtest-Based Bootstrap and Adaptive Residual Selection", "abstract": ""}}
{"id": "bV5-mblQEx", "cdate": 1640995200000, "mdate": 1680100733369, "content": {"title": "Multi-Frequency Joint Community Detection and Phase Synchronization", "abstract": ""}}
{"id": "EP2sFA0g_4Y", "cdate": 1640995200000, "mdate": 1680100733370, "content": {"title": "Robust Nonparametric Distribution Forecast with Backtest-based Bootstrap and Adaptive Residual Selection", "abstract": ""}}
{"id": "keZDNt24Dc", "cdate": 1609459200000, "mdate": 1680100733366, "content": {"title": "Enhancing Parameter-Free Frank Wolfe with an Extra Subproblem", "abstract": ""}}
{"id": "jb6FM4JjIaB", "cdate": 1609459200000, "mdate": 1629741687338, "content": {"title": "Near-Optimal Algorithms for Piecewise-Stationary Cascading Bandits", "abstract": "Cascading bandit (CB) is a popular model for web search and online advertising. However, the stationary CB model may be too simple to cope with real-world problems, where user preferences may change over time. Considering piecewise-stationary environments, two efficient algorithms, GLRT-CascadeUCB and GLRT-CascadeKL-UCB, are developed. Comparing with existing works, the proposed algorithms: i) are free of change-point-dependent information for choosing parameters; ii) have fewer tuning parameters; iii) improve regret upper bounds. We also show that the proposed algorithms are optimal up to logarithm terms by deriving a minimax lower bound $\\Omega (\\sqrt {NLT} )$ for piecewise-stationary CB. The efficiency of the proposed algorithms is validated through numerical tests on a real-world benchmark dataset."}}
{"id": "GYmEI21dME3", "cdate": 1609459200000, "mdate": 1680100733370, "content": {"title": "Adversarial Linear Contextual Bandits with Graph-Structured Side Observations", "abstract": ""}}
{"id": "z0MGgCWYHO8", "cdate": 1577836800000, "mdate": null, "content": {"title": "Enhancing Parameter-Free Frank Wolfe with an Extra Subproblem", "abstract": "Aiming at convex optimization under structural constraints, this work introduces and analyzes a variant of the Frank Wolfe (FW) algorithm termed ExtraFW. The distinct feature of ExtraFW is the pair of gradients leveraged per iteration, thanks to which the decision variable is updated in a prediction-correction (PC) format. Relying on no problem dependent parameters in the step sizes, the convergence rate of ExtraFW for general convex problems is shown to be ${\\cal O}(\\frac{1}{k})$, which is optimal in the sense of matching the lower bound on the number of solved FW subproblems. However, the merit of ExtraFW is its faster rate ${\\cal O}\\big(\\frac{1}{k^2} \\big)$ on a class of machine learning problems. Compared with other parameter-free FW variants that have faster rates on the same problems, ExtraFW has improved rates and fine-grained analysis thanks to its PC update. Numerical tests on binary classification with different sparsity-promoting constraints demonstrate that the empirical performance of ExtraFW is significantly better than FW, and even faster than Nesterov's accelerated gradient on certain datasets. For matrix completion, ExtraFW enjoys smaller optimality gap, and lower rank than FW."}}
{"id": "WUrwZilCH2q", "cdate": 1577836800000, "mdate": 1629741687375, "content": {"title": "A Near-Optimal Change-Detection Based Algorithm for Piecewise-Stationary Combinatorial Semi-Bandits", "abstract": "We investigate the piecewise-stationary combinatorial semi-bandit problem. Compared to the original combinatorial semi-bandit problem, our setting assumes the reward distributions of base arms may change in a piecewise-stationary manner at unknown time steps. We propose an algorithm, GLR-CUCB, which incorporates an efficient combinatorial semi-bandit algorithm, CUCB, with an almost parameter-free change-point detector, the Generalized Likelihood Ratio Test (GLRT). Our analysis shows that the regret of GLR-CUCB is upper bounded by O(√NKT log T), where N is the number of piecewise-stationary segments, K is the number of base arms, and T is the number of time steps. As a complement, we also derive a nearly matching regret lower bound on the order of Ω(√NKT), for both piecewise-stationary multi-armed bandits and combinatorial semi-bandits, using information-theoretic techniques and judiciously constructed piecewise-stationary bandit instances. Our lower bound is tighter than the best available regret lower bound, which is Ω(√T). Numerical experiments on both synthetic and real-world datasets demonstrate the superiority of GLR-CUCB compared to other state-of-the-art algorithms."}}
{"id": "KWp3Tbrmz_r", "cdate": 1577836800000, "mdate": null, "content": {"title": "Adversarial Linear Contextual Bandits with Graph-Structured Side Observations", "abstract": "This paper studies the adversarial graphical contextual bandits, a variant of adversarial multi-armed bandits that leverage two categories of the most common side information: \\emph{contexts} and \\emph{side observations}. In this setting, a learning agent repeatedly chooses from a set of $K$ actions after being presented with a $d$-dimensional context vector. The agent not only incurs and observes the loss of the chosen action, but also observes the losses of its neighboring actions in the observation structures, which are encoded as a series of feedback graphs. This setting models a variety of applications in social networks, where both contexts and graph-structured side observations are available. Two efficient algorithms are developed based on \\texttt{EXP3}. Under mild conditions, our analysis shows that for undirected feedback graphs the first algorithm, \\texttt{EXP3-LGC-U}, achieves the regret of order $\\mathcal{O}(\\sqrt{(K+\\alpha(G)d)T\\log{K}})$ over the time horizon $T$, where $\\alpha(G)$ is the average \\emph{independence number} of the feedback graphs. A slightly weaker result is presented for the directed graph setting as well. The second algorithm, \\texttt{EXP3-LGC-IX}, is developed for a special class of problems, for which the regret is reduced to $\\mathcal{O}(\\sqrt{\\alpha(G)dT\\log{K}\\log(KT)})$ for both directed as well as undirected feedback graphs. Numerical tests corroborate the efficiency of proposed algorithms."}}
{"id": "3R5yGC58SLs", "cdate": 1577836800000, "mdate": null, "content": {"title": "Almost Tune-Free Variance Reduction", "abstract": "The variance reduction class of algorithms including the representative ones, SVRG and SARAH, have well documented merits for empirical risk minimization problems. However, they require grid search..."}}
