{"id": "-e2SBzFDE8x", "cdate": 1652737355038, "mdate": null, "content": {"title": "Adaptively Exploiting d-Separators with Causal Bandits", "abstract": "Multi-armed bandit problems provide a framework to identify the optimal intervention over a sequence of repeated experiments. Without additional assumptions, minimax optimal performance (measured by cumulative regret) is well-understood. With access to additional observed variables that d-separate the intervention from the outcome (i.e., they are a d-separator), recent \"causal bandit\" algorithms provably incur less regret. However, in practice it is desirable to be agnostic to whether observed variables are a d-separator. Ideally, an algorithm should be adaptive; that is, perform nearly as well as an algorithm with oracle knowledge of the presence or absence of a d-separator. In this work, we formalize and study this notion of adaptivity, and provide a novel algorithm that simultaneously achieves (a) optimal regret when a d-separator is observed, improving on classical minimax algorithms, and (b) significantly smaller regret than recent causal bandit algorithms when the observed variables are not a d-separator. Crucially, our algorithm does not require any oracle knowledge of whether a d-separator is observed. We also generalize this adaptivity to other conditions, such as the front-door criterion."}}
{"id": "B98xIKGrae9", "cdate": 1646248574075, "mdate": null, "content": {"title": "Estimation of local treatment effects under the binary instrumental variable model", "abstract": "Instrumental variables are widely used to deal with unmeasured confounding in observational studies and imperfect randomized controlled trials. In these studies, researchers often target the so-called local average treatment effect as it is identifiable under mild conditions. In this paper we consider estimation of the local average treatment effect under the binary instrumental variable model. We discuss the challenges of causal estimation with a binary outcome and show that, surprisingly, it can be more difficult than in the case with a continuous outcome. We propose novel modelling and estimation procedures that improve upon existing proposals in terms of model congeniality, interpretability, robustness and efficiency. Our approach is illustrated via simulation studies and a real data analysis."}}
{"id": "H7mmkA1o6HZ", "cdate": 1631950850044, "mdate": 1631950850044, "content": {"title": "The Promises of Parallel Outcomes", "abstract": "Unobserved confounding presents a major threat to the validity of causal inference from observational studies. In this paper, we introduce a novel framework that leverages the information in multiple parallel outcomes for identification and estimation of causal effects. Under a conditional independence structure among multiple parallel outcomes, we achieve nonparametric identification with at least three parallel outcomes. We further show that under a set of linear structural equation models, causal inference is possible with two parallel outcomes. We develop accompanying estimating procedures and evaluate their finite sample performance through simulation studies and a data application studying the causal effect of the tau protein level on various types of behavioral deficits."}}
{"id": "OlhyC33EP04", "cdate": 1631950759133, "mdate": 1631950759133, "content": {"title": "On Modeling and Estimation for the Relative Risk and Risk Difference", "abstract": "A common problem in formulating models for the relative risk and risk difference is the\nvariation dependence between these parameters and the baseline risk, which is a nuisance\nmodel. We address this problem by proposing the conditional log odds-product as a preferred\nnuisance model. This novel nuisance model facilitates maximum-likelihood estimation, but\nalso permits doubly-robust estimation for the parameters of interest. Our approach is illustrated\nvia simulations and a data analysis. An R package brm implementing the proposed methods\nis available on CRAN."}}
{"id": "WUICcL45la4", "cdate": 1631950686570, "mdate": 1631950686570, "content": {"title": "Bounded, efficient and multiply robust estimation of average treatment effects using instrumental variables", "abstract": "Instrumental variables (IVs) are widely used for estimating causal effects in the presence of unmeasured confounding. Under the standard IV model, however, the average treatment effect (ATE) is only\npartially identifiable. To address this, we propose novel assumptions that allow for identification of the\nATE. Our identification assumptions are clearly separated from model assumptions needed for estimation, so that researchers are not required to commit to a specific observed data model in establishing\nidentification. We then construct multiple estimators that are consistent under three different observed\ndata models, and multiply robust estimators that are consistent in the union of these observed data models. We pay special attention to the case of binary outcomes, for which we obtain bounded estimators of\nthe ATE that are guaranteed to lie between -1 and 1. Our approaches are illustrated with simulations and\na data analysis evaluating the causal effect of education on earnings"}}
