{"id": "CFGokaSzzW8", "cdate": 1680307200000, "mdate": 1681656648844, "content": {"title": "Detecting Engine Anomalies Using Batteries", "abstract": "The automotive industry is increasingly deploying software solutions to provide value-added features for vehicles, especially in the era of vehicle electrification and automation. However, the ever-increasing cyber components of vehicles (i.e., computation, communication, and control) incur new risks of anomalies, as evident by the millions of vehicle recalls by different automakers. To mitigate these risks, we design the <monospace>B-Diag</monospace> , a battery-based diagnostic system detects engine anomalies with a cyber-physical approach. The core idea of <monospace>B-Diag</monospace> is to diagnose engines using the physically-induced correlations between battery voltage and engine variables, which is captured as a customized 3-layer correlation graph and a set of data-driven norm models describing the edges thereof. The design of <monospace>B-Diag</monospace> is steered by a dataset collected with a prototype system when driving a 2018 Subaru Crosstrek in real-life for over three months. Our evaluation shows <monospace>B-Diag</monospace> to detect anomalies of 17 engine variables with a <inline-formula><tex-math notation=\"LaTeX\">$&gt;$</tex-math></inline-formula> <inline-formula><tex-math notation=\"LaTeX\">$86\\%$</tex-math></inline-formula> (up to <inline-formula><tex-math notation=\"LaTeX\">$100\\%$</tex-math></inline-formula> ) accuracy."}}
{"id": "Vi_6Jutzfz", "cdate": 1675209600000, "mdate": 1681656648831, "content": {"title": "Learning From FM Communications: Toward Accurate, Efficient, All-Terrain Vehicle Localization", "abstract": "Vehicle localization service is a fundamental component of intelligent transportation systems. The widely used satellite navigation systems perform poorly in urban areas because the lines of sight to satellites are blocked by complex terrain characteristics, e.g., buildings, elevated streets and interchanges. In this paper, we design RadioLoc, a novel system achieving accurate, efficient, all-terrain vehicle localization with two key design points. First, RadioLoc harvests the frequency modulation (FM) signal, which has higher availability than satellite signal in complex terrains, as the signal source for localization. Second, RadioLoc integrates modern machine learning techniques into the processing of FM signals to efficiently learn the accurate vehicle localization in all-terrain environments. We validate the feasibility of FM-based vehicle localization and corresponding challenges and practical issues via field tests (e.g., signal distortion, signal inconsistency and limited in- vehicle radio bandwidth), and develop a series of advanced techniques in RadioLoc to address them, including adaptive batching, frequency sweeping, a novel multipath delay spread filter, a reconstructive PCA denoiser and a tailored FM feature extractor. We then develop a generic, modular localization module in RadioLoc, and design different learning-based 3D position identification algorithms for this module. We implement a prototype of RadioLoc and perform extensive field experiments to evaluate its efficiency and efficacy. Results show that (1) RadioLoc achieves a real-time localization latency of less than 100 milliseconds; (2) RadioLoc achieves a worst-case localization accuracy of 99.6% even in an underground parking lot, and (3) the horizontal error of RadioLoc is only one sixth of a dedicated GPS device even when the vehicle is moving at a high-speed (i.e., 80 km/h) in a complex highway scenario."}}
{"id": "9jyw09VpowN", "cdate": 1675209600000, "mdate": 1681656648831, "content": {"title": "AISChain: Blockchain-Based AIS Data Platform With Dynamic Bloom Filter Tree", "abstract": "Since 2002, hundreds of thousands of vessels have equipped the Automatic Identification System (AIS), which continuously broadcasts its identity and location information for vessel collision avoidance. To utilize these scattered AIS data for further analysis, there are multiple AIS data platforms collecting AIS data from vessels around the world through their satellites and land-based stations. Thus, users can obtain AIS data of vessels from these platforms without dedicated devices. However, existing platforms work in silos, and AIS data is distributed across different platforms, resulting in reduced data availability. In addition, AIS is vulnerable to jamming and spoofing attacks, which can undermine the authenticity of AIS data. In this paper, we propose AISChain, a secure and fast blockchain-based AIS data platform. AISChain adopts consortium blockchain, which only permits those authorized parties (i.e., AIS data providers) to participate in the consensus protocol, and is compatible with current commodity AIS hardware. Since the whole system is co-maintained by multiple authorized parties, AISChain can integrate AIS data resources in a secure way. For avoiding repeated recording of AIS data on the chain, we design the Dynamic Bloom Filter Tree (DBFT) to realize efficient duplication detection in the transaction verification phase. We also propose the dual signature scheme to clarify the AIS data ownership. Moreover, we leverage the geographical location-based blockchain sharding approach to further improve the scalability of AISChain. We implement a prototype of AISChain, and conduct extensive experiments to evaluate the performance of AISChain. Evaluation results show that the search time of DBFT is negligible (4.3 ms) with an extreme low error ratio (0.4%). Meanwhile, AISChain can achieve more than 730 tx/s throughput even when nodes scale to 36. To the best of our knowledge, AISChain is the first work to apply the blockchain technology to secure the AIS data platform."}}
{"id": "g5pH9nUcmQt", "cdate": 1672531200000, "mdate": 1681656648835, "content": {"title": "Xformer: Hybrid X-Shaped Transformer for Image Denoising", "abstract": "In this paper, we present a hybrid X-shaped vision Transformer, named Xformer, which performs notably on image denoising tasks. We explore strengthening the global representation of tokens from different scopes. In detail, we adopt two types of Transformer blocks. The spatial-wise Transformer block performs fine-grained local patches interactions across tokens defined by spatial dimension. The channel-wise Transformer block performs direct global context interactions across tokens defined by channel dimension. Based on the concurrent network structure, we design two branches to conduct these two interaction fashions. Within each branch, we employ an encoder-decoder architecture to capture multi-scale features. Besides, we propose the Bidirectional Connection Unit (BCU) to couple the learned representations from these two branches while providing enhanced information fusion. The joint designs make our Xformer powerful to conduct global information modeling in both spatial and channel dimensions. Extensive experiments show that Xformer, under the comparable model complexity, achieves state-of-the-art performance on the synthetic and real-world image denoising tasks."}}
{"id": "PBcS7es2_jZ", "cdate": 1672531200000, "mdate": 1681656648836, "content": {"title": "Recursive Generalization Transformer for Image Super-Resolution", "abstract": "Transformer architectures have exhibited remarkable performance in image super-resolution (SR). Since the quadratic computational complexity of the self-attention (SA) in Transformer, existing methods tend to adopt SA in a local region to reduce overheads. However, the local design restricts the global context exploitation, which is critical for accurate image reconstruction. In this work, we propose the Recursive Generalization Transformer (RGT) for image SR, which can capture global spatial information and is suitable for high-resolution images. Specifically, we propose the recursive-generalization self-attention (RG-SA). It recursively aggregates input features into representative feature maps, and then utilizes cross-attention to extract global information. Meanwhile, the channel dimensions of attention matrices (query, key, and value) are further scaled for a better trade-off between computational overheads and performance. Furthermore, we combine the RG-SA with local self-attention to enhance the exploitation of the global context, and propose the hybrid adaptive integration (HAI) for module integration. The HAI allows the direct and effective fusion between features at different levels (local or global). Extensive experiments demonstrate that our RGT outperforms recent state-of-the-art methods."}}
{"id": "19Y9nLCfYVb", "cdate": 1672531200000, "mdate": 1681656648830, "content": {"title": "Edge-computing-driven Internet of Things: A Survey", "abstract": "The Internet of Things (IoT) is impacting the world’s connectivity landscape. More and more IoT devices are connected, bringing many benefits to our daily lives. However, the influx of IoT devices poses non-trivial challenges for the existing cloud-based computing paradigm. In the cloud-based architecture, a large amount of IoT data is transferred to the cloud for data management, analysis, and decision making. It could not only cause a heavy workload on the cloud but also result in unacceptable network latency, ultimately undermining the benefits of cloud-based computing. To address these challenges, researchers are looking for new computing models for the IoT. Edge computing, a new decentralized computing model, is valued by more and more researchers in academia and industry. The main idea of edge computing is placing data processing in near-edge devices instead of remote cloud servers. It is promising to build more scalable, low-latency IoT systems. Many studies have been proposed on edge computing and IoT, but a comprehensive survey of this crossover area is still lacking. In this survey, we first introduce the impact of edge computing on the development of IoT and point out why edge computing is more suitable for IoT than other computing paradigms. Then, we analyze the necessity of systematical investigation on the edge-computing-driven IoT (ECDriven-IoT) and summarize new challenges occurring in ECDriven-IoT. We categorize recent advances from bottom to top, covering six aspects of ECDriven-IoT. Finally, we conclude lessons learned and propose some challenging"}}
{"id": "IloMJ5rqfnt", "cdate": 1663849918023, "mdate": null, "content": {"title": "Accurate Image Restoration with Attention Retractable Transformer", "abstract": "Recently, Transformer-based image restoration networks have achieved promising improvements over convolutional neural networks due to parameter-independent global interactions. To lower computational cost, existing works generally limit self-attention computation within non-overlapping windows. However, each group of tokens are always from a dense area of the image. This is considered as a dense attention strategy since the interactions of tokens are restrained in dense regions. Obviously, this strategy could result in restricted receptive fields. To address this issue, we propose \\textbf{A}ttention \\textbf{R}etractable \\textbf{T}ransformer (ART) for image restoration, which presents both dense and sparse attention modules in the network. The sparse attention module allows tokens from sparse areas to interact and thus provides a wider receptive field. Furthermore, the alternating application of dense and sparse attention modules greatly enhances representation ability of Transformer while providing retractable attention on the input image.We conduct extensive experiments on image super-resolution, denoising, and JPEG compression artifact reduction tasks. Experimental results validate that our proposed ART outperforms state-of-the-art methods on various benchmark datasets both quantitatively and visually. We also provide code and models at~\\url{https://github.com/gladzhang/ART}."}}
{"id": "wQ2QNNP8GtM", "cdate": 1652737291412, "mdate": null, "content": {"title": "Cross Aggregation Transformer for Image Restoration", "abstract": "Recently, Transformer architecture has been introduced into image restoration to replace convolution neural network (CNN) with surprising results. Considering the high computational complexity of Transformer with global attention, some methods use the local square window to limit the scope of self-attention. However, these methods lack direct interaction among different windows, which limits the establishment of long-range dependencies. To address the above issue, we propose a new image restoration model, Cross Aggregation Transformer (CAT). The core of our CAT is the Rectangle-Window Self-Attention (Rwin-SA), which utilizes horizontal and vertical rectangle window attention in different heads parallelly to expand the attention area and aggregate the features cross different windows. We also introduce the Axial-Shift operation for different window interactions. Furthermore, we propose the Locality Complementary Module to complement the self-attention mechanism, which incorporates the inductive bias of CNN (e.g., translation invariance and locality) into Transformer, enabling global-local coupling. Extensive experiments demonstrate that our CAT outperforms recent state-of-the-art methods on several image restoration applications. The code and models are available at https://github.com/zhengchen1999/CAT."}}
{"id": "zfcyfarwr_N", "cdate": 1640995200000, "mdate": 1681656649383, "content": {"title": "mNB-IoT: Concurrent Uplink Transmission for Multiple User Equipments in NB-IoT", "abstract": "The Narrow Band-Internet of Things (NB-IoT) is a wireless protocol with low-power, low-cost, and wide coverage, which has a broad application prospect in fields like smart city or manufacturing. In order to expand the network coverage, the repetition mechanism is designed in NB-IoT, where the same information is required to be transmitted repeatedly for the accurate decoding of received signals in low signal-to-noise ratio (SNR) environments. However, such repetition mechanism will cause a dramatic decrease in the spectrum utilization, which will be greatly reduced by up to 1/128. Literature has explored efficient coding methods, such as Non-Orthogonal Multiple Access (NOMA), but they can only achieve 55% maximum improvement on spectral efficiency.To further increase the spectrum utilization, this paper propose a novel uplink repetition mechanism design for NB-IoT, namely mNB-IoT. It can enable multiple user equipments (UEs) to transmit data to base stations in parallel using the same subcarriers. Based on the timing synchronization of NB-IoT, the original repetition mechanism is changed to the repetition based on orthogonal sequences to realize concurrent transmission among multiple UEs. The repetition intervals and times are then unified among UEs to maximize spectral efficiency. Experiments built upon 3 USRP devices and simulations on 128 UEs have proven the efficiency of mNB-IoT in realizing the repetition mechanism without spectral efficiency reduction."}}
{"id": "xX926lCawY", "cdate": 1640995200000, "mdate": 1681656649380, "content": {"title": "6G Intelligent Distributed Uplink Beamforming for Transport System in Highly Dynamic Environments", "abstract": "In the last decade, MIMO spatial multiplexing and distributed beamforming play a significant role in improving data throughput through cooperative transmission. It has been widely used in wireless communication, especially in 6G. However, the distributed uplink beamforming is still an open problem in highly dynamic environments. However, the proposed 6G technology represents the further integration of deep learning and wireless communication. In this paper, we propose Argute Distributed Uplink Beamforming (ArguteDUB), which uses a feedback algorithm with an offline-trained deep learning model to implement highly dynamic distributed uplink beamforming for the Internet of Vehicles (IoV) in 6G. Specifically, each vehicle enables the base station (BS)/access point (AP) to separate different channel state information (CSI) by inserting orthogonal sequences into the sending data. The BS adopts deep learning to filter the noise and predict the beamforming weight to achieve phase synchronization. Unlike traditional distributed uplink beamforming, ArguteDUB can be adapted to the highly dynamic time-varying channels. The simple network structure ensures the fast response of ArguteDUB. In addition, we make ArguteDUB Orthogonal Frequency Division Multiplexing (OFDM) compatible so that it can be easily deployed in 6G networks. Our evaluation shows that ArguteDUB has an SNR gain of about 5dB to 5.3dB over the single vehicle transmission mode."}}
