{"id": "-qtvXzvCaM_", "cdate": 1631809449041, "mdate": null, "content": {"title": "Cooperative Co-Evolutionary Genetic Programming for High Dimensional Problems", "abstract": "We propose a framework for Cooperative Co-Evolutionary\nGenetic Programming (CCGP) that considers co-evolution at three dif-\nferent abstraction levels: genotype, feature and output level. A thorough\nempirical evaluation is carried out on a real-world high dimensional ML\nproblem (image denoising). Results indicate that GP’s performance is\nenhanced only when cooperation happens at an output level (ensemble-\nalike). The proposed co-evolutionary ensemble approach is compared\nagainst a canonical GP implementation and a GP customized for im-\nage processing tasks. Preliminary results show that the proposed frame-\nwork obtains superior average performance in comparison to the other\nGP models. Our most relevant finding is the empirical evidence showing\nthat the proposed CCGP model is a promising alternative to specialized\nGP implementations that require knowledge of the problem’s domain.\n"}}
{"id": "vjPBCLqhTXz", "cdate": 1599153501321, "mdate": null, "content": {"title": "Convolutional Genetic Programming", "abstract": " In recent years, Deep Neural Networks (DNN), a special type\nof Convolutional Neural Networks (CNN), have come to dominate many\nmachine learning related tasks, specially those related to image process-\ning, such as object recognition, detection, etc. Here we explore the posi-\nbility of developing image denoising filters by stacking multiple Genetic\nProgramming (GP) syntax trees, in a similar fashion to how CNNs are\ndesigned. We test the evolved filters performance in removing additive\ngaussian noise. Results show that GP is able to generate a diverse set\nof feature maps at the ’hidden’ layers of the proposed architecture. Al-\nthough more research is required to validate the suitability of GP for\nimage denoising, our work set the basis for the briding the gap between\ndeep learning and evolutionary computation.\n"}}
{"id": "kh_CMP8cYnj", "cdate": 1599153403044, "mdate": null, "content": {"title": "Evolving autoencoding structures through genetic programming", "abstract": "We propose a novel method to evolve autoencoding structures through genetic pro-\ngramming (GP) for representation learning on high dimensional data. It involves a\npartitioning scheme of high dimensional input representations for distributed pro-\ncessing as well as an on-line form of learning that allows GP to efficiently process\ntraining datasets composed of hundreds or thousands of samples. The use of this\non-line learning approach has important consequences in computational cost given\ndifferent evolutionary population dynamics, namely steady state evolution and gen-\nerational replacement. We perform a complete experimental study to compare the\nevolution of autoencoders (AEs) under different population dynamics and genetic\noperators useful to evolve GP based AEs’ individuals. Also, we compare the perfor-\nmance of GP based AEs with another representation learning method. Competitive\nresults have been achieved through the proposed method. To the best of the authors’\nknowledge, this research work is a precursor within the field of evolutionary deep\nlearning."}}
