{"id": "xOyKJySxGB", "cdate": 1640995200000, "mdate": 1681777096323, "content": {"title": "Algorithmic Learning Foundations for Common Law", "abstract": "This paper looks at a common law legal system as a learning algorithm, models specific features of legal proceedings, and asks whether this system learns efficiently. A particular feature of our model is explicitly viewing various aspects of court proceedings as learning algorithms. This viewpoint enables directly pointing out that when the costs of going to court are not commensurate with the benefits of going to court, there is a failure of learning and inaccurate outcomes will persist in cases that settle. Specifically, cases are brought to court at an insufficient rate. On the other hand, when individuals can be compelled or incentivized to bring their cases to court, the system can learn and inaccuracy vanishes over time."}}
{"id": "vfJHk2Q98zL", "cdate": 1640995200000, "mdate": 1681777096344, "content": {"title": "Algorithmic Learning Foundations for Common Law", "abstract": "This paper looks at a common law legal system as a learning algorithm, models specific features of legal proceedings, and asks whether this system learns efficiently. A particular feature of our model is explicitly viewing various aspects of court proceedings as learning algorithms. This viewpoint enables directly pointing out that when the costs of going to court are not commensurate with the benefits of going to court, there is a failure of learning and inaccurate outcomes will persist in cases that settle. Specifically, cases are brought to court at an insufficient rate. On the other hand, when individuals can be compelled or incentivized to bring their cases to court, the system can learn and inaccuracy vanishes over time."}}
{"id": "teZwV4Vdw98", "cdate": 1640995200000, "mdate": 1681777096301, "content": {"title": "Fair Curing and Network Design in SIS Epidemic Processes", "abstract": "This paper studies efficient algorithms for dynamic curing policies and the corresponding network design problems to guarantee the fast extinction of epidemic spread in a susceptible-infected-susceptible (SIS) model. We consider a Markov process-based SIS epidemic model. We call a curing policy fair if demographic groups are cured with comparable speeds. We propose a fair curing policy based on the curing policy of Drakopoulos et al. Since these optimization problems are NP-hard, finding optimal policies is intractable for large graphs. We provide approximation guarantees on both curing and fair curing policies. Moreover, when the total infection rate is large, the original curing policy includes a waiting period in which no measures are taken to mitigate the spread until the rate slows down. To avoid the waiting period, we study network design problems to reduce the total infection rate by deleting edges or reducing the weight of edges. Then the curing processes become continuous since the total infection rate is restricted by network design. We provide algorithms with provable guarantees for the considered network design problems. In summary, the proposed fair curing and network design algorithms together provide an effective, fair, and computationally efficient approach that mitigates SIS epidemic spread in networks."}}
{"id": "i18Qe8AXp3k", "cdate": 1640995200000, "mdate": 1681777096300, "content": {"title": "Explainable k-means: don't be greedy, plant bigger trees!", "abstract": "We provide a new bi-criteria Õ(log2 k) competitive algorithm for explainable k-means clustering. Explainable k-means was recently introduced by Dasgupta, Frost, Moshkovitz, and Rashtchian (ICML 2020). It is described by an easy to interpret and understand (threshold) decision tree or diagram. The cost of the explainable k-means clustering equals to the sum of costs of its clusters; and the cost of each cluster equals the sum of squared distances from the points in the cluster to the center of that cluster. The best non bi-criteria algorithm for explainable clustering Õ(k) competitive, and this bound is tight. Our randomized bi-criteria algorithm constructs a threshold decision tree that partitions the data set into (1+δ)k clusters (where δ∈ (0,1) is a parameter of the algorithm). The cost of this clustering is at most Õ(1/δ· log2 k) times the cost of the optimal unconstrained k-means clustering. We show that this bound is almost optimal."}}
{"id": "_5Qj4swPG0", "cdate": 1640995200000, "mdate": 1681777096301, "content": {"title": "Edge Deletion Algorithms for Minimizing Spread in SIR Epidemic Models", "abstract": "This paper studies algorithmic strategies to effectively reduce the number of infections in susceptible-infected-recovered (SIR) epidemic models. We consider a Markov chain SIR model and its two instantiations in the deterministic SIR (D-SIR) model and the independent cascade SIR (IC-SIR) model. We investigate the problem of minimizing the number of infections by restricting contacts under realistic constraints. Under moderate assumptions on the reproduction number, we prove that the infection numbers are bounded by supermodular functions in the D-SIR model and the IC-SIR model for large classes of random networks. We propose efficient algorithms with approximation guarantees to minimize infections. The theoretical results are illustrated by numerical simulations."}}
{"id": "Er4MIqOdC4x", "cdate": 1640995200000, "mdate": 1681777096301, "content": {"title": "Optimization of Scoring Rules", "abstract": "This paper introduces an objective for optimizing proper scoring rules. The objective is to maximize the increase in payoff of a forecaster who exerts a binary level of effort to refine a posterior belief from a prior belief. In this framework we characterize optimal scoring rules in simple settings, give efficient algorithms for computing optimal scoring rules in complex settings, and identify simple scoring rules that are approximately optimal. In comparison, standard scoring rules in theory and practice -- for example the quadratic rule, scoring rules for the expectation, and scoring rules for multiple tasks that are averages of single-task scoring rules -- can be very far from optimal."}}
{"id": "2EOaareCxNv", "cdate": 1640995200000, "mdate": 1681777096303, "content": {"title": "Optimal Scoring Rules for Multi-dimensional Effort", "abstract": "This paper develops a framework for the design of scoring rules to optimally incentivize an agent to exert a multi-dimensional effort. This framework is a generalization to strategic agents of the classical knapsack problem (cf. Briest, Krysta, and V\\\"ocking, 2005, Singer, 2010) and it is foundational to applying algorithmic mechanism design to the classroom. The paper identifies two simple families of scoring rules that guarantee constant approximations to the optimal scoring rule. The truncated separate scoring rule is the sum of single dimensional scoring rules that is truncated to the bounded range of feasible scores. The threshold scoring rule gives the maximum score if reports exceed a threshold and zero otherwise. Approximate optimality of one or the other of these rules is similar to the bundling or selling separately result of Babaioff, Immorlica, Lucier, and Weinberg (2014). Finally, we show that the approximate optimality of the best of those two simple scoring rules is robust when the agent's choice of effort is made sequentially."}}
{"id": "gHzwS2ma2gi", "cdate": 1609459200000, "mdate": 1681777096339, "content": {"title": "Explainable k-means. Don't be greedy, plant bigger trees!", "abstract": "We provide a new bi-criteria $\\tilde{O}(\\log^2 k)$ competitive algorithm for explainable $k$-means clustering. Explainable $k$-means was recently introduced by Dasgupta, Frost, Moshkovitz, and Rashtchian (ICML 2020). It is described by an easy to interpret and understand (threshold) decision tree or diagram. The cost of the explainable $k$-means clustering equals to the sum of costs of its clusters; and the cost of each cluster equals the sum of squared distances from the points in the cluster to the center of that cluster. The best non bi-criteria algorithm for explainable clustering $\\tilde{O}(k)$ competitive, and this bound is tight. Our randomized bi-criteria algorithm constructs a threshold decision tree that partitions the data set into $(1+\\delta)k$ clusters (where $\\delta\\in (0,1)$ is a parameter of the algorithm). The cost of this clustering is at most $\\tilde{O}(1/ \\delta \\cdot \\log^2 k)$ times the cost of the optimal unconstrained $k$-means clustering. We show that this bound is almost optimal."}}
{"id": "bM9ZT-_-xb", "cdate": 1609459200000, "mdate": 1681777096317, "content": {"title": "Near-optimal Algorithms for Explainable k-Medians and k-Means", "abstract": "We consider the problem of explainable $k$-medians and $k$-means introduced by Dasgupta, Frost, Moshkovitz, and Rashtchian~(ICML 2020). In this problem, our goal is to find a threshold decision tree that partitions data into $k$ clusters and minimizes the $k$-medians or $k$-means objective. The obtained clustering is easy to interpret because every decision node of a threshold tree splits data based on a single feature into two groups. We propose a new algorithm for this problem which is $\\tilde O(\\log k)$ competitive with $k$-medians with $\\ell_1$ norm and $\\tilde O(k)$ competitive with $k$-means. This is an improvement over the previous guarantees of $O(k)$ and $O(k^2)$ by Dasgupta et al (2020). We also provide a new algorithm which is $O(\\log^{3/2} k)$ competitive for $k$-medians with $\\ell_2$ norm. Our first algorithm is near-optimal: Dasgupta et al (2020) showed a lower bound of $\\Omega(\\log k)$ for $k$-medians; in this work, we prove a lower bound of $\\tilde\\Omega(k)$ for $k$-means. We also provide a lower bound of $\\Omega(\\log k)$ for $k$-medians with $\\ell_2$ norm."}}
{"id": "Inj8nFAmBak", "cdate": 1609459200000, "mdate": 1681777096298, "content": {"title": "Near-Optimal Algorithms for Explainable k-Medians and k-Means", "abstract": "We consider the problem of explainable $k$-medians and $k$-means introduced by Dasgupta, Frost, Moshkovitz, and Rashtchian (ICML 2020). In this problem, our goal is to find a \\emph{threshold decisi..."}}
