{"id": "QG3Zb8hojJ", "cdate": 1640995200000, "mdate": 1683911419071, "content": {"title": "Hierarchically Clustered PCA and CCA via a Convex Clustering Penalty", "abstract": "AI-enabled precision medicine promises a transformational improvement in healthcare outcomes by enabling data-driven personalized diagnosis, prognosis, and treatment. However, the well-known \"curse of dimensionality\" and the clustered structure of biomedical data together interact to present a joint challenge in the high dimensional, limited observation precision medicine regime. To overcome both issues simultaneously we propose a simple and scalable approach to joint clustering and embedding that combines standard embedding methods with a convex clustering penalty in a modular way. This novel, cluster-aware embedding approach overcomes the complexity and limitations of current joint embedding and clustering methods, which we show with straightforward implementations of hierarchically clustered principal component analysis (PCA), locally linear embedding (LLE), and canonical correlation analysis (CCA). Through both numerical experiments and real-world examples, we demonstrate that our approach outperforms traditional and contemporary clustering methods on highly underdetermined problems (e.g., with just tens of observations) as well as on large sample datasets. Importantly, our approach does not require the user to choose the desired number of clusters, but instead yields interpretable dendrograms of hierarchically clustered embeddings. Thus our approach improves significantly on existing methods for identifying patient subgroups in multiomics and neuroimaging data, enabling scalable and interpretable biomarkers for precision medicine."}}
{"id": "gjxt5Ucdb9", "cdate": 1356998400000, "mdate": 1684096407532, "content": {"title": "Interpretable whole-brain prediction analysis with GraphNet", "abstract": ""}}
{"id": "V8EwrVkKMR", "cdate": 1356998400000, "mdate": 1684096407529, "content": {"title": "The Open Connectome Project Data Cluster: Scalable Analysis and Vision for High-Throughput Neuroscience", "abstract": "We describe a scalable database cluster for the spatial analysis and annotation of high-throughput brain imaging data, initially for 3-d electron microscopy image stacks, but for time-series and multi-channel data as well. The system was designed primarily for workloads that build connectomes---neural connectivity maps of the brain---using the parallel execution of computer vision algorithms on high-performance compute clusters. These services and open-science data sets are publicly available at http://openconnecto.me. The system design inherits much from NoSQL scale-out and data-intensive computing architectures. We distribute data to cluster nodes by partitioning a spatial index. We direct I/O to different systems---reads to parallel disk arrays and writes to solid-state storage---to avoid I/O interference and maximize throughput. All programming interfaces are RESTful Web services, which are simple and stateless, improving scalability and usability. We include a performance evaluation of the production system, highlighting the effectiveness of spatial data organization."}}
{"id": "TQoo6skZvo", "cdate": 1356998400000, "mdate": 1684096407533, "content": {"title": "The open connectome project data cluster: scalable analysis and vision for high-throughput neuroscience", "abstract": "We describe a scalable database cluster for the spatial analysis and annotation of high-throughput brain imaging data, initially for 3-d electron microscopy image stacks, but for time-series and multi-channel data as well. The system was designed primarily for workloads that build connectomes---neural connectivity maps of the brain---using the parallel execution of computer vision algorithms on high-performance compute clusters. These services and open-science data sets are publicly available at openconnecto.me. The system design inherits much from NoSQL scale-out and data-intensive computing architectures. We distribute data to cluster nodes by partitioning a spatial index. We direct I/O to different systems---reads to parallel disk arrays and writes to solid-state storage---to avoid I/O interference and maximize throughput. All programming interfaces are RESTful Web services, which are simple and stateless, improving scalability and usability. We include a performance evaluation of the production system, highlighting the effectiveness of spatial data organization."}}
{"id": "1JuHTW42cxk", "cdate": 1230768000000, "mdate": 1684096407529, "content": {"title": "Elastic Source Selection for In Vivo Imaging of Neuronal Ensembles", "abstract": "Advances in microscopy and biochemistry now allow investigators to image the calcium dynamics of hundreds to thousands of neurons in awake behaving animals. However, as speed and resolution of such techniques rapidly increase, so do the dimension and complexity of the data collected. ICA has been widely employed to reveal independent non-Gaussian sources underlying large data sets consisting of mixed sources. We apply a recently developed sparse regression method, the Elastic Net (ENET), to the columns of the mixing matrix of a independent component analysis (ICA) procedure. This regression method automatically selects only those columns of the mixing matrix relevant to a dependent variable of interest. Further, because ICA is a linear operator, we can easily project the ldquorelevance filteredrdquo data back into the native data space for interpretation. We demonstrate the utility of this method on 3D calcium imaging data collected from the optic tectum of an awake behaving larval zebrafish watching a prey-like stimulus."}}
{"id": "0pK9V_bqT8", "cdate": 1230768000000, "mdate": 1684096407529, "content": {"title": "EEG Classification by ICA Source Selection of Laplacian-Filtered Data", "abstract": "We studied the performance of a double-spatial filtering method for classification of single-trial electroencephalography (EEG) data that couples the spherical surface Laplacian (SL) and independent component analysis (ICA). This method was evaluated in the context of a binary classification experiment with brain states driven by mental imagery of auditory and visual stimuli. A statistically significant improvement was achieved with respect to the rates provided by raw data and by data filtered by either SL or ICA."}}
{"id": "uXk2m4kwj68", "cdate": 1199145600000, "mdate": 1684096407529, "content": {"title": "Quantifying inter-subject agreement in brain-imaging analyses", "abstract": ""}}
{"id": "Du2TGn1KcRK", "cdate": 1167609600000, "mdate": 1684096407529, "content": {"title": "Single-Trial Classification of MEG Recordings", "abstract": "para xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> While magnetoencephalography (MEG) is widely used to identify spatial locations of brain activations associated with various tasks, classification of single trials in stimulus-locked experiments remains an open subject. Very significant single-trial classification results have been published using electroencephalogram (EEG) data, but in the MEG case, the weakness of the magnetic fields originating from the relevant sources relative to external noise, and the high dimensionality of the data are difficult obstacles to overcome. We present here very significant MEG single-trial mean classification rates of words. The number of words classified varied from seven to nine and both visual and auditory modalities were studied. These results were obtained by using a variety of blind sources separation methods: spatial principal components analysis (PCA), Infomax independent components analysis (Infomax ICA) and second-order blind identification (SOBI). The sources obtained were classified using two methods, linear discriminant classification (LDC) and <formula formulatype=\"inline\"><tex>$\\nu $</tex></formula>-support vector machine (<formula formulatype=\"inline\"><tex>$\\nu $</tex></formula>-SVM). The data used here, auditory and visual presentations of words, presented nontrivial classification problems, but with Infomax ICA associated with LDC we obtained high classification rates. Our best single-trial mean classification rate was 60.1% for classification of 900 single trials of nine auditory words. On two-class problems rates were as high as 97.5%. </para>"}}
{"id": "soSuk6d6s0", "cdate": 1136073600000, "mdate": 1684096407528, "content": {"title": "Multichannel Classification of Single EEG Trials with Independent Component Analysis", "abstract": "We have previously shown that classification of single-trial electroencephalographic (EEG) recordings is improved by the use of either a multichannel classifier or the best independent component over a single channel classifier. In this paper, we introduce a classifier that makes explicit use of multiple independent components. Two models are compared. The first (“direct”) model uses independent components as time-series inputs, while the second (“indirect”) model remixes the components back to the signal space. The direct model resulted in significantly improved classification rates when applied to two experiments using both monopolar and bipolar settings."}}
