{"id": "yuqQDuQwKjN", "cdate": 1680307200000, "mdate": 1681716144232, "content": {"title": "Higher-Order Truss Decomposition in Graphs", "abstract": "inline-formula><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> -truss model is a typical cohesive subgraph model and has been received considerable attention recently. However, the <inline-formula><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> -truss model only considers the direct common neighbors of an edge, which restricts its ability to reveal fine-grained structure information of the graph. Motivated by this, in this paper, we propose a new model named <inline-formula><tex-math notation=\"LaTeX\">$(k, \\tau)$</tex-math></inline-formula> -truss that considers the higher-order neighborhood ( <inline-formula><tex-math notation=\"LaTeX\">$\\tau$</tex-math></inline-formula> hop) information of an edge. Based on the <inline-formula><tex-math notation=\"LaTeX\">$(k, \\tau)$</tex-math></inline-formula> -truss model, we study the higher-order truss decomposition problem which computes the <inline-formula><tex-math notation=\"LaTeX\">$(k, \\tau)$</tex-math></inline-formula> -trusses for all possible <inline-formula><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> values regarding a given <inline-formula><tex-math notation=\"LaTeX\">$\\tau$</tex-math></inline-formula> . Higher-order truss decomposition can be used in the applications such as community detection and search, hierarchical structure analysis, and graph visualization. To address this problem, we first propose a bottom-up decomposition paradigm in the increasing order of <inline-formula><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> values to compute the corresponding <inline-formula><tex-math notation=\"LaTeX\">$(k, \\tau)$</tex-math></inline-formula> -truss. Based on the bottom-up decomposition paradigm, we further devise three optimization strategies to reduce the unnecessary computation. We evaluate our proposed algorithms on real datasets and synthetic datasets, the experimental results demonstrate the efficiency, effectiveness and scalability of our proposed algorithms."}}
{"id": "n5YaNRdMoL", "cdate": 1680307200000, "mdate": 1681716144183, "content": {"title": "Data Level Privacy Preserving: A Stochastic Perturbation Approach Based on Differential Privacy", "abstract": "With the great amount of available data, especially collecting from the ubiquitous Internet of Things (IoT), the issue of privacy leakage arises increasingly concerns recently. To preserve the privacy of IoT datasets, traditional methods usually calibrate random noises on the data values to achieve differential privacy (DP). However, the amount of the calibrating noises should be carefully designed and a heedless value will definitely degrade the availability of datasets. Thus, in this work, we propose a stochastic perturbation method to sanitize the dataset, where the perturbation is obtained from the rest samples in the same dataset. In addition, we derive the expression of the utility level based on its unique framework and prove that the proposed algorithm can achieve the <inline-formula><tex-math notation=\"LaTeX\">$\\epsilon$</tex-math></inline-formula> -DP. To show the effectiveness of the proposed algorithm, we conduct extensive experiments on real-life datasets by various functions, such as query answers and machine learning tasks. By comparing with the state-of-the-art methods, our proposed algorithm can achieve a better performance under the same privacy level."}}
{"id": "ZNrr7_hq8Pq", "cdate": 1672531200000, "mdate": 1681716144188, "content": {"title": "Effective Community Search on Large Attributed Bipartite Graphs", "abstract": "Community search over bipartite graphs has attracted significant interest recently. In many applications such as user-item bipartite graph in E-commerce, customer-movie bipartite graph in movie rating website, nodes tend to have attributes, while previous community search algorithm on bipartite graphs ignore attributes, which makes the returned results with poor cohesion with respect to their node attributes. In this paper, we study the community search problem on attributed bipartite graphs. Given a query vertex q, we aim to find attributed $\\left(\\alpha,\\beta\\right)$-communities of $G$, where the structure cohesiveness of the community is described by an $\\left(\\alpha,\\beta\\right)$-core model, and the attribute similarity of two groups of nodes in the subgraph is maximized. In order to retrieve attributed communities from bipartite graphs, we first propose a basic algorithm composed of two steps: the generation and verification of candidate keyword sets, and then two improved query algorithms Inc and Dec are proposed. Inc is proposed considering the anti-monotonity property of attributed bipartite graphs, then we adopt different generating method and verifying order of candidate keyword sets and propose the Dec algorithm. After evaluating our solutions on eight large graphs, the experimental results demonstrate that our methods are effective and efficient in querying the attributed communities on bipartite graphs."}}
{"id": "y1aq3juqryX", "cdate": 1640995200000, "mdate": 1681716144385, "content": {"title": "Trusted AI in Multi-agent Systems: An Overview of Privacy and Security for Distributed Learning", "abstract": "Motivated by the advancing computational capacity of distributed end-user equipments (UEs), as well as the increasing concerns about sharing private data, there has been considerable recent interest in machine learning (ML) and artificial intelligence (AI) that can be processed on on distributed UEs. Specifically, in this paradigm, parts of an ML process are outsourced to multiple distributed UEs, and then the processed ML information is aggregated on a certain level at a central server, which turns a centralized ML process into a distributed one, and brings about significant benefits. However, this new distributed ML paradigm raises new risks of privacy and security issues. In this paper, we provide a survey of the emerging security and privacy risks of distributed ML from a unique perspective of information exchange levels, which are defined according to the key steps of an ML process, i.e.: i) the level of preprocessed data, ii) the level of learning models, iii) the level of extracted knowledge and, iv) the level of intermediate results. We explore and analyze the potential of threats for each information exchange level based on an overview of the current state-of-the-art attack mechanisms, and then discuss the possible defense methods against such threats. Finally, we complete the survey by providing an outlook on the challenges and possible directions for future research in this critical area."}}
{"id": "lhEIIxxl34", "cdate": 1640995200000, "mdate": 1674044474165, "content": {"title": "Balanced Clique Computation in Signed Networks: Concepts and Algorithms", "abstract": ""}}
{"id": "kIj0UR1xrU", "cdate": 1640995200000, "mdate": 1674044473949, "content": {"title": "Shortest-Path Queries on Complex Networks: Experiments, Analyses, and Improvement", "abstract": ""}}
{"id": "b2I1qm-s2D", "cdate": 1640995200000, "mdate": 1681716144294, "content": {"title": "Index-based Structural Clustering on Directed Graphs", "abstract": "Structural clustering (SCAN) is one of the most popular graph clustering paradigms. However, SCAN assumes that the input graph is undirected and can not cluster the directed graphs. To address this problem, in this paper, we propose a new structural clustering model based on SCAN to cluster directed graphs. Following the new model, we propose an index-based approach to support the efficient clustering of a given graph. Moreover, we also devise efficient index maintenance algorithms to handle the case that the input graph is dynamically updated. We conduct extensive experiments on nine real directed graphs, one of which contains more than 2 billion edges. The results demonstrate the effectiveness and efficiency of our proposed methods."}}
{"id": "GG5ZfoWwf36", "cdate": 1640995200000, "mdate": 1681716144196, "content": {"title": "Multi-label transfer learning via latent graph alignment", "abstract": "Multi-label transfer learning aiming to learn robust classifiers for the target domain by leveraging knowledge from a source domain has been received considerable attention recently. The core part of such research is similarity measurement. Nevertheless, the existing similarity measurement functions of probability distributions are still too simple to fully describe the similarity of probability distributions.. In order to address this problem, we propose a Multi-label Transfer Learning Via Latent Graph Alignment (G-MLTL). G-MLTL uses subspace learning to make the feature distribution of the target domain consistent with the source domain. At the same time, G-MLTL decomposes the label matrix to ensure data points sharing the same labels to have identical latent semantic representation in the new reconstruction space. The proposed G-MLTL also focuses on directly utilizing Latent Graph Alignment to guide the knowledge transfer process. Extensive experiments demonstrate that G-MLTL significantly outperforms the existing multi-label transfer learning methods. Especially when the number of labels is more than four, the mean Average Precision of G-MLTL is higher than the baseline algorithm by 2.1-10.5%."}}
{"id": "BsG0x9HvQIM", "cdate": 1640995200000, "mdate": 1681716144497, "content": {"title": "Hop-Constrained s-t Simple Path Enumeration in Billion-Scale Labelled Graphs", "abstract": "Hop-constrained s-t simple path ( $${\\textsf{HC}}\\text {-}{\\textsf{s}}\\text {-}{\\mathsf {t~path}} $$ ) enumeration is a fundamental problem in graph analysis. Existing solutions for this problem focus on unlabelled graphs and assume queries are issued without any label constraints. However, in many real-world applications, graphs are edge-labelled and the queries involve label constraints on the path connecting two vertices. Therefore, we study the problem of labelled hop-constrained s-t path ( $$\\textsf{LHC}$$ - $$\\textsf{s}$$ - $$\\mathsf {t~path}$$ ) enumeration in this paper. We aim to efficiently enumerate the $$\\textsf{HC}$$ - $$\\textsf{s}$$ - $$\\mathsf {t~paths}$$ using only edges with provided labels. To achieve this goal, we first demonstrate the existence of unnecessary computation specific to the label constraints in the state-of-the-art $$\\textsf{HC}$$ - $$\\textsf{s}$$ - $$\\mathsf {t~path}$$ enumeration algorithm. We then devise a novel online index to identify the fruitless exploration during the enumeration. Based on the proposed index, we design an efficient $$\\textsf{LHC}$$ - $$\\textsf{s}$$ - $$\\mathsf {t~path}$$ enumeration algorithm in which unnecessary computation is effectively pruned. Extensive experiments are conducted on real-world graphs with billions of edges. Experiment results show that our proposed algorithms significantly outperform the baseline methods by over one order of magnitude."}}
{"id": "ZfYDfrGW8YX", "cdate": 1609459200000, "mdate": 1674044474164, "content": {"title": "Efficient Label-Constrained Shortest Path Queries on Road Networks: A Tree Decomposition Approach", "abstract": ""}}
