{"id": "QnCSmMWSvij", "cdate": 1684294172401, "mdate": 1684294172401, "content": {"title": "Early warning of burst passenger flow in public transportation system", "abstract": "Burst passenger flow in the public transportation system is serious to public safety. Existing works mainly focused on prediction and monitoring of regular passenger flow, which are not suitable for burst passenger flow. In this article, we first formulate the problem as early warning of burst passenger flow. Next, we design a novel framework to solve this problem by our observation that a burst passenger in-flow usually comes after an abnormal passenger out-flow for a subway station, especially when there is a large-scale social crowd event. Our framework consists of two models: (1) Abnormal out-flow detection (AOFD) which detects abnormal out-flows and warns the city administration of the burst in-flow fairly ahead of time. (2) Burst in-flow peak estimation (BIFPE) which estimates burst in-flow peak time and volume. We evaluate our framework with real-world smartcard data of the largest city in China and use large-scale social crowd event data to further explain our model. The result shows that: (1) AOFD can detect abnormal out-flows that would later result in bursts in-flows with better performance and can send warning signal ahead of the time of burst passenger in-flow. (2) BIFPE can effectively estimate the peak time of burst in-flow and can reduce peak volume estimation error compared with the traditional passenger flow prediction models."}}
{"id": "ephWA7KaWmD", "cdate": 1621630191321, "mdate": null, "content": {"title": "GRIN: Generative Relation and Intention Network for Multi-agent Trajectory Prediction", "abstract": "Learning the distribution of future trajectories conditioned on the past is a crucial problem for understanding multi-agent systems. This is challenging because humans make decisions based on complex social relations and personal intents, resulting in highly complex uncertainties over trajectories. To address this problem, we propose a conditional deep generative model that combines advances in graph neural networks. The prior and recognition model encodes two types of latent codes for each agent: an inter-agent latent code to represent social relations and an intra-agent latent code to represent agent intentions. The decoder is carefully devised to leverage the codes in a disentangled way to predict multi-modal future trajectory distribution. Specifically, a graph attention network built upon inter-agent latent code is used to learn continuous pair-wise relations, and an agent's motion is controlled by its latent intents and its observations of all other agents. Through experiments on both synthetic and real-world datasets, we show that our model outperforms previous work in multiple performance metrics. We also show that our model generates realistic multi-modal trajectories."}}
{"id": "VMoXBtt8Ng", "cdate": 1546300800000, "mdate": null, "content": {"title": "Decoding Spiking Mechanism with Dynamic Learning on Neuron Population", "abstract": "A main concern in cognitive neuroscience is to decode the overt neural spike train observations and infer latent representations under neural circuits. However, traditional methods entail strong prior on network structure and hardly meet the demand for real spike data. Here we propose a novel neural network approach called Neuron Activation Network that extracts neural information explicitly from single trial neuron population spike trains. Our proposed method consists of a spatiotemporal learning procedure on sensory environment and a message passing mechanism on population graph, followed by a neuron activation process in a recursive fashion. Our model is aimed to reconstruct neuron information while inferring representations of neuron spiking states. We apply our model to retinal ganglion cells and the experimental results suggest that our model holds a more potent capability in generating neural spike sequences with high fidelity than the state-of-the-art methods, as well as being more expressive and having potential to disclose latent spiking mechanism. The source code will be released with the final paper."}}
{"id": "TfIgaVWTIhC", "cdate": 1546300800000, "mdate": null, "content": {"title": "Learning Interpretable Deep State Space Model for Probabilistic Time Series Forecasting", "abstract": "Probabilistic time series forecasting involves estimating the distribution of future based on its history, which is essential for risk management in downstream decision-making. We propose a deep state space model for probabilistic time series forecasting whereby the non-linear emission model and transition model are parameterized by networks and the dependency is modeled by recurrent neural nets. We take the automatic relevance determination (ARD) view and devise a network to exploit the exogenous variables in addition to time series. In particular, our ARD network can incorporate the uncertainty of the exogenous variables and eventually helps identify useful exogenous variables and suppress those irrelevant for forecasting. The distribution of multi-step ahead forecasts are approximated by Monte Carlo simulation. We show in experiments that our model produces accurate and sharp probabilistic forecasts. The estimated uncertainty of our forecasting also realistically increases over time, in a spontaneous manner."}}
{"id": "Bd6PiEXsF2", "cdate": 1546300800000, "mdate": null, "content": {"title": "Differential Privacy with Variant-Noise for Gaussian Processes Classification", "abstract": "Incredible capacity of machine learning models to mine the underlying information has led to concerns of privacy disclosure. This makes privacy-preserving learning algorithms become a hot spot. In this paper, we focus on Gaussian processes classification (GPC) with a provable secure and feasible privacy model, differential privacy (DP). First we apply a functional mechanism to design a basic privacy-preserving GP classifier. This involves finding the sensitivity of the outputs, and adding a Gaussian process noise proportional to the sensitivity to the trained classifier. Then we propose a variant-noise mechanism to perturb the classifier with different scaled noise based on the density of dataset. We show that this method can significantly reduce the added noise, whilst sufficiently maintaining the accuracy of the classifier both in theory and experiments."}}
{"id": "04MnY9CrLoe", "cdate": 1546300800000, "mdate": null, "content": {"title": "Online detection of abnormal passenger out-flow in urban metro system", "abstract": "Accurate forecasting of the number of passengers coming into the urban metro system, namely, passenger in-flow has been one of the most important issues in the research on the intelligent transportation system. Existing studies aim at making the prediction mainly by learning the recurring patterns from historical passenger in-flows. However, passenger out-flows from the urban metro system, which may usually contribute to understanding passenger behavior, and help forecast passenger in-flows, especially burst in-flows on unusual conditions, have rarely been studied yet. In this paper, we propose a model called EAD-OF (Elastic Abnormality Detection for Out-flow) to real-time detect the abnormal passenger out-flows and alarm the administrators in time. Furthermore, we analyze the characteristics of passenger in-flow, out-flow and their correlation. We evaluate our model with real transportation data of the biggest city in China and use large-scale social event data to further explain our model. The result shows that EAD-OF can effectively detect the abnormal out-flows which would cause burst in-flows with performance tens of times better than the baseline models. In term of efficiency, EAD-OF can also beat the direct computation approach several times."}}
{"id": "C9MJvgJkGds", "cdate": 1514764800000, "mdate": null, "content": {"title": "Peak-Hour Subway Passenger Flow Forecasting: A Tensor Based Approach", "abstract": "Passenger flow forecasting plays a critical role in intelligent transportation systems. Existing studies mainly focused on the accuracy of forecasting. In this paper, we propose a tensor-based framework combined with “priori modeling” and “posterior analysis”, which can forecast peak-hour passenger flow with both accuracy and interpretability. This framework consists of three parts: 1) construct 5-way tensor model based priori features of passenger flow (e.g. multiple periodicity, temporal variabilities and spatial information); 2) design a tensor completion algorithm to forecast peak-hour passenger flow; 3) qualitatively and quantitatively assess the reliability and importance of priori features. Our framework is evaluated on a real world large-scale passenger flow dataset in the largest city in China. Experimental results showed that our approach achieves 25%-40% improvement over baselines. We also provided in-depth analysis for traffic meanings of modes of tensor and the rank of importance of priori features."}}
