{"id": "6Q-dBOmpOR", "cdate": 1695043826911, "mdate": null, "content": {"title": "Time Series Continuous Modeling for Imputation and Forecasting with Implicit Neural Representations", "abstract": "Although widely explored, time series modeling continues to encounter significant challenges when confronted with real-world data. We propose a novel modeling approach leveraging Implicit Neural Representations (INR). This approach enables us to effectively capture the continuous aspect of time series and provides a natural solution to recurring modeling issues such as handling missing data, dealing with irregular sampling, or unaligned observations from multiple sensors. By introducing conditional modulation of INR parameters and leveraging meta-learning techniques, we address the issue of generalization to both unseen samples and time window shifts. Through extensive experimentation, our model demonstrates state-of-the-art performance in forecasting and imputation tasks, while exhibiting flexibility in handling a wide range of challenging scenarios that competing models cannot."}}
{"id": "NT4U69OQNB", "cdate": 1695043722210, "mdate": null, "content": {"title": "Operator Learning with Neural Fields: Tackling PDEs on General Geometries", "abstract": "Machine learning approaches for solving partial differential equations require learning mappings between function spaces. While convolutional or graph neural networks are constrained to discretized functions, neural operators present a promising milestone toward mapping functions directly. Despite impressive results they still face challenges with respect to the domain geometry and typically rely on some form of discretization. In order to alleviate such limitations, we present CORAL, a new method that leverages coordinate-based networks for solving PDEs on general geometries. CORAL is designed to remove constraints on the input mesh, making it applicable to any spatial sampling and geometry. Its ability extends to diverse problem domains, including PDE solving, spatio-temporal forecasting, and inverse problems like geometric design. CORAL demonstrates robust performance across multiple resolutions and performs well in both convex and non-convex domains, surpassing or performing on par with state-of-the-art models."}}
{"id": "rQqqWeUyqBo", "cdate": 1675970197520, "mdate": null, "content": {"title": "OPERATOR LEARNING ON FREE-FORM GEOMETRIES", "abstract": "Operator Learning models usually rely on a fixed sampling scheme for training which might limit their ability to generalize to new situations. We present CORAL, a new method which leverages Coordinate-Based Networks for OpeRAtor Learning without any constraints on the training mesh or input sampling. CORAL is able to solve complex Initial Value Problems such as 2D Navier-Stokes or 3D spherical Shallow-Water and can perform zero-shot super-resolution to recover a dense grid, even when the training grid is irregular and sparse. It can also be applied to the task of geometric design with structured or point-cloud data, to infer the steady physical state of a system given the characteristics of the domain."}}
{"id": "Zf1oEPZse3u", "cdate": 1672531200000, "mdate": 1695970481887, "content": {"title": "Operator Learning with Neural Fields: Tackling PDEs on General Geometries", "abstract": "Machine learning approaches for solving partial differential equations require learning mappings between function spaces. While convolutional or graph neural networks are constrained to discretized functions, neural operators present a promising milestone toward mapping functions directly. Despite impressive results they still face challenges with respect to the domain geometry and typically rely on some form of discretization. In order to alleviate such limitations, we present CORAL, a new method that leverages coordinate-based networks for solving PDEs on general geometries. CORAL is designed to remove constraints on the input mesh, making it applicable to any spatial sampling and geometry. Its ability extends to diverse problem domains, including PDE solving, spatio-temporal forecasting, and inverse problems like geometric design. CORAL demonstrates robust performance across multiple resolutions and performs well in both convex and non-convex domains, surpassing or performing on par with state-of-the-art models."}}
{"id": "HNdp1ltDG_", "cdate": 1672531200000, "mdate": 1695970481887, "content": {"title": "Time Series Continuous Modeling for Imputation and Forecasting with Implicit Neural Representations", "abstract": "Although widely explored, time series modeling continues to encounter significant challenges when confronted with real-world data. We propose a novel modeling approach leveraging Implicit Neural Representations (INR). This approach enables us to effectively capture the continuous aspect of time series and provides a natural solution to recurring modeling issues such as handling missing data, dealing with irregular sampling, or unaligned observations from multiple sensors. By introducing conditional modulation of INR parameters and leveraging meta-learning techniques, we address the issue of generalization to both unseen samples and time window shifts. Through extensive experimentation, our model demonstrates state-of-the-art performance in forecasting and imputation tasks, while exhibiting flexibility in handling a wide range of challenging scenarios that competing models cannot."}}
{"id": "21xEuSsPV3", "cdate": 1672531200000, "mdate": 1695970481887, "content": {"title": "INFINITY: Neural Field Modeling for Reynolds-Averaged Navier-Stokes Equations", "abstract": "For numerical design, the development of efficient and accurate surrogate models is paramount. They allow us to approximate complex physical phenomena, thereby reducing the computational burden of direct numerical simulations. We propose INFINITY, a deep learning model that utilizes implicit neural representations (INRs) to address this challenge. Our framework encodes geometric information and physical fields into compact representations and learns a mapping between them to infer the physical fields. We use an airfoil design optimization problem as an example task and we evaluate our approach on the challenging AirfRANS dataset, which closely resembles real-world industrial use-cases. The experimental results demonstrate that our framework achieves state-of-the-art performance by accurately inferring physical fields throughout the volume and surface. Additionally we demonstrate its applicability in contexts such as design exploration and shape optimization: our model can correctly predict drag and lift coefficients while adhering to the equations."}}
