{"id": "5ZI0PyaCJfW", "cdate": 1609459200000, "mdate": 1635435398581, "content": {"title": "Training Differentially Private Neural Networks with Lottery Tickets", "abstract": "We propose the differentially private lottery ticket hypothesis (DPLTH). An end-to-end differentially private training paradigm based on the lottery ticket hypothesis, designed specifically to improve the privacy-utility trade-off in differentially private neural networks. DPLTH, using high-quality winners privately selected via our custom score function outperforms current methods by a margin greater than 20%. We further show that DPLTH converges faster, allowing for early stopping with reduced privacy budget consumption and that a single publicly available dataset for ticket generation is enough for enhancing the utility on multiple datasets of varying properties and from varying domains. Our extensive evaluation on six public datasets provides evidence to our claims."}}
{"id": "xd1gAP99Th9", "cdate": 1577836800000, "mdate": 1635435398581, "content": {"title": "The Differentially Private Lottery Ticket Mechanism", "abstract": "We propose the differentially private lottery ticket mechanism (DPLTM). An end-to-end differentially private training paradigm based on the lottery ticket hypothesis. Using \"high-quality winners\", selected via our custom score function, DPLTM significantly improves the privacy-utility trade-off over the state-of-the-art. We show that DPLTM converges faster, allowing for early stopping with reduced privacy budget consumption. We further show that the tickets from DPLTM are transferable across datasets, domains, and architectures. Our extensive evaluation on several public datasets provides evidence to our claims."}}
{"id": "xNe6GXlPgSs", "cdate": 1577836800000, "mdate": 1635435398580, "content": {"title": "Differentially Private Top-k Selection via Stability on Unknown Domain", "abstract": "We propose a new method that satisfies approximate differential privacy for top-$k$ selection with unordered output in the unknown data domain setting, not relying on the full knowledge of the doma..."}}
{"id": "bZsGk3Rz6R", "cdate": 1577836800000, "mdate": 1635435398641, "content": {"title": "Differentially Private Survival Function Estimation", "abstract": "Survival function estimation is used in many disciplines, but it is most common in medical analytics in the form of the Kaplan-Meier estimator. Sensitive data (patient records) is used in the estim..."}}
{"id": "BVqxsVCOkZd", "cdate": 1577836800000, "mdate": 1635435398596, "content": {"title": "Differentially Private Small Dataset Release Using Random Projections", "abstract": "Small datasets form a significant portion of releasable data in high sensitivity domains such as healthcare. But, providing differential privacy for small dataset release is a hard task, where curr..."}}
{"id": "S1e5YC4KPS", "cdate": 1569439361857, "mdate": null, "content": {"title": "Winning Privately: The Differentially Private Lottery Ticket Mechanism", "abstract": "We propose the differentially private lottery ticket mechanism (DPLTM). An end-to-end differentially private training paradigm based on the lottery ticket hypothesis. Using ``high-quality winners\", selected via our custom score function, DPLTM significantly outperforms state-of-the-art. We show that DPLTM converges faster, allowing for early stopping with reduced privacy budget consumption. We further show that the tickets from DPLTM are transferable across datasets, domains, and architectures. Our extensive evaluation on several public datasets provides evidence to our claims. "}}
{"id": "ryx_Y6EYwH", "cdate": 1569439104435, "mdate": null, "content": {"title": "Differentially Private Survival Function Estimation", "abstract": "Survival function estimation is used in many disciplines, but it is most common in medical analytics in the form of the Kaplan-Meier estimator. Sensitive data (patient records) is used in the estimation without any explicit control on the information leakage, which is a significant privacy concern. We propose a first differentially private estimator of the survival function and show that it can be easily extended to provide differentially private confidence intervals and test statistics without spending any extra privacy budget. We further provide extensions for differentially private estimation of the competing risk cumulative incidence function. Using nine real-life clinical datasets, we provide empirical evidence that our proposed method provides good utility while simultaneously providing strong privacy guarantees."}}
{"id": "Fe_7skjnvSz", "cdate": 1546300800000, "mdate": 1635435398658, "content": {"title": "Differentially Private Survival Function Estimation", "abstract": "Survival function estimation is used in many disciplines, but it is most common in medical analytics in the form of the Kaplan-Meier estimator. Sensitive data (patient records) is used in the estimation without any explicit control on the information leakage, which is a significant privacy concern. We propose a first differentially private estimator of the survival function and show that it can be easily extended to provide differentially private confidence intervals and test statistics without spending any extra privacy budget. We further provide extensions for differentially private estimation of the competing risk cumulative incidence function, Nelson-Aalen's estimator for the hazard function, etc. Using eleven real-life clinical datasets, we provide empirical evidence that our proposed method provides good utility while simultaneously providing strong privacy guarantees."}}
{"id": "YGqiOMOIqfY", "cdate": 1514764800000, "mdate": 1635435398644, "content": {"title": "Recovering Loss to Followup Information Using Denoising Autoencoders", "abstract": "Loss to followup is a significant issue in healthcare and has serious consequences for a study's validity and cost. Methods available at present for recovering loss to followup information are restricted by their expressive capabilities and struggle to model highly non-linear relations and complex interactions. In this paper we propose a model based on overcomplete denoising autoencoders to recover loss to followup information. Designed to work with high volume data, results on various simulated and real life datasets show our model is appropriate under varying dataset and loss to followup conditions and outperforms the state-of-the-art methods by a wide margin ($\\ge 20\\%$ in some scenarios) while preserving the dataset utility for final analysis."}}
{"id": "Mz5RF6vHpU", "cdate": 1514764800000, "mdate": 1635435398598, "content": {"title": "MIDA: Multiple Imputation Using Denoising Autoencoders", "abstract": "Missing data is a significant problem impacting all domains. State-of-the-art framework for minimizing missing data bias is multiple imputation, for which the choice of an imputation model remains nontrivial. We propose a multiple imputation model based on overcomplete deep denoising autoencoders. Our proposed model is capable of handling different data types, missingness patterns, missingness proportions and distributions. Evaluation on several real life datasets show our proposed model significantly outperforms current state-of-the-art methods under varying conditions while simultaneously improving end of the line analytics."}}
