{"id": "RWl461-Kaq", "cdate": 1683885758926, "mdate": null, "content": {"title": "An additive Gaussian process regression model for interpretable non-parametric analysis of longitudinal data", "abstract": "Biomedical research typically involves longitudinal study designs where samples from individuals are measured repeatedly over time and the goal is to identify risk factors (covariates) that are associated with an outcome value. General linear mixed effect models are the standard workhorse for statistical analysis of longitudinal data. However, analysis of longitudinal data can be complicated for reasons such as difficulties in modelling correlated outcome values, functional (time-varying) covariates, nonlinear and non-stationary effects, and model inference. We present LonGP, an additive Gaussian process regression model that is specifically designed for statistical analysis of longitudinal data, which solves these commonly faced challenges. LonGP can model time-varying random effects and non-stationary signals, incorporate multiple kernel learning, and provide interpretable results for the effects of individual covariates and their interactions. We demonstrate LonGP’s performance and accuracy by analysing various simulated and real longitudinal -omics datasets."}}
{"id": "U0x444dbvAg", "cdate": 1648707476432, "mdate": 1648707476432, "content": {"title": "SCAPE: a mixture model revealing single-cell polyadenylation diversity and cellular dynamics during cell differentiation and reprogramming", "abstract": "Alternative polyadenylation increases transcript diversities at the 3’ end, regulating biological processes including cell differentiation, embryonic development and cancer progression. Here, we present\na Bayesian method SCAPE, which enables de novo\nidentification and quantification of polyadenylation\n(pA) sites at single-cell level by utilizing insert size\ninformation. We demonstrated its accuracy and robustness and identified 31 558 sites from 36 mouse\norgans, 43.8% (13 807) of which were novel. We illustrated that APA isoforms were associated with\nmiRNAs binding and regulated in tissue-, cell typeand tumor-specific manners where no difference was\nfound at gene expression level, providing an extra\nlayer of information for cell clustering. Furthermore,\nwe found genome-wide dynamic changes of APA usage during erythropoiesis and induced pluripotent\nstem cell (iPSC) differentiation, suggesting APA contributes to the functional flexibility and diversity of\nsingle cells. We expect SCAPE to aid the analyses of\ncellular dynamics and diversities in health and disease."}}
{"id": "hzzd1NGfgcH", "cdate": 1620633581395, "mdate": null, "content": {"title": "Bayesian estimation of bacterial community composition from 454 sequencing data ", "abstract": "Estimating bacterial community composition from a mixed sample in different applied contexts is an important task for many microbiologists. The bacterial community composition is commonly estimated by clustering polymerase chain reaction amplified 16S rRNA gene sequences. Current taxonomy-independent clustering methods for analyzing these sequences, such as UCLUST, ESPRIT-Tree and CROP, have two limitations: (i) expert knowledge is needed, i.e. a difference cutoff between species needs to be specified; (ii) closely related species cannot be separated. The first limitation imposes a burden on the user, since considerable effort is needed to select appropriate parameters, whereas the second limitation leads to an inaccurate description of the underlying bacterial community composition. We propose a probabilistic model-based method to estimate bacterial community composition which tackles these limitations. Our method requires very little expert knowledge, where only the possible maximum number of clusters needs to be specified. Also our method demonstrates its ability to separate closely related species in two experiments, in spite of sequencing errors and individual variations."}}
{"id": "2VDfd025kDt", "cdate": 1620633502896, "mdate": null, "content": {"title": "Genomic monitoring of SARS-CoV-2 uncovers an Nsp1 deletion variant that modulates type I interferon response", "abstract": "The SARS-CoV-2 virus, the causative agent of COVID-19, is undergoing constant mutation. Here, we utilized an integrative approach combining epidemiology, virus genome sequencing, clinical phenotyping, and experimental validation to locate mutations of clinical importance. We identified 35 recurrent variants, some of which are associated with clinical phenotypes related to severity. One variant, containing a deletion in the Nsp1-coding region (Δ500-532), was found in more than 20% of our sequenced samples and associates with higher RT-PCR cycle thresholds and lower serum IFN-β levels of infected patients. Deletion variants in this locus were found in 37 countries worldwide, and viruses isolated from clinical samples or engineered by reverse genetics with related deletions in Nsp1 also induce lower IFN-β responses in infected Calu-3 cells. Taken together, our virologic surveillance characterizes recurrent genetic diversity and identified mutations in Nsp1 of biological and clinical importance, which collectively may aid molecular diagnostics and drug design.\n\n"}}
{"id": "kSKRIsWf72G", "cdate": 1620633382614, "mdate": null, "content": {"title": "An additive Gaussian process regression model for interpretable non-parametric analysis of longitudinal data", "abstract": "Biomedical research typically involves longitudinal study designs where samples from individuals are measured repeatedly over time and the goal is to identify risk factors (covariates) that are associated with an outcome value. General linear mixed effect models are the standard workhorse for statistical analysis of longitudinal data. However, analysis of longitudinal data can be complicated for reasons such as difficulties in modelling correlated outcome values, functional (time-varying) covariates, nonlinear and non-stationary effects, and model inference. We present LonGP, an additive Gaussian process regression model that is specifically designed for statistical analysis of longitudinal data, which solves these commonly faced challenges. LonGP can model time-varying random effects and non-stationary signals, incorporate multiple kernel learning, and provide interpretable results for the effects of individual covariates and their interactions. We demonstrate LonGP’s performance and accuracy by analysing various simulated and real longitudinal -omics datasets.\n\n"}}
{"id": "4PgDL-UlYZ", "cdate": 1620633290291, "mdate": null, "content": {"title": "Hierarchical and spatially explicit clustering of DNA sequences with BAPS software", "abstract": "Phylogeographical analyses have become commonplace for a myriad of organisms with the advent of cheap DNA sequencing technologies. Bayesian model-based clustering is a powerful tool for detecting important patterns in such data and can be used to decipher even quite subtle signals of systematic differences in molecular variation. Here, we introduce two upgrades to the Bayesian Analysis of Population Structure (BAPS) software, which enable 1) spatially explicit modeling of variation in DNA sequences and 2) hierarchical clustering of DNA sequence data to reveal nested genetic population structures. We provide a direct interface to map the results from spatial clustering with Google Maps using the portal http://www.spatialepidemiology.net/ and illustrate this approach using sequence data from Borrelia burgdorferi. The usefulness of hierarchical clustering is demonstrated through an analysis of the …"}}
