{"id": "1LeLyB6T0JM", "cdate": 1677713825970, "mdate": null, "content": {"title": "MARKOVIAN EMBEDDINGS FOR COALITIONAL BARGAINING GAMES", "abstract": "We examine the Markovian properties of coalition bargaining games, in particular, the case where past rejected proposals cannot be repeated. We propose a Markovian embedding with filtrations to render the sates Markovian and thus, fit into the framework of stochastic games.\n"}}
{"id": "OaZktJBVpUy", "cdate": 1677713797301, "mdate": null, "content": {"title": "MULTI-AGENT REINFORCEMENT LEARNING FOR COALITIONAL BARGAINING GAMES", "abstract": "In recent years, there has been growing attention to the application of MARL to coalition formation problems, in particular, on coalitional bargaining games as a means of negotiation. However, the lack of theoretical principles for using MARL in coalitional bargaining games remain less explored. This paper aims to address this gap by providing an examination of the theoretical link between coalition formation, coalitional bargaining games, and MARL through the link of stochastic games. Through this analysis, the paper seeks to shed light on the underlying principles that support the use of MARL in coalitional bargaining and to explore the contributions of this approach and its limitations in comparison to traditional game theoretical methods."}}
{"id": "BcgYj9kaeq", "cdate": 1646226080620, "mdate": null, "content": {"title": "Coalition Formation in Ridesharing with Walking Options", "abstract": "In this work, we introduce a novel coalition formation mechanism for ridesharing services. We extend on the current literature to integrate walking options within the trip, this allows us to effectively account for a user’s value of time when walk- ing, which is not negligible. Additionally, we propose a price allocation method that ensures proportionality for sharing the costs. We formally evaluate the effi- cacy of our pricing method and discuss its desirable properties. Our study is a step towards developing smart mobility systems that recommend optimal ridesharing coalitions to users and suggest cost allocations that are fair and stable."}}
{"id": "oL2ePgXnP6j", "cdate": 1640995200000, "mdate": 1681657161326, "content": {"title": "Comparison of CoModGANs, LaMa and GLIDE for Art Inpainting- Completing M.C Escher's Print Gallery", "abstract": "Digital art restoration has benefited from inpainting models to correct the degradation or missing sections of a painting. This work compares three current state-of-the art models for inpainting of large missing regions. We provide qualitative and quantitative comparison of the performance by CoModGANs, LaMa and GLIDE in inpainting of blurry and missing sections of images. We use Escher's incomplete painting Print Gallery as our test study since it presents several of the challenges commonly present in restorative inpainting."}}
{"id": "kYwOLP0A2eZ", "cdate": 1640995200000, "mdate": 1681657161326, "content": {"title": "A Proportional Pricing Mechanism for Ridesharing Services with Meeting Points", "abstract": "Ridesharing is a promising approach for reducing congestion and pollution, and many variants have been studied in the literature over the past decades. In this paper, we consider a novel setting where individuals walk to a common pick-up point and ride together to a single drop-off point from where they walk to their final destination. This setting requires finding the optimal composition of riders and pick-up and drop-off meeting points, as well as an equitable distribution of the costs whereby riders are incentivised to participate. Based on game-theoretic principles, we propose a methodology to determine the optimal pick-up and drop-off points, together with a cost allocation method that is equitable in the sense that it ensures proportionality for sharing the costs, i.e., those who walk more should pay less. We present a formal evaluation of our cost allocation method and empirical evaluation against the Shapley value using real-world and simulated data. Our results show that our approach is computationally more tractable than the Shapley value, as it is linear in time while guaranteeing individual rationality under certain conditions."}}
{"id": "dtPNKpiMcG", "cdate": 1640995200000, "mdate": 1681657161326, "content": {"title": "Comparison of CoModGANs, LaMa and GLIDE for Art Inpainting Completing M.C Escher's Print Gallery", "abstract": "Digital art restoration has benefited from inpainting models to correct the degradation or missing sections of a painting. This work compares three current state-of-the art models for inpainting of large missing regions. We provide qualitative and quantitative comparison of the performance by CoModGANs, LaMa and GLIDE in inpainting of blurry and missing sections of images. We use Escher’s incomplete painting Print Gallery as our test study since it presents several of the challenges commonly present in restorative inpainting."}}
{"id": "1LJJiBBdfLG", "cdate": 1631641427244, "mdate": null, "content": {"title": "Multi-agent reinforcement learning algorithm performance in unfamiliar domains", "abstract": "Reinforcement learning (RL) has been shown to be able to generate effective (even super-human) agents to play games such as Go and Starcraft. Dstl would like to investigate RL in the context of games that are relevant in the defence sphere, and in particular whether RL can provide solutions which are adaptable to changes in the configuration o f the game. The aim of this DSG is thus to investigate the effectiveness of RL techniques when the rules of the game change between the training phase and the deployment phase."}}
{"id": "XoIGIw1FzC", "cdate": 1609459200000, "mdate": 1681657161326, "content": {"title": "Image In painting Applied to Art Completing Escher's Print Gallery", "abstract": "This extended abstract presents the first stages of a research on in-painting suited for art reconstruction. We introduce M.C Eschers Print Gallery lithography as a use case example. This artwork presents a void on its center and additionally, it follows a challenging mathematical structure that needs to be preserved by the in-painting method. We present our work so far and our future line of research."}}
