{"id": "kxXorBW1mBC", "cdate": 1640995200000, "mdate": 1664951140966, "content": {"title": "d3p - A Python Package for Differentially-Private Probabilistic Programming", "abstract": ""}}
{"id": "07JvsF3MTxz", "cdate": 1640995200000, "mdate": 1673268049025, "content": {"title": "DPVIm: Differentially Private Variational Inference Improved", "abstract": ""}}
{"id": "0UzEWZpGqcg", "cdate": 1609459200000, "mdate": null, "content": {"title": "Tight Differential Privacy for Discrete-Valued Mechanisms and for the Subsampled Gaussian Mechanism Using FFT", "abstract": "We propose a numerical accountant for evaluating the tight (ε,δ)-privacy loss for algorithms with discrete one dimensional output. The method is based on the privacy loss distribution formalism and it uses the recently introduced fast Fourier transform based accounting technique. We carry out an error analysis of the method in terms of moment bounds of the privacy loss distribution which leads to rigorous lower and upper bounds for the true (ε,δ)-values. As an application, we present a novel approach to accurate privacy accounting of the subsampled Gaussian mechanism. This completes the previously proposed analysis by giving strict lower and upper bounds for the privacy parameters. We demonstrate the performance of the accountant on the binomial mechanism and show that our approach allows decreasing noise variance up to 75 percent at equal privacy compared to existing bounds in the literature. We also illustrate how to compute tight bounds for the exponential mechanism applied to counting queries."}}
{"id": "8IdiJGvT0K", "cdate": 1483228800000, "mdate": 1684134219734, "content": {"title": "On the importance of monitoring and directing progress in AI", "abstract": "This essay argues that the speed with which AI development proceeds will be an important factor for a beneficial adoption and thus should be closely monitored and controlled, if necessary. It also discusses privacy and manipulation, inequality of access and (value learning) superintelligence as major issues for all development trajectories."}}
