{"id": "kByF3V_izY", "cdate": 1609459200000, "mdate": 1667440013819, "content": {"title": "One-shot learning of paired associations by a reservoir computing model with Hebbian plasticity", "abstract": "One-shot learning can be achieved by algorithms and animals, but how the latter do it is poorly understood as most of the algorithms are not biologically plausible. Experiments studying one-shot learning in rodents have shown that after initial gradual learning of associations between cues and locations, new associations can be learned with just a single exposure to each new cue-location pair. Foster, Morris and Dayan (2000) developed a hybrid temporal difference - symbolic model that exhibited one-shot learning for dead reckoning to displaced single locations. While the temporal difference rule for learning the agent's actual coordinates was biologically plausible, the model's symbolic mechanism for learning target coordinates was not, and one-shot learning for multiple target locations was not addressed. Here we extend the model by replacing the symbolic mechanism with a reservoir of recurrently connected neurons resembling cortical microcircuitry. Biologically plausible learning of target coordinates was achieved by subjecting the reservoir's output weights to synaptic plasticity governed by a novel 4-factor variant of the exploratory Hebbian (EH) rule. As with rodents, the reservoir model exhibited one-shot learning for multiple paired associations."}}
{"id": "FPsKoLZfyV", "cdate": 1609459200000, "mdate": 1667440013819, "content": {"title": "A nonlinear hidden layer enables actor-critic agents to learn multiple paired association navigation", "abstract": "Navigation to multiple cued reward locations has been increasingly used to study rodent learning. Though deep reinforcement learning agents have been shown to be able to learn the task, they are not biologically plausible. Biologically plausible classic actor-critic agents have been shown to learn to navigate to single reward locations, but which biologically plausible agents are able to learn multiple cue-reward location tasks has remained unclear. In this computational study, we show versions of classic agents that learn to navigate to a single reward location, and adapt to reward location displacement, but are not able to learn multiple paired association navigation. The limitation is overcome by an agent in which place cell and cue information are first processed by a feedforward nonlinear hidden layer with synapses to the actor and critic subject to temporal difference error-modulated plasticity. Faster learning is obtained when the feedforward layer is replaced by a recurrent reservoir network."}}
