{"id": "Mp-RSZHHJUF", "cdate": 1680192411846, "mdate": 1680192411846, "content": {"title": "Bayes-optimal limits in structured PCA, and how to reach them", "abstract": "We study the paradigmatic spiked matrix model of principal components analysis, where the rank-one signal is corrupted by additive noise. While the noise is typically taken from a Wigner matrix with independent entries, here the potential acting on the eigenvalues has a quadratic plus a quartic component. The quartic term induces strong correlations between the matrix elements, which makes the setting relevant for applications but analytically challenging. Our work provides the first characterization of the Bayes-optimal limits for inference in this model with structured noise. If the signal prior is rotational-invariant, then we show that a spectral estimator is optimal. In contrast, for more general priors, the existing approximate message passing algorithm (AMP) falls short of achieving the information-theoretic limits, and we provide a justification for this sub-optimality. Finally, by generalizing the theory of Thouless-Anderson-Palmer equations, we cure the issue by proposing a novel AMP which matches the theoretical limits. Our information-theoretic analysis is based on the replica method, a powerful heuristic from statistical mechanics; instead, the novel AMP comes with a rigorous state evolution analysis tracking its performance in the high-dimensional limit. Even if we focus on a specific noise distribution, our methodology can be generalized to a wide class of trace ensembles, at the cost of more involved expressions. "}}
{"id": "Ns99MqEsw7", "cdate": 1672139322341, "mdate": 1672139322341, "content": {"title": "Generalized Probabilities in Statistical Theories", "abstract": "We discuss different formal frameworks for the description of generalized probabilities in statistical theories. We analyze the particular cases of probabilities appearing in classical and quantum mechanics and the approach to generalized probabilities based on convex sets. We argue for considering quantum probabilities as the natural probabilistic assignments for rational agents dealing with contextual probabilistic models. In this way, the formal structure of quantum probabilities as a non-Boolean probabilistic calculus is endowed with a natural interpretation."}}
{"id": "t2LT22E6Xih", "cdate": 1672139184168, "mdate": 1672139184168, "content": {"title": "Exact asymptotic characterisation of running time for approximate gradient descent on random graphs", "abstract": "In this work we study the time complexity for the search of local minima in random graphs whose vertices have i.i.d. cost values. We show that, for Erdos-Renyi graphs with connection probability given by a family of local algorithms that approximate a gradient descent find local minima faster than the full gradient descent. Furthermore, we find a probabilistic representation for the running time of these algorithms leading to asymptotic estimates of the mean running times."}}
{"id": "pREPcMCX2F", "cdate": 1672139110072, "mdate": 1672139110072, "content": {"title": "Bayes-optimal limits in structured PCA, and how to reach them", "abstract": "We study the paradigmatic spiked matrix model of principal components analysis, where the rank-one signal is corrupted by additive noise. While the noise is typically taken from a Wigner matrix with independent entries, here the potential acting on the eigenvalues has a quadratic plus a quartic component. The quartic term induces strong correlations between the matrix elements, which makes the setting relevant for applications but analytically challenging. Our work provides the first characterization of the Bayes-optimal limits for inference in this model with structured noise. If the signal prior is rotational-invariant, then we show that a spectral estimator is optimal. In contrast, for more general priors, the existing approximate message passing algorithm (AMP) falls short of achieving the information-theoretic limits, and we provide a justification for this sub-optimality. Finally, by generalizing the theory of Thouless-Anderson-Palmer equations, we cure the issue by proposing a novel AMP which matches the theoretical limits. Our information-theoretic analysis is based on the replica method, a powerful heuristic from statistical mechanics; instead, the novel AMP comes with a rigorous state evolution analysis tracking its performance in the high-dimensional limit. Even if we focus on a specific noise distribution, our methodology can be generalized to a wide class of trace ensembles, at the cost of more involved expressions."}}
{"id": "H1oSfee1aL", "cdate": 1672139006235, "mdate": 1672139006235, "content": {"title": "Marginals of a spherical spin glass model with correlated disorder", "abstract": "In this paper we prove the weak convergence, in the high-temperature phase, of the finite marginals of the Gibbs measure associated to a symmetric spherical spin glass model with correlated couplings towards an explicit asymptotic decoupled measure. We also provide upper bounds for the rate of convergence in terms of the one of the energy per variable. Furthermore, we establish a concentration inequality for bounded functions in a subset of the high-temperature phase. These results are exemplified by analysing the asymptotic behaviour of the empirical mean of coordinate-wise functions of samples from the Gibbs measure of the model."}}
{"id": "Q13D8QVaR6", "cdate": 1672138929871, "mdate": 1672138929871, "content": {"title": "Degree-Greedy Algorithms on Large Random Graphs", "abstract": "Computing the size of maximum independent sets is an NP-hard problem for fixed graphs. Characterizing and designing efficient algorithms to compute (or approximate) this independence number for random graphs are notoriously difficult and still largely open issues. In this paper, we show that a low complexity degree-greedy exploration is actually asymptotically optimal on a large class of sparse random graphs. Encouraged by this result, we present and study two variants of sequential exploration algorithms: static and dynamic degree-aware explorations. We derive hydrodynamic limits for both of them, which in turn allow us to compute the size of the resulting independent set. Whereas the former is simpler to compute, the latter may be used to arbitrarily approximate the degree-greedy algorithm. Both can be implemented in a distributed manner. The corresponding hydrodynamic limits constitute an efficient method to compute or bound the independence number for a large class of sparse random graphs. As an application, we then show how our method may be used to compute (or approximate) the capacity of a large 802.11-based wireless network."}}
{"id": "9J3TgG7KPK", "cdate": 1672138799879, "mdate": 1672138799879, "content": {"title": "Strong replica symmetry for high-dimensional disordered log-concave Gibbs measures", "abstract": "We consider a generic class of log-concave, possibly random, (Gibbs) measures. We prove the concentration of an infinite family of order parameters called multioverlaps. Because they completely parametrize the quenched Gibbs measure of the system, this implies a simple representation of the asymptotic Gibbs measures, as well as the decoupling of the variables in a strong sense. These results may prove themselves useful in several contexts. In particular in machine learning and high-dimensional inference, log-concave measures appear in convex empirical risk minimization, maximum a-posteriori inference or M-estimation. We believe that they may be applicable in establishing some type of ‘replica symmetric formulas’ for the free energy, inference or generalization error in such settings."}}
{"id": "FdxHDQxmpOY", "cdate": 1672138690065, "mdate": 1672138690065, "content": {"title": "A discussion on the origin of quantum probabilities", "abstract": "We study the origin of quantum probabilities as arising from non-Boolean propositional-operational structures. We apply the method developed by Cox to non distributive lattices and develop an alternative formulation of non-Kolmogorovian probability measures for quantum mechanics. By generalizing the method presented in previous works, we outline a general framework for the deduction of probabilities in general propositional structures represented by lattices (including the non-distributive case)."}}
{"id": "H5mAlsT25Jx", "cdate": 1672138587702, "mdate": 1672138587702, "content": {"title": "Natural information measures in Cox' approach for contextual probabilistic theories", "abstract": "In this article we provide, from a novel perspective, arguments that support the idea that, in the wake of Cox' approach to probability theory, von Neumann's entropy should be the natural one in Quantum Mechanics. We also generalize the pertinent reasoning to more general orthomodular lattices, which reveals the structure of a general non-Boolean information theory."}}
{"id": "cmdmI_9fwJ", "cdate": 1672138249122, "mdate": 1672138249122, "content": {"title": "Performance of Bayesian linear regression in a model with mismatch", "abstract": "For a model of high-dimensional linear regression with random design, we analyze the performance of an estimator given by the mean of a log-concave Bayesian posterior distribution with gaussian prior. The model is mismatched in the following sense: like the model assumed by the statistician, the labels-generating process is linear in the input data, but both the classifier ground-truth prior and gaussian noise variance are unknown to her. This inference model can be rephrased as a version of the Gardner model in spin glasses and, using the cavity method, we provide fixed point equations for various overlap order parameters, yielding in particular an expression for the mean-square reconstruction error on the classifier (under an assumption of uniqueness of solutions). As a direct corollary we obtain an expression for the free energy. Similar models have already been studied by Shcherbina and Tirozzi and by Talagrand, but our arguments are more straightforward and some assumptions are relaxed. An interesting consequence of our analysis is that in the random design setting of ridge regression, the performance of the posterior mean is independent of the noise variance (or \"temperature\") assumed by the statistician, and matches the one of the usual (zero temperature) ridge estimator."}}
