{"id": "rWPQnTubL1u", "cdate": 1679902220365, "mdate": 1679902220365, "content": {"title": "Deep Graph Networks for Drug Repurposing with Multi-Protein Targets", "abstract": "In the early phases of the COVID-19 pandemic, repurposing of drugs approved for use in other diseases helped counteract the aggressiveness of the virus. Therefore, the availability of effective and flexible methodologies to speed up and prioritize the repurposing process is fundamental to tackle present and future challenges to worldwide health. This work addresses the problem of drug repurposing through the lens of deep learning for graphs, by designing an architecture that exploits both structural and biological information to propose a reduced set of drugs that may be effective against an unknown disease. Our main contribution is a method to repurpose a drug against multiple proteins, rather than the most common single-drug/single-protein setting. The method leverages graph embeddings to encode the relevant proteins' and drugs' information based on gene ontology data and structural similarities. Finally, we publicly release a comprehensive and unified data repository for graph-based analysis to foster further studies on COVID-19 and drug repurposing. We empirically validate the proposed approach in a general drug repurposing setting, showing that it generalizes better than single protein repurposing schemes. We conclude the manuscript with an exemplified application of our method to the COVID-19 use case. All source code is publicly available."}}
{"id": "u5DSF1Eyyen", "cdate": 1620345130309, "mdate": null, "content": {"title": "Prediction of dynamical properties of biochemical pathways with Graph Neural Networks", "abstract": "Biochemical pathways are often represented as graphs, in which nodes and edges give a qualitative description of the modeled reactions, while node and edge labels provide quantitative details such as kinetic and stoichiometric parameters. Dynamical properties of biochemical pathways are usually assessed by performing numerical (ODE-based) or stochastic simulations in which quantitative parameters are essential. These simulation methods are often computationally very expensive, in particular when property assessment requires varying parameters such as initial concentrations of molecules. In this paper we propose the use of a Deep Neural Network (DNN) to predict such dynamical properties relying only on the graph structure. In particular, our model is based on Graph Neural Networks. We focus on the dynamical property of concentration robustness, which is the ability of the pathway to maintain the concentration of some molecules within certain intervals despite of perturbation in the initial concentration of other molecules. The use of DNNs can allow robustness to be predicted by avoiding the burden of performing a huge number of numerical or stochastic simulations. Moreover, once trained, the model could be applied to predicting robustness properties for pathways in which quantitative parameters are not available.\n"}}
{"id": "QMcCU_hQGps", "cdate": 1620344999553, "mdate": null, "content": {"title": "Edge-based sequential graph generation with recurrent neural networks", "abstract": "Graph generation with Machine Learning is an open problem with applications in various research fields. In this work, we propose to cast the generative process of a graph into a sequential one, relying on a node ordering procedure. We use this sequential process to design a novel generative model composed of two recurrent neural networks that learn to predict the edges of graphs: the first network generates one endpoint of each edge, while the second network generates the other endpoint conditioned on the state of the first. We test our approach extensively on five different datasets, comparing with two well-known baselines coming from graph literature, and two recurrent approaches, one of which holds state of the art performances. Evaluation is conducted considering quantitative and qualitative characteristics of the generated samples. Results show that our approach is able to yield novel, and unique graphs originating from very different distributions while retaining structural properties very similar to those in the training sample. Under the proposed evaluation framework, our approach is able to reach performances comparable to the current state of the art on the graph generation task."}}
{"id": "Cj8fFigXiEg", "cdate": 1620344959367, "mdate": null, "content": {"title": "A gentle introduction to deep learning for graphs", "abstract": "The adaptive processing of graph data is a long-standing research topic that has been lately consolidated as a theme of major interest in the deep learning community. The snap increase in the amount and breadth of related research has come at the price of little systematization of knowledge and attention to earlier literature. This work is a tutorial introduction to the field of deep learning for graphs. It favors a consistent and progressive presentation of the main concepts and architectural aspects over an exposition of the most recent literature, for which the reader is referred to available surveys. The paper takes a top-down view of the problem, introducing a generalized formulation of graph representation learning based on a local and iterative approach to structured information processing. Moreover, it introduces the basic building blocks that can be combined to design novel and effective neural models for graphs. We complement the methodological exposition with a discussion of interesting research challenges and applications in the field."}}
{"id": "ijmSGAf5Vy9", "cdate": 1620344872802, "mdate": null, "content": {"title": "A Deep Generative Model for Fragment-Based Molecule Generation", "abstract": "Molecule generation is a challenging open problem in cheminformatics. Currently, deep generative approaches addressing the challenge belong to two broad categories, differing in how molecules are represented. One approach encodes molecular graphs as strings of text, and learns their corresponding character-based language model. Another, more expressive, approach operates directly on the molecular graph. In this work, we address two limitations of the former: generation of invalid and duplicate molecules. To improve validity rates, we develop a language model for small molecular substructures called fragments, loosely inspired by the well-known paradigm of Fragment-Based Drug Design. In other words, we generate molecules fragment by fragment, instead of atom by atom. To improve uniqueness rates, we present a frequency-based masking strategy that helps generate molecules with infrequent fragments. We show experimentally that our model largely outperforms other language model-based competitors, reaching state-of-the-art performances typical of graph-based approaches. Moreover, generated molecules display molecular properties similar to those in the training sample, even in absence of explicit task-specific supervision."}}
{"id": "vy1FXwUwnHB", "cdate": 1609459200000, "mdate": 1660125967917, "content": {"title": "GraphGen-Redux: a Fast and Lightweight Recurrent Model for labeled Graph Generation", "abstract": "The problem of labeled graph generation is gaining attention in the Deep Learning community. The task is challenging due to the sparse and discrete nature of graph spaces. Several approaches have been proposed in the literature, most of which require to transform the graphs into sequences that encode their structure and labels and to learn the distribution of such sequences through an auto-regressive generative model. Among this family of approaches, we focus on the GraphGen model. The preprocessing phase of GraphGen transforms graphs into unique edge sequences called Depth-First Search (DFS) codes, such that two isomorphic graphs are assigned the same DFS code. Each element of a DFS code is associated with a graph edge: specifically, it is a quintuple comprising one node identifier for each of the two endpoints, their node labels, and the edge label. GraphGen learns to generate such sequences auto-regressively and models the probability of each component of the quintuple independently. While effective, the independence assumption made by the model is too loose to capture the complex label dependencies of real-world graphs precisely. By introducing a novel graph preprocessing approach, we are able to process the labeling information of both nodes and edges jointly. The corresponding model, which we term GraphGen-Redux, improves upon the generative performances of GraphGen in a wide range of datasets of chemical and social graphs. In addition, it uses approximately 78% fewer parameters than the vanilla variant and requires 50% fewer epochs of training on average."}}
{"id": "qY6LGW8HaQ", "cdate": 1609459200000, "mdate": 1660125967879, "content": {"title": "Graphgen-redux: a Fast and Lightweight Recurrent Model for labeled Graph Generation", "abstract": "The problem of labeled graph generation is gaining attention in the Deep Learning community. The task is challenging due to the sparse and discrete nature of graph spaces. Several approaches have been proposed in the literature, most of which require to transform the graphs into sequences that encode their structure and labels and to learn the distribution of such sequences through an auto-regressive generative model. Among this family of approaches, we focus on the Graphgen model. The preprocessing phase of Graphgen transforms graphs into unique edge sequences called Depth-First Search (DFS) codes, such that two isomorphic graphs are assigned the same DFS code. Each element of a DFS code is associated with a graph edge: specifically, it is a quintuple comprising one node identifier for each of the two endpoints, their node labels, and the edge label. Graphgen learns to generate such sequences auto-regressively and models the probability of each component of the quintuple independently. While effective, the independence assumption made by the model is too loose to capture the complex label dependencies of real-world graphs precisely. By introducing a novel graph preprocessing approach, we are able to process the labeling information of both nodes and edges jointly. The corresponding model, which we term Graphgen-redux, improves upon the generative performances of Graphgen in a wide range of datasets of chemical and social graphs. In addition, it uses approximately 78&#x0025; fewer parameters than the vanilla variant and requires 50&#x0025; fewer epochs of training on average."}}
{"id": "qN9y8Xa1YLW", "cdate": 1609459200000, "mdate": 1695975811150, "content": {"title": "Deep Learning on Graphs with Applications to the Life Sciences", "abstract": "The application of Deep Learning models to complex biological problems has recently revolutionized the field of the life sciences, leading to advancements that could potentially change the quality and length of human life for the better. A significant contribution to this success comes from the ability of deep neural networks to well approximate non-linear biological functions and their flexibility to learn from structured biological data directly. This thesis presents two relevant applications where Deep Learning is used on biological graphs to learn complex tasks. The first concerns the prediction of dynamical properties of chemical reactions at the cellular level represented as Petri graphs. Our contribution is a Deep Learning model that can learn the task solely relying on the structure of such graphs, which is orders of magnitude faster than running expensive simulations. The second application is about accelerating the drug design process by discovering novel drug candidates. We present a deep and generative framework in which novel graphs, corresponding to molecules with desired characteristics, can be obtained by combining chemically meaningful molecular fragments. Our work suggests that coupling the power of Deep Learning with the ability to handle structured data remains one of the preferred avenues to pursue towards solving well-known biological problems, as well as an effective methodology to tackle new ones."}}
{"id": "z9qnqwAvhaQ", "cdate": 1577836800000, "mdate": 1660125967936, "content": {"title": "Edge-based sequential graph generation with recurrent neural networks", "abstract": ""}}
{"id": "Zq43obnakqx", "cdate": 1577836800000, "mdate": 1660125967955, "content": {"title": "Biochemical Pathway Robustness Prediction with Graph Neural Networks", "abstract": ""}}
