{"id": "w-4_rLSGfWq", "cdate": 1672531200000, "mdate": 1683894461903, "content": {"title": "Wearable Sensor-based Multimodal Physiological Responses of Socially Anxious Individuals across Social Contexts", "abstract": "Correctly identifying an individual's social context from passively worn sensors holds promise for delivering just-in-time adaptive interventions (JITAIs) to treat social anxiety disorder. In this study, we present results using passively collected data from a within-subject experiment that assessed physiological response across different social contexts (i.e, alone vs. with others), social phases (i.e., pre- and post-interaction vs. during an interaction), social interaction sizes (i.e., dyadic vs. group interactions), and levels of social threat (i.e., implicit vs. explicit social evaluation). Participants in the study ($N=46$) reported moderate to severe social anxiety symptoms as assessed by the Social Interaction Anxiety Scale ($\\geq$34 out of 80). Univariate paired difference tests, multivariate random forest models, and follow-up cluster analyses were used to explore physiological response patterns across different social and non-social contexts. Our results suggest that social context is more reliably distinguishable than social phase, group size, or level of social threat, but that there is considerable variability in physiological response patterns even among these distinguishable contexts. Implications for real-world context detection and deployment of JITAIs are discussed."}}
{"id": "gB4p4T3vki", "cdate": 1672531200000, "mdate": 1681670358920, "content": {"title": "Infinite Action Contextual Bandits with Reusable Data Exhaust", "abstract": "For infinite action contextual bandits, smoothed regret and reduction to regression results in state-of-the-art online performance with computational cost independent of the action set: unfortunately, the resulting data exhaust does not have well-defined importance-weights. This frustrates the execution of downstream data science processes such as offline model selection. In this paper we describe an online algorithm with an equivalent smoothed regret guarantee, but which generates well-defined importance weights: in exchange, the online computational cost increases, but only to order smoothness (i.e., still independent of the action set). This removes a key obstacle to adoption of smoothed regret in production scenarios."}}
{"id": "PU09UXLUw_", "cdate": 1672531200000, "mdate": 1683894461902, "content": {"title": "Personalized State Anxiety Detection: An Empirical Study with Linguistic Biomarkers and A Machine Learning Pipeline", "abstract": "Individuals high in social anxiety symptoms often exhibit elevated state anxiety in social situations. Research has shown it is possible to detect state anxiety by leveraging digital biomarkers and machine learning techniques. However, most existing work trains models on an entire group of participants, failing to capture individual differences in their psychological and behavioral responses to social contexts. To address this concern, in Study 1, we collected linguistic data from N=35 high socially anxious participants in a variety of social contexts, finding that digital linguistic biomarkers significantly differ between evaluative vs. non-evaluative social contexts and between individuals having different trait psychological symptoms, suggesting the likely importance of personalized approaches to detect state anxiety. In Study 2, we used the same data and results from Study 1 to model a multilayer personalized machine learning pipeline to detect state anxiety that considers contextual and individual differences. This personalized model outperformed the baseline F1-score by 28.0%. Results suggest that state anxiety can be more accurately detected with personalized machine learning approaches, and that linguistic biomarkers hold promise for identifying periods of state anxiety in an unobtrusive way."}}
{"id": "wGvzQWFyUB", "cdate": 1663850394342, "mdate": null, "content": {"title": "Personalized Reward Learning with Interaction-Grounded Learning (IGL)", "abstract": "In an era of countless content offerings, recommender systems alleviate information overload by providing users with personalized content suggestions. Due to the scarcity of explicit user feedback, modern recommender systems typically optimize for the same fixed combination of implicit feedback signals across all users. However, this approach disregards a growing body of work highlighting that (i) implicit signals can be used by users in diverse ways, signaling anything from satisfaction to active dislike, and (ii) different users communicate preferences in different ways. We propose applying the recent Interaction Grounded Learning (IGL) paradigm to address the challenge of learning representations of diverse user communication modalities. Rather than requiring a fixed, human-designed reward function, IGL is able to learn personalized reward functions for different users and then optimize directly for the latent user satisfaction. We demonstrate the success of IGL with experiments using simulations as well as with real-world production traces.\n"}}
{"id": "1DOS0kifqeP", "cdate": 1663850204966, "mdate": null, "content": {"title": "Eigen Memory Trees", "abstract": "This work introduces the Eigen Memory Tree (EMT), a novel online memory model for sequential learning scenarios. EMTs store data at the leaves of a binary tree, and route new samples through the structure using the principal components of previous experiences, facilitating efficient (logarithmic) access to relevant memories. We demonstrate that EMT outperforms existing online memory approaches, and provide a hybridized EMT-parametric algorithm that enjoys drastically improved performance over purely parametric methods with nearly no downsides. Our findings are validated using 206 datasets from OpenML repository in both bounded and infinite memory budget situations. "}}
{"id": "Rk_mEzrHTC6", "cdate": 1640995200000, "mdate": 1683894461897, "content": {"title": "Personalized Reward Learning with Interaction-Grounded Learning (IGL)", "abstract": "In an era of countless content offerings, recommender systems alleviate information overload by providing users with personalized content suggestions. Due to the scarcity of explicit user feedback, modern recommender systems typically optimize for the same fixed combination of implicit feedback signals across all users. However, this approach disregards a growing body of work highlighting that (i) implicit signals can be used by users in diverse ways, signaling anything from satisfaction to active dislike, and (ii) different users communicate preferences in different ways. We propose applying the recent Interaction Grounded Learning (IGL) paradigm to address the challenge of learning representations of diverse user communication modalities. Rather than requiring a fixed, human-designed reward function, IGL is able to learn personalized reward functions for different users and then optimize directly for the latent user satisfaction. We demonstrate the success of IGL with experiments using simulations as well as with real-world production traces."}}
{"id": "KuehwL_cGOZ", "cdate": 1609459200000, "mdate": 1683894461995, "content": {"title": "Inverse Reinforcement Learning for Strategy Identification", "abstract": "In adversarial environments, one side could gain an advantage by identifying the opponent’s strategy. For example, in combat games, if an opponent’s strategy is identified as overly aggressive, one could lay a trap that exploits the opponent’s aggressive nature. However, an opponent’s strategy is not always apparent and may need to be estimated from observations of their actions. This paper proposes to use inverse reinforcement learning (IRL) to identify strategies in adversarial environments. Specifically, the contributions of this work are 1) the demonstration of this concept on gaming combat data generated from three pre-defined strategies and 2) the framework for using IRL to achieve strategy identification. The numerical experiments demonstrate that the recovered rewards can be identified using a variety of techniques including visual analysis, cluster analysis, and supervised classification."}}
{"id": "yxcA_KlNuZ", "cdate": 1577836800000, "mdate": 1683894461999, "content": {"title": "A Framework for Addressing the Risks and Opportunities In Al-Supported Virtual Health Coaches", "abstract": "Virtual coaching has rapidly evolved into a foundational component of modern clinical practice. At a time when healthcare professionals are in short supply and the demand for low-cost treatments is ever-increasing, virtual health coaches (VHCs) offer intervention-on-demand for those limited by finances or geographic access to care. More recently, AI-powered virtual coaches have become a viable complement to human coaches. However, the push for AI-powered coaching systems raises several important issues for researchers, designers, clinicians, and patients. In this paper, we present a novel framework to guide the design and development of virtual coaching systems. This framework augments a traditional data science pipeline with four key guiding goals: reliability, fairness, engagement, and ethics."}}
{"id": "HDmAiTPpmW", "cdate": 1577836800000, "mdate": 1683894461915, "content": {"title": "A Framework for Addressing the Risks and Opportunities In AI-Supported Virtual Health Coaches", "abstract": "Virtual coaching has rapidly evolved into a foundational component of modern clinical practice. At a time when healthcare professionals are in short supply and the demand for low-cost treatments is ever-increasing, virtual health coaches (VHCs) offer intervention-on-demand for those limited by finances or geographic access to care. More recently, AI-powered virtual coaches have become a viable complement to human coaches. However, the push for AI-powered coaching systems raises several important issues for researchers, designers, clinicians, and patients. In this paper, we present a novel framework to guide the design and development of virtual coaching systems. This framework augments a traditional data science pipeline with four key guiding goals: reliability, fairness, engagement, and ethics."}}
{"id": "a4CSCokXTi", "cdate": 1483228800000, "mdate": 1683894461903, "content": {"title": "Discovery of Behavioral Markers of Social Anxiety from Smartphone Sensor Data", "abstract": "Better understanding of an individual's smartphone use can help researchers to understand the relationship between behaviors and mental health, and ultimately improve methods for early detection, evaluation, and intervention. This relationship may be particularly significant for individuals with social anxiety, for whom stress from social interactions may arise repeatedly and unexpectedly over the course of a day. For this reason, we present an exploratory study of behavioral markers extracted from smartphone data. We examine fine-grained behaviors before and after smartphone communication events across social anxiety levels. To discover behavioral markers, we model the smartphone as a linear dynamical system with the accelerometer data as output. In a two-week study of 52 college students, we find substantially different behavioral markers prior to outgoing phone calls when comparing individuals with high and low social anxiety."}}
