{"id": "vYOGXML19sr", "cdate": 1664928777367, "mdate": null, "content": {"title": "Instance norm improves meta-learning in class-imbalanced land cover classification", "abstract": "Distribution shift is omnipresent in geographic data,  where various climatic and cultural factors lead to different representations across the globe. We aim to adapt dynamically to unseen data distributions with model-agnostic meta-learning, where data sampled from each distribution is seen as a task with only a few annotated samples. Transductive batch normalization layers are often employed in meta-learning models, as they reach the highest numerical accuracy on the class-balanced target tasks used as meta-learning benchmarks. In this work, we demonstrate empirically that transductive batch normalization collapses when deployed on a real class-imbalanced land cover classification problem. We propose a solution to replace batch normalization with instance normalization. This modification consistently outperformed all other normalization alternatives across different meta-learning algorithms in our class-imbalanced land cover classification test tasks."}}
{"id": "QQ6UVyyEeUA", "cdate": 1640995200000, "mdate": 1682319187919, "content": {"title": "Time Dependent Image Generation of Plants from Incomplete Sequences with CNN-Transformer", "abstract": "Data imputation of incomplete image sequences is an essential prerequisite for analyzing and monitoring all development stages of plants in precision agriculture. For this purpose, we propose a conditional Wasserstein generative adversarial network TransGrow that combines convolutions for spatial modeling and a transformer for temporal modeling, enabling time-dependent image generation of above-ground plant phenotypes. Thereby, we achieve the following advantages over comparable data imputation approaches: (1) The model is conditioned by an incomplete image sequence of arbitrary length, the input time points, and the requested output time point, allowing multiple growth stages to be generated in a targeted manner; (2) By considering a stochastic component and generating a distribution for each point in time, the uncertainty in plant growth is considered and can be visualized; (3) Besides interpolation, also test-extrapolation can be performed to generate future plant growth stages. Experiments based on two datasets of different complexity levels are presented: Laboratory single plant sequences with Arabidopsis thaliana and agricultural drone image sequences showing crop mixtures. When comparing TransGrow to interpolation in image space, variational, and adversarial autoencoder, it demonstrates significant improvements in image quality, measured by multi-scale structural similarity, peak signal-to-noise ratio, and Fréchet inception distance. To our knowledge, TransGrow is the first approach for time- and image-dependent, high-quality generation of plant images based on incomplete sequences."}}
{"id": "Q7BSbmgT8W", "cdate": 1640995200000, "mdate": 1682319188041, "content": {"title": "Humans are Poor Few-Shot Classifiers for Sentinel-2 Land Cover", "abstract": "Learning to predict accurately from a few data samples is a central challenge in modern data-hungry machine learning. On natural images, human vision typically outperforms deep learning approaches on few-shot learning. However, we hypothesize that aerial and satellite images are more challenging to the human eye. This applies particularly when the image resolution is comparatively low, as with the 10m ground sampling distance of Sentinel-2. In this study, we benchmark model-agnostic meta-learning (MAML) algorithms against human participants on few-shot land cover classification with Sentinel-2 imagery on the Sen12MS dataset. We find that categorization of land cover from globally distributed regions is a difficult task for the participants, who classified the given images less accurately than the MAML-trained model and with a highly variable success rate. This suggest that hand-labeling land cover directly on Sentinel-2 imagery is not optimal when tackling a new land cover classification problem. Labeling only a few images and employing a trained meta-learning model to this task may lead to more accurate and consistent solutions compared to hand labeling by multiple individuals."}}
{"id": "D2_5uV86av", "cdate": 1640995200000, "mdate": 1682319187924, "content": {"title": "Data-Driven Feature Learning with Discriminative Models for Satellite Time Series", "abstract": "Machine learning enables us to learn relationships from annotated datasets. This is useful in fields where finding an explicit mathematical model is difficult. The classification of agricultural field parcels from satellite image time series is such a field where feature learning can be used to accurately predict the crop type from available satellite data. This dissertation investigated what deep learning models and learning schemes are most effective when many and few labels are available."}}
{"id": "uUa4jNMLjrL", "cdate": 1629910090621, "mdate": null, "content": {"title": "DENETHOR: The DynamicEarthNET dataset for Harmonized, inter-Operable, analysis-Ready, daily crop monitoring from space", "abstract": "Recent advances in remote sensing products allow near-real time monitoring of the Earth’s surface. Despite increasing availability of near-daily time-series of satellite imagery, there has been little exploration of deep learning methods to utilize the unprecedented temporal density of observations. This is particularly interesting in crop monitoring where time-series remote sensing data has been used frequently to exploit phenological differences of crops in the growing cycle over time. In this work, we present DENETHOR: The DynamicEarthNET dataset for Harmonized, inter-Operabel, analysis-Ready, daily crop monitoring from space. Our dataset contains daily, analysis-ready Planet Fusion data together with Sentinel-1 radar and Sentinel-2 optical time-series for crop type classification in Northern Germany. Our baseline experiments underline that incorporating the available spatial and temporal information fully may not be straightforward and could require the design of tailored architectures. The dataset presents two main challenges to the community: Exploit the temporal dimension for improved crop classification and ensure that models can handle a domain shift to a different year."}}
{"id": "QubRUb9Fg6", "cdate": 1609459200000, "mdate": 1669114213297, "content": {"title": "DENETHOR: The DynamicEarthNET dataset for Harmonized, inter-Operable, analysis-Ready, daily crop monitoring from space", "abstract": "Recent advances in remote sensing products allow near-real time monitoring of the Earth’s surface. Despite increasing availability of near-daily time-series of satellite imagery, there has been little exploration of deep learning methods to utilize the unprecedented temporal density of observations. This is particularly interesting in crop monitoring where time-series remote sensing data has been used frequently to exploit phenological differences of crops in the growing cycle over time. In this work, we present DENETHOR: The DynamicEarthNET dataset for Harmonized, inter-Operabel, analysis-Ready, daily crop monitoring from space. Our dataset contains daily, analysis-ready Planet Fusion data together with Sentinel-1 radar and Sentinel-2 optical time-series for crop type classification in Northern Germany. Our baseline experiments underline that incorporating the available spatial and temporal information fully may not be straightforward and could require the design of tailored architectures. The dataset presents two main challenges to the community: Exploit the temporal dimension for improved crop classification and ensure that models can handle a domain shift to a different year."}}
{"id": "BFZa3w61var", "cdate": 1609459200000, "mdate": 1682319187995, "content": {"title": "InSAR Displacement Time Series Mining: A Machine Learning Approach", "abstract": "Interferometric Synthetic Aperture Radar (InSAR)-derived surface displacement time series enable a wide range of applications from urban structural monitoring to geohazard assessment. With systematic data acquisitions becoming the new norm for SAR missions, millions of time series are continuously generated. Machine Learning provides a framework for the efficient mining of such big data. Here, we focus on unsupervised mining of the data via clustering the similar temporal patterns and data-driven displacement signal reconstruction from the InSAR time series. We propose a deep Long Short Term Memory (LSTM) autoencoder model which can exploit temporal relations in contrast to the commonly used shallow learning methods, such as Uniform Manifold Approximation and Projection (UMAP). We also modify the loss function to allow the quantification of uncertainties in the time series data. The two approaches are applied to the Lazufre Volcanic Complex located at the central volcanic zone of the Andes and thereby compared."}}
{"id": "oWxKsn6wV66", "cdate": 1577836800000, "mdate": null, "content": {"title": "Tslearn, A Machine Learning Toolkit for Time Series Data", "abstract": "tslearn is a general-purpose Python machine learning library for time series that offers tools for pre-processing and feature extraction as well as dedicated models for clustering, classification and regression. It follows scikit-learn's Application Programming Interface for transformers and estimators, allowing the use of standard pipelines and model selection tools on top of tslearn objects. It is distributed under the BSD-2-Clause license, and its source code is available at https://github.com/tslearn-team/tslearn."}}
{"id": "Wdc4XT4Z4Fp", "cdate": 1577836800000, "mdate": null, "content": {"title": "Model and Data Uncertainty for Satellite Time Series Forecasting with Deep Recurrent Models", "abstract": "Deep Learning is often criticized as being a black-box method that provides accurate predictions, but a limited explanation of the underlying processes and no indication when to not trust those predictions. Equipping existing deep learning models with an (general) notion of uncertainty can help mitigate both these issues. The Bayesian deep learning community has developed model-agnostic methodology to estimate both data and model uncertainty that can be implemented on top of existing deep learning models. In this work, we test this methodology for deep recurrent satellite time series forecasting and test its assumptions on data and model uncertainty. We tested its effectiveness on an application on climate change where the activity of seasonal vegetation decreased over multiple years."}}
{"id": "LHSnnYDqgdX", "cdate": 1577836800000, "mdate": null, "content": {"title": "Meta-Learning for Few-Shot Land Cover Classification", "abstract": "The representations of the Earth's surface vary from one geographic region to another. For instance, the appearance of urban areas differs between continents, and seasonality influences the appearance of vegetation. To capture the diversity within a single category, such as urban or vegetation, requires a large model capacity and, consequently, large datasets. In this work, we propose a different perspective and view this diversity as an inductive transfer learning problem where few data samples from one region allow a model to adapt to an unseen region. We evaluate the modelagnostic meta-learning (MAML) algorithm on classification and segmentation tasks using globally and regionally distributed datasets. We find that few-shot model adaptation outperforms pre-training with regular gradient descent and fine-tuning on the (1) Sen12MS dataset and (2) DeepGlobe dataset when the source domain and target domain differ. This indicates that model optimization with meta-learning may benefit tasks in the Earth sciences whose data show a high degree of diversity from region to region, while traditional gradient-based supervised learning remains suitable in the absence of a feature or label shift."}}
