{"id": "k61vjRgiFDM", "cdate": 1620636082247, "mdate": null, "content": {"title": "Adversarial Robustness Toolbox v1.0.0", "abstract": "Adversarial Robustness Toolbox (ART) is a Python library supporting developers and researchers in defending Machine Learning models (Deep Neural Networks, Gradient Boosted Decision Trees, Support Vector Machines, Random Forests, Logistic Regression, Gaussian Processes, Decision Trees, Scikit-learn Pipelines, etc.) against adversarial threats and helps making AI systems more secure and trustworthy. Machine Learning models are vulnerable to adversarial examples, which are inputs (images, texts, tabular data, etc.) deliberately modified to produce a desired response by the Machine Learning model. ART provides the tools to build and deploy defences and test them with adversarial attacks. Defending Machine Learning models involves certifying and verifying model robustness and model hardening with approaches such as pre-processing inputs, augmenting training data with adversarial samples, and leveraging runtime detection methods to flag any inputs that might have been modified by an adversary. The attacks implemented in ART allow creating adversarial attacks against Machine Learning models which is required to test defenses with state-of-the-art threat models. Supported Machine Learning Libraries include TensorFlow (v1 and v2), Keras, PyTorch, MXNet, Scikit-learn, XGBoost, LightGBM, CatBoost, and GPy. The source code of ART is released with MIT license. The release includes code examples, notebooks with tutorials and documentation."}}
{"id": "SkeVzrEHwV", "cdate": 1552397580352, "mdate": null, "content": {"title": "Similarity Learning for Time Series Classification", "abstract": ""}}
{"id": "H1lenV4BDE", "cdate": 1552397480261, "mdate": null, "content": {"title": "Joint Semi-Supervised Similarity Learning for Linear Classification", "abstract": ""}}
{"id": "r1e_rVNrw4", "cdate": 1552397375754, "mdate": null, "content": {"title": "Algorithmic robustness for learning via (epsilon, gamma, tau)-good similarity functions", "abstract": ""}}
{"id": "SJx8SXErvN", "cdate": 1552397118224, "mdate": null, "content": {"title": "Efficient Defenses Against Adversarial Attacks", "abstract": ""}}
{"id": "SkgCTFpV2X", "cdate": 1540835782034, "mdate": null, "content": {"title": "Open Fabric for Deep Learning Models", "abstract": "We will show the advantages of using a fabric of open source AI services and libraries, which have been launched by the AI labs in IBM Research, to train, harden and de-bias deep learning models. The motivation is that model building should not be monolithic. Algorithms, operations and pipelines to build and refine models should be modularized and reused as needed. The componentry presented meets these requirements and shares a philosophy of being framework- and vendor- agnostic, as well as modular and extensible. We focus on multiple aspects of machine learning that we describe in the following. To train models in the cloud in a distributed, framework-agnostic way, we use the Fabric for Deep Learning (FfDL). Adversarial attacks against models are mitigated using the Adversarial Robustness Toolbox (ART). We detect and remove bias using AI Fairness 360 (AIF360). Additionally, we publish to the open source developer community using the Model Asset Exchange (MAX). Overall, we demonstrate operations on deep learning models, and a set of developer APIs, that will help open source developers create robust and fair models for their applications, and for open source sharing. We will also call for community collaboration on these projects of open services and libraries, to democratize the open AI ecosystem.\n"}}
{"id": "SygNVgd-cQ", "cdate": 1538519083555, "mdate": null, "content": {"title": "Open Fabric for Deep Learning Models", "abstract": "We will show the advantages of using a fabric of open source AI services and libraries, which have been launched by the AI labs in IBM Research, to train, harden and de-bias deep learning models. The motivation is that model building should not be monolithic. Algorithms, operations and pipelines to build and refine models should be modularized and reused as needed. The componentry presented meets these requirements and shares a philosophy of being framework- and vendor- agnostic, as well as modular and extensible. We focus on multiple aspects of machine learning that we describe in the following. To train models in the cloud in a distributed, framework-agnostic way, we use the Fabric for Deep Learning (FfDL). Adversarial attacks against models are mitigated using the Adversarial Robustness Toolbox (ART). We detect and remove bias using AI Fairness 360 (AIF360). Additionally, we publish to the open source developer community using the Model Asset Exchange (MAX). Overall, we demonstrate operations on deep learning models, and a set of developer APIs, that will help open source developers create robust and fair models for their applications, and for open source sharing. We will also call for community collaboration on these projects of open services and libraries, to democratize the open AI ecosystem.\n"}}
