{"id": "BO6njh2AjK", "cdate": 1693526400000, "mdate": 1696209263758, "content": {"title": "Efficient Network Representation Learning via Cluster Similarity", "abstract": "Network representation learning is a de facto tool for graph analytics. The mainstream of the previous approaches is to factorize the proximity matrix between nodes. However, if n is the number of nodes, since the size of the proximity matrix is $$n \\times n$$ n × n , it needs $$O(n^3)$$ O ( n 3 ) time and $$O(n^2)$$ O ( n 2 ) space to perform network representation learning; they are significantly high for large-scale graphs. This paper introduces the novel idea of using similarities between clusters instead of proximities between nodes; the proposed approach computes the representations of the clusters from similarities between clusters and computes the representations of nodes by referring to them. If l is the number of clusters, since $$l \\ll n$$ l ≪ n , we can efficiently obtain the representations of clusters from a small $$l \\times l$$ l × l similarity matrix. Furthermore, since nodes in each cluster share similar structural properties, we can effectively compute the representation vectors of nodes. Experiments show that our approach can perform network representation learning more efficiently and effectively than existing approaches."}}
{"id": "XcgKRa6e1XS", "cdate": 1672531200000, "mdate": 1682317806913, "content": {"title": "Efficient Network Representation Learning via Cluster Similarity", "abstract": "Network representation learning is a de-facto tool for graph analytics. The mainstream of the previous approaches is to factorize the proximity matrix between nodes. However, if n is the number of nodes, since the size of the proximity matrix is $$n \\times n$$ , it needs $$O(n^3)$$ time and $$O(n^2)$$ space to perform network representation learning. The proposed approach computes the representations of the clusters from similarities between clusters and computes the representations of nodes by referring to them. If l is the number of clusters, since $$l \\ll n$$ , we can efficiently obtain the representations of clusters from a small $$l \\times l$$ similarity matrix. Experiments show that our approach can perform network representation learning more efficiently and effectively than existing approaches."}}
{"id": "txbgYBwMOrq", "cdate": 1640995200000, "mdate": 1681728576201, "content": {"title": "Nonparametric Relational Models with Superrectangulation", "abstract": "This paper addresses the question, ”What is the smallest object that contains all rectangular partitions with n or fewer blocks?” and shows its application to relational data analysis using a new strategy we call super Bayes as an alternative to Bayesian nonparametric (BNP) methods. Conventionally, standard BNP methods have combined the Aldous-Hoover-Kallenberg representation with parsimonious stochastic processes on rectangular partitioning to construct BNP relational models. As a result, conventional methods face the great difficulty of searching for a parsimonious random rectangular partition that fits the observed data well in Bayesian inference. As a way to essentially avoid such a problem, we propose a strategy to combine an extremely redundant rectangular partition as a deterministic (non-probabilistic) object. Specifically, we introduce a special kind of rectangular partitioning, which we call superrectangulation, that contains all possible rectangular partitions. Delightfully, this strategy completely eliminates the difficult task of searching around for random rectangular partitions, since the superrectangulation is deterministically fixed in inference. Experiments on predictive performance in relational data analysis show that the super Bayesian model provides a more stable analysis than the existing BNP models, which are less likely to be trapped in bad local optima."}}
{"id": "-P3vxsG3NB", "cdate": 1640995200000, "mdate": 1695950543725, "content": {"title": "Fast Binary Network Hashing via Graph Clustering", "abstract": "Network hashing converts each node of a graph into a compact binary code, and it is a useful graph analytics tool since it can reduce memory cost. INH-MF is a network hashing approach to factorize the high-order proximity matrix representing similarities between nodes. However, since it cuts small nonzero elements from the proximity matrix, it fails to effectively extract insights from the graph. Moreover, it incurs high memory and computational costs since the proximity matrix is large and dense. We propose Graph Clustering-based Network Hashing, a novel network hashing approach. To compute the proximities effectively, it uses the structural relationships between nodes and clusters obtained from a graph clustering approach. Moreover, it can efficiently compute hash codes from eigenvectors of the matrix corresponding to the graph Laplacian by using its low-rank property. Experiments show that it can more efficiently and effectively compute hash codes than previous approaches."}}
{"id": "hhkyM3ib9e6", "cdate": 1621630134084, "mdate": null, "content": {"title": "Permuton-induced Chinese Restaurant Process", "abstract": "This paper proposes the permuton-induced Chinese restaurant process (PCRP), a stochastic process on rectangular partitioning of a matrix. This distribution is suitable for use as a prior distribution in Bayesian nonparametric relational model to find hidden clusters in matrices and network data. Our main contribution is to introduce the notion of permutons into the well-known Chinese restaurant process (CRP) for sequence partitioning: a permuton is a probability measure on $[0,1]\\times [0,1]$ and can be regarded as a geometric interpretation of the scaling limit of permutations. Specifically, we extend the model that the table order of CRPs has a random geometric arrangement on $[0,1]\\times [0,1]$ drawn from the permuton. By analogy with the relationship between the stick-breaking process (SBP) and CRP for the infinite mixture model of a sequence, this model can be regarded as a multi-dimensional extension of CRP paired with the block-breaking process (BBP), which has been recently proposed as a multi-dimensional extension of SBP. While BBP always has an infinite number of redundant intermediate variables, PCRP can be composed of varying size intermediate variables in a data-driven manner depending on the size and quality of the observation data. Experiments show that PCRP can improve the prediction performance in relational data analysis by reducing the local optima and slow mixing problems compared with the conventional BNP models because the local transitions of PCRP in Markov chain Monte Carlo inference are more flexible than the previous models."}}
{"id": "HzAKyiUSuIb", "cdate": 1609459200000, "mdate": 1681728576006, "content": {"title": "Bayesian nonparametric model for arbitrary cubic partitioning", "abstract": "In this paper, we propose a continuous-time Markov process for cubic partitioning models of three-dimensional (3D) arrays and its application to Bayesian nonparametric relational data analysis of 3..."}}
{"id": "8_JuJ8nZIML", "cdate": 1609459200000, "mdate": 1682317951049, "content": {"title": "Unsupervised Heart Sound Decomposition and State Estimation with Generative Oscillation Models", "abstract": "This paper proposes a new generative probabilistic model for phonocardiograms (PCGs) that can simultaneously capture oscillatory factors and state transitions in cardiac cycles. Conventionally, PCGs have been modeled in two main aspects. One is a state space model that represents recurrent and frequently appearing state transitions. Another is a factor model that expresses the PCG as a non-stationary signal consisting of multiple oscillations. To model these perspectives in a unified framework, we combine an oscillation decomposition with a state space model. The proposed model can decompose the PCG into cardiac state dependent oscillations by reflecting the mechanism of cardiac sounds generation in an unsupervised manner. In the experiments, our model achieved better accuracy in the state estimation task compared to the empirical mode decomposition method. In addition, our model detected S2 onsets more accurately than the supervised segmentation method when distributions among PCG signals were different."}}
{"id": "3dr-nTC01N", "cdate": 1609459200000, "mdate": 1681728576220, "content": {"title": "Permuton-induced Chinese Restaurant Process", "abstract": "This paper proposes the permuton-induced Chinese restaurant process (PCRP), a stochastic process on rectangular partitioning of a matrix. This distribution is suitable for use as a prior distribution in Bayesian nonparametric relational model to find hidden clusters in matrices and network data. Our main contribution is to introduce the notion of permutons into the well-known Chinese restaurant process (CRP) for sequence partitioning: a permuton is a probability measure on $[0,1]\\times [0,1]$ and can be regarded as a geometric interpretation of the scaling limit of permutations. Specifically, we extend the model that the table order of CRPs has a random geometric arrangement on $[0,1]\\times [0,1]$ drawn from the permuton. By analogy with the relationship between the stick-breaking process (SBP) and CRP for the infinite mixture model of a sequence, this model can be regarded as a multi-dimensional extension of CRP paired with the block-breaking process (BBP), which has been recently proposed as a multi-dimensional extension of SBP. While BBP always has an infinite number of redundant intermediate variables, PCRP can be composed of varying size intermediate variables in a data-driven manner depending on the size and quality of the observation data. Experiments show that PCRP can improve the prediction performance in relational data analysis by reducing the local optima and slow mixing problems compared with the conventional BNP models because the local transitions of PCRP in Markov chain Monte Carlo inference are more flexible than the previous models."}}
{"id": "WaxzRZsezU", "cdate": 1577836800000, "mdate": 1623725879110, "content": {"title": "Baxter Permutation Process", "abstract": "In this paper, a Bayesian nonparametric (BNP) model for Baxter permutations (BPs), termed BP process (BPP) is proposed and applied to relational data analysis. The BPs are a well-studied class of permutations, and it has been demonstrated that there is one-to-one correspondence between BPs and several interesting objects including floorplan partitioning (FP), which constitutes a subset of rectangular partitioning (RP). Accordingly, the BPP can be used as an FP model. We combine the BPP with a multi-dimensional extension of the stick-breaking process called the {\\it block-breaking process} to fill the gap between FP and RP, and obtain a stochastic process on arbitrary RPs. Compared with conventional BNP models for arbitrary RPs, the proposed model is simpler and has a high affinity with Bayesian inference."}}
{"id": "2njuzqh6MwQ", "cdate": 1577836800000, "mdate": 1684501642613, "content": {"title": "Gaussian process with physical laws for 3D cardiac modeling", "abstract": "This paper introduces some physical laws into a Gaussian process for a statistical three-dimensional (3D) cardiac computational model. The 3D cardiac shape modeling is still challenging, since it involves personality and diversity. However, in spite of such variety, the heart shape must be ruled by some physical laws, which should be an important clue for the statistical shape estimation. Specifically, we introduce the Frank-Starling laws into the Gaussian process as a linear constraint, whose resulting process also follows a Gaussian process. For demonstration, we apply our model into the pipeline that estimates the heart shape from cardiovascular magnetic resonance (CMR) imaging, by combining it with the deep neural networks-based anatomical segmentation of CMR imaging."}}
