{"id": "9esx9O5RB4", "cdate": 1640995200000, "mdate": 1681652498952, "content": {"title": "Behavioral embedding for continuous user verification in global settings", "abstract": ""}}
{"id": "bUAdXW8wN6", "cdate": 1632875720496, "mdate": null, "content": {"title": "Domain Invariant Adversarial Learning", "abstract": "The phenomenon of adversarial examples illustrates one of the most basic vulnerabilities of deep neural networks. Among the variety of techniques introduced to surmount this inherent weakness, adversarial training has emerged as the most effective strategy to achieve robustness. Typically, this is achieved by balancing robust and natural objectives. In this work, we aim to further reduce the trade-off between robust and standard accuracy by enforcing a domain-invariant feature representation. We present a new adversarial training method, Domain Invariant Adversarial Learning (DIAL), which learns a feature representation which is both robust and domain invariant. DIAL uses a variant of Domain Adversarial Neural Network (DANN) on the natural domain and its corresponding adversarial domain. In a case where the source domain consists of natural examples and the target domain is the adversarially perturbed examples, our method learns a feature representation constrained not to discriminate between the natural and adversarial examples, and can therefore achieve a more robust representation. Our experiments indicate that our method improves both robustness and standard accuracy, when compared to other state-of-the-art adversarial training methods."}}
{"id": "ccoDOO4C97", "cdate": 1609459200000, "mdate": 1681589808821, "content": {"title": "Domain Invariant Adversarial Learning", "abstract": ""}}
{"id": "UdmCiOGyae", "cdate": 1577836800000, "mdate": 1681652498875, "content": {"title": "Deep Learning Based Sequential Mining for User Authentication in Web Applications", "abstract": ""}}
{"id": "iD5AUt_iN1", "cdate": 1546300800000, "mdate": 1681652498892, "content": {"title": "User Profiling Using Sequential Mining Over Web Elements", "abstract": ""}}
{"id": "tsMVRKkFuh9", "cdate": 1514764800000, "mdate": 1681589809020, "content": {"title": "Advanced Analytics for Connected Car Cybersecurity", "abstract": ""}}
{"id": "X3yiXZL29Gg", "cdate": 1483228800000, "mdate": 1681589809040, "content": {"title": "Advanced Analytics for Connected Cars Cyber Security", "abstract": ""}}
