{"id": "bHsl4S8dXAg", "cdate": 1669074575648, "mdate": 1669074575648, "content": {"title": "Diversity-based Deep Reinforcement Learning Towards Multidimensional Difficulty for Fighting Game AI", "abstract": "In fighting games, individual players of the same skill level often exhibit distinct strategies from one another through their gameplay. Despite this, the majority of AI agents for fighting games have only a single strategy for each \"level\" of difficulty. To make AI opponents more human-like, we'd ideally like to see multiple different strategies at each level of difficulty, a concept we refer to as \"multidimensional\" difficulty. In this paper, we introduce a diversity-based deep reinforcement learning approach for generating a set of agents of similar difficulty that utilize diverse strategies. We find this approach outperforms a baseline trained with specialized, human-authored reward functions in both diversity and performance."}}
{"id": "SY_dBVB0ouj", "cdate": 1669074516840, "mdate": 1669074516840, "content": {"title": "Taikonation: Patterning-focused chart generation for rhythm action games", "abstract": "Generating rhythm game charts from songs via machine learning has been a problem of increasing interest in recent years. However, all existing systems struggle to replicate human-like patterning: the placement of game objects in relation to each other to form congruent patterns based on events in the song. Patterning is a key identifier of high quality rhythm game content, seen as a necessary component in human rankings. We establish a new approach for chart generation that produces charts with more congruent, human-like patterning than seen in prior work."}}
{"id": "aoN53_PV5TM", "cdate": 1669074459369, "mdate": 1669074459369, "content": {"title": "Threshold Designer Adaptation: Improved Adaptation for Designers in Co-creative Systems", "abstract": "To best assist human designers with different styles, Machine Learning (ML) systems need to be able to adapt to them. However, there has been relatively little prior work on how and when to best adapt an ML system to a co-designer. In this paper we present threshold designer adaptation: a novel method for adapting a creative ML model to an individual designer. We evaluate our approach with a human subject study using a co-creative rhythm game design tool. We find that designers prefer our proposed method and produce higher quality content in comparison to an existing baseline."}}
{"id": "Uoxtb7QgYtV", "cdate": 1577836800000, "mdate": null, "content": {"title": "Entity Embedding as Game Representation", "abstract": "Procedural content generation via machine learning (PCGML) has shown success at producing new video game content with machine learning. However, the majority of the work has focused on the production of static game content, including game levels and visual elements. There has been much less work on dynamic game content, such as game mechanics. One reason for this is the lack of a consistent representation for dynamic game content, which is key for a number of statistical machine learning approaches. We present an autoencoder for deriving what we call \"entity embeddings\", a consistent way to represent different dynamic entities across multiple games in the same representation. In this paper we introduce the learned representation, along with some evidence towards its quality and future utility."}}
{"id": "RiPyRH9T8uH", "cdate": 1577836800000, "mdate": null, "content": {"title": "Conceptual Game Expansion", "abstract": "Automated game design is the problem of automatically producing games through computational processes. Traditionally, these methods have relied on the authoring of search spaces by a designer, defining the space of all possible games for the system to author. In this paper, we instead learn representations of existing games from gameplay video and use these to approximate a search space of novel games. In a human subject study we demonstrate that these novel games are indistinguishable from human games in terms of challenge, and that one of the novel games was equivalent to one of the human games in terms of fun, frustration, and likeability."}}
{"id": "NaN7OXbK2Mv", "cdate": 1577836800000, "mdate": null, "content": {"title": "Generating Gameplay-Relevant Art Assets with Transfer Learning", "abstract": "In game development, designing compelling visual assets that convey gameplay-relevant features requires time and experience. Recent image generation methods that create high-quality content could reduce development costs, but these approaches do not consider game mechanics. We propose a Convolutional Variational Autoencoder (CVAE) system to modify and generate new game visuals based on their gameplay relevance. We test this approach with Pok\\'emon sprites and Pok\\'emon type information, since types are one of the game's core mechanics and they directly impact the game's visuals. Our experimental results indicate that adopting a transfer learning approach can help to improve visual quality and stability over unseen data."}}
{"id": "BLQ8b171KTY", "cdate": 1577836800000, "mdate": null, "content": {"title": "Explainability via Responsibility", "abstract": "Procedural Content Generation via Machine Learning (PCGML) refers to a group of methods for creating game content (e.g. platformer levels, game maps, etc.) using machine learning models. PCGML approaches rely on black box models, which can be difficult to understand and debug by human designers who do not have expert knowledge about machine learning. This can be even more tricky in co-creative systems where human designers must interact with AI agents to generate game content. In this paper we present an approach to explainable artificial intelligence in which certain training instances are offered to human users as an explanation for the AI agent's actions during a co-creation process. We evaluate this approach by approximating its ability to provide human users with the explanations of AI agent's actions and helping them to more efficiently cooperate with the AI agent."}}
{"id": "Hyx4pflOvr", "cdate": 1569354428026, "mdate": null, "content": {"title": "Automated Game Design via Conceptual Expansion", "abstract": "Automated game design has remained a key challenge within the field of Game AI. In this paper, we introduce a method for recombining existing games to create new games through a process called conceptual expansion. Prior automated game design approaches have relied on hand-authored or crowd- sourced knowledge, which limits the scope and applications of such systems. Our approach instead relies on machine learning to learn approximate representations of games. Our approach recombines knowledge from these learned repre- sentations to create new games via conceptual expansion. We evaluate this approach by demonstrating the ability for the system to recreate existing games. To the best of our knowl- edge, this represents the first machine learning-based auto- mated game design system."}}
{"id": "JOmJRsJP6YD", "cdate": 1546300800000, "mdate": null, "content": {"title": "Combinets: Creativity via Recombination of Neural Networks", "abstract": ""}}
{"id": "9QzBxDaPRht", "cdate": 1546300800000, "mdate": null, "content": {"title": "Friend, Collaborator, Student, Manager: How Design of an AI-Driven Game Level Editor Affects Creators", "abstract": "Machine learning advances have afforded an increase in algorithms capable of creating art, music, stories, games, and more. However, it is not yet well-understood how machine learning algorithms might best collaborate with people to support creative expression. To investigate how practicing designers perceive the role of AI in the creative process, we developed a game level design tool for Super Mario Bros.-style games with a built-in AI level designer. In this paper we discuss our design of the Morai Maker intelligent tool through two mixed-methods studies with a total of over one-hundred participants. Our findings are as follows: (1) level designers vary in their desired interactions with, and role of, the AI, (2) the AI prompted the level designers to alter their design practices, and (3) the level designers perceived the AI as having potential value in their design practice, varying based on their desired role for the AI."}}
