{"id": "7kAnnHfzv7U", "cdate": 1687979025961, "mdate": 1687979025961, "content": {"title": "MEISD: A Multimodal Multi-Label Emotion, Intensity and Sentiment Dialogue Dataset for Emotion Recognition and Sentiment Analysis in Conversations", "abstract": "Emotion and sentiment classification in dialogues is a challenging task that has gained popularity\nin recent times. Humans tend to have multiple emotions with varying intensities while expressing\ntheir thoughts and feelings. Emotions in an utterance of dialogue can either be independent or\ndependent on the previous utterances, making the task complex and interesting. Multi-label\nemotion detection in conversations is a significant task that provides the ability to the system to\nunderstand the various emotions of the users interacting. On the other hand, sentiment analysis\nin dialogue or conversation helps in understanding the perspective of the user with respect to\nthe ongoing conversation. Besides text, additional information in the form of audio and video\nassists in identifying the correct emotions with the appropriate intensity and sentiments in an\nutterance of a dialogue. Lately, quite a few datasets have been made available for emotion and\nsentiment classification in dialogues. Still, these datasets are imbalanced in representing different\nemotions and consist of only a single emotion. Hence, we present at first a large-scale balanced\nMultimodal Multi-label Emotion, Intensity, and Sentiment Dialogue dataset (MEISD) collected\nfrom different TV series that has textual, audio, and visual features, and then establish a baseline\nsetup for further research"}}
{"id": "hKXGhlN5f5J", "cdate": 1687976606598, "mdate": 1687976606598, "content": {"title": "EmoInHindi: A Multi-label Emotion and Intensity Annotated Dataset in Hindi for Emotion Recognition in Dialogues", "abstract": "The long-standing goal of Artificial Intelligence (AI) has been to create human-like conversational systems. Such systems should have the ability to develop an emotional connection with the users, consequently, emotion recognition in dialogues has gained popularity. Emotion detection in dialogues is a challenging task because humans usually convey multiple emotions with varying degrees of intensities in a single utterance. Moreover, emotion in an utterance of a dialogue may be dependent on previous utterances making the task more complex. Recently, emotion recognition in low-resource languages like Hindi has been in great demand. However, most of the existing datasets for multi-label emotion and intensity detection in conversations are in English. To this end, we propose a large conversational dataset in Hindi named EmoInHindi for multi-label emotion and intensity recognition in conversations containing 1,814 dialogues with a total of 44,247 utterances. We prepare our dataset in a Wizard-of-Oz manner for mental health and legal counselling of crime victims. Each utterance of dialogue is annotated with one or more emotion categories from 16 emotion labels including neutral and their corresponding intensity. We further propose strong contextual baselines that can detect the emotion(s) and corresponding emotional intensity of an utterance given the conversational context."}}
{"id": "s0j31YS9nk", "cdate": 1687974599565, "mdate": 1687974599565, "content": {"title": "PoliSe: Reinforcing Politeness Using User Sentiment for Customer Care Response Generation", "abstract": "The interaction between a consumer and the customer service representative greatly contributes to the overall customer experience. Therefore, to ensure customers’ comfort and retention, it is important that customer service agents and chatbots connect with users on social, cordial, and empathetic planes. In the current work, we automatically identify the sentiment of the user and transform the neutral responses into polite responses conforming to the sentiment and the conversational history. Our technique is basically a reinforced multi-task network- the primary task being ‘polite response generation’ and the secondary task being ‘sentiment analysis’- that uses a Transformer based encoder-decoder. We use sentiment annotated conversations from Twitter as the training data. The detailed evaluation shows that our proposed approach attains superior performance compared to the baseline models."}}
{"id": "qTnR7UK9Sd", "cdate": 1672531200000, "mdate": 1679949302146, "content": {"title": "EmoInt-Trans: A Multimodal Transformer for Identifying Emotions and Intents in Social Conversations", "abstract": ""}}
{"id": "QjT7Auf8WFG", "cdate": 1672531200000, "mdate": 1679949302150, "content": {"title": "Multitask learning for multilingual intent detection and slot filling in dialogue systems", "abstract": ""}}
{"id": "O6jUbmYO_m", "cdate": 1672531200000, "mdate": 1679949302146, "content": {"title": "Prompt-Based Editing for Text Style Transfer", "abstract": ""}}
{"id": "Hu4r-dedqR0", "cdate": 1663850188735, "mdate": null, "content": {"title": "Weakly Supervised Explainable Phrasal Reasoning with Neural Fuzzy Logic", "abstract": "Natural language inference (NLI) aims to determine the logical relationship between two sentences, such as Entailment, Contradiction, and Neutral. In recent years, deep learning models have become a prevailing approach to NLI, but they lack interpretability and explainability. In this work, we address the explainability of NLI by weakly supervised logical reasoning, and propose an Explainable Phrasal Reasoning (EPR) approach. Our model first detects phrases as the semantic unit and aligns corresponding phrases in the two sentences. Then, the model predicts the NLI label for the aligned phrases, and induces the sentence label by fuzzy logic formulas. Our EPR is almost everywhere differentiable and thus the system can be trained end to end. In this way, we are able to provide explicit explanations of phrasal logical relationships in a weakly supervised manner. We further show that such reasoning results help textual explanation generation."}}
{"id": "oybca7xRM0", "cdate": 1640995200000, "mdate": 1679949302148, "content": {"title": "Knowing What to Say:  Towards knowledge grounded code-mixed response generation for open-domain conversations", "abstract": ""}}
{"id": "om-yUCvRxY", "cdate": 1640995200000, "mdate": 1667617900169, "content": {"title": "A Unified Framework for Emotion Identification and Generation in Dialogues", "abstract": "Social chatbots have gained immense popularity, and their appeal lies not just in their capacity to respond to the diverse requests from users, but also in the ability to develop an emotional connection with users. To further develop and promote social chatbots, we need to concentrate on increasing user interaction and take into account both the intellectual and emotional quotient in the conversational agents. In this paper, we propose a multi-task framework that jointly identifies the emotion of a given dialogue and generates response in accordance to the identified emotion. We employ a BERT based network for creating an empathetic system and use a mixed objective function that trains the end-to-end network with both the classification and generation loss. Experimental results show that our proposed framework outperforms current state-of-the-art models"}}
{"id": "eJTGGorsBn", "cdate": 1640995200000, "mdate": 1679949302235, "content": {"title": "PoliSe: Reinforcing Politeness Using User Sentiment for Customer Care Response Generation", "abstract": ""}}
