{"id": "SkeGURNtDH", "cdate": 1569439306226, "mdate": null, "content": {"title": "MultiGrain: a unified image embedding for classes and instances", "abstract": "We introduce MultiGrain, a neural network architecture that generates compact image embedding vectors that solve multiple tasks of different granularity: class, instance, and copy recognition. MultiGrain is trained jointly for classification by optimizing the cross-entropy loss and for instance/copy recognition by optimizing a self-supervised ranking loss. The self-supervised loss only uses data augmentation and thus does not require additional labels. Remarkably, the unified embeddings are not only much more compact than using several specialized embeddings, but they also have the same or better accuracy. When fed to a linear classifier, MultiGrain using ResNet-50 achieves 79.4% top-1 accuracy on ImageNet, a +1.8% absolute improvement over the the current state-of-the-art AutoAugment method. The same embeddings perform on par with state-of-the-art instance retrieval with images of moderate resolution. An ablation study shows that our approach benefits from the self-supervision, the pooling method and the mini-batches with repeated augmentations of the same image.\n"}}
{"id": "BJ-RR1MuZB", "cdate": 1514764800000, "mdate": null, "content": {"title": "The Lovász-Softmax Loss: A Tractable Surrogate for the Optimization of the Intersection-Over-Union Measure in Neural Networks", "abstract": "The Jaccard index, also referred to as the intersection-over-union score, is commonly employed in the evaluation of image segmentation results given its perceptual qualities, scale invariance - which lends appropriate relevance to small objects, and appropriate counting of false negatives, in comparison to per-pixel losses. We present a method for direct optimization of the mean intersection-over-union loss in neural networks, in the context of semantic image segmentation, based on the convex Lovász extension of submodular losses. The loss is shown to perform better with respect to the Jaccard index measure than the traditionally used cross-entropy loss. We show quantitative and qualitative differences between optimizing the Jaccard index per image versus optimizing the Jaccard index taken over an entire dataset. We evaluate the impact of our method in a semantic segmentation pipeline and show substantially improved intersection-over-union segmentation scores on the Pascal VOC and Cityscapes datasets using state-of-the-art deep learning segmentation architectures."}}
{"id": "HkVKQtbOZB", "cdate": 1451606400000, "mdate": null, "content": {"title": "Monocular Surface Reconstruction Using 3D Deformable Part Models", "abstract": "Our goal in this work is to recover an estimate of an object’s surface from a single image. We address this severely ill-posed problem by employing a discriminatively-trained graphical model: we incorporate prior information about the 3D shape of an object category in terms of pairwise terms among parts, while using powerful CNN features to construct unary terms that dictate the part placement in the image. Our contributions are three-fold: firstly, we extend the Deformable Part Model (DPM) paradigm to operate in a three-dimensional pose space that encodes the putative real-world coordinates of object parts. Secondly, we use branch-and-bound to perform efficient inference with DPMs, resulting in accelerations by two orders of magnitude over linear-time algorithms. Thirdly, we use Structured SVM training to properly penalize deviations between the model predictions and the 3D ground truth information during learning. Our inference requires a fraction of a second at test time and our results outperform those published recently in [17] on the PASCAL 3D+ dataset."}}
