{"id": "JfOvub5TBNW", "cdate": 1672531200000, "mdate": 1696601808944, "content": {"title": "Efficient Learning of PDEs via Taylor Expansion and Sparse Decomposition into Value and Fourier Domains", "abstract": "Accelerating the learning of Partial Differential Equations (PDEs) from experimental data will speed up the pace of scientific discovery. Previous randomized algorithms exploit sparsity in PDE updates for acceleration. However such methods are applicable to a limited class of decomposable PDEs, which have sparse features in the value domain. We propose Reel, which accelerates the learning of PDEs via random projection and has much broader applicability. Reel exploits the sparsity by decomposing dense updates into sparse ones in both the value and frequency domains. This decomposition enables efficient learning when the source of the updates consists of gradually changing terms across large areas (sparse in the frequency domain) in addition to a few rapid updates concentrated in a small set of \"interfacial\" regions (sparse in the value domain). Random projection is then applied to compress the sparse signals for learning. To expand the model applicability, Taylor series expansion is used in Reel to approximate the nonlinear PDE updates with polynomials in the decomposable form. Theoretically, we derive a constant factor approximation between the projected loss function and the original one with poly-logarithmic number of projected dimensions. Experimentally, we provide empirical evidence that our proposed Reel can lead to faster learning of PDE models (70-98% reduction in training time when the data is compressed to 1% of its original size) with comparable quality as the non-compressed models."}}
{"id": "SCg9JDUscgq", "cdate": 1646077527516, "mdate": null, "content": {"title": "Efficient Learning of Sparse and Decomposable PDEs using Random Projection", "abstract": "Learning physics models in the form of Partial Differential Equations (PDEs) is carried out through back-propagation to match the simulations of the physics model with experimental observations. Nevertheless, such matching involves computation over billions of elements, presenting a significant computational overhead. We notice many PDEs in real world problems are sparse and decomposable, where the temporal updates and the spatial features are sparsely concentrated on small interface regions. We propose Rapid-PDE, an algorithm to expedite the learning of sparse and decomposable PDEs. Our Rapid-PDE first uses random projection to compress the high dimensional sparse updates and features into low dimensional representations and then use these compressed signals during learning. Crucially, such a conversion is only carried out once prior to learning and the entire learning process is conducted in the compressed space. Theoretically, we derive a constant factor approximation between the projected loss function and the original one with logarithmic number of projected dimensions. Empirically, we demonstrate Rapid-PDE with data compressed to 0.05% of its original size learns similar models compared with uncompressed algorithms in learning a set of phase-field models which govern the spatial-temporal dynamics of nano-scale structures in metallic materials."}}
{"id": "M4LkqBsqzq", "cdate": 1640995200000, "mdate": 1683904915913, "content": {"title": "Efficient learning of sparse and decomposable PDEs using random projection", "abstract": "Learning physics models in the form of Partial Differential Equations (PDEs) is carried out through back-propagation to match the simulations of the physics model with experimental observations. Ne..."}}
{"id": "ATwNdsdpMl", "cdate": 1609459200000, "mdate": 1683904915827, "content": {"title": "Physics Knowledge Discovery via Neural Differential Equation Embedding", "abstract": "Despite much interest, physics knowledge discovery from experiment data remains largely a manual trial-and-error process. This paper proposes neural differential equation embedding (NeuraDiff), an end-to-end approach to learn a physics model characterized by a set of partial differential equations directly from experiment data. The key idea is the integration of two neural networks – one recognition net extracting the values of physics model variables from experimental data, and the other neural differential equation net simulating the temporal evolution of the physics model. Learning is completed by matching the outcomes of the two neural networks. We apply NeuraDiff to the real-world application of tracking and learning the physics model of nano-scale defects in crystalline materials under irradiation and high temperature. Experimental results demonstrate that NeuraDiff produces highly accurate tracking results while capturing the correct dynamics of nano-scale defects."}}
{"id": "1S_hRFZ5kK", "cdate": 1514764800000, "mdate": 1683904915899, "content": {"title": "Duity: A Low-cost and Pervasive Finger-count Based Hand Gesture Recognition System for Low-literate and Novice Users", "abstract": "In the context of developed countries, a considerable amount of research studies have been done to make Human-Computer Interaction (HCI) as natural and intuitive as possible for the public computing devices. Given the proliferation of public computing devices in the developing regions, a context-aware HCI design, focusing the low-literate and novice users from these regions, has the utmost importance. Taking the hygiene issue with the usage of touch-based public computing devices into account, in-air hand gestures are considered as one of the most natural forms of non-verbal interaction in this regard. In this paper, we present Duity -- a low-cost finger-count based hand gesture recognition system -- which reliably tackles the hurdle faced by novice and low-literacy populations. Exploiting the reflective property of visible light spectrum, we develop a mechanism that can reliably count fingers and thus identify different gestures. The system is fine-tuned to such an extent that varying lighting conditions and environmental setups can not perturb the accurate identification of the gestures. Our claims are supported by a user evaluation, which takes multiple scenarios into accounts, confirming the robustness, usability, and acceptability of Duity."}}
{"id": "mgwgVohOWx", "cdate": 1483228800000, "mdate": 1683904915900, "content": {"title": "Low-cost finger gesture recognition system for disabled and elderly people", "abstract": "Gesture recognition is increasingly being used to design systems that assist the disabled people and elderly people, who struggle with motor control and motor functionality. In this paper, we propose a device which helps people with severe motor disabilities, however, have full functionality in their fingers even if they can not move or lift their arms. The proposed device tracks the movement of the fingers of the users and classifies them as gestures. The classified gestures can be used to control various electrical devices such as switches, electrical appliances, wheelchairs, etc. and can also be used to signal the need for human assistance. The device is robust, easy to use, highly accurate, and low power consuming. Therefore, it can be used for an extended period of time and is reliable for helping the disabled people and elderly people."}}
{"id": "FE6jlKzmnt", "cdate": 1483228800000, "mdate": 1683904915826, "content": {"title": "Devising a novel visible light based low-cost ultra-low-power gesture recognition system", "abstract": "In recent times, migrating from touch-based input systems to gesture recognition based touchless input systems has become one of the major research problems, considering the health hazards exposed in public usages of the devices. The problem still remains mostly unsolved as such a system having the properties of being low-cost, ultra-low-power and easy-to-use is yet to be proposed in the literature. As a remedy to this situation, in this paper, we propose a visible light based gesture recognition system retaining all the properties mentioned above. Its operational algorithm makes it functioning in a well-lit room and guarantees robustness against undefined noisy gestures. Real implementation of the system along with its rigorous evaluation through interaction with several users confirm its efficacy and existences of all the mentioned properties in it."}}
{"id": "wl0iBxZkaQ", "cdate": 1451606400000, "mdate": 1683904915767, "content": {"title": "Sporshohin: A Tale of Devising Visible Light Based Low-Cost Robust Touchless Input Device", "abstract": "In recent times, migrating from touch-based input devices to touchless input devices has become one of the major research problems considering the health hazards exposed in public usages (e.g., information kiosk) of the touch-based devices. The problem still remains mostly open, since a solution having the properties of being low-cost, low power consuming, robust, and easy-to-use, is yet to be proposed in the literature. As a remedy to this situation, in this paper, we propose a visible light based touchless input device (named Sporshohin), retaining all the properties mentioned above, for ensuring ubiquitous usage. Sporshohin recognizes predefined gestures performed by the user, through an underlying mechanism that exploits well-known reflection model over the visible light spectrum. The underlying mechanism is intelligent enough to guarantee robustness against varying environmental lighting conditions and undefined noisy gestures. Real implementation, involving interaction with diversified users, confirms high accuracy and usability along with existence of all the above mentioned properties. We show the emulation of Sporshohin as an input interface for an information kiosk. The attributes of Sporshohin exhibit its prospect of being used in diversified applications going beyond information kiosks."}}
{"id": "nvWRj7GFjs", "cdate": 1420070400000, "mdate": 1683904915756, "content": {"title": "Spatio-temporal keyword search for nearest neighbour queries", "abstract": "The widespread availability and the technological advancement of geo-positioning devices enable users to generate a high volume of geo-tagged objects everyday. These objects include points of inter..."}}
