{"id": "2QV4LIqT5S", "cdate": 1683906675281, "mdate": 1683906675281, "content": {"title": "Splitavg: A heterogeneity-aware federated deep learning method for medical imaging", "abstract": "Federated learning is an emerging research paradigm for enabling collaboratively training deep learning models without sharing patient data. However, the data from different institutions are usually heterogeneous across institutions, which may reduce the performance of models trained using federated learning. In this study, we propose a novel heterogeneity-aware federated learning method, SplitAVG, to overcome the performance drops from data heterogeneity in federated learning. Unlike previous federated methods that require complex heuristic training or hyper parameter tuning, our SplitAVG leverages the simple network split and feature map concatenation strategies to encourage the federated model training an unbiased estimator of the target data distribution. We compare SplitAVG with seven state-of-the-art federated learning methods, using centrally hosted training data as the baseline on a suite of both synthetic and real-world federated datasets. We find that the performance of models trained using all the comparison federated learning methods degraded significantly with the increasing degrees of data heterogeneity. In contrast, SplitAVG method achieves comparable results to the baseline method under all heterogeneous settings, that it achieves 96.2% of the accuracy and 110.4% of the mean absolute error obtained by the baseline in a diabetic retinopathy binary classification dataset and a bone age prediction dataset, respectively, on highly heterogeneous data partitions. We conclude that SplitAVG method can effectively overcome the performance drops from variability in data distributions across institutions. Experimental results also show that SplitAVG can be adapted to different base convolutional neural networks (CNNs) and generalized to various types of medical imaging tasks. The code is publicly available at https://github.com/zm17943/SplitAVG."}}
{"id": "GChV32EyYi", "cdate": 1683823732040, "mdate": 1683823732040, "content": {"title": "Segmenting across places: The need for fair transfer learning with satellite imagery", "abstract": "The increasing availability of high-resolution satellite imagery has enabled the use of machine learning to support land-cover measurement and inform policy-making. How- ever, labelling satellite images is expensive and is available for only some locations. This prompts the use of transfer learning to adapt models from data-rich locations to others. Given the potential for high-impact applications of satel- lite imagery across geographies, a systematic assessment of transfer learning implications is warranted. In this work, we consider the task of land-cover segmentation and study the fairness implications of transferring models across lo- cations. We leverage a large satellite image segmentation benchmark with 5987 images from 18 districts (9 urban and 9 rural). Via fairness metrics we quantify disparities in model performance along two axes – across urban-rural locations and across land-cover classes. Findings show that state-of-the-art models have better overall accuracy in ru- ral areas compared to urban areas, through unsupervised domain adaptation methods transfer learning better to ur- ban versus rural areas and enlarge fairness gaps. In analy- sis of reasons for these findings, we show that raw satellite images are overall more dissimilar between source and tar- get districts for rural than for urban locations. This work highlights the need to conduct fairness analysis for satel- lite imagery segmentation models and motivates the devel- opment of methods for fair transfer learning in order not to introduce disparities between places, particularly urban and rural locations."}}
