{"id": "IHWB9f4Ohm", "cdate": 1672531200000, "mdate": 1693092575834, "content": {"title": "Response Time Improves Choice Prediction and Function Estimation for Gaussian Process Models of Perception and Preferences", "abstract": "Models for human choice prediction in preference learning and psychophysics often consider only binary response data, requiring many samples to accurately learn preferences or perceptual detection thresholds. The response time (RT) to make each choice captures additional information about the decision process, however existing models incorporating RTs for choice prediction do so in fully parametric settings or over discrete stimulus sets. This is in part because the de-facto standard model for choice RTs, the diffusion decision model (DDM), does not admit tractable, differentiable inference. The DDM thus cannot be easily integrated with flexible models for continuous, multivariate function approximation, particularly Gaussian process (GP) models. We propose a novel differentiable approximation to the DDM likelihood using a family of known, skewed three-parameter distributions. We then use this new likelihood to incorporate RTs into GP models for binary choices. Our RT-choice GPs enable both better latent value estimation and held-out choice prediction relative to baselines, which we demonstrate on three real-world multivariate datasets covering both human psychophysics and preference learning applications."}}
{"id": "DK3NSMBdEJg", "cdate": 1672531200000, "mdate": 1693092575834, "content": {"title": "A Semi-parametric Model for Decision Making in High-Dimensional Sensory Discrimination Tasks", "abstract": "Psychometric functions typically characterize binary sensory decisions along a single stimulus dimension. However, real-life sensory tasks vary along a greater variety of dimensions (e.g. color, contrast and luminance for visual stimuli). Approaches to characterizing high-dimensional sensory spaces either require strong parametric assumptions about these additional contextual dimensions, or fail to leverage known properties of classical psychometric curves. We overcome both limitations by introducing a semi-parametric model of sensory discrimination that applies traditional psychophysical models along a stimulus intensity dimension, but puts Gaussian process (GP) priors on the parameters of these models with respect to the remaining dimensions. By combining the flexibility of the GP with the deep literature on parametric psychophysics, our semi-parametric models achieve good performance with much less data than baselines on both synthetic and real-world, high-dimensional psychophysics datasets. We additionally show strong performance in a Bayesian active learning setting, and present a novel active learning paradigm for the semi-parametric model."}}
{"id": "r5XEOB-5kYR", "cdate": 1640995200000, "mdate": 1649961217584, "content": {"title": "Look-Ahead Acquisition Functions for Bernoulli Level Set Estimation", "abstract": "Level set estimation (LSE) is the problem of identifying regions where an unknown function takes values above or below a specified threshold. Active sampling strategies for efficient LSE have primarily been studied in continuous-valued functions. Motivated by applications in human psychophysics where common experimental designs produce binary responses, we study LSE active sampling with Bernoulli outcomes. With Gaussian process classification surrogate models, the look-ahead model posteriors used by state-of-the-art continuous-output methods are intractable. However, we derive analytic expressions for look-ahead posteriors of sublevel set membership, and show how these lead to analytic expressions for a class of look-ahead LSE acquisition functions, including information-based methods. Benchmark experiments show the importance of considering the global look-ahead impact on the entire posterior. We demonstrate a clear benefit to using this new class of acquisition functions on benchmark problems, and on a challenging real-world task of estimating a high-dimensional contrast sensitivity function."}}
{"id": "aZKYmlrbBVe", "cdate": 1640995200000, "mdate": 1682353718247, "content": {"title": "Perceptual Requirements for Eye-Tracked Distortion Correction in VR", "abstract": "We present a virtual reality display system simulator that accurately reproduces gaze-contingent distortions created by any viewing optic. The simulator hardware supports rapid prototyping by presenting stereoscopic distortions on a high-speed television paired with shutter glasses, eliminating the need to fabricate physical optics. We further introduce light field portals as an efficient and general-purpose representation for VR optics, enabling real-time emulation using our simulator. This platform is used to conduct the first user study of perceptual requirements for eye-tracked optical distortion correction. Because our hardware platform facilitates consistent head and eye movements, it enables direct comparison of these requirements across observers, optical designs, and scene content. We conclude by introducing a simple binocular distortion metric, built using light field portals, which agrees with key trends identified in the user study and lays a foundation for the design of perceptually-based distortion metrics and correction schemes."}}
{"id": "9jUmO6cGMs", "cdate": 1640995200000, "mdate": 1682353718061, "content": {"title": "Look-Ahead Acquisition Functions for Bernoulli Level Set Estimation", "abstract": "Level set estimation (LSE) is the problem of identifying regions where an unknown function takes values above or below a specified threshold. Active sampling strategies for efficient LSE have primarily been studied in continuous-valued functions. Motivated by applications in human psychophysics where common experimental designs produce binary responses, we study LSE active sampling with Bernoulli outcomes. With Gaussian process classification surrogate models, the look-ahead model posteriors used by state-of-the-art continuous-output methods are intractable. However, we derive analytic expressions for look-ahead posteriors of sublevel set membership, and show how these lead to analytic expressions for a class of look-ahead LSE acquisition functions, including information-based methods. Benchmark experiments show the importance of considering the global look-ahead impact on the entire posterior. We demonstrate a clear benefit to using this new class of acquisition functions on benchmark problems, and on a challenging real-world task of estimating a high-dimensional contrast sensitivity function."}}
{"id": "J3C7W4QdyYY", "cdate": 1577836800000, "mdate": null, "content": {"title": "Unifying Few- and Zero-Shot Egocentric Action Recognition", "abstract": "Although there has been significant research in egocentric action recognition, most methods and tasks, including EPIC-KITCHENS, suppose a fixed set of action classes. Fixed-set classification is useful for benchmarking methods, but is often unrealistic in practical settings due to the compositionality of actions, resulting in a functionally infinite-cardinality label set. In this work, we explore generalization with an open set of classes by unifying two popular approaches: few- and zero-shot generalization (the latter which we reframe as cross-modal few-shot generalization). We propose a new set of splits derived from the EPIC-KITCHENS dataset that allow evaluation of open-set classification, and use these splits to show that adding a metric-learning loss to the conventional direct-alignment baseline can improve zero-shot classification by as much as 10%, while not sacrificing few-shot performance."}}
{"id": "112gXyWb5a", "cdate": 1577836800000, "mdate": null, "content": {"title": "Incorporating structured assumptions with probabilistic graphical models in fMRI data analysis", "abstract": "With the wide adoption of functional magnetic resonance imaging (fMRI) by cognitive neuroscience researchers, large volumes of brain imaging data have been accumulated in recent years. Aggregating these data to derive scientific insights often faces the challenge that fMRI data are high-dimensional, heterogeneous across people, and noisy. These challenges demand the development of computational tools that are tailored both for the neuroscience questions and for the properties of the data. We review a few recently developed algorithms in various domains of fMRI research: fMRI in naturalistic tasks, analyzing full-brain functional connectivity, pattern classification, inferring representational similarity and modeling structured residuals. These algorithms all tackle the challenges in fMRI similarly: they start by making clear statements of assumptions about neural data and existing domain knowledge, incorporating those assumptions and domain knowledge into probabilistic graphical models, and using those models to estimate properties of interest or latent structures in the data. Such approaches can avoid erroneous findings, reduce the impact of noise, better utilize known properties of the data, and better aggregate data across groups of subjects. With these successful cases, we advocate wider adoption of explicit model construction in cognitive neuroscience. Although we focus on fMRI, the principle illustrated here is generally applicable to brain data of other modalities."}}
{"id": "V4IWV26uGR1", "cdate": 1546300800000, "mdate": null, "content": {"title": "Asymmetric Switch Costs as a Function of Task Strength", "abstract": "Several studies reported that it is harder to switch from a difficult task to an easy task than vice versa. Previous studies explain this paradoxical effect in terms of differences in task strength, by letting participants switch between different types of tasks. However, these studies failed to isolate the effects of task strength from task identity. Here, we present a series of experiments in which we systematically varied the strength of two tasks independent of their identity. We adapted a computational model of task switching by Yeung & Monsell (2003) to derive predictions about the magnitude of asymmetric switch costs (ASC) as a function of task strength, and compared predictions from the model to behavioral data. Our results reveal that ASC depend on the overall and relative task strength across the two tasks. ASC can therefore flip directions if the strength of two tasks is reversed, irrespective of their identities."}}
{"id": "zrkaQC3hjpN", "cdate": 1514764800000, "mdate": null, "content": {"title": "Constraints associated with cognitive control and the stability-flexibility dilemma", "abstract": "One of the most compelling characteristics of controlled processing is our limitation to exercise it. Theories of control allocation account for such limitations by assuming a cost of control that constrains how much cognitive control is allocated to a task. However, this leaves open the question of why such a cost would exist in the first place. Here, we use neural network simulations to test the hypothesis that constraints on cognitive control may reflect an optimal solution to the stability-flexibility dilemma: allocating more control to a task results in greater activation of its neural representation but also in greater persistence of this activity upon switching to a new task, yielding switch costs. We demonstrate that constraints on control impair performance of any given task but reduce performance costs associated with task switches. Critically, we show that optimal control constraints are higher in environments with a higher probability of task switches."}}
{"id": "NQtsr2ZTObe", "cdate": 1514764800000, "mdate": null, "content": {"title": "Matrix-normal models for fMRI analysis", "abstract": "Multivariate analysis of fMRI data has bene- fited substantially from advances in machine learning. Most recently, a range of prob- abilistic latent variable models applied to fMRI data have been s..."}}
