{"id": "mNMIyR_o7K9", "cdate": 1623604619967, "mdate": null, "content": {"title": "Planning from Pixels in Environments with Combinatorially Hard Search Spaces", "abstract": "The ability to form complex plans based on raw visual input is a litmus test for current capabilities of artificial intelligence, as it requires a seamless combination of visual processing and abstract algorithmic execution, two traditionally separate areas of computer science. A recent surge of interest in this field brought advances that yield good performance in tasks ranging from arcade games to continuous control; these methods however do not come without significant issues, such as limited generalization capabilities and difficulties when dealing with combinatorially hard planning instances. Our contribution is two-fold: (i) we present a method that learns to represent its environment as a latent graph and leverages state reidentification to reduce the complexity of finding a good policy from exponential to linear (ii) we introduce a set of lightweight environments with an underlying discrete combinatorial structure in which planning is challenging even for humans. Moreover, we show that our methods achieves strong empirical generalization to variations in the environment, even across highly disadvantaged regimes, such as “one-shot” planning, or in an offline RL paradigm which only provides low-quality trajectories."}}
{"id": "XgGUUaKgips", "cdate": 1621630051638, "mdate": null, "content": {"title": "Planning from Pixels in Environments with Combinatorially Hard Search Spaces", "abstract": "The ability to form complex plans based on raw visual input is a litmus test for current capabilities of artificial intelligence, as it requires a seamless combination of visual processing and abstract algorithmic execution, two traditionally separate areas of computer science. A recent surge of interest in this field brought advances that yield good performance in tasks ranging from arcade games to continuous control; these methods however do not come without significant issues, such as limited generalization capabilities and difficulties when dealing with combinatorially hard planning instances. Our contribution is two-fold: (i) we present a method that learns to represent its environment as a latent graph and leverages state reidentification to reduce the complexity of finding a good policy from exponential to linear (ii) we introduce a set of lightweight environments with an underlying discrete combinatorial structure in which planning is challenging even for humans. Moreover, we show that our methods achieves strong empirical generalization to variations in the environment, even across highly disadvantaged regimes, such as “one-shot” planning, or in an offline RL paradigm which only provides low-quality trajectories."}}
{"id": "w5T5MjTWVzk", "cdate": 1609459200000, "mdate": 1633301379701, "content": {"title": "Demystifying Inductive Biases for β-VAE Based Architectures", "abstract": "The performance of $\\beta$-Variational-Autoencoders ($\\beta$-VAEs) and their variants on learning semantically meaningful, disentangled representations is unparalleled. On the other hand, there are theoretical arguments suggesting the impossibility of unsupervised disentanglement. In this work, we shed light on the inductive bias responsible for the success of VAE-based architectures. We show that in classical datasets the structure of variance, induced by the generating factors, is conveniently aligned with the latent directions fostered by the VAE objective. This builds the pivotal bias on which the disentangling abilities of VAEs rely. By small, elaborate perturbations of existing datasets, we hide the convenient correlation structure that is easily exploited by a variety of architectures. To demonstrate this, we construct modified versions of standard datasets in which (i) the generative factors are perfectly preserved; (ii) each image undergoes a mild transformation causing a small change of variance; (iii) the leading \\textbf{VAE-based disentanglement architectures fail to produce disentangled representations whilst the performance of a non-variational method remains unchanged}. The construction of our modifications is nontrivial and relies on recent progress on mechanistic understanding of $\\beta$-VAEs and their connection to PCA. We strengthen that connection by providing additional insights that are of stand-alone interest."}}
{"id": "sdjNkdAm6Ku", "cdate": 1609459200000, "mdate": 1633301379766, "content": {"title": "Neuro-algorithmic Policies enable Fast Combinatorial Generalization", "abstract": "Although model-based and model-free approaches to learning the control of systems have achieved impressive results on standard benchmarks, generalization to task variations is still lacking. Recent results suggest that generalization for standard architectures improves only after obtaining exhaustive amounts of data. We give evidence that generalization capabilities are in many cases bottlenecked by the inability to generalize on the combinatorial aspects of the problem. Furthermore, we show that for a certain subclass of the MDP framework, this can be alleviated by neuro-algorithmic architectures. Many control problems require long-term planning that is hard to solve generically with neural networks alone. We introduce a neuro-algorithmic policy architecture consisting of a neural network and an embedded time-dependent shortest path solver. These policies can be trained end-to-end by blackbox differentiation. We show that this type of architecture generalizes well to unseen variations in the environment already after seeing a few examples."}}
{"id": "nI-MEn9hyXn", "cdate": 1609459200000, "mdate": 1633301379717, "content": {"title": "CombOptNet: Fit the Right NP-Hard Problem by Learning Integer Programming Constraints", "abstract": "Bridging logical and algorithmic reasoning with modern machine learning techniques is a fundamental challenge with potentially transformative impact. On the algorithmic side, many NP-hard problems ..."}}
{"id": "eLpqubBqgPK", "cdate": 1609459200000, "mdate": 1633301379766, "content": {"title": "CombOptNet: Fit the Right NP-Hard Problem by Learning Integer Programming Constraints", "abstract": "Bridging logical and algorithmic reasoning with modern machine learning techniques is a fundamental challenge with potentially transformative impact. On the algorithmic side, many NP-hard problems can be expressed as integer programs, in which the constraints play the role of their \"combinatorial specification.\" In this work, we aim to integrate integer programming solvers into neural network architectures as layers capable of learning both the cost terms and the constraints. The resulting end-to-end trainable architectures jointly extract features from raw data and solve a suitable (learned) combinatorial problem with state-of-the-art integer programming solvers. We demonstrate the potential of such layers with an extensive performance analysis on synthetic data and with a demonstration on a competitive computer vision keypoint matching benchmark."}}
{"id": "aXJk5s9DH9", "cdate": 1609459200000, "mdate": 1633301379723, "content": {"title": "Neuro-algorithmic Policies Enable Fast Combinatorial Generalization", "abstract": "Although model-based and model-free approaches to learning the control of systems have achieved impressive results on standard benchmarks, generalization to task variations is still lacking. Recent..."}}
{"id": "HmNDIQk4Yj5", "cdate": 1609459200000, "mdate": 1633301379714, "content": {"title": "Demystifying Inductive Biases for (Beta-)VAE Based Architectures", "abstract": "The performance of Beta-Variational-Autoencoders and their variants on learning semantically meaningful, disentangled representations is unparalleled. On the other hand, there are theoretical argum..."}}
{"id": "5raigLM_wjU", "cdate": 1609459200000, "mdate": 1633301379715, "content": {"title": "Making Higher Order MOT Scalable: An Efficient Approximate Solver for Lifted Disjoint Paths", "abstract": "We present an efficient approximate message passing solver for the lifted disjoint paths problem (LDP), a natural but NP-hard model for multiple object tracking (MOT). Our tracker scales to very large instances that come from long and crowded MOT sequences. Our approximate solver enables us to process the MOT15/16/17 benchmarks without sacrificing solution quality and allows for solving MOT20, which has been out of reach up to now for LDP solvers due to its size and complexity. On all these four standard MOT benchmarks we achieve performance comparable or better than current state-of-the-art methods including a tracker based on an optimal LDP solver."}}
{"id": "-3qCWheZhxU", "cdate": 1602926480159, "mdate": null, "content": {"title": "Fit The Right NP-Hard Problem: End-to-end Learning of Integer Programming Constraints", "abstract": "Bridging logical and algorithmic reasoning with modern machine learning\ntechniques is a fundamental challenge with potentially transformative impact.\nOn the algorithmic side, many NP-Hard problems can be expressed as integer\nprograms, in which the constraints play the role of their ``combinatorial\nspecification''. In this work, we aim to integrate integer programming solvers\ninto neural network architectures by providing loss functions for \\emph{both}\nthe objective and the constraints. The resulting end-to-end trainable\narchitectures have the power of jointly extracting features from raw data and\nof solving a suitable (learned) combinatorial problem with state-of-the-art\ninteger programming solvers. We experimentally validate our approach on\nartificial datasets created from random constraints, and on solving\n\\textsc{Knapsack} instances from their description in natural language."}}
