{"id": "OGWiDK0QjM", "cdate": 1672531200000, "mdate": 1685408048161, "content": {"title": "Tell Me About It: Adolescent Self-Disclosure with an Online Robot for Mental Health", "abstract": ""}}
{"id": "eirOBaFvWJ", "cdate": 1640995200000, "mdate": 1685408048148, "content": {"title": "Following Natural Language Instructions for Household Tasks With Landmark Guided Search and Reinforced Pose Adjustment", "abstract": "We study the challenging problem of following natural language instructions on a mobile manipulator robot. This task is challenging because it requires the robot to integrate the semantics of the unconstrained natural language instructions with the robot’s egocentric visual observations of the environment which are typically incomplete and noisy. To address these challenges, we propose a method that is able to use visible landmarks to more efficiently explore the environment in search of the objects described by the natural language instructions. Additionally, we propose using a pose adjustment policy during manipulation planning to help the robot recover from noisy visual observations. We show that this policy can be trained through experience with reinforcement learning as well as with human-in-the-loop feedback. We evaluate our approach on the popular ALFRED instruction following benchmark and show that these methods achieve state-of-the-art performance (35.41%) with a substantial (8.92% absolute) gap from prior work."}}
{"id": "0WDtVJVwBcf", "cdate": 1624097108926, "mdate": null, "content": {"title": "Learning Backchanneling Behaviors for a Social Robot via Data Augmentation from Human-Human Conversations", "abstract": "Backchanneling behaviors on a robot, such as nodding, can make talking to a robot feel more natural and engaging by giving a sense that the robot is actively listening. For backchanneling to be effective, it is important that the timing of such cues is appropriate given the humans' conversational behaviors. Recent progress has shown that these behaviors can be learned from datasets of human-human conversations. However, recent data-driven methods tend to overfit to the human speakers that are seen in training data and fail to generalize well to previously unseen speakers. In this paper, we explore the use of data augmentation for effective nodding behavior in a robot. We show that, by augmenting the input speech and visual features, we can produce data-driven models that are more robust to unseen features without collecting additional data. We analyze the efficacy of data-driven backchanneling in a realistic human-robot conversational setting with a user study, showing that users perceived the data-driven model to be better at listening as compared to rule-based and random baselines."}}
{"id": "gFqRNwtUfqH", "cdate": 1609459200000, "mdate": 1685408048146, "content": {"title": "Learning Backchanneling Behaviors for a Social Robot via Data Augmentation from Human-Human Conversations", "abstract": "Backchanneling behaviors on a robot, such as nodding, can make talking to a robot feel more natural and engaging by giving a sense that the robot is actively listening. For backchanneling to be eff..."}}
{"id": "8bcoYTLEV3I", "cdate": 1546300800000, "mdate": null, "content": {"title": "Vision-and-Dialog Navigation", "abstract": "Robots navigating in human environments should use language to ask for assistance and be able to understand human responses. To study this challenge, we introduce Cooperative Vision-and-Dialog Navi..."}}
