{"id": "qVbD24X5lH5", "cdate": 1693831685728, "mdate": 1693831685728, "content": {"title": "Tipping Point Forecasting in Non-Stationary Dynamics on Function Spaces", "abstract": "Tipping points are abrupt, drastic, and often irreversible changes in the evolution of non-stationary and chaotic dynamical systems. For instance, increased greenhouse gas concentrations are predicted to lead to drastic decreases in low cloud cover, referred to as a climatological tipping point. In this paper, we learn the evolution of such non-stationary dynamical systems using a novel recurrent neural operator (RNO), which learns mappings between function spaces. After training RNO on only the pre-tipping dynamics, we employ it to detect future tipping points using an uncertainty-based approach. In particular, we propose a conformal prediction framework to forecast tipping points by monitoring deviations from physics con- straints (such as conserved quantities and partial differential equations), enabling forecasting of these abrupt changes along with a rigorous measure of uncertainty. We illustrate our proposed methodology on non-stationary ordinary and partial differential equations, such as the Lorenz-63 and Kuramoto-Sivashinsky equations. We also apply our methods to forecast a climate tipping point in stratocumulus cloud cover. In our experiments, we demonstrate that even partial or approximate physics constraints can be used to accurately forecast future tipping points."}}
{"id": "1s-vejbR3V7", "cdate": 1672531200000, "mdate": 1695949385362, "content": {"title": "Tipping Point Forecasting in Non-Stationary Dynamics on Function Spaces", "abstract": "Tipping points are abrupt, drastic, and often irreversible changes in the evolution of non-stationary and chaotic dynamical systems. For instance, increased greenhouse gas concentrations are predicted to lead to drastic decreases in low cloud cover, referred to as a climatological tipping point. In this paper, we learn the evolution of such non-stationary dynamical systems using a novel recurrent neural operator (RNO), which learns mappings between function spaces. After training RNO on only the pre-tipping dynamics, we employ it to detect future tipping points using an uncertainty-based approach. In particular, we propose a conformal prediction framework to forecast tipping points by monitoring deviations from physics constraints (such as conserved quantities and partial differential equations), enabling forecasting of these abrupt changes along with a rigorous measure of uncertainty. We illustrate our proposed methodology on non-stationary ordinary and partial differential equations, such as the Lorenz-63 and Kuramoto-Sivashinsky equations. We also apply our methods to forecast a climate tipping point in stratocumulus cloud cover. In our experiments, we demonstrate that even partial or approximate physics constraints can be used to accurately forecast future tipping points."}}
{"id": "1C36tFZn7sR", "cdate": 1652737357656, "mdate": null, "content": {"title": "Learning Chaotic Dynamics in Dissipative Systems", "abstract": "Chaotic systems are notoriously challenging to predict because of their sensitivity to perturbations and errors due to time stepping. Despite this unpredictable behavior, for many dissipative systems the statistics of the long term trajectories are governed by an invariant measure supported on a set, known as the global attractor; for many problems this set is finite dimensional, even if the state space is infinite dimensional. For Markovian systems, the statistical properties of long-term trajectories are uniquely determined by the solution operator that maps the evolution of the system over arbitrary positive time increments. In this work, we propose a machine learning framework to learn the underlying solution operator for dissipative chaotic systems, showing that the resulting learned operator accurately captures short-time trajectories and long-time statistical behavior. Using this framework, we are able to predict various statistics of the invariant measure for the turbulent Kolmogorov Flow dynamics with Reynolds numbers up to $5000$."}}
{"id": "lEceEedAWa", "cdate": 1640995200000, "mdate": 1683921839225, "content": {"title": "Learning Chaotic Dynamics in Dissipative Systems", "abstract": "Chaotic systems are notoriously challenging to predict because of their sensitivity to perturbations and errors due to time stepping. Despite this unpredictable behavior, for many dissipative systems the statistics of the long term trajectories are governed by an invariant measure supported on a set, known as the global attractor; for many problems this set is finite dimensional, even if the state space is infinite dimensional. For Markovian systems, the statistical properties of long-term trajectories are uniquely determined by the solution operator that maps the evolution of the system over arbitrary positive time increments. In this work, we propose a machine learning framework to learn the underlying solution operator for dissipative chaotic systems, showing that the resulting learned operator accurately captures short-time trajectories and long-time statistical behavior. Using this framework, we are able to predict various statistics of the invariant measure for the turbulent Kolmogorov Flow dynamics with Reynolds numbers up to $5000$."}}
{"id": "imXXyV5ezUc", "cdate": 1640995200000, "mdate": 1683921839221, "content": {"title": "Ice Thickness From Deep Learning and Conditional Random Fields: Application to Ice-Penetrating Radar Data With Radiometric Validation", "abstract": "Identifying the location of the ice–bedrock interface of glaciers and ice sheets is crucial for a wide range of geophysical applications, such as searching for liquid water in basal regions and computing ice thickness to quantify ice sheet and glacier mass balance. Simple, record-by-record, approaches to detecting the bottom of the ice echo may be affected by spurious off-nadir noise that requires significant manual interaction to correct. In this article, we propose a deep learning model based on convolutional neural networks (CNNs) and continuous conditional random fields (CCRFs) to automate ice bed identification and better capture fine-grained basal detail. We deploy this approach on high-capability radar sounder (HiCARS) radargrams, and this is the first time deep learning methods have been applied to this dataset. Intuitively, our CNN captures the global geometry of the ice bed, while the CCRF adjusts the initial CNN outputs to better incorporate fine-scale spatial information into the final prediction. We also develop a coherent geophysical framework using three echo characters (along-track continuity, relative delay, and signal coherency) to compare our model’s outputs with those of a manually targeted approach. Our analysis suggests that our CNN + CCRF model is as suitable as the manual approach for radiometric applications, and it outperforms the manual technique in identifying the first continuous return, which is most often the near-nadir reflection. Thus, our approach is more universal than the current manual labeling methodology in the range of geophysical applications where it can be used, and it provides better confidence regarding the source of the basal return detected."}}
