{"id": "fLVFbMhyrg", "cdate": 1640995200000, "mdate": 1681744022806, "content": {"title": "On the Ranking Recovery from Noisy Observations up to a Distortion", "abstract": "This paper considers the problem of recovering the ranking of a data vector from noisy observations, up to a distortion. Specifically, the noisy observations consist of the original data vector corrupted by isotropic additive Gaussian noise, and the distortion is measured in terms of a distance function between the estimated ranking and the true ranking of the original data vector. First, it is shown that an optimal (in terms of error probability) decision rule for the estimation task simply outputs the ranking of the noisy observation. Then, the error probability incurred by such a decision rule is characterized in the low-noise regime, and shown to grow sublinearly with the noise standard deviation. This result highlights that the proposed approximate version of the ranking recovery problem is significantly less noise-dominated than the exact recovery considered in [Jeong, ISIT 2021]."}}
{"id": "cyROJQB5qG", "cdate": 1609459200000, "mdate": 1681744022813, "content": {"title": "Retrieving Data Permutations from Noisy Observations: High and Low Noise Asymptotics", "abstract": "This paper considers the problem of recovering the permutation of an n-dimensional random vector X observed in Gaussian noise. First, a general expression for the probability of error is derived when a linear decoder (i.e., linear estimator followed by a sorting operation) is used. The derived expression holds with minimal assumptions on the distribution of X and when the noise has memory. Second, for the case of isotropic noise (i.e., noise with a diagonal scalar covariance matrix), the rates of convergence of the probability of error are characterized in the high and low noise regimes. In the low noise regime, for every dimension <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$n$</tex> , the probability of error is shown to behave proportionally to <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\sigma$</tex> , where <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\sigma$</tex> is the noise standard deviation. Moreover, the slope is computed exactly for several distributions and it is shown to behave quadratically in <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$n$</tex> . In the high noise regime, for every dimension <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$n$</tex> , the probability of correctness is shown to behave as <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$1/\\sigma$</tex> , and the exact expression for the rate of convergence is also provided."}}
{"id": "hQqpXJ1RdW", "cdate": 1577836800000, "mdate": 1681744022814, "content": {"title": "Gradient of Error Probability of $M$-ary Hypothesis Testing Problems Under Multivariate Gaussian Noise", "abstract": "This letter considers an M-ary hypothesis testing problem on an n-dimensional random vector perturbed by the addition of Gaussian noise. A novel expression for the gradient of the error probability, with respect to the covariance matrix of the noise, is derived and shown to be a function of the cross-covariance matrix between the noise matrix (i.e., the matrix obtained by multiplying the noise vector by its transpose) and Bernoulli random variables associated with the correctness event."}}
{"id": "D2OsVVqjWSO", "cdate": 1577836800000, "mdate": 1681744022780, "content": {"title": "Recovering Structure of Noisy Data through Hypothesis Testing", "abstract": "This paper considers a noisy data structure recovery problem. Specifically, the goal is to investigate the following question: Given a noisy observation of the data, according to which permutation was the original data sorted? The main focus is on scenarios where data is generated according to an isotropic Gaussian distribution, and the perturbation consists of adding Gaussian noise with diagonal scalar covariance matrix. This problem is posed within a hypothesis testing framework. First, the optimal decision criterion is characterized and shown to be identical to the hypothesis of the observation. Then, by leveraging the structure of the optimal decision criterion, the probability of error is characterized. Finally, the logarithmic behavior (i.e., the exponent) of the probability of error is derived in the regime where the dimension of the data goes to infinity."}}
{"id": "9MVmnzyZpLa", "cdate": 1577836800000, "mdate": 1681744022792, "content": {"title": "Recovering Data Permutations From Noisy Observations: The Linear Regime", "abstract": "This article considers a noisy data structure recovery problem. The goal is to investigate the following question: given a noisy observation of a permuted data set, according to which permutation was the original data sorted? The focus is on scenarios where data is generated according to an isotropic Gaussian distribution, and the noise is additive Gaussian with an arbitrary covariance matrix. This problem is posed within a hypothesis testing framework. The objective is to study the linear regime in which the optimal decoder has a polynomial complexity in the data size, and it declares the permutation by simply computing a permutation-independent linear function of the noisy observations. The main result of this article is a complete characterization of the linear regime in terms of the noise covariance matrix. Specifically, it is shown that this matrix must have a very flat spectrum with at most three distinct eigenvalues to induce the linear regime. Several practically relevant implications of this result are discussed, and the error probability incurred by the decision criterion in the linear regime is also characterized. A core technical component consists of using linear algebraic and geometric tools, such as Steiner symmetrization."}}
{"id": "AIz_Nb04G0f", "cdate": 1546300800000, "mdate": 1681744022799, "content": {"title": "SC-Fano Decoding of Polar Codes", "abstract": "For finite-length polar codes, the standard successive cancellation (SC) decoding has been improved, such as SC-List (SCL), SC-Stack (SCS), and SC-Flip (SCF) decodings. In this paper, we present an alternative improvement of SC decoding by incorporating the Fano sequential decoding into SC decoding. This is referred to as SC-Fano decoding. Specifically, it can address the major drawback of SC decoding by enabling moving-backward when the reliability of an on-going path is not good enough. The SCS and SC-Fano decodings can be viewed as the sequential decoding for polar codes. In addition, for cyclic-redundancy-check (CRC) concatenated polar codes, we enhance SC-Fano decoding by leveraging the bit-flipping idea of SCF decoding. The simulation results demonstrate that the proposed SC-Fano decoding can provide better performance-complexity tradeoff than the existing decoding methods."}}
{"id": "uonKZrsopm", "cdate": 1514764800000, "mdate": 1681744022778, "content": {"title": "An Efficient Construction of Rate-Compatible Punctured Polar (RCPP) Codes Using Hierarchical Puncturing", "abstract": "In this paper, we present an efficient method to construct a good rate-compatible punctured polar (RCPP) code for incremental redundancy hybrid automatic repeat request schemes. One of the major challenges on the construction of a RCPP code is to optimize a common information set which is good for all the (punctured) polar codes in the family. Unfortunately, there is no efficient way to solve the above problem. In the proposed construction, a common information set is simply optimized for the highest-rate code in the family and then it is updated to yield an effective information set for each other code, by keeping the condition that information bits are unchanged during retransmissions. This is enabled by presenting a novel hierarchical (or reciprocal) puncturing and information-copy technique. Specifically, some information bits are copied to frozen-bit channels whose locations are carefully determined according to rate-compatible puncturing patterns. This yields an information-dependent frozen vector in the encoding part. Also, in the decoding part, the effective information sets are obtained by properly combining the common information set and the information-dependent frozen vector. More importantly, the impact of unknown frozen bits are avoided due to the special structure of the proposed hierarchical (or reciprocal) puncturing. Simulation results verify that the proposed RCPP code can yield a significant performance gain (about 2 dB) over a benchmark RCPP code where both codes use the same rate-compatible puncturing patterns but the latter uses the conventional all-zero frozen vector. Therefore, the proposed method would be crucial to construct a good RCPP code efficiently."}}
