{"id": "w3iXSZSdKu", "cdate": 1672531200000, "mdate": 1699285729344, "content": {"title": "A Data-Centric Online Market for Machine Learning: From Discovery to Pricing", "abstract": "Data fuels machine learning (ML) - rich and high-quality training data is essential to the success of ML. However, to transform ML from the race among a few large corporations to an accessible technology that serves numerous normal users' data analysis requests, there still exist important challenges. One gap we observed is that many ML users can benefit from new data that other data owners possess, whereas these data owners sit on piles of data without knowing who can benefit from it. This gap creates the opportunity for building an online market that can automatically connect supply with demand. While online matching markets are prevalent (e.g., ride-hailing systems), designing a data-centric market for ML exhibits many unprecedented challenges. This paper develops new techniques to tackle two core challenges in designing such a market: (a) to efficiently match demand with supply, we design an algorithm to automatically discover useful data for any ML task from a pool of thousands of datasets, achieving high-quality matching between ML models and data; (b) to encourage market participation of ML users without much ML expertise, we design a new pricing mechanism for selling data-augmented ML models. Furthermore, our market is designed to be API-compatible with existing online ML markets like Vertex AI and Sagemaker, making it easy to use while providing better results due to joint data and model search. We envision that the synergy of our data and model discovery algorithm and pricing mechanism will be an important step towards building a new data-centric online market that serves ML users effectively."}}
{"id": "GoPbIIKuNX", "cdate": 1672531200000, "mdate": 1693662503902, "content": {"title": "Robust Stackelberg Equilibria", "abstract": "This paper provides a systematic study of the robust Stackelberg equilibrium (RSE), which naturally generalizes the widely adopted solution concept of the strong Stackelberg equilibrium (SSE). The RSE accounts for any possible up-to-δ suboptimal follower responses in Stackelberg games and is adopted to improve the robustness of the leader's strategy. While a few variants of robust Stackelberg equilibrium have been considered in previous literature, the RSE solution concept we consider is importantly different --- in some sense, it relaxes previously studied robust Stackelberg strategies and is applicable to much broader sources of uncertainties."}}
{"id": "Az4e4_wcQh", "cdate": 1672531200000, "mdate": 1693662503863, "content": {"title": "Robust Stackelberg Equilibria", "abstract": "This paper provides a systematic study of the robust Stackelberg equilibrium (RSE), which naturally generalizes the widely adopted solution concept of the strong Stackelberg equilibrium (SSE). The RSE accounts for any possible up-to-$\\delta$ suboptimal follower responses in Stackelberg games and is adopted to improve the robustness of the leader's strategy. While a few variants of robust Stackelberg equilibrium have been considered in previous literature, the RSE solution concept we consider is importantly different -- in some sense, it relaxes previously studied robust Stackelberg strategies and is applicable to much broader sources of uncertainties. We provide a thorough investigation of several fundamental properties of RSE, including its utility guarantees, algorithmics, and learnability. We first show that the RSE we defined always exists and thus is well-defined. Then we characterize how the leader's utility in RSE changes with the robustness level considered. On the algorithmic side, we show that, in sharp contrast to the tractability of computing an SSE, it is NP-hard to obtain a fully polynomial approximation scheme (FPTAS) for any constant robustness level. Nevertheless, we develop a quasi-polynomial approximation scheme (QPTAS) for RSE. Finally, we examine the learnability of the RSE in a natural learning scenario, where both players' utilities are not known in advance, and provide almost tight sample complexity results on learning the RSE. As a corollary of this result, we also obtain an algorithm for learning SSE, which strictly improves a key result of Bai et al. in terms of both utility guarantee and computational efficiency."}}
{"id": "mgJWwcBrNI3", "cdate": 1640995200000, "mdate": 1681828082200, "content": {"title": "First-Order Convex Fitting and Its Application to Economics and Optimization", "abstract": "This paper studies a function fitting problem which we coin first-order convex fitting (FCF): given any two vector sequences x1, ..., xT and p1, ..., pT, when is it possible to efficiently construct a convex function f(x) that ``fits'' the two sequences in the first-order sense, i.e, the (sub)gradient of f(xi) equals precisely pi, for all i = 1, ..., T? Despite a basic question of convex analysis, FCF has surprisingly been overlooked in the past literature. With an efficient constructive proof, we provide a clean answer to this question: FCF is possible if and only if the two sequences are permutation stable: p1 * x1 + ... + pT * xT is greater than or equal to p1 * x’1 + ... + pT * x’T where x’1, ..., x’T is any permutation of x1, ..., xT. We demonstrate the usefulness of FCF in two applications. First, we study how it can be used as an empirical risk minimization procedure to learn the original convex function. We provide efficient PAC-learnability bounds for special classes of convex functions learned via FCF, and demonstrate its application to multiple economic problems where only function gradients (as opposed to function values) can be observed. Second, we empirically show how it can be used as a surrogate to significantly accelerate the minimization of the original convex function."}}
{"id": "SCaL3nP8ML7", "cdate": 1640995200000, "mdate": 1681828082201, "content": {"title": "Optimal Coordination in Generalized Principal-Agent Problems: A Revisit and Extensions", "abstract": "In the principal-agent problem formulated in [Myerson 1982], agents have private information (type) and make private decisions (action), both of which are unobservable to the principal. Myerson pointed out an elegant solution that relies on the revelation principle, which states that without loss of generality optimal coordination mechanisms of this problem can be assumed to be truthful and direct. Consequently, the problem can be solved by a linear program when the support sets of the action and type spaces are finite. In this paper, we extend Myerson's results to the setting where the principal's action space might be infinite and subject to additional design constraints. This generalized principal-agent model unifies several important design problems -- including contract design, information design, and Bayesian Stackelberg games -- and encompasses them as special cases. We present a revelation principle for this general model, based on which a polynomial-time algorithm is derived for computing the optimal coordination mechanism. This algorithm not only implies new efficient algorithms simultaneously for all the aforementioned special cases but also significantly simplifies previous approaches in the literature."}}
{"id": "TqvwWkdlLIk", "cdate": 1621629862133, "mdate": null, "content": {"title": "The Limits of Optimal Pricing in the Dark", "abstract": "A ubiquitous learning problem in today’s digital market is, during repeated interactions between a seller and a buyer, how a seller can gradually learn optimal pricing decisions based on the buyer’s past purchase responses. A fundamental challenge of learning in such a strategic setup is that the buyer will naturally have incentives to manipulate his responses in order to induce more favorable learning outcomes for him. To understand the limits of the seller’s learning when facing such a strategic and possibly manipulative buyer, we study a natural yet powerful buyer manipulation strategy. That is, before the pricing game starts, the buyer simply commits to “imitate” a different value function by pretending to always react optimally according to this imitative value function. \n\nWe fully characterize the optimal imitative value function that the buyer should imitate as well as the resultant seller revenue and buyer surplus under this optimal buyer manipulation. Our characterizations reveal many useful insights about what happens at equilibrium. For example, a seller with concave production cost will obtain essentially 0 revenue at equilibrium whereas the revenue for a seller with convex production cost is the Bregman divergence of her cost function between no production and certain production. Finally, and importantly, we show that a more powerful class of pricing schemes does not necessarily increase, in fact, may be harmful to, the seller’s revenue. Our results not only lead to an effective prescriptive way for buyers to manipulate learning algorithms but also shed lights on the limits of what a seller can really achieve when pricing in the dark."}}
{"id": "p3AliPfQI6", "cdate": 1609459200000, "mdate": 1681828082212, "content": {"title": "The Limits of Optimal Pricing in the Dark", "abstract": "A ubiquitous learning problem in today's digital market is, during repeated interactions between a seller and a buyer, how a seller can gradually learn optimal pricing decisions based on the buyer's past purchase responses. A fundamental challenge of learning in such a strategic setup is that the buyer will naturally have incentives to manipulate his responses in order to induce more favorable learning outcomes for him. To understand the limits of the seller's learning when facing such a strategic and possibly manipulative buyer, we study a natural yet powerful buyer manipulation strategy. That is, before the pricing game starts, the buyer simply commits to \"imitate\" a different value function by pretending to always react optimally according to this imitative value function. We fully characterize the optimal imitative value function that the buyer should imitate as well as the resultant seller revenue and buyer surplus under this optimal buyer manipulation. Our characterizations reveal many useful insights about what happens at equilibrium. For example, a seller with concave production cost will obtain essentially 0 revenue at equilibrium whereas the revenue for a seller with convex production cost is the Bregman divergence of her cost function between no production and certain production. Finally, and importantly, we show that a more powerful class of pricing schemes does not necessarily increase, in fact, may be harmful to, the seller's revenue. Our results not only lead to an effective prescriptive way for buyers to manipulate learning algorithms but also shed lights on the limits of what a seller can really achieve when pricing in the dark."}}
{"id": "NuNuX7UprO", "cdate": 1609459200000, "mdate": 1681828082206, "content": {"title": "The Limits of Optimal Pricing in the Dark", "abstract": "A ubiquitous learning problem in today’s digital market is, during repeated interactions between a seller and a buyer, how a seller can gradually learn optimal pricing decisions based on the buyer’s past purchase responses. A fundamental challenge of learning in such a strategic setup is that the buyer will naturally have incentives to manipulate his responses in order to induce more favorable learning outcomes for him. To understand the limits of the seller’s learning when facing such a strategic and possibly manipulative buyer, we study a natural yet powerful buyer manipulation strategy. That is, before the pricing game starts, the buyer simply commits to “imitate” a different value function by pretending to always react optimally according to this imitative value function. We fully characterize the optimal imitative value function that the buyer should imitate as well as the resultant seller revenue and buyer surplus under this optimal buyer manipulation. Our characterizations reveal many useful insights about what happens at equilibrium. For example, a seller with concave production cost will obtain essentially 0 revenue at equilibrium whereas the revenue for a seller with convex production cost is the Bregman divergence of her cost function between no production and certain production. Finally, and importantly, we show that a more powerful class of pricing schemes does not necessarily increase, in fact, may be harmful to, the seller’s revenue. Our results not only lead to an effective prescriptive way for buyers to manipulate learning algorithms but also shed lights on the limits of what a seller can really achieve when pricing in the dark."}}
{"id": "Am89am6_MhRF", "cdate": 1451606400000, "mdate": 1652979249146, "content": {"title": "Item Sorting Platform Based on Cloud Computing", "abstract": "As the pace of modern life gets much faster, time is becoming more and more valuable among the crowds. Too much information winds right in people's face, and they feel difficult to remember everything properly and hardly find useful information through existing tools. At present, we don't have an intelligent and helpful application for sorting personal belongings or a map application which provides a function for sharing areas. People often waste too much time looking for things. Some existing solutions are very simple and we can't add things conveniently. In this paper, we demonstrate the item-oriented Location-Based Mobile Services (LBMSs), which is a daily itemsorting application based on Bmob Cloud Platform, to solve this problem. Based on the geographical location, we propose a query items algorithm on the cloud computing platform, which plays a vital role in E-business service and application field. We utilize a map-based interface for visualizing the distribution of personal items and sharing information. It can be used as a private memo for recording items in the Photo + Text + Map way. It is also a public community for exchanging useful geolocation information between users. The proposed item-sorting helper is developed with cloud computing techniques, which relies on sharing of resources and focuses on maximizing the effectiveness of the shared resources. Sorting items on cloud is more private and convenient, which provides unlimited capacity and reliable service. Experimental results show that this application can function properly, it will help people sort items efficiently and get location tips in real-time."}}
