{"id": "q-tTkgjuiv5", "cdate": 1652737480242, "mdate": null, "content": {"title": "Graphical Resource Allocation with Matching-Induced Utilities", "abstract": "Motivated by real-world applications, we study the fair allocation of graphical resources, where \nthe resources are the vertices in a graph. Upon receiving a set of resources, an agent's utility equals the weight of the maximum matching in the induced subgraph. We care about maximin share (MMS) fairness and envy-freeness up to one item (EF1). Regarding MMS fairness, the problem does not admit a finite approximation ratio for heterogeneous agents. For homogeneous agents, we design constant-approximation polynomial-time algorithms, and also note that significant amount of social welfare is sacrificed inevitably in order to ensure (approximate) MMS fairness. We then consider EF1 allocations whose existence is guaranteed. We show that for homogeneous agents, there is an EF1 allocation that ensures at least a constant fraction of the maximum possible social welfare. However, the social welfare guarantee of EF1 allocations degrades to $1/n$ for heterogeneous agents, where $n$ is the number of agents. Fortunately, for two special yet typical cases, namely binary-weight and two-agent, we are able to design polynomial-time algorithms ensuring a constant fractions of the maximum social welfare."}}
{"id": "QMJb9BvLqXU", "cdate": 1621629911373, "mdate": null, "content": {"title": "Fair Scheduling for Time-dependent Resources", "abstract": "We study a fair resource scheduling problem, where a set of interval jobs are to be allocated to heterogeneous machines controlled by intellectual agents.\nEach job is associated with release time, deadline, and processing time such that it can be processed if its complete processing period is between its release time and deadline. \nThe machines gain possibly different utilities by processing different jobs, and all jobs assigned to the same machine should be processed without overlap.\nWe consider two widely studied solution concepts, namely, maximin share fairness and envy-freeness.\nFor both criteria, we discuss the extent to which fair allocations exist and present constant approximation algorithms for various settings. "}}
{"id": "pmP-Vfu1s01", "cdate": 1609459200000, "mdate": null, "content": {"title": "Two-facility Location Games with Minimum Distance Requirement", "abstract": "We study the mechanism design problem of a social planner for locating two facilities on a line interval [0, 1], where a set of n strategic agents report their locations and a mechanism determines the locations of the two facilities. We consider the requirement of a minimum distance 0 ≤ d ≤ 1 between the two facilities. Given the two facilities are heterogeneous, we model the cost/utility of an agent as the sum of his distances to both facilities. In the heterogeneous two-facility location game to minimize the social cost, we show that the optimal solution can be computed in polynomial time and prove that carefully choosing one optimal solution as output is strategyproof. We also design a strategyproof mechanism minimizing the maximum cost. Given the two facilities are homogeneous, we model the cost/utility of an agent as his distance to the closer facility. In the homogeneous two-facility location game for minimizing the social cost, we show that any deterministic strategyproof mechanism has unbounded approximation ratio. Moreover, in the obnoxious heterogeneous two-facility location game for maximizing the social utility, we propose new deterministic group strategyproof mechanisms with provable approximation ratios and establish a lower bound (7 − d)/6 for any deterministic strategyproof mechanism. We also design a strategyproof mechanism maximizing the minimum utility. In the obnoxious homogeneous two-facility location game for maximizing the social utility, we propose deterministic group strategyproof mechanisms with provable approximation ratios and establish a lower bound 4/3. Besides, in the two-facility location game with triple-preference, where each facility may be favorable, obnoxious, indifferent for any agent, we further motivate agents to report both their locations and preferences towards the two facilities truthfully, and design a deterministic group strategyproof mechanism with an approximation ratio 4."}}
{"id": "kDyRrmTy98b", "cdate": 1609459200000, "mdate": null, "content": {"title": "Strategic Learning Approach for Deploying UAV-Provided Wireless Services", "abstract": "Unmanned Aerial Vehicle (UAV) have emerged as a promising technique to rapidly provide wireless services to a group of mobile users simultaneously. The article aims to address a challenging issue that each user is selfish and may misreport his location or preference for changing the optimal UAV location to be close to himself. Using algorithmic game theory, we study how to determine the final location of a UAV in the 3D space, by ensuring all selfish users' truthfulness in reporting their locations for learning purpose. To minimize the social service cost in this UAV placement game, we design strategyproof mechanisms with the approximation ratios, when comparing to the social optimum. We also study the obnoxious UAV placement game to maximally keep their social utility, where each incumbent user may misreport his location to keep the UAV away from him. Moreover, we present the dual-preference UAV placement game by considering the coexistence of the two groups of users above, where users can misreport both their locations and preference types (favorable or obnoxious) towards the UAV. Finally, we extend the three games above to include multiple UAVs and design strategyproof mechanisms with provable approximation ratios."}}
{"id": "LS7GjeH4Jc", "cdate": 1609459200000, "mdate": null, "content": {"title": "Maximizing approximately k-submodular functions", "abstract": "We introduce the problem of maximizing approximately $k$-submodular functions subject to size constraints. In this problem, one seeks to select $k$-disjoint subsets of a ground set with bounded total size or individual sizes, and maximum utility, given by a function that is \"close\" to being $k$-submodular. The problem finds applications in tasks such as sensor placement, where one wishes to install $k$ types of sensors whose measurements are noisy, and influence maximization, where one seeks to advertise $k$ topics to users of a social network whose level of influence is uncertain. To deal with the problem, we first provide two natural definitions for approximately $k$-submodular functions and establish a hierarchical relationship between them. Next, we show that simple greedy algorithms offer approximation guarantees for different types of size constraints. Last, we demonstrate experimentally that the greedy algorithms are effective in sensor placement and influence maximization problems."}}
{"id": "xGuN0rmqR3T", "cdate": 1577836800000, "mdate": null, "content": {"title": "Facility location games with optional preference", "abstract": "In this paper, we study the optional preference model of the facility location game problem with two heterogeneous facilities on a line. The preference of each agent is one of the two facilities or both facilities, and the cost of each agent is a function of the distances to the facilities that the agent prefers. We consider two cost functions: Minimum Distance and Maximum Distance functions. Aiming at minimizing the maximum cost or the social cost of agents, we propose different strategyproof mechanisms without monetary transfers and derive both lower and upper bounds of the approximation ratios with respect to strategyproof mechanisms. In the variant of Minimum Distance, we propose a 2-approximation deterministic strategyproof mechanism for the maximum cost objective, and prove a lower bound of 4/3, while for the social cost objective we propose a (                                                                                                                              n                                                                                                                                                                                           /                                                                                                                                                                                           2                                                             +1)-approximation deterministic strategyproof mechanism and prove a lower bound of 2, also a lower bound of 3/2 for randomized mechanisms. In the variant of Maximum Distance, we propose an optimal deterministic strategyproof mechanism for the maximum cost objective and a 2-approximation deterministic strategyproof mechanism for the social cost objective."}}
{"id": "w8IRsFwP4ld", "cdate": 1577836800000, "mdate": null, "content": {"title": "Online Maximum k-Interval Coverage Problem", "abstract": "We study the online maximum coverage problem on a line, in which, given an online sequence of sub-intervals (which may intersect among each other) of a target large interval and an integer k, we aim to select at most k of the sub-intervals such that the total covered length of the target interval is maximized. The decision to accept or reject each sub-interval is made immediately and irrevocably (no preemption) right at the release timestamp of the sub-interval. We comprehensively study different settings of the problem, regarding the number of total released sub-intervals, we consider the unique-number (UN) setting where the total number is known in advance and the arbitrary-number (AN) setting where the total number is not known, respectively; regarding the length of a released sub-interval, we generally consider three settings: each sub-interval is of a normalized unit-length (UL), a flexible-length (FL) in a known range, or an arbitrary-length (AL). In addition, we extend the UL setting to a generalized unit-sum (US) setting, where a batch of a finite number of disjoint sub-intervals of the unit total length is released instead at each timestamp, and accordingly k batches can be accepted. We first prove in the AL setting that no online deterministic algorithm can achieve a bounded competitive ratio. Then, we present lower bounds on the competitive ratio for the other settings concerned in this paper. For the offline problem where the sequence of all the released sub-intervals is known in advance to the decision-maker, we propose a dynamic-programming-based optimal approach as the benchmark. For the online problem, we first propose a single-threshold-based deterministic algorithm SOA by adding a sub-interval if the added length exceeds a certain threshold, achieving competitive ratios close to the lower bounds, respectively. Then, we extend to a double-thresholds-based algorithm DOA, by using the first threshold for exploration and the second threshold (larger than the first one) for exploitation. With the two thresholds solved by our proposed program, we show that DOA improves SOA in the worst-case performance. Moreover, we prove that a deterministic algorithm that accepts sub-intervals by multi non-increasing thresholds cannot outperform even SOA."}}
{"id": "qNVRq0WApzi", "cdate": 1577836800000, "mdate": null, "content": {"title": "Two-sided Auctions with Budgets: Fairness, Incentives and Efficiency", "abstract": "This paper considers the fairness in the problem of budget-feasible mechanism design in two-sided markets where multiple sellers come with indivisible items and buyers come with budgets. Buyers could untruthfully claim their budgets to procure as much value of items as possible from sellers. Each seller with a single item is required to bid his cost since the cost is privately known, while the value of each item is publicly known. A viable mechanism should satisfy buyers' fairness where a buyer with more budget can procure more value of items, and budget feasibility where buyers' respective budgets are not exceeded. The goal is to investigate budget-feasible mechanisms that guarantee the fairness, incentives and efficiency simultaneously. We consider two models by distinguishing the types of items, one with homogeneous items and one with heterogeneous items. Our main contributions are the budget-feasible mechanisms for these models that guarantee the fairness, the truthfulness both on the sellers' side and the buyers' side, and constant approximation to the optimal total procured value from sellers."}}
{"id": "pm4YyOSuoVl", "cdate": 1577836800000, "mdate": null, "content": {"title": "Strategyproof Mechanisms for Activity Scheduling", "abstract": "Recent years have seen various designs of strategyproof mechanisms in the facility location game and the obnoxious facility game, by considering the facility as a point. In this paper, we extend that point to be an interval and study a novel activity scheduling game to schedule an activity in the time domain [0,1] based on all agents' time reports. The activity lasts for a time period of d with 0≤ d≤ 1, and each agent i wants his private time ti to be within the activity duration [y,y+d] or at least as close as possible. Thus his cost is the time difference between his time ti and the activity duration [y,y+d]. The social cost is the summation of all agents' costs. Our objective is to choose the activity starting time y so that the mechanisms are strategyproof (truthful) and efficient. We design a mechanism outputting an optimal solution and prove it is group strategyproof. For minimizing the maximum cost, we also design a strategyproof mechanism with approximation ratio 2. In the obnoxious activity scheduling game, each agent prefers his conflict time ti to be far away from the activity duration [y,y+d]. We respectively design deterministic and randomized group strategyproof mechanisms with provable approximation ratios and also show the lower bounds. Besides, for extension, we consider the cost/utility as the characteristic function and find group strategyproof mechanisms for minimizing the social cost and maximizing the social utility."}}
{"id": "oDJyaTm5mdd", "cdate": 1577836800000, "mdate": null, "content": {"title": "Budgeted Facility Location Games with Strategic Facilities", "abstract": "This paper studies the facility location games with payments, where facilities are strategic players. In the game, customers and facilities are located at publicly known locations on a line segment. Each selfish facility has an opening-cost as her private information, and she may strategically report it. Upon receiving the reports, the government uses a mechanism to select some facilities to open and pay to them. The cost/utility of each customer depends on the distance to the nearest opened facility. Under a given budget B, which constrains the total payment, we derive upper and lower bounds on the approximation ratios of truthful budget feasible mechanisms for four utilitarian and egalitarian objectives, and study the case when augmented budget is allowed."}}
