{"id": "p1AIaXIYEO", "cdate": 1664248831299, "mdate": null, "content": {"title": "Adaptive Bias Correction for Improved Subseasonal Forecast", "abstract": "Subseasonal forecasting—predicting temperature and precipitation 2 to 6 weeks ahead—is critical for effective water allocation, wildfire management, and drought and flood mitigation. Recent international research efforts have advanced the subseasonal capabilities of operational dynamical models, yet temperature and precipitation prediction skills remains poor, partly due to stubborn errors in representing atmospheric dynamics and physics inside dynamical models. To counter these errors, we introduce an adaptive bias correction (ABC) method that combines state-of-the-art dynamical forecasts with observations using machine learning. When applied to the leading subseasonal model from the European Centre for Medium-Range Weather Forecasts (ECMWF), ABC improves temperature forecasting skill by 60-90% and precipitation forecasting skill by 40-69% in the contiguous U.S. We couple these performance improvements with a practical workflow, based on Cohort Shapley, for explaining ABC skill gains and identifying higher-skill windows of opportunity based on specific climate conditions."}}
{"id": "rhVnLs4THs", "cdate": 1640995200000, "mdate": 1681141760684, "content": {"title": "Robust and Agnostic Learning of Conditional Distributional Treatment Effects", "abstract": ""}}
{"id": "nzqoh6FN6sF", "cdate": 1621630203428, "mdate": null, "content": {"title": "Estimating the Long-Term Effects of Novel Treatments", "abstract": "Policy makers often need to estimate the long-term effects of novel treatments, while only having historical data of older treatment options. We propose a surrogate-based approach using a long-term dataset where only past treatments were administered and a short-term dataset where novel treatments have been administered. Our approach generalizes previous surrogate-style methods, allowing for continuous treatments and serially-correlated treatment policies while maintaining consistency and root-n asymptotically normal estimates under a Markovian assumption on the data and the observational policy. Using a semi-synthetic dataset on customer incentives from a major corporation, we evaluate the performance of our method and discuss solutions to practical challenges when deploying our methodology."}}
{"id": "J35dYbRpIv", "cdate": 1609459200000, "mdate": 1681141760670, "content": {"title": "Estimating the Long-Term Effects of Novel Treatments", "abstract": ""}}
{"id": "D4cUMm677S", "cdate": 1609459200000, "mdate": 1681141760663, "content": {"title": "Causal Inference and Machine Learning in Practice with EconML and CausalML: Industrial Use Cases at Microsoft, TripAdvisor, Uber", "abstract": ""}}
{"id": "7C2SaBWgMjm", "cdate": 1609459200000, "mdate": 1633011290109, "content": {"title": "Online Learning with Optimism and Delay", "abstract": "Inspired by the demands of real-time climate and weather forecasting, we develop optimistic online learning algorithms that require no parameter tuning and have optimal regret guarantees under delayed feedback. Our algorithms -- DORM, DORM+, and AdaHedgeD -- arise from a novel reduction of delayed online learning to optimistic online learning that reveals how optimistic hints can mitigate the regret penalty caused by delay. We pair this delay-as-optimism perspective with a new analysis of optimistic learning that exposes its robustness to hinting errors and a new meta-algorithm for learning effective hinting strategies in the presence of delay. We conclude by benchmarking our algorithms on four subseasonal climate forecasting tasks, demonstrating low regret relative to state-of-the-art forecasting models."}}
{"id": "oe9sEFZU8y", "cdate": 1546300800000, "mdate": null, "content": {"title": "Machine Learning Estimation of Heterogeneous Treatment Effects with Instruments", "abstract": "We consider the estimation of heterogeneous treatment effects with arbitrary machine learning methods in the presence of unobserved confounders with the aid of a valid instrument. Such settings arise in A/B tests with an intent-to-treat structure, where the experimenter randomizes over which user will receive a recommendation to take an action, and we are interested in the effect of the downstream action. We develop a statistical learning approach to the estimation of heterogeneous effects, reducing the problem to the minimization of an appropriate loss function that depends on a set of auxiliary models (each corresponding to a separate prediction task). The reduction enables the use of all recent algorithmic advances (e.g. neural nets, forests). We show that the estimated effect model is robust to estimation errors in the auxiliary models, by showing that the loss satisfies a Neyman orthogonality criterion. Our approach can be used to estimate projections of the true effect model on simpler hypothesis spaces. When these spaces are parametric, then the parameter estimates are asymptotically normal, which enables construction of confidence sets. We applied our method to estimate the effect of membership on downstream webpage engagement for a major travel webpage, using as an instrument an intent-to-treat A/B test among 4 million users, where some users received an easier membership sign-up process. We also validate our method on synthetic data and on public datasets for the effects of schooling on income."}}
{"id": "HkNvAcbubS", "cdate": 1546300800000, "mdate": null, "content": {"title": "Orthogonal Random Forest for Causal Inference", "abstract": "We propose the orthogonal random forest, an algorithm that combines Neyman-orthogonality to reduce sensitivity with respect to estimation error of nuisance parameters with generalized random forest..."}}
