{"id": "uBqcJ8QEe1", "cdate": 1676827090782, "mdate": null, "content": {"title": "Learning from Low Rank Tensor Data: A Random Tensor Theory Perspective", "abstract": "Under a simplified data model, this paper provides a theoretical analysis of learning from data that have an underlying low-rank tensor structure in both supervised and unsupervised settings. For the supervised setting, we provide an analysis of a Ridge classifier (with high regularization parameter) with and without knowledge of the low-rank structure of the data. Our results quantify analytically the gain in misclassification errors achieved by exploiting the low-rank structure for denoising purposes, as opposed to treating data as mere vectors. We further provide a similar analysis in the context of clustering, thereby quantifying the exact performance gap between tensor methods and standard approaches which treat data as simple vectors."}}
{"id": "qGxg90T3-S", "cdate": 1672531200000, "mdate": 1683629562373, "content": {"title": "Hotelling Deflation on Large Symmetric Spiked Tensors", "abstract": ""}}
{"id": "-glfdrbng6W", "cdate": 1652115512117, "mdate": 1652115512117, "content": {"title": "Soil Moisture Estimation Using Sentinel-1/-2 Imagery Coupled With CycleGAN for Time-Series Gap Filing", "abstract": "Fast soil moisture content (SMC) mapping is necessary\nto support water resource management and to understand\ncrop growth, quality, and yield. Therefore, earth observation (EO)\nplays a key role due to its ability of almost real-time monitoring\nof large areas at a low cost. This study aimed to explore the\npossibility of taking advantage of freely available Sentinel-1 (S1)\nand Sentinel-2 (S2) EO data for the simultaneous prediction of\nSMC with cycle-consistent adversarial network (CycleGAN) for\ntime-series gap filling. The proposed methodology, first, learns\nlatent low-dimensional representation of the satellite images,\nthen learns a simple machine learning (ML) model on top of\nthese representations. To evaluate the methodology, a series of\nvineyards, located in South Australia’s Eden valley are chosen.\nSpecifically, we presented an efficient framework for extracting\nlatent features from S1 and S2 imagery. We showed how one\ncould use S1 to S2 feature translation based on CycleGAN using\nS1 and S2 time series when there are missing images acquired\nover an area of interest. The resulting data in our study is\nthen used to fill gaps in time-series data. We used the resulting\nlatent representations to predict SMC with various ML tools.\nIn the experiments, CycleGAN and the autoencoders were trained\nwith data randomly chosen around the site of interest, so we\ncould augment the existing dataset. The best performance was\ndemonstrated with random forest (RF) algorithm, whereas linear\nregression model demonstrated significant overfitting. The experiments\ndemonstrate that the proposed methodology outperforms\nthe compared state-of-the-art methods if there are missing optical\nand synthetic-aperture radar (SAR) images."}}
{"id": "wAILtcLU9S", "cdate": 1640995200000, "mdate": 1681813386418, "content": {"title": "Node Feature Kernels Increase Graph Convolutional Network Robustness", "abstract": "The robustness of the much used Graph Convolutional Networks (GCNs) to perturbations of their input is becoming a topic of increasing importance. In this paper the random GCN is introduced for which a random matrix theory analysis is possible. This analysis suggests that if the graph is sufficiently perturbed, or in the extreme case random, then the GCN fails to benefit from the node features. It is furthermore observed that enhancing the message passing step in GCNs by adding the node feature kernel to the adjacency matrix of the graph structure solves this problem. An empirical study of a GCN utilised for node classification on six real datasets further confirms the theoretical findings and demonstrates that perturbations of the graph structure can result in GCNs performing significantly worse than Multi-Layer Perceptrons run on the node features alone. In practice, adding a node feature kernel to the message passing of perturbed graphs results in a significant improvement of the GCN’s performance, thereby rendering it more robust to graph perturbations. Our code is publicly available at: https://github.com/ChangminWu/RobustGCN."}}
{"id": "Fdf6g2FhOWy", "cdate": 1640995200000, "mdate": 1683629562571, "content": {"title": "Deciphering Lasso-based Classification Through a Large Dimensional Analysis of the Iterative Soft-Thresholding Algorithm", "abstract": "This paper proposes a theoretical analysis of a Lasso-based classification algorithm. Leveraging on a realistic regime where the dimension of the data $p$ and their number $n$ are of the same order..."}}
{"id": "BHftmSGLa1", "cdate": 1640995200000, "mdate": 1683629562364, "content": {"title": "Soil Moisture Estimation Using Sentinel-1/-2 Imagery Coupled With CycleGAN for Time-Series Gap Filing", "abstract": "Fast soil moisture content (SMC) mapping is necessary to support water resource management and to understand crop growth, quality, and yield. Therefore, earth observation (EO) plays a key role due to its ability of almost real-time monitoring of large areas at a low cost. This study aimed to explore the possibility of taking advantage of freely available Sentinel-1 (S1) and Sentinel-2 (S2) EO data for the simultaneous prediction of SMC with cycle-consistent adversarial network (CycleGAN) for time-series gap filling. The proposed methodology, first, learns latent low-dimensional representation of the satellite images, then learns a simple machine learning (ML) model on top of these representations. To evaluate the methodology, a series of vineyards, located in South Australia ’s Eden valley are chosen. Specifically, we presented an efficient framework for extracting latent features from S1 and S2 imagery. We showed how one could use S1 to S2 feature translation based on CycleGAN using S1 and S2 time series when there are missing images acquired over an area of interest. The resulting data in our study is then used to fill gaps in time-series data. We used the resulting latent representations to predict SMC with various ML tools. In the experiments, CycleGAN and the autoencoders were trained with data randomly chosen around the site of interest, so we could augment the existing dataset. The best performance was demonstrated with random forest (RF) algorithm, whereas linear regression model demonstrated significant overfitting. The experiments demonstrate that the proposed methodology outperforms the compared state-of-the-art methods if there are missing optical and synthetic-aperture radar (SAR) images."}}
{"id": "6QhjUUJDBe", "cdate": 1640995200000, "mdate": 1683629562323, "content": {"title": "Neural Networks Classify through the Class-Wise Means of Their Representations", "abstract": "In this paper, based on an asymptotic analysis of the Softmax layer, we show that when training neural networks for classification tasks, the weight vectors corre sponding to each class of the Softmax layer tend to converge to the class-wise means computed at the representation layer (for specific choices of the representation activation). We further show some consequences of our findings to the context of transfer learning, essentially by proposing a simple yet effective initialization procedure that significantly accelerates the learning of the Softmax layer weights as the target domain gets closer to the source one. Experiments are notably performed on the datasets: MNIST, Fashion MNIST, Cifar10, and Cifar100 and using a standard CNN architecture."}}
{"id": "kBBLKt4cOq", "cdate": 1609459200000, "mdate": 1683629562305, "content": {"title": "Deep Miner: A Deep and Multi-branch Network which Mines Rich and Diverse Features for Person Re-identification", "abstract": "Most recent person re-identification approaches are based on the use of deep convolutional neural networks (CNNs). These networks, although effective in multiple tasks such as classification or object detection, tend to focus on the most discriminative part of an object rather than retrieving all its relevant features. This behavior penalizes the performance of a CNN for the re-identification task, since it should identify diverse and fine grained features. It is then essential to make the network learn a wide variety of finer characteristics in order to make the re-identification process of people effective and robust to finer changes. In this article, we introduce Deep Miner, a method that allows CNNs to \"mine\" richer and more diverse features about people for their re-identification. Deep Miner is specifically composed of three types of branches: a Global branch (G-branch), a Local branch (L-branch) and an Input-Erased branch (IE-branch). G-branch corresponds to the initial backbone which predicts global characteristics, while L-branch retrieves part level resolution features. The IE-branch for its part, receives partially suppressed feature maps as input thereby allowing the network to \"mine\" new features (those ignored by G-branch) as output. For this special purpose, a dedicated suppression procedure for identifying and removing features within a given CNN is introduced. This suppression procedure has the major benefit of being simple, while it produces a model that significantly outperforms state-of-the-art (SOTA) re-identification methods. Specifically, we conduct experiments on four standard person re-identification benchmarks and witness an absolute performance gain up to 6.5% mAP compared to SOTA."}}
{"id": "S8Li4pfLjzP", "cdate": 1609459200000, "mdate": 1683629562325, "content": {"title": "Node Feature Kernels Increase Graph Convolutional Network Robustness", "abstract": "The robustness of the much-used Graph Convolutional Networks (GCNs) to perturbations of their input is becoming a topic of increasing importance. In this paper, the random GCN is introduced for which a random matrix theory analysis is possible. This analysis suggests that if the graph is sufficiently perturbed, or in the extreme case random, then the GCN fails to benefit from the node features. It is furthermore observed that enhancing the message passing step in GCNs by adding the node feature kernel to the adjacency matrix of the graph structure solves this problem. An empirical study of a GCN utilised for node classification on six real datasets further confirms the theoretical findings and demonstrates that perturbations of the graph structure can result in GCNs performing significantly worse than Multi-Layer Perceptrons run on the node features alone. In practice, adding a node feature kernel to the message passing of perturbed graphs results in a significant improvement of the GCN's performance, thereby rendering it more robust to graph perturbations. Our code is publicly available at:https://github.com/ChangminWu/RobustGCN."}}
{"id": "IAukpJW7Qma", "cdate": 1609459200000, "mdate": 1683629562328, "content": {"title": "Optimization-Based Neural Networks Compression", "abstract": "This paper presents a method for constructing a size compressed neural network with better or similar accuracy than a given dense neural network, therefore the compressed network requires less memory and computational resources. The presented method relies basically on learning successive mappings between the given dense neural network (teacher) hidden features and the size-compressed neural network (student) hidden features, where the latter is learned also to solve the initial task of the teacher network. The presented method is particularly compared to baselines where we specifically show that the additional learned mappings significantly improve the performance (accuracy and computation) of the student network."}}
