{"id": "jBYJlgtU1pz", "cdate": 1640995200000, "mdate": 1681542642913, "content": {"title": "Beyond Heisenberg Limit Quantum Metrology through Quantum Signal Processing", "abstract": ""}}
{"id": "_EDKWpnteuF", "cdate": 1640995200000, "mdate": 1681542642922, "content": {"title": "Domain-Specific Quantum Architecture Optimization", "abstract": ""}}
{"id": "1l-ezGLmHK", "cdate": 1640995200000, "mdate": 1681542642914, "content": {"title": "Domain-Specific Quantum Architecture Optimization", "abstract": ""}}
{"id": "Dtcc6IxNcTM", "cdate": 1577836800000, "mdate": null, "content": {"title": "Learnability and Complexity of Quantum Samples", "abstract": "Given a quantum circuit, a quantum computer can sample the output distribution exponentially faster in the number of bits than classical computers. A similar exponential separation has yet to be established in generative models through quantum sample learning: given samples from an n-qubit computation, can we learn the underlying quantum distribution using models with training parameters that scale polynomial in n under a fixed training time? We study four kinds of generative models: Deep Boltzmann machine (DBM), Generative Adversarial Networks (GANs), Long Short-Term Memory (LSTM) and Autoregressive GAN, on learning quantum data set generated by deep random circuits. We demonstrate the leading performance of LSTM in learning quantum samples, and thus the autoregressive structure present in the underlying quantum distribution from random quantum circuits. Both numerical experiments and a theoretical proof in the case of the DBM show exponentially growing complexity of learning-agent parameters required for achieving a fixed accuracy as n increases. Finally, we establish a connection between learnability and the complexity of generative models by benchmarking learnability against different sets of samples drawn from probability distributions of variable degrees of complexities in their quantum and classical representations."}}
{"id": "1_ldAhb1PP2", "cdate": 1577836800000, "mdate": 1681542642941, "content": {"title": "TensorFlow Quantum: A Software Framework for Quantum Machine Learning", "abstract": ""}}
{"id": "qw0N0U53Hm", "cdate": 1546300800000, "mdate": 1681542642925, "content": {"title": "Learning Non-Markovian Quantum Noise from Moiré-Enhanced Swap Spectroscopy with Deep Evolutionary Algorithm", "abstract": ""}}
{"id": "_aG8CMRvYm", "cdate": 1546300800000, "mdate": 1681542642914, "content": {"title": "Recurrent Neural Networks in the Eye of Differential Equations", "abstract": ""}}
{"id": "1XVikPwbhi", "cdate": 1483228800000, "mdate": 1681542642948, "content": {"title": "Quantum simulation from the bottom up: the case of rebits", "abstract": ""}}
