{"id": "H-7lOIUnrb", "cdate": 1667373745262, "mdate": null, "content": {"title": "Measure controllable volumetric mesh parameterization", "abstract": "Volumetric parameterization is a fundamental problem in solid and physical modeling. In practice, it is highly desirable to control the volumes of the regions of interest in the parameter domain. This work introduces a novel volumetric parameterization method, which allows users to prescribe the target volumetric measure of the input solid.\n\nGiven a simply connected tetrahedral mesh with a single boundary surface, we first compute a volumetric harmonic map to parameterize the solid onto the unit solid ball; then we compute an optimal mass transportation map from the unit solid ball with the push-forward volume element induced by the harmonic map onto the parameter domain with the user prescribed volumetric measure. The composition of the volumetric harmonic map and the optimal mass transportation map gives a measure controllable volumetric parameterization. Furthermore, this method can handle solids with empty voids inside.\n\nThe method has solid theoretic foundation, and is based on conventional algorithms in computational geometry, and easy to implement. The experimental results demonstrate the efficiency and efficacy of the proposed method."}}
{"id": "Y0Ay3x8rgNE", "cdate": 1667372962632, "mdate": 1667372962632, "content": {"title": "The singularity set of optimal transportation maps", "abstract": "Optimal transportation plays an important role in many engineering fields, especially in deep learning. By the Brenier theorem, computing optimal transportation maps is reduced to solving Monge–Ampère equations, which in turn is equivalent to constructing Alexandrov polytopes. Furthermore, the regularity theory of Monge–Ampère equation explains mode collapsing issue in deep learning. Hence, computing and studying the singularity sets of OT maps become important. In this work, we generalize the concept of medial axis to power medial axis, which describes the singularity sets of optimal transportation maps. Then we propose a computational algorithm based on variational approach using power diagrams. Furthermore, we prove that when the measures are changed homotopically, the corresponding singularity sets of the optimal transportation maps are homotopy equivalent as well. Furthermore, we generalize the Fréchet distance concept and utilize the obliqueness condition to give a sufficient condition for the existence of singularities of optimal transportation maps between planar domains. The condition is formulated using the boundary curvature."}}
{"id": "EIq8VMqcXXH", "cdate": 1667371769725, "mdate": 1667371769725, "content": {"title": "Curvature adaptive surface remeshing by sampling normal cycle", "abstract": "Surface meshing plays a fundamental important role in Visualization and Computer Graphics, which produces discrete meshes to approximate a smooth surface. Many geometric processing tasks heavily depend on the qualities of the meshes, especially the convergence in terms of topology, position, Riemannian metric, differential operators and curvature measures.\n\nNormal cycle theory points out that in order to guarantee the convergence of curvature measures, the discrete meshes are required to approximate not only the smooth surface itself, but also the normal cycle of the surface. This theory inspires the development of the remeshing method based on conformal parameterization and planar Delaunay refinement, which uniformly samples the smooth surface, and produces Delaunay triangulations with bounded minimal corner angles. This method ensures the Hausdorff distances between the normal cycles of the resulting meshes and the smooth normal cycle converges to 0, the discrete Gaussian curvature and mean curvature measures of the resulting meshes converge to their counter parts on the smooth surface.\n\nIn the current work, the conformal parameterization based remeshing algorithm is further improved to speed up the curvature convergence. Instead of uniformly sampling the surface itself, the novel algorithm samples the normal cycle of the surface. The algorithm pipeline is as follows: first, two parameterizations are constructed, one is the surface conformal parameterization based on dynamic Ricci flow, the other is the normal cycle area-preserving parameterization based on optimal mass transportation; second, the normal cycle parameterization is uniformly sampled; third, the Delaunay refinement mesh generation is carried out on the surface conformal parameterization. The produced meshes can be proven to converge to the smooth surface in terms of curvature measures.\n\nExperimental results demonstrate the efficiency and efficacy of proposed algorithm, the convergence speeds of the curvatures are prominently faster than those of conventional methods."}}
{"id": "VCS6GoM96o", "cdate": 1667371293679, "mdate": 1667371293679, "content": {"title": "Volume preserving mesh parameterization based on optimal mass transportation", "abstract": "In order to convert a finite element mesh model to the spline representation for the purpose of isogeometric analysis, one needs to parameterize the solid. This work introduces a novel volumetric parameterization method, which guarantees to be free of volume distortion.\n\nGiven a simply connected tetrahedral mesh with a single boundary surface, we first compute a harmonic map from the boundary triangle mesh to the unit sphere by non-linear heat diffusion method; then we use the surface harmonic map as the boundary condition to compute the volumetric harmonic map to parameterize the solid onto the unit solid ball; finally we compute an optimal mass transportation map from the unit solid ball with the push-forward volume element induced by the harmonic map onto itself with the Euclidean volume element. The composition of the volumetric harmonic map and the optimal mass transportation map gives an volume-preserving parameterization.\n\nThe method has solid theoretic foundation, and is based on conventional algorithms in computational geometry, easy to implement. We have thoroughly tested our algorithm on many solid models in reality. The experimental results demonstrate the efficiency and efficacy of the proposed method. To the best of our knowledge, it is the first work addressing volume-preserving parameterization in the literature."}}
{"id": "lTD7nNgNER", "cdate": 1667370850224, "mdate": 1667370850224, "content": {"title": "Robust surface registration using optimal mass transport and Teichmüller mapping", "abstract": "Surface registration plays a significant role in computer vision and engineering fields. One of the most challenging problems in surface registration, however, is to obtain a unique bijective registration for surfaces with large deformations and landmarks constraints. In this work, a novel surface registration framework is proposed to tackle this problem using optimal mass transport mapping (OMT-Map) and Teichmüller mapping (T-Map). All metric surfaces with the disk topology are mapped to the planar disk using OMT-Map, which avoids huge area distortion, thus rendering our method more robust. A landmark-constrained T-Map is then computed between two planar disks such that the maximal conformality distortion is minimized while the landmarks are matched. Compared with existing surface registration methods, our method is more advantageous in enforcing the robustness by avoiding large area distortion, and producing diffeomorphisms with all landmarks matched consistently. Numerical experiments on various surfaces demonstrate the efficiency, robustness of our method."}}
{"id": "MtegROD2jiC", "cdate": 1667369545423, "mdate": 1667369545423, "content": {"title": "Quadrilateral mesh generation I: Metric based method", "abstract": "This work proposes a novel metric based algorithm for quadrilateral mesh generating. Each quad-mesh induces a Riemannian metric satisfying special conditions: the metric is a flat metric with cone singularities conformal to the original metric, the total curvature satisfies the Gauss–Bonnet condition, the holonomy group is a subgroup of the rotation group {e i k π∕ 2}, there is cross field obtained by parallel translation which is aligned with the boundaries, and its streamlines are finite geodesics. Inversely, such kind of metric induces a quad-mesh. Based on discrete Ricci flow and conformal structure deformation, one can obtain a metric satisfying all the conditions and obtain the desired quad-mesh. This method is rigorous, simple and automatic. Our experimental results demonstrate the efficiency and efficacy of the algorithm."}}
{"id": "EVrz7UM-ZDm", "cdate": 1663849836447, "mdate": null, "content": {"title": "Volumetric Optimal Transportation by Fast Fourier Transform", "abstract": "The optimal transportation map finds the most economical way to transport one probability measure to another, and it has been applied in a broad range of applications in machine learning and computer vision. By the Brenier theory, computing the optimal transport map is equivalent to solving a Monge-Amp\\`ere equation, which is highly non-linear. Therefore, the computation of optimal transportation maps is intrinsically challenging.\n\nIn this work, we propose a novel and powerful method, the FFT-OT (fast Fourier transform-optimal transport), to compute the 3-dimensional OT problems. The method is based on several key ideas: first, the Monge-Amp\\`ere equation is linearized to a sequence of linear elliptic PDEs with spacial and temporal variant coefficients; second, the obliqueness property of optimal transportation maps is reformulated as a Neumann boundary condition; and third, the variant coefficient elliptic PDEs are approximated by constant coefficient elliptic PDEs and solved by FFT on GPUs. We also prove that the algorithm converges linearly, namely the approximation error decreases exponentially fast. Experimental results show that the FFT-OT algorithm is more than a hundred times faster than the conventional methods based on the convex geometry. Furthermore, the method can be directly applied for sampling from complex 3D density functions in machine learning and magnifying the volumetric data in medical imaging. "}}
{"id": "HkldyTNYwH", "cdate": 1569438944387, "mdate": null, "content": {"title": "AE-OT: A NEW GENERATIVE MODEL BASED ON EXTENDED SEMI-DISCRETE OPTIMAL TRANSPORT", "abstract": "Generative adversarial networks (GANs) have attracted huge attention due to\nits capability to generate visual realistic images. However, most of the existing\nmodels suffer from the mode collapse or mode mixture problems. In this work, we\ngive a theoretic explanation of the both problems by Figalli’s regularity theory of\noptimal transportation maps. Basically, the generator compute the transportation\nmaps between the white noise distributions and the data distributions, which are\nin general discontinuous. However, DNNs can only represent continuous maps.\nThis intrinsic conflict induces mode collapse and mode mixture. In order to\ntackle the both problems, we explicitly separate the manifold embedding and the\noptimal transportation; the first part is carried out using an autoencoder to map the\nimages onto the latent space; the second part is accomplished using a GPU-based\nconvex optimization to find the discontinuous transportation maps. Composing the\nextended OT map and the decoder, we can finally generate new images from the\nwhite noise. This AE-OT model avoids representing discontinuous maps by DNNs,\ntherefore effectively prevents mode collapse and mode mixture."}}
{"id": "BJV39lfdZS", "cdate": 1483228800000, "mdate": null, "content": {"title": "Surface Registration via Foliation", "abstract": "This work introduces a novel surface registration method based on foliation. A foliation decomposes the surface into a family of closed loops, such that the decomposition has local tensor product structure. By projecting each loop to a point, the surface is collapsed into a graph. Two homeomorphic surfaces with consistent foliations can be registered by first matching their foliation graphs, then matching the corresponding leaves. This foliation based method is capable of handling surfaces with complicated topologies and large non-isometric deformations, rigorous with solid theoretic foundation, easy to implement, robust to compute. The result mapping is diffeomorphic. Our experimental results show the efficiency and efficacy of the proposed method."}}
{"id": "B1-jDWMu-H", "cdate": 1483228800000, "mdate": null, "content": {"title": "Intrinsic 3D Dynamic Surface Tracking based on Dynamic Ricci Flow and Teichmüller Map", "abstract": "3D dynamic surface tracking is an important research problem and plays a vital role in many computer vision and medical imaging applications. However, it is still challenging to efficiently register surface sequences which has large deformations and strong noise. In this paper, we propose a novel automatic method for non-rigid 3D dynamic surface tracking with surface Ricci flow and Teichmiiller map methods. According to quasi-conformal Teichmiiller theory, the Techmüller map minimizes the maximal dilation so that our method is able to automatically register surfaces with large deformations. Besides, the adoption of Delaunay triangulation and quadrilateral meshes makes our method applicable to low quality meshes. In our work, the 3D dynamic surfaces are acquired by a high speed 3D scanner. We first identified sparse surface features using machine learning methods in the texture space. Then we assign landmark features with different curvature settings and the Riemannian metric of the surface is computed by the dynamic Ricci flow method, such that all the curvatures are concentrated on the feature points and the surface is flat everywhere else. The registration among frames is computed by the Teichmiiller mappings, which aligns the feature points with least angle distortions. We apply our new method to multiple sequences of 3D facial surfaces with large expression deformations and compare them with two other state-of-the-art tracking methods. The effectiveness of our method is demonstrated by the clearly improved accuracy and efficiency."}}
