{"id": "l43cAl0BZzU", "cdate": 1676170031737, "mdate": null, "content": {"title": "Graph-informed simulation-based inference for models of active matter", "abstract": "Many collective systems exist in nature far from equilibrium, ranging from cellular sheets up to flocks of birds. These systems reflect a form of active matter, whereby individual material components have internal energy. Under specific parameter regimes, these active systems undergo phase transitions whereby small fluctuations of single components can lead to global changes to the rheology of the system. Simulations and methods from statistical physics are typically used to understand and predict these phase transitions for real-world observations. In this work, we demonstrate that simulation-based inference can be used to robustly infer active matter parameters from system observations. Moreover, we demonstrate that a small number (from one to three) snapshots of the system can be used for parameter inference and that this graph-informed approach outperforms typical metrics such as the average velocity or mean square displacement of the system. Our work highlights that high-level system information is contained within the relational structure of a collective system and that this can be exploited to better couple models to data."}}
{"id": "H6GeVHzyaW5", "cdate": 1647272507617, "mdate": null, "content": {"title": "Designing Neural Network Collectives", "abstract": "Artificial neural networks have demonstrated exemplary learning capabilities in a wide range of tasks, including computer vision, natural language processing and, most recently, graph-based learning. Many of the advances in deep learning have been made possible by the large design-space for neural network architectures. We believe that this diversity in architectures may lead to novel and emergent learning capabilities, especially when architectures are connected into a collective system. In this work, we outline a form of neural network collectives (NNC), motivated by recent work in the field of collective intelligence, and give details about the specific sub-components that an NNC may have. "}}
{"id": "buhAv1_RruB", "cdate": 1609459200000, "mdate": 1631653340411, "content": {"title": "Evolutionary computational platform for the automatic discovery of nanocarriers for cancer treatment", "abstract": "We present the EVONANO platform for the evolution of nanomedicines with application to anti-cancer treatments. EVONANO includes a simulator to grow tumours, extract representative scenarios, and then simulate nanoparticle transport through these scenarios to predict nanoparticle distribution. The nanoparticle designs are optimised using machine learning to efficiently find the most effective anti-cancer treatments. We demonstrate our platform with two examples optimising the properties of nanoparticles and treatment to selectively kill cancer cells over a range of tumour environments."}}
{"id": "MA2d4xyouYR", "cdate": 1609459200000, "mdate": 1631653340319, "content": {"title": "Towards open-ended evolutionary simulator for developing novel tumour drug delivery systems", "abstract": "Tumours behave as moving targets that can evade chemotherapeutic treatments by rapidly acquiring resistance via various mechanisms. In Balaz et al. (2021, Biosystems; 199:104290) we initiated the development of the agent-based open-ended evolutionary simulator of novel drug delivery systems (DDS). It is an agent-based simulator where evolvable agents can change their perception of the environment and thus adapt to tumour mutations. Here we mapped the parameters of evolvable agent properties to the realistic biochemical boundaries and test their efficacy by simulating their behaviour at the cell scale using the stochastic simulator, STEPS. We show that the shape of the parameter space evolved in our simulator is comparable to those obtained by the rational design."}}
{"id": "JSQIiO4elK4", "cdate": 1609459200000, "mdate": 1631653340194, "content": {"title": "Harnessing adaptive novelty for automated generation of cancer treatments", "abstract": "Nanoparticles have the potential to modulate both the pharmacokinetic and pharmacodynamic profiles of drugs, thereby enhancing their therapeutic effect. The versatility of nanoparticles allows for a wide range of customization possibilities. However, it also leads to a rich design space which is difficult to investigate and optimize. An additional problem emerges when they are applied to cancer treatment. A heterogeneous and highly adaptable tumour can quickly become resistant to primary therapy, making it inefficient. To automate the design of potential therapies for such complex cases, we propose a computational model for fast, novelty-based machine learning exploration of the nanoparticle design space. In this paper, we present an evolvable, open-ended agent-based model, where the exploration of an initially small portion of the given state space can be expanded by an ongoing generation of adaptive novelties, whenever the simulated tumour makes an adaptive leap. We demonstrate that the nano-agents can continuously reshape themselves and create a heterogeneous population of specialized groups of individuals optimized for tracking and killing different phenotypes of cancer cells. In the conclusion, we outline further development steps so this model could be used in real-world research and clinical practice."}}
{"id": "YamqLY5RW6", "cdate": 1577836800000, "mdate": 1631653340317, "content": {"title": "Model Exploration with Cost-Aware Learning", "abstract": "We present an extension to active learning routines in which non-constant costs are explicitly considered. This work considers both known and unknown costs and introduces the term \\epsilon-frugal for learners that do not only consider minimizing total costs but are also able to explore high cost regions of the sample space. We demonstrate our extension on a well-known machine learning dataset and find that out \\epsilon-frugal learners outperform both learners with known costs and random sampling."}}
