{"id": "6wesS2b2RZ", "cdate": 1704067200000, "mdate": 1706638350986, "content": {"title": "Dynamic Spiking Graph Neural Networks", "abstract": "The integration of Spiking Neural Networks (SNNs) and Graph Neural Networks (GNNs) is gradually attracting attention due to the low power consumption and high efficiency in processing the non-Euclidean data represented by graphs. However, as a common problem, dynamic graph representation learning faces challenges such as high complexity and large memory overheads. Current work often uses SNNs instead of Recurrent Neural Networks (RNNs) by using binary features instead of continuous ones for efficient training, which would overlooks graph structure information and leads to the loss of details during propagation. Additionally, optimizing dynamic spiking models typically requires propagation of information across time steps, which increases memory requirements. To address these challenges, we present a framework named \\underline{Dy}namic \\underline{S}p\\underline{i}king \\underline{G}raph \\underline{N}eural Networks (\\method{}). To mitigate the information loss problem, \\method{} propagates early-layer information directly to the last layer for information compensation. To accommodate the memory requirements, we apply the implicit differentiation on the equilibrium state, which does not rely on the exact reverse of the forward computation. While traditional implicit differentiation methods are usually used for static situations, \\method{} extends it to the dynamic graph setting. Extensive experiments on three large-scale real-world dynamic graph datasets validate the effectiveness of \\method{} on dynamic node classification tasks with lower computational costs."}}
{"id": "K5kvwRhrNx", "cdate": 1701388800000, "mdate": 1706264728762, "content": {"title": "OMG: Towards Effective Graph Classification Against Label Noise", "abstract": "Graph classification is a fundamental problem with diverse applications in bioinformatics and chemistry. Due to the intricate procedures of manual annotations in graphical domains, there may be abundant noisy labels of graphs in practice, resulting in poor performance for existing supervised methods. Thus, it is necessary and urgent to study the problem of graph classification with label noise. However, this problem is challenging due to the overfitting of noisy data as well as complicated relational structures of graphs. To handle this problem, we present a simple but effective approach called c <underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">O</u> upled <underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">M</u> ix for <underline xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">G</u> raph Contrast (OMG), which combines coupled Mixup with graph contrastive learning in the feature space. On the one hand, to improve the model generalization, we take convex combination of sample pairs in the feature space for positive pair construction. On the other hand, to accomplish effective optimization, we offer challenging negatives by multiple sample Mixup with different emphasis. To further reduce the impact of noisy data, we develop a neighbour-aware noise removal strategy, which promotes the smoothness in the neighbourhood of samples following the principle of curriculum learning. Extensive experiments on a range of benchmark datasets demonstrate the superiority of our proposed OMG."}}
{"id": "kyZSWN0tSB", "cdate": 1698796800000, "mdate": 1706638350974, "content": {"title": "Multiobjective Optimization for Vehicle Routing Optimization Problem in Low-Carbon Intelligent Transportation", "abstract": "The work aims to reduce the energy consumption and carbon emissions generated during the urban logistics transportation and distribution and make the actual path planning flexible. Based on Vehicle Routing Problem (VRP), the routing problem of distribution vehicles is optimized under satisfying customers’ cargo demand and time requirements. Because Non-dominated Sorting Genetic Algorithm (NSGA-II) reduces the complexity of non-inferior sorting genetic algorithm and is characterized by fast running speed and good convergence, it is deeply improved. NSGA-II algorithm based on Multifactorial Evolutionary Algorithm (MFEA) (M-NSGA-II) is proposed. In terms of the solution of the stability of the optimal values of four target functions, including distribution cost, customer satisfaction, fuel conservation, and carbon emission, the lowest distribution costs of M-NSGA-II algorithm in ten experiments were all lower than those of other three standard algorithms. The solution duration of M-NSGA-II algorithm was 85.2s and the corresponding average frontier value amounted to 20. The multi-objective path optimization model designed is of great value for reducing carbon emissions under satisfying customers’ cargo demand and time requirements."}}
