{"id": "Oh33AWyN0ei", "cdate": 1684603075609, "mdate": 1684603075609, "content": {"title": "Machine Learning Models and Uncertainty for Atomic Simulations", "abstract": "As computational power grows, materials simulation becomes an increasingly valuable scientific tool. Simulations are used to calculate properties that are difficult to obtain experimentally, perform high-throughput design and discovery, and investigate material behavior and theory. Ultimately we want to push the time and length scales of simulation and connect atomic scale with continuum scale properties. There is a trade-off between accuracy and computational cost. One approach is to use machine learned (ML) potentials as fast, accurate approximations to quantum chemical methods. ML potentials are systematically improvable, and can be as accurate as density functional theory at much lower computational cost. Potential challenges are that ML potentials extrapolate, and it is nonobvious when extrapolation occurs and how to efficiently build the training dataset. In addition we would like to have uncertainty measurements of ML models and physically simulated properties.\nIn this dissertation, we investigate the relationship between atomic scale and continuum properties in liquid Al-Si using molecular dynamics (MD). We study the local order using Voronoi polyhedrons and agglomerative clustering, which allowed us to analyze the large amount of data generated from MD trajectories in an efficient manner. We found that clusters have minimal effect on diffusion while increasing viscosity, which is a likely origin of the Stokes-Einstein deviation for liquid Al-Si at low temperatures near the melting point. This study demonstrates the value of MD simulation and using ML clustering and large datasets analysis to find new phenomena.\nIn the next part, we build a neural network (NN) potential for a complex Ni-Al-W liquid alloy. We conducted hyperparameter studies on NN architecture and Behler-Parrinello fingerprints. The ML potential was iteratively tested in MD simulation and retrained with diverse dataset. The final potential achieved comparable results with ab initio simulation. We found that the NN potential extrapolated on inputs that were dissimilar from its training data, which motivates uncertainty quantification.\nWe implement the multiparameter delta method for NN potentials (and generally for other nonlinear models) with parameters trained by least squares regression. The uncertainty measure requires the gradient of the model prediction and the Hessian of the loss function, both with respect to model parameters. We obtain the derivatives from ML software with automatic differentiation. We show that the uncertainty measure is larger for input space regions that are not part of the training data. Therefore this method can be used to identify extrapolation, aid in selecting training data, and assess model reliability.\nIn the final part, we compare uncertainties of physical properties from delta method, Bayesian nonlinear regression, and Gaussian process (GP). Many physical properties of interest require derivatives, therefore we derived GP with joint distribution over a function and its first and second derivatives. We show that delta method and Bayesian nonlinear regression give model specific uncertainty while GP variance includes uncertainty with respect to model selection."}}
{"id": "cX2dR4LS2-a", "cdate": 1684603012660, "mdate": 1684603012660, "content": {"title": "Uncertainty quantification in machine learning and nonlinear least squares regression models", "abstract": "Machine learning (ML) models are valuable research tools for making accurate predictions. However, ML models often unreliably extrapolate outside their training data. The multiparameter delta method quantifies uncertainty for ML models (and generally for other nonlinear models) with parameters trained by least squares regression. The uncertainty measure requires the gradient of the model prediction and the Hessian of the loss function, both with respect to model parameters. Both the gradient and Hessian can be readily obtained from most ML software frameworks by automatic differentiation. We show examples of the uncertainty method in applications of molecular simulations and neural networks. We further show that the uncertainty measure is larger for input space regions that are not part of the training data. Therefore, this method can be used to identify extrapolation and to aid in selecting training data or assessing model reliability."}}
{"id": "0KN_DyTEgm0", "cdate": 1684602962014, "mdate": 1684602962014, "content": {"title": "Origin of the Stokes-Einstein Deviation in Liquid Al-Si", "abstract": "One goal in materials simulation is finding relationships between atomic scale and continuum properties. The Stokes–Einstein–Sutherland (SES) equation relates diffusion and viscosity in liquids through the effective diameter d, which is frequently observed to be constant with the ratio T/(Dη) where T is the temperature, D is the diffusion coefficient, and η is the viscosity. The SES has a practical use in estimating diffusion from viscosity or vice versa as they can be difficult to measure experimentally. The constant effective diameter observed in the SES holds for many liquids within a temperature range, but at low temperatures, deviations where d is not constant have been observed. This work investigates SES in liquid Al–Si using molecular dynamics. We analyze the local order using Voronoi polyhedrons and agglomerative clustering. Clustering methods from machine learning allowed us to analyze the large amount of data generated from molecular dynamics trajectories in an efficient manner. We found that clusters have minimal effect on diffusion while increasing viscosity, which is a likely origin of the SES deviation for liquid Al–Si at low temperatures near the melting temperature."}}
{"id": "i8Aang9gWK", "cdate": 1684602890273, "mdate": 1684602890273, "content": {"title": "Model-Specific to Model-General Uncertainty for Physical Properties", "abstract": "Many physical properties are derived from models, and we would like to be able to report the property with its uncertainty in an interpretable way. Different frameworks for interpreting uncertainty have been proposed. For example, “aleatoric” refers to randomness in the experiment or observations, while “epistemic” refers to ignorance about the best model. In addition, there are many ways to calculate uncertainty, including the frequentist confidence interval and the Bayesian probability distribution. In this work, we improve the understanding of which sources of uncertainty are captured by different methods. We use an example of obtaining physical properties based on function derivatives from an equation of state for Pd and Au. We obtain uncertainties using three methods: the delta method and nonlinear regression, Bayesian nonlinear regression, and Gaussian process regression. We develop a Gaussian process with joint covariance over a function and its first and second derivatives. The delta method and Bayesian regression uncertainties are consistent with each other and capture epistemic uncertainty, specifically model parameter uncertainty. The Gaussian process extends this to uncertainties arising from model selection."}}
{"id": "cGFrqO3grBD", "cdate": 1609459200000, "mdate": 1681664738022, "content": {"title": "Graphical Models for Financial Time Series and Portfolio Selection", "abstract": "We examine a variety of graphical models to construct optimal portfolios. Graphical models such as PCA-KMeans, autoencoders, dynamic clustering, and structural learning can capture the time varying patterns in the covariance matrix and allow the creation of an optimal and robust portfolio. We compared the resulting portfolios from the different models with baseline methods. In many cases our graphical strategies generated steadily increasing returns with low risk and outgrew the S&P 500 index. This work suggests that graphical models can effectively learn the temporal dependencies in time series data and are proved useful in asset management."}}
{"id": "-F_gStU03a-", "cdate": 1609459200000, "mdate": 1681664738020, "content": {"title": "Where does the Stimulus go? Deep Generative Model for Commercial Banking Deposits", "abstract": "This paper examines deposits of individuals (\"retail\") and large companies (\"wholesale\") in the U.S. banking industry, and how these deposit types are impacted by macroeconomic factors, such as quantitative easing (QE). Actual data for deposits by holder are unavailable. We use a dataset on banks' financial information and probabilistic generative model to predict industry retail-wholesale deposit split from 2000 to 2020. Our model assumes account balances arise from separate retail and wholesale lognormal distributions and fit parameters of distributions by minimizing error between actual bank metrics and simulated metrics using the model's generative process. We use time-series regression to forward predict retail-wholesale deposits as function of loans, retail loans, and reserve balances at Fed banks. We find increase in reserves (representing QE) increases wholesale but not retail deposits, and increase in loans increase both wholesale and retail deposits evenly. The result shows that QE following the 2008 financial crisis benefited large companies more than average individuals, a relevant finding for economic decision making. In addition, this work benefits bank management strategy by providing forecasting capability for retail-wholesale deposits."}}
{"id": "W-AbxE5MpO9", "cdate": 1577836800000, "mdate": 1681664738020, "content": {"title": "Graphical models for financial time series and portfolio selection", "abstract": "We examine a variety of graphical models to construct optimal portfolios. Graphical models such as PCA-KMeans, autoencoders, dynamic clustering, and structural learning can capture the time varying patterns in the covariance matrix and allow the creation of an optimal and robust portfolio. We compared the resulting portfolios from the different models with baseline methods. In many cases our graphical strategies generated steadily increasing returns with low risk and outgrew the S&P 500 index. This work suggests that graphical models can effectively learn the temporal dependencies in time series data and are proved useful in asset management."}}
