{"id": "-2mgH2hdMj-", "cdate": 1672531200000, "mdate": 1682362370961, "content": {"title": "Retracted Articles about COVID-19 Vaccines Enable Vaccine Misinformation on Twitter", "abstract": "Retracted scientific articles about COVID-19 vaccines have proliferated false claims about vaccination harms and discouraged vaccine acceptance. Our study analyzed the topical content of 4,876 English-language tweets about retracted COVID-19 vaccine research and found that 27.4% of tweets contained retraction-related misinformation. Misinformed tweets either ignored the retraction, or less commonly, politicized the retraction using conspiratorial rhetoric. To address this, Twitter and other social media platforms should expand their efforts to address retraction-related misinformation."}}
{"id": "s2KBCjaHNSY", "cdate": 1640995200000, "mdate": 1682362370980, "content": {"title": "Twitter Engagement with Retracted Articles: Who, When, and How?", "abstract": "Retracted research discussed on social media can spread misinformation, yet we lack an understanding of how retracted articles are mentioned by academic and non-academic users. This is especially relevant on Twitter due to the platform's prominent role in science communication. Here, we analyze the pre and post retraction differences in Twitter engagement metrics and content of mentions for over 3,800 retracted English-language articles alongside comparable non-retracted articles. We subset these findings according to the five user types detected by our supervised learning classifier: members of the public, scientists, bots, practitioners, and science communicators. We find that retracted articles receive greater overall engagement than non-retracted articles, especially among members of the public and bot users, the majority of engagement happening prior to retraction. Our results highlight non-scientists' involvement in retracted article discussions and suggest an opportunity for Twitter to include a retraction notice feature."}}
{"id": "OwTW6VGNXe", "cdate": 1640995200000, "mdate": 1682362370954, "content": {"title": "Ethical Tensions, Norms, and Directions in the Extraction of Online Volunteer Work", "abstract": ""}}
{"id": "FevMmAJltyp", "cdate": 1640995200000, "mdate": 1663783080110, "content": {"title": "Behavioral Use Licensing for Responsible AI", "abstract": "With the growing reliance on artificial intelligence (AI) for many different applications, the sharing of code, data, and models is important to ensure the replicability and democratization of scientific knowledge. Many high-profile academic publishing venues expect code and models to be submitted and released with papers. Furthermore, developers often want to release these assets to encourage development of technology that leverages their frameworks and services. A number of organizations have expressed concerns about the inappropriate or irresponsible use of AI and have proposed ethical guidelines around the application of such systems. While such guidelines can help set norms and shape policy, they are not easily enforceable. In this paper, we advocate the use of licensing to enable legally enforceable behavioral use conditions on software and code and provide several case studies that demonstrate the feasibility of behavioral use licensing. We envision how licensing may be implemented in accordance with existing responsible AI guidelines."}}
{"id": "AZjgO4DLmjb", "cdate": 1640995200000, "mdate": 1682362370960, "content": {"title": "Misleading Tweets and Helpful Notes: Investigating Data Labor by Twitter Birdwatch Users", "abstract": "In response to concerns about misleading content on social media, Twitter launched the “Birdwatch” initiative that allows volunteers to label and add context to tweets. We study data from Birdwatch to understand how users are performing “data labor” for Twitter, with implications for other platforms that are similarly reliant on data labor. We conduct computational analyses of Birdwatch text data and perform machine learning experiments to see how Birdwatch contributions might be used for classification. We find that Birdwatch users discuss distinct topics in domains like politics and news. While using Birdwatch data for content-only predictions may provide only a small amount of predictive power, in some cases Birdwatch data may be able to support ML systems. Furthermore, we see that the continuous flow of Birdwatch contributions provides great value in terms of supporting a “guess most frequent“ baseline for classifying Twitter content."}}
{"id": "Qd_eU1wvJeu", "cdate": 1623088923014, "mdate": null, "content": {"title": "Addressing \"Documentation Debt\" in Machine Learning: A Retrospective Datasheet for BookCorpus", "abstract": "This paper contributes a formal case study in retrospective dataset documentation and pinpoints several problems with the influential BookCorpus dataset. Recent work has underscored the importance of dataset documentation in machine learning research, including by addressing ``documentation debt'' for datasets that have been used widely but documented sparsely. BookCorpus is one such dataset. Researchers have used BookCorpus to train OpenAI's GPT-N models and Google's BERT models, but little to no documentation exists about the dataset's motivation, composition, collection process, etc. We offer a retrospective datasheet with key context and information about BookCorpus, including several notable deficiencies. In particular, we find evidence that (1) BookCorpus violates copyright restrictions for many books, (2) BookCorpus contains thousands of duplicated books, and (3) BookCorpus exhibits significant skews in genre representation. We also find hints of other potential deficiencies that call for future research, such as lopsided author contributions. While more work remains, this initial effort to provide a datasheet for BookCorpus offers a cautionary case study and adds to growing literature that urges more careful, systematic documentation of machine learning datasets."}}
{"id": "ppfzlwupmFd", "cdate": 1609459200000, "mdate": null, "content": {"title": "Data Leverage: A Framework for Empowering the Public in its Relationship with Technology Companies", "abstract": "Many powerful computing technologies rely on implicit and explicit data contributions from the public. This dependency suggests a potential source of leverage for the public in its relationship with technology companies: by reducing, stopping, redirecting, or otherwise manipulating data contributions, the public can reduce the effectiveness of many lucrative technologies. In this paper, we synthesize emerging research that seeks to better understand and help people action this data leverage. Drawing on prior work in areas including machine learning, human-computer interaction, and fairness and accountability in computing, we present a framework for understanding data leverage that highlights new opportunities to change technology company behavior related to privacy, economic inequality, content moderation and other areas of societal concern. Our framework also points towards ways that policymakers can bolster data leverage as a means of changing the balance of power between the public and tech companies."}}
{"id": "km8CzSqlvCP", "cdate": 1609459200000, "mdate": 1682362370958, "content": {"title": "CEAM: The Effectiveness of Cyclic and Ephemeral Attention Models of User Behavior on Social Platforms", "abstract": "To improve the user experience as well as business outcomes, social platforms aim to predict user behavior. To this end, recurrent models are often used to predict a user's next behavior based on their most recent behavior. However, people have habits and routines, making it plausible to predict their behavior from more than just their most recent activity. Our work focuses on the interplay between ephemeral and cyclical components of user behaviors. By utilizing user activity data from social platform Snapchat, we uncover cyclic and ephemeral usage patterns on a per user level. Based on our findings, we imbued recurrent models with awareness: we augment an RNN with a cyclic module to complement traditional RNNs that model ephemeral behaviors and allow a flexible weighting of the two for the prediction task. We conducted extensive experiments to evaluate our model's performance on four user behavior prediction tasks on the Snapchat platform. We achieve improved results on each task compared against existing methods, using this simple, but important insight in user behavior: Both cyclical and ephemeral components matter. We show that in some situations and for some people, ephemeral components may be more helpful for predicting behavior, while for others and in other situations, cyclical components may carry more weight."}}
{"id": "e8yZhK8KNvg", "cdate": 1609459200000, "mdate": 1682362370959, "content": {"title": "Can \"Conscious Data Contribution\" Help Users to Exert \"Data Leverage\" Against Technology Companies?", "abstract": "Tech users currently have limited ability to act on concerns regarding the negative societal impacts of large tech companies. However, recent work suggests that users can exert leverage using their role in the generation of valuable data, for instance by withholding their data contributions to intelligent technologies. We propose and evaluate a new means to exert this type of leverage against tech companies: \"conscious data contribution\" (CDC). Users who participate in CDC exert leverage against a target tech company by contributing data to technologies operated by a competitor of that company. Using simulations, we find that CDC could be highly effective at reducing the gap in intelligent technologies performance between an incumbent and their competitors. In some cases, just 20% of users contributing data they have produced to a small competitor could help that competitor get 80% of the way towards the original company's best-case performance. We discuss the implications of CDC for policymakers, tech designers, and researchers."}}
{"id": "_tDpcz-oOG5", "cdate": 1609459200000, "mdate": 1682362370996, "content": {"title": "A Deeper Investigation of the Importance of Wikipedia Links to Search Engine Results", "abstract": "A growing body of work has highlighted the important role that Wikipedia's volunteer-created content plays in helping search engines achieve their core goal of addressing the information needs of hundreds of millions of people. In this paper, we report the results of an investigation into the incidence of Wikipedia links in search engine results pages (SERPs). Our results extend prior work by considering three U.S. search engines, simulating both mobile and desktop devices, and using a spatial analysis approach designed to study modern SERPs that are no longer just \"ten blue links\". We find that Wikipedia links are extremely common in important search contexts, appearing in 67-84% of desktop SERPs for common and trending queries, but less often for medical queries. Furthermore, we observe that Wikipedia links often appear in \"Knowledge Panel\" SERP elements and are in positions visible to users without scrolling, although Wikipedia appears less often and in less prominent positions on mobile devices. Our findings reinforce the complementary notions that (1) Wikipedia content and research has major impact outside of the Wikipedia domain and (2) powerful technologies like search engines are highly reliant on free content created by volunteers."}}
