{"id": "W232ImXVJ-", "cdate": 1692043993262, "mdate": 1692043993262, "content": {"title": "Network comparisons and their applications in connectomics", "abstract": "Over the past decade, there has been a growing emphasis on neuroscience to analyze the human brain from the perspective of complex networks. Here, connectomics, or the study of underlying connectivity patterns in the brain, has provided several fundamental insights into its intrinsic organization. However, hypothesis-driven discovery in this domain is extremely challenging due to the high data dimensionality, environmental confounds, and considerable interindividual variability. In light of these challenges, this chapter provides a deep dive into network-based analyses in connectomics. Specifically, we will introduce the idea of “network comparison” from two complementary perspectives: capturing group differences using simple graph-theoretic measures and mechanistic network models that integrate another layer of complexity to parse connectomics data. Next, we examine data-driven approaches to network comparison that can capture intersubject variability. These approaches span classical machine learning, geometric techniques, and deep learning. We conclude with a brief snapshot on extending network comparison concepts to dynamic network analysis, as a prelude to later chapters of this book."}}
{"id": "5gRZ0NMsxXC", "cdate": 1692043939736, "mdate": 1692043939736, "content": {"title": "mSPD-NN: A Geometrically Aware Neural Framework for Biomarker Discovery from Functional Connectomics Manifolds", "abstract": "Connectomics has emerged as a powerful tool in neuroimaging and has spurred recent advancements in statistical and machine learning methods for connectivity data. Despite connectomes inhabiting a matrix manifold, most analytical frameworks ignore the underlying data geometry. This is largely because simple operations, such as mean estimation, do not have easily computable closed-form solutions. We propose a geometrically aware neural framework for connectomes, i.e., the mSPD-NN, designed to estimate the geodesic mean of a collections of symmetric positive definite (SPD) matrices. The mSPD-NN is comprised of bilinear fully connected layers with tied weights and utilizes a novel loss function to optimize the matrix-normal equation arising from Fréchet mean estimation. Via experiments on synthetic data, we demonstrate the efficacy of our mSPD-NN against common alternatives for SPD mean estimation, providing competitive performance in terms of scalability and robustness to noise. We illustrate the real-world flexibility of the mSPD-NN in multiple experiments on rs-fMRI data and demonstrate that it uncovers stable biomarkers associated with subtle network differences among patients with ADHD-ASD comorbidities and healthy controls."}}
{"id": "tyw6aQ_OEA", "cdate": 1672531200000, "mdate": 1699638376690, "content": {"title": "Feature Selection for Malapposition Detection in Intravascular Ultrasound - A Comparative Study", "abstract": "Coronary atherosclerosis is a leading cause of morbidity and mortality worldwide. It is often treated by placing stents in the coronary arteries. Inappropriately placed stents or malappositions can result in post-interventional complications. Intravascular Ultrasound (IVUS) imaging offers a potential solution by providing real-time endovascular guidance for stent placement. The signature of malapposition is very subtle and requires exploring second-order relationships between blood flow patterns, vessel walls, and stents. In this paper, we perform a comparative study of various deep learning methods and their feature extraction capabilities for building a malapposition detector. Our results in the study address the importance of incorporating domain knowledge in performance improvement while still indicating the limitations of current systems for achieving clinically ready performance."}}
{"id": "p3x7A2Io2q", "cdate": 1672531200000, "mdate": 1699912779813, "content": {"title": "Bayesian Models of Functional Connectomics and Behavior", "abstract": "The problem of jointly analysing functional connectomics and behavioral data is extremely challenging owing to the complex interactions between the two domains. In addition, clinical rs-fMRI studies often have to contend with limited samples, especially in the case of rare disorders. This data-starved regimen can severely restrict the reliability of classical machine learning or deep learning designed to predict behavior from connectivity data. In this work, we approach this problem from the lens of representation learning and bayesian modeling. To model the distributional characteristics of the domains, we first examine the ability of approaches such as Bayesian Linear Regression, Stochastic Search Variable Selection after performing a classical covariance decomposition. Finally, we present a fully bayesian formulation for joint representation learning and prediction. We present preliminary results on a subset of a publicly available clinical rs-fMRI study on patients with Autism Spectrum Disorder."}}
{"id": "_PLEsnYXdl2", "cdate": 1672531200000, "mdate": 1692043766283, "content": {"title": "MaxCorrMGNN: A Multi-Graph Neural Network Framework for Generalized Multimodal Fusion of Medical Data for Outcome Prediction", "abstract": "With the emergence of multimodal electronic health records, the evidence for an outcome may be captured across multiple modalities ranging from clinical to imaging and genomic data. Predicting outcomes effectively requires fusion frameworks capable of modeling fine-grained and multi-faceted complex interactions between modality features within and across patients. We develop an innovative fusion approach called MaxCorr MGNN that models non-linear modality correlations within and across patients through Hirschfeld-Gebelein-Renyi maximal correlation (MaxCorr) embeddings, resulting in a multi-layered graph that preserves the identities of the modalities and patients. We then design, for the first time, a generalized multi-layered graph neural network (MGNN) for task-informed reasoning in multi-layered graphs, that learns the parameters defining patient-modality graph connectivity and message passing in an end-to-end fashion. We evaluate our model an outcome prediction task on a Tuberculosis (TB) dataset consistently outperforming several state-of-the-art neural, graph-based and traditional fusion techniques."}}
{"id": "Ma5jLGBF8w", "cdate": 1672531200000, "mdate": 1699912779496, "content": {"title": "mSPD-NN: A Geometrically Aware Neural Framework for Biomarker Discovery from Functional Connectomics Manifolds", "abstract": "Connectomics has emerged as a powerful tool in neuroimaging and has spurred recent advancements in statistical and machine learning methods for connectivity data. Despite connectomes inhabiting a matrix manifold, most analytical frameworks ignore the underlying data geometry. This is largely because simple operations, such as mean estimation, do not have easily computable closed-form solutions. We propose a geometrically aware neural framework for connectomes, i.e., the mSPD-NN, designed to estimate the geodesic mean of a collections of symmetric positive definite (SPD) matrices. The mSPD-NN is comprised of bilinear fully connected layers with tied weights and utilizes a novel loss function to optimize the matrix-normal equation arising from Fréchet mean estimation. Via experiments on synthetic data, we demonstrate the efficacy of our mSPD-NN against common alternatives for SPD mean estimation, providing competitive performance in terms of scalability and robustness to noise. We illustrate the real-world flexibility of the mSPD-NN in multiple experiments on rs-fMRI data and demonstrate that it uncovers stable biomarkers associated with subtle network differences among patients with ADHD-ASD comorbidities and healthy controls."}}
{"id": "h-UkhDzFFj", "cdate": 1663849978449, "mdate": null, "content": {"title": "Geo-NN: An End-to-End Framework for Geodesic Mean Estimation on the Manifold of Symmetric Positive Definite Matrices", "abstract": "The manifold of symmetric positive definite (SPD) matrices plays a key role in many domains, from network science to differential geometry to signal and image processing. However, leveraging the SPD manifold geometry during inference is challenging, as simple operations, such as mean estimation, do not have a closed-form or easily computable solution. In this paper, we propose an end-to-end deep learning framework, which we call a Geometric Neural Network (Geo-NN), to efficiently compute the geodesic mean of a collection of matrices lying on the SPD manifold. Geo-NN utilizes a Matrix-Autoencoder (MAE) architecture with intersecting fully connected layers as its backbone. We illustrate that the matrix-normal equation arising from Fr\\'echet mean estimation can be converted into a loss function for optimizing the Geo-NN, which in turn approximates the geodesic mean of a collection of SPD matrices. We demonstrate the efficacy of our framework in both synthetic and real-world scenarios, as compared to commonly used alternative methods. Our simulated experiments demonstrate that Geo-NN is robust to various noise conditions and is scalable to increasing dataset size and dimensionality. Our real-world application of Geo-NN to functional connectomics data allows us to extract network patterns associated with patient/control differences."}}
{"id": "0lCoqZB08-", "cdate": 1640995200000, "mdate": 1667347388895, "content": {"title": "Fusing Modalities by Multiplexed Graph Neural Networks for Outcome Prediction in Tuberculosis", "abstract": "In a complex disease such as tuberculosis, the evidence for the disease and its evolution may be present in multiple modalities such as clinical, genomic, or imaging data. Effective patient-tailored outcome prediction and therapeutic guidance will require fusing evidence from these modalities. Such multimodal fusion is difficult since the evidence for the disease may not be uniform across all modalities, not all modality features may be relevant, or not all modalities may be present for all patients. All these nuances make simple methods of early, late, or intermediate fusion of features inadequate for outcome prediction. In this paper, we present a novel fusion framework using multiplexed graphs and derive a new graph neural network for learning from such graphs. Specifically, the framework allows modalities to be represented through their targeted encodings, and models their relationship explicitly via multiplexed graphs derived from salient features in a combined latent space. We present results that show that our proposed method outperforms state-of-the-art methods of fusing modalities for multi-outcome prediction on a large Tuberculosis (TB) dataset."}}
{"id": "ud-iBiED9zb", "cdate": 1612997569581, "mdate": null, "content": {"title": "M-GCN: A Multimodal Graph Convolutional Network to Integrate Functional and Structural Connectomics Data to Predict Multidimensional Phenotypic Characterizations", "abstract": "We propose a multimodal graph convolutional network (M-GCN) that integrates resting-state fMRI connectivity and diffusion tensor imaging tractography to predict phenotypic measures. Our specialized M-GCN filters act topologically on the functional connectivity matrices, as guided by the subject-wise structural connectomes. The inclusion of structural information also acts as a regularizer and helps extract rich data embeddings that are predictive of clinical outcomes. We validate our framework on 275 healthy individuals from the Human Connectome Project and 57 individuals diagnosed with Autism Spectrum Disorder from an in-house data to predict cognitive measures and behavioral deficits respectively. We demonstrate that the M-GCN outperforms several state-of-the-art baselines in a five-fold cross validated setting and extracts predictive biomarkers from both healthy and autistic populations. Our framework thus provides the representational flexibility to exploit the complementary nature of structure and function and map this information to phenotypic measures in the presence of limited training data."}}
{"id": "9nFzujol4JA", "cdate": 1609459200000, "mdate": 1631117070530, "content": {"title": "Predicting Acute Kidney Injury via Interpretable Ensemble Learning and Attention Weighted Convoutional-Recurrent Neural Networks", "abstract": "Acute Kidney Injury (AKI) is one of the most frequent postoperative complications and is associated with both short- and long-term mortality. Improved prediction of AKI is crucial and may help clinicians prevent and mitigate its adverse effects. In this paper, we explore the use of machine learning methods to predict postoperative AKI. Our analysis centers on the ensemble-based random forest (RF) classifier, which operates on static clinical variables, and a novel deep learning architecture that incorporates intraoperative time series data along with the static variables. The architecture uses a dual-attention mechanism to select both features and time intervals relevant for AKI prediction. We evaluate our models on the publicly available VitalDB database of 3,640 patients who underwent non-cardiac surgery. The RF outperformed existing machine learning classifiers in the AKI literature (AUROC: 0.86, AUPRC: 0.54). In addition, the RF identified a robust set of preoperative variables that can be screened in a simple blood test. While the deep learning model achieved slightly lower performance (AUROC: 0.84, AUPRC: 0.44), the attention weights provide important intraoperative information, which can be monitored by clinicians during surgery. Taken together, our results highlight the promise of machine learning for AKI prediction and take the first steps towards developing clinically translatable models."}}
