{"id": "hBLGeslooS", "cdate": 1672531200000, "mdate": 1688053278114, "content": {"title": "Improving Grounded Language Understanding in a Collaborative Environment by Interacting with Agents Through Help Feedback", "abstract": "Many approaches to Natural Language Processing (NLP) tasks often treat them as single-step problems, where an agent receives an instruction, executes it, and is evaluated based on the final outcome. However, human language is inherently interactive, as evidenced by the back-and-forth nature of human conversations. In light of this, we posit that human-AI collaboration should also be interactive, with humans monitoring the work of AI agents and providing feedback that the agent can understand and utilize. Further, the AI agent should be able to detect when it needs additional information and proactively ask for help. Enabling this scenario would lead to more natural, efficient, and engaging human-AI collaborations. In this work, we explore these directions using the challenging task defined by the IGLU competition, an interactive grounded language understanding task in a MineCraft-like world. We explore multiple types of help players can give to the AI to guide it and analyze the impact of this help in AI behavior, resulting in performance improvements."}}
{"id": "JJTPy7-NuO6", "cdate": 1640995200000, "mdate": 1664910874734, "content": {"title": "Tackling Fake News Detection by Continually Improving Social Context Representations using Graph Neural Networks", "abstract": ""}}
{"id": "4zJ2r7vMNv", "cdate": 1546300800000, "mdate": 1688053278173, "content": {"title": "Improving Natural Language Interaction with Robots Using Advice", "abstract": "Over the last few years, there has been growing interest in learning models for physically grounded language understanding tasks, such as the popular blocks world domain. These works typically view this problem as a single-step process, in which a human operator gives an instruction and an automated agent is evaluated on its ability to execute it. In this paper we take the first step towards increasing the bandwidth of this interaction, and suggest a protocol for including advice, high-level observations about the task, which can help constrain the agent's prediction. We evaluate our approach on the blocks world task, and show that even simple advice can help lead to significant performance improvements. To help reduce the effort involved in supplying the advice, we also explore model self-generated advice which can still improve results."}}
