{"id": "wUn1Q_GvIRh", "cdate": 1672531200000, "mdate": 1685474427520, "content": {"title": "Ask \"Who\", Not \"What\": Bitcoin Volatility Forecasting with Twitter Data", "abstract": ""}}
{"id": "qrw40Po0bl", "cdate": 1672531200000, "mdate": 1707303729683, "content": {"title": "Temporal-Weighted Bipartite Graph Model for Sparse Expert Recommendation in Community Question Answering", "abstract": "Community Question Answering (CQA) websites are valuable knowledge repositories where individuals exchange information by asking and answering questions. With an ever-increasing number of questions and high in-flow and out-flow of users in these communities, a key challenge is to design effective strategies for recommending experts for new questions. This requires robust approaches that facilitate modeling users’ expertise given their changing interests and sparse historical data, at the same time being computationally less expensive for periodic updates. In this paper, we propose a simple graph diffusion-based expert recommendation model for CQA, that can outperform state-of-the-art convolutional neural network and transformers-based deep learning representatives and collaborative models. Our proposed method learns users’ expertise in the context of both semantic and temporal information to capture their changing interests and activity levels with time. Experiments on six real-world datasets from the Stack Exchange network demonstrate that our approach outperforms competitive baseline methods. Further, experiments on cold-start users (users with a limited historical record) show our model achieves an average of 50% performance gain compared to the best baseline method."}}
{"id": "GL1zvnKgdup", "cdate": 1672531200000, "mdate": 1707303729684, "content": {"title": "Universality of neural dynamics on complex networks", "abstract": "Data-driven approximations of ordinary differential equations offer a promising alternative to classical methods of discovering a dynamical system model, particularly in complex systems lacking explicit first principles. This paper focuses on a complex system whose dynamics is described with a system of such equations, coupled through a complex network. Numerous real-world systems, including financial, social, and neural systems, belong to this class of dynamical models. We propose essential elements for approximating these dynamical systems using neural networks, including necessary biases and an appropriate neural architecture. Emphasizing the differences from static supervised learning, we advocate for evaluating generalization beyond classical assumptions of statistical learning theory. To estimate confidence in prediction during inference time, we introduce a dedicated null model. By studying various complex network dynamics, we demonstrate that the neural approximations of dynamics generalize across complex network structures, sizes, and statistical properties of inputs. Our comprehensive framework enables accurate and reliable deep learning approximations of high-dimensional, nonlinear dynamical systems."}}
{"id": "ibw0kMdfOdb", "cdate": 1609459200000, "mdate": 1707303729687, "content": {"title": "Information dynamics of price and liquidity around the 2017 Bitcoin markets crash", "abstract": "We study the information dynamics between the largest Bitcoin exchange markets during the bubble in 2017-2018. By analysing high-frequency market-microstructure observables with different information theoretic measures for dynamical systems, we find temporal changes in information sharing across markets. In particular, we study the time-varying components of predictability, memory, and synchronous coupling, measured by transfer entropy, active information storage, and multi-information. By comparing these empirical findings with several models we argue that some results could relate to intra-market and inter-market regime shifts, and changes in direction of information flow between different market observables."}}
{"id": "X8j7-BBT8sK", "cdate": 1609459200000, "mdate": 1707303729685, "content": {"title": "Implicit energy regularization of neural ordinary-differential-equation control", "abstract": "Although optimal control problems of dynamical systems can be formulated within the framework of variational calculus, their solution for complex systems is often analytically and computationally intractable. In this Letter we present a versatile neural ordinary-differential-equation control (NODEC) framework with implicit energy regularization and use it to obtain neural-network-generated control signals that can steer dynamical systems towards a desired target state within a predefined amount of time. We demonstrate the ability of NODEC to learn control signals that closely resemble those found by corresponding optimal control frameworks in terms of control energy and deviation from the desired target state. Our results suggest that NODEC is capable to solve a wide range of control and optimization problems, including those that are analytically intractable."}}
{"id": "DDt6vM0KVN", "cdate": 1577836800000, "mdate": 1707303729687, "content": {"title": "NNC: Neural-Network Control of Dynamical Systems on Graphs", "abstract": "We study the ability of neural networks to calculate feedback control signals that steer trajectories of continuous time non-linear dynamical systems on graphs, which we represent with neural ordinary differential equations (neural ODEs). To do so, we present a neural-ODE control (NODEC) framework and find that it can learn feedback control signals that drive graph dynamical systems into desired target states. While we use loss functions that do not constrain the control energy, our results show, in accordance with related work, that NODEC produces low energy control signals. Finally, we evaluate the performance and versatility of NODEC against well-known feedback controllers and deep reinforcement learning. We use NODEC to generate feedback controls for systems of more than one thousand coupled, non-linear ODEs that represent epidemic processes and coupled oscillators."}}
{"id": "06Wr6Bao1l", "cdate": 1577836800000, "mdate": 1683890858636, "content": {"title": "On the impact of publicly available news and information transfer to financial markets", "abstract": "We quantify the propagation and absorption of large-scale publicly available news articles from the World Wide Web to financial markets. To extract publicly available information, we use the news archives from the Common Crawl, a nonprofit organization that crawls a large part of the web. We develop a processing pipeline to identify news articles associated with the constituent companies in the S\\&P 500 index, an equity market index that measures the stock performance of U.S. companies. Using machine learning techniques, we extract sentiment scores from the Common Crawl News data and employ tools from information theory to quantify the information transfer from public news articles to the U.S. stock market. Furthermore, we analyze and quantify the economic significance of the news-based information with a simple sentiment-based portfolio trading strategy. Our findings provides support for that information in publicly available news on the World Wide Web has a statistically and economically significant impact on events in financial markets."}}
{"id": "SkxQp1StDH", "cdate": 1569439674613, "mdate": null, "content": {"title": "Low-dimensional statistical manifold embedding of directed graphs", "abstract": "We propose a novel node embedding of directed graphs to statistical manifolds, which is based on a global minimization of pairwise relative entropy and graph geodesics in a non-linear way. Each node is encoded with a probability density function over a measurable space. Furthermore, we analyze the connection of the geometrical properties of such embedding and their efficient learning procedure. Extensive experiments show that our proposed embedding is better preserving the global geodesic information of graphs, as well as outperforming existing embedding models on directed graphs in a variety of evaluation metrics, in an unsupervised setting."}}
{"id": "rkWQNbZdbS", "cdate": 1546300800000, "mdate": null, "content": {"title": "Sensing Social Media Signals for Cryptocurrency News", "abstract": "The ability to track and monitor relevant and important news in real-time is of crucial interest in multiple industrial sectors. In this work, we focus on cryptocurrency news, which recently became of emerging interest to the general and financial audience. In order to track popular news in real-time, we (i) match news from the web with tweets from social media, (ii) track their intraday tweet activity and (iii) explore different machine learning models for predicting the number of article mentions on Twitter after its publication. We compare several machine learning models, such as linear extrapolation, linear and random forest autoregressive models, and a sequence-to-sequence neural network."}}
{"id": "Byb3xjWOZr", "cdate": 1546300800000, "mdate": null, "content": {"title": "Exploring interpretable LSTM neural networks over multi-variable data", "abstract": "For recurrent neural networks trained on time series with target and exogenous variables, in addition to accurate prediction, it is also desired to provide interpretable insights into the data. In ..."}}
