{"id": "9zoJMJZ9he8", "cdate": 1675209600000, "mdate": 1684323044513, "content": {"title": "Semi-streaming algorithms for submodular matroid intersection", "abstract": "While the basic greedy algorithm gives a semi-streaming algorithm with an approximation guarantee of 2 for the unweighted matching problem, it was only recently that Paz and Schwartzman obtained an analogous result for weighted instances. Their approach is based on the versatile local ratio technique and also applies to generalizations such as weighted hypergraph matchings. However, the framework for the analysis fails for the related problem of weighted matroid intersection and as a result the approximation guarantee for weighted instances did not match the factor 2 achieved by the greedy algorithm for unweighted instances.Our main result closes this gap by developing a semi-streaming algorithm with an approximation guarantee of $$2+\\varepsilon $$ 2 + ε for weighted matroid intersection, improving upon the previous best guarantee of $$4+\\varepsilon $$ 4 + ε . Our techniques also allow us to generalize recent results by Levin and Wajc on submodular maximization subject to matching constraints to that of matroid-intersection constraints. While our algorithm is an adaptation of the local ratio technique used in previous works, the analysis deviates significantly and relies on structural properties of matroid intersection, called kernels. Finally, we also conjecture that our algorithm gives a $$(k+\\varepsilon )$$ ( k + ε ) approximation for the intersection of k matroids but prove that new tools are needed in the analysis as the structural properties we use fail for $$k\\ge 3$$ k ≥ 3 ."}}
{"id": "qyRwXY1FiO", "cdate": 1672531200000, "mdate": 1684323044639, "content": {"title": "The Exact Bipartite Matching Polytope Has Exponential Extension Complexity", "abstract": ""}}
{"id": "YmLQESK8tf", "cdate": 1672531200000, "mdate": 1684323045176, "content": {"title": "The Price of Explainability for Clustering", "abstract": "Given a set of points in $d$-dimensional space, an explainable clustering is one where the clusters are specified by a tree of axis-aligned threshold cuts. Dasgupta et al. (ICML 2020) posed the question of the price of explainability: the worst-case ratio between the cost of the best explainable clusterings to that of the best clusterings. We show that the price of explainability for $k$-medians is at most $1+H_{k-1}$; in fact, we show that the popular Random Thresholds algorithm has exactly this price of explanability, matching the known lower bound constructions. We complement our tight analysis of this particular algorithm by constructing instances where the price of explanability (using any algorithm) is at least $(1-o(1)) \\ln k$, showing that our result is best possible, up to lower-order terms. We also improve the price of explanability for the $k$-means problem to $O(k \\ln \\ln k)$ from the previous $O(k \\ln k)$, considerably closing the gap to the lower bounds of $\\Omega(k)$. Finally, we study the algorithmic question of finding the best explainable clustering: We show that explainable $k$-medians and $k$-means cannot be approximated better than $O(\\ln k)$, under standard complexity-theoretic conjectures. This essentially settles the approximability of explainable $k$-medians and leaves open the intriguing possibility to get significantly better approximation algorithms for $k$-means than its price of explainability."}}
{"id": "xfDvsukmC-", "cdate": 1640995200000, "mdate": 1684323045190, "content": {"title": "Flow Time Scheduling and Prefix Beck-Fiala", "abstract": "We relate discrepancy theory with the classic scheduling problems of minimizing max flow time and total flow time on unrelated machines. Specifically, we give a general reduction that allows us to transfer discrepancy bounds in the prefix Beck-Fiala (bounded $\\ell_1$-norm) setting to bounds on the flow time of an optimal schedule.   Combining our reduction with a deep result proved by Banaszczyk via convex geometry, give guarantees of $O(\\sqrt{\\log n})$ and $O(\\sqrt{\\log n} \\log P)$ for max flow time and total flow time, respectively, improving upon the previous best guarantees of $O(\\log n)$ and $O(\\log n \\log P)$. Apart from the improved guarantees, the reduction motivates seemingly easy versions of prefix discrepancy questions: any constant bound on prefix Beck-Fiala where vectors have sparsity two (sparsity one being trivial) would already yield tight guarantees for both max flow time and total flow time. While known techniques solve this case when the entries take values in $\\{-1,0,1\\}$, we show that they are unlikely to transfer to the more general $2$-sparse case of bounded $\\ell_1$-norm."}}
{"id": "iEkF7LXAs7b", "cdate": 1640995200000, "mdate": 1681721850725, "content": {"title": "Submodular Maximization Subject to Matroid Intersection on the Fly", "abstract": "Despite a surge of interest in submodular maximization in the data stream model, there remain significant gaps in our knowledge about what can be achieved in this setting, especially when dealing with multiple constraints. In this work, we nearly close several basic gaps in submodular maximization subject to $k$ matroid constraints in the data stream model. We present a new hardness result showing that super polynomial memory in $k$ is needed to obtain an $o(k / \\log k)$-approximation. This implies near optimality of prior algorithms. For the same setting, we show that one can nevertheless obtain a constant-factor approximation by maintaining a set of elements whose size is independent of the stream size. Finally, for bipartite matching constraints, a well-known special case of matroid intersection, we present a new technique to obtain hardness bounds that are significantly stronger than those obtained with prior approaches. Prior results left it open whether a $2$-approximation may exist in this setting, and only a complexity-theoretic hardness of $1.91$ was known. We prove an unconditional hardness of $2.69$."}}
{"id": "gudXlCBFbT4", "cdate": 1640995200000, "mdate": 1684323044525, "content": {"title": "A Simple LP-Based Approximation Algorithm for the Matching Augmentation Problem", "abstract": "The Matching Augmentation Problem (MAP) has recently received significant attention as an important step towards better approximation algorithms for finding cheap 2-edge connected subgraphs. This has culminated in a $$\\frac{5}{3}$$ -approximation algorithm. However, the algorithm and its analysis are fairly involved and do not compare against the problem’s well-known LP relaxation called the cut LP. In this paper, we propose a simple algorithm that, guided by an optimal solution to the cut LP, first selects a DFS tree and then finds a solution to MAP by computing an optimum augmentation of this tree. Using properties of extreme point solutions, we show that our algorithm always returns (in polynomial time) a better than 2-approximation when compared to the cut LP. We thereby also obtain an improved upper bound on the integrality gap of this natural relaxation."}}
{"id": "d_N3Rh9ynK", "cdate": 1640995200000, "mdate": 1684323044697, "content": {"title": "Flow time scheduling and prefix Beck-Fiala", "abstract": ""}}
{"id": "YQMOQalNie", "cdate": 1640995200000, "mdate": 1684323045177, "content": {"title": "Towards Non-Uniform k-Center with Constant Types of Radii", "abstract": "In the Non-Uniform k-Center problem we need to cover a finite metric space using k balls of different radii that can be scaled uniformly. The goal is to minimize the scaling factor. If the number of different radii is unbounded, the problem does not admit a constant-factor approximation algorithm but it has been conjectured that such an algorithm exists if the number of radii is constant. Yet, this is known only for the case of two radii. Our first contribution is a simple black box reduction which shows that if one can handle the variant of t — 1 radii with outliers, then one can also handle t radii. Together with an algorithm by Chakrabarty and Negahbani for two radii with outliers, this immediately implies a constant-factor approximation algorithm for three radii; thus making further progress on the conjecture. Furthermore, using algorithms for the k-center with outliers problem, that is the one radii with outliers case, we also get a simple algorithm for two radii. The algorithm by Chakrabarty and Negahbani uses a top-down approach, starting with the larger radius and then proceeding to the smaller one. Our reduction, on the other hand, looks only at the smallest radius and eliminates it, which suggests that a bottom-up approach is promising. In this spirit, we devise a modification of the Chakrabarty and Negahbani algorithm which runs in a bottom-up fashion, and in this way we recover their result with the advantage of having a simpler analysis."}}
{"id": "XPlzJwHhFhJ", "cdate": 1640995200000, "mdate": 1681721850721, "content": {"title": "Submodular Maximization Subject to Matroid Intersection on the Fly", "abstract": "Despite a surge of interest in submodular maximization in the data stream model, there remain significant gaps in our knowledge about what can be achieved in this setting, especially when dealing with multiple constraints. In this work, we nearly close several basic gaps in submodular maximization subject to k matroid constraints in the data stream model. We present a new hardness result showing that super polynomial memory in k is needed to obtain an o(k/(log k))-approximation. This implies near optimality of prior algorithms. For the same setting, we show that one can nevertheless obtain a constant-factor approximation by maintaining a set of elements whose size is independent of the stream size. Finally, for bipartite matching constraints, a well-known special case of matroid intersection, we present a new technique to obtain hardness bounds that are significantly stronger than those obtained with prior approaches. Prior results left it open whether a 2-approximation may exist in this setting, and only a complexity-theoretic hardness of 1.91 was known. We prove an unconditional hardness of 2.69."}}
{"id": "LinAy2Feel", "cdate": 1640995200000, "mdate": 1684323044853, "content": {"title": "Fair colorful k-center clustering", "abstract": "An instance of colorful k-center consists of points in a metric space that are colored red or blue, along with an integer k and a coverage requirement for each color. The goal is to find the smallest radius $$\\rho $$ ρ such that there exist balls of radius $$\\rho $$ ρ around k of the points that meet the coverage requirements. The motivation behind this problem is twofold. First, from fairness considerations: each color/group should receive a similar service guarantee, and second, from the algorithmic challenges it poses: this problem combines the difficulties of clustering along with the subset-sum problem. In particular, we show that this combination results in strong integrality gap lower bounds for several natural linear programming relaxations. Our main result is an efficient approximation algorithm that overcomes these difficulties to achieve an approximation guarantee of 3, nearly matching the tight approximation guarantee of 2 for the classical k-center problem which this problem generalizes. algorithms either opened more than k centers or only worked in the special case when the input points are in the plane."}}
