{"id": "xghu0noM4ur", "cdate": 1609459200000, "mdate": 1631876449862, "content": {"title": "Estimating Previous Quantization Factors on Multiple JPEG Compressed Images", "abstract": "The JPEG compression algorithm has proven to be efficient in saving storage and preserving image quality thus becoming extremely popular. On the other hand, the overall process leaves traces into encoded signals which are typically exploited for forensic purposes: for instance, the compression parameters of the acquisition device (or editing software) could be inferred. To this aim, in this paper a novel technique to estimate “previous” JPEG quantization factors on images compressed multiple times, in the aligned case by analyzing statistical traces hidden on Discrete Cosine Transform (DCT) histograms is exploited. Experimental results on double, triple and quadruple compressed images, demonstrate the effectiveness of the proposed technique while unveiling further interesting insights."}}
{"id": "gte3uCmECt-", "cdate": 1609459200000, "mdate": 1631876449866, "content": {"title": "Food Recognition for Dietary Monitoring during Smoke Quitting", "abstract": ""}}
{"id": "ey9TuVOuO5q", "cdate": 1609459200000, "mdate": 1631876449864, "content": {"title": "Fighting deepfakes by detecting GAN DCT anomalies", "abstract": "To properly contrast the Deepfake phenomenon the need to design new Deepfake detection algorithms arises; the misuse of this formidable A.I. technology brings serious consequences in the private life of every involved person. State-of-the-art proliferates with solutions using deep neural networks to detect a fake multimedia content but unfortunately these algorithms appear to be neither generalizable nor explainable. However, traces left by Generative Adversarial Network (GAN) engines during the creation of the Deepfakes can be detected by analyzing ad-hoc frequencies. For this reason, in this paper we propose a new pipeline able to detect the so-called GAN Specific Frequencies (GSF) representing a unique fingerprint of the different generative architectures. By employing Discrete Cosine Transform (DCT), anomalous frequencies were detected. The \\BETA statistics inferred by the AC coefficients distribution have been the key to recognize GAN-engine generated data. Robustness tests were also carried out in order to demonstrate the effectiveness of the technique using different attacks on images such as JPEG Compression, mirroring, rotation, scaling, addition of random sized rectangles. Experiments demonstrated that the method is innovative, exceeds the state of the art and also give many insights in terms of explainability."}}
{"id": "1cxFPiUNFSJ", "cdate": 1609459200000, "mdate": 1631876449867, "content": {"title": "First Quantization Estimation by a Robust Data Exploitation Strategy of DCT Coefficients", "abstract": "It is well known that the JPEG compression pipeline leaves residual traces in the compressed images that are useful for forensic investigations. Through the analysis of such insights the history of a digital image can be reconstructed by means of First Quantization Estimations (FQE), often employed for the camera model identification (CMI) task. In this paper, a novel FQE technique for JPEG double compressed images is proposed which employs a mixed approach based on Machine Learning and statistical analysis. The proposed method was designed to work in the aligned case (i.e., 8 ×8 JPEG grid is not misaligned among the various compressions) and demonstrated to be able to work effectively in different challenging scenarios (small input patches, custom quantization tables) without strong a-priori assumptions, surpassing state-of-the-art solutions. Finally, an in-depth analysis on the impact of image input sizes, dataset image resolutions, custom quantization tables and different Discrete Cosine Transform (DCT) implementations was carried out."}}
{"id": "t0fenF_hTVI", "cdate": 1577836800000, "mdate": 1631876449869, "content": {"title": "DeepFake Detection by Analyzing Convolutional Traces", "abstract": "The Deepfake phenomenon has become very popular nowadays thanks to the possibility to create incredibly realistic images using deep learning tools, based mainly on ad-hoc Generative Adversarial Networks (GAN). In this work we focus on the analysis of Deepfakes of human faces with the objective of creating a new detection method able to detect a forensics trace hidden in images: a sort of fingerprint left in the image generation process. The proposed technique, by means of an Expectation Maximization (EM) algorithm, extracts a set of local features specifically addressed to model the underlying convolutional generative process. Ad-hoc validation has been employed through experimental tests with naive classifiers on five different architectures (GDWCT, STARGAN, ATTGAN, STYLEGAN, STYLEGAN2) against the CELEBA dataset as ground-truth for non-fakes. Results demonstrated the effectiveness of the technique in distinguishing the different architectures and the corresponding generation process."}}
{"id": "p4exgJijNaC", "cdate": 1577836800000, "mdate": 1631876449882, "content": {"title": "Single architecture and multiple task deep neural network for altered fingerprint analysis", "abstract": "Fingerprints are one of the most copious evidence in a crime scene and, for this reason, they are frequently used by law enforcement for identification of individuals. But fingerprints can be altered. \"Altered fingerprints\", refers to intentionally damage of the friction ridge pattern and they are often used by smart criminals in hope to evade law enforcement. We use a deep neural network approach training an Inception-v3 architecture. This paper proposes a method for detection of altered fingerprints, identification of types of alterations and recognition of gender, hand and fingers. We also produce activation maps that show which part of a fingerprint the neural network has focused on, in order to detect where alterations are positioned. The proposed approach achieves an accuracy of 98.21%, 98.46%, 92.52%, 97.53% and 92,18% for the classification of fakeness, alterations, gender, hand and fingers, respectively on the SO.CO.FING. dataset."}}
{"id": "nQtYmvT_dC7", "cdate": 1577836800000, "mdate": 1631876449864, "content": {"title": "DeepFake Detection by Analyzing Convolutional Traces", "abstract": "The Deepfake phenomenon has become very popular nowadays thanks to the possibility to create incredibly realistic images using deep learning tools, based mainly on ad-hoc Generative Adversarial Networks (GAN). In this work we focus on the analysis of Deepfakes of human faces with the objective of creating a new detection method able to detect a forensics trace hidden in images: a sort of fingerprint left in the image generation process. The proposed technique, by means of an Expectation Maximization (EM) algorithm, extracts a set of local features specifically addressed to model the underlying convolutional generative process. Ad-hoc validation has been employed through experimental tests with naive classifiers on five different architectures (GDWCT, STARGAN, ATTGAN, STYLEGAN, STYLEGAN2) against the CELEBA dataset as ground-truth for non-fakes. Results demonstrated the effectiveness of the technique in distinguishing the different architectures and the corresponding generation process."}}
{"id": "fltsltwXBj8", "cdate": 1577836800000, "mdate": 1631876449883, "content": {"title": "Animated Gif Optimization By Adaptive Color Local Table Management", "abstract": "After thirty years of the GIF file format, today is becoming more popular than ever: being a great way of communication for friends and communities on Instant Messengers and Social Networks. While being so popular, the original compression method to encode GIF images have not changed a bit. On the other hand popularity means that storage saving becomes an issue for hosting platforms. In this paper a parametric optimization technique for animated GIFs will be presented. The proposed technique is based on Local Color Table selection and color remapping in order to create optimized animated GIFs while preserving the original format. The technique achieves good results in terms of byte reduction with limited or no loss of perceived color quality. Tests carried out on 1000 GIF files demonstrate the effectiveness of the proposed optimization strategy."}}
{"id": "f20_X-_y529", "cdate": 1577836800000, "mdate": 1631876449871, "content": {"title": "In-Depth DCT Coefficient Distribution Analysis for First Quantization Estimation", "abstract": "The exploitation of traces in JPEG double compressed images is of utter importance for investigations. Properly exploiting such insights, First Quantization Estimation (FQE) could be performed in order to obtain source camera model identification (CMI) and therefore reconstruct the history of a digital image. In this paper, a method able to estimate the first quantization factors for JPEG double compressed images is presented, employing a mixed statistical and Machine Learning approach. The presented solution is demonstrated to work without any a-priori assumptions about the quantization matrices. Experimental results and comparisons with the state-of-the-art show the goodness of the proposed technique."}}
{"id": "Q8ogYB5DLFj", "cdate": 1577836800000, "mdate": 1631876449871, "content": {"title": "Fighting Deepfake by Exposing the Convolutional Traces on Images", "abstract": "Advances in Artificial Intelligence and Image Processing are changing the way people interacts with digital images and video. Widespread mobile apps like FACEAPP make use of the most advanced Generative Adversarial Networks (GAN) to produce extreme transformations on human face photos such gender swap, aging, etc. The results are utterly realistic and extremely easy to be exploited even for non-experienced users. This kind of media object took the name of Deepfake and raised a new challenge in the multimedia forensics field: the Deepfake detection challenge. Indeed, discriminating a Deepfake from a real image could be a difficult task even for human eyes but recent works are trying to apply the same technology used for generating images for discriminating them with preliminary good results but with many limitations: employed Convolutional Neural Networks are not so robust, demonstrate to be specific to the context and tend to extract semantics from images. In this paper, a new approach aimed to extract a Deepfake fingerprint from images is proposed. The method is based on the Expectation-Maximization algorithm trained to detect and extract a fingerprint that represents the Convolutional Traces (CT) left by GANs during image generation. The CT demonstrates to have high discriminative power achieving better results than state-of-the-art in the Deepfake detection task also proving to be robust to different attacks. Achieving an overall classification accuracy of over 98%, considering Deepfakes from 10 different GAN architectures not only involved in images of faces, the CT demonstrates to be reliable and without any dependence on image semantic. Finally, tests carried out on Deepfakes generated by FACEAPP achieving 93% of accuracy in the fake detection task, demonstrated the effectiveness of the proposed technique on a real-case scenario."}}
