{"id": "f7d_qjEthpo", "cdate": 1672531200000, "mdate": 1682456238987, "content": {"title": "Learning with Exposure Constraints in Recommendation Systems", "abstract": "Recommendation systems are dynamic economic systems that balance the needs of multiple stakeholders. A recent line of work studies incentives from the content providers' point of view. Content providers, e.g., vloggers and bloggers, contribute fresh content and rely on user engagement to create revenue and finance their operations. In this work, we propose a contextual multi-armed bandit setting to model the dependency of content providers on exposure. In our model, the system receives a user context in every round and has to select one of the arms. Every arm is a content provider who must receive a minimum number of pulls every fixed time period (e.g., a month) to remain viable in later rounds; otherwise, the arm departs and is no longer available. The system aims to maximize the users' (content consumers) welfare. To that end, it should learn which arms are vital and ensure they remain viable by subsidizing arm pulls if needed. We develop algorithms with sub-linear regret, as well as a lower bound that demonstrates that our algorithms are optimal up to logarithmic factors."}}
{"id": "n7-mcBY6XIH", "cdate": 1640995200000, "mdate": 1682456238988, "content": {"title": "Modeling Attrition in Recommender Systems with Departing Bandits", "abstract": "Traditionally, when recommender systems are formalized as multi-armed bandits, the policy of the recommender system influences the rewards accrued, but not the length of interaction. However, in real-world systems, dissatisfied users may depart (and never come back). In this work, we propose a novel multi-armed bandit setup that captures such policy-dependent horizons. Our setup consists of a finite set of user types, and multiple arms with Bernoulli payoffs. Each (user type, arm) tuple corresponds to an (unknown) reward probability. Each user's type is initially unknown and can only be inferred through their response to recommendations. Moreover, if a user is dissatisfied with their recommendation, they might depart the system. We first address the case where all users share the same type, demonstrating that a recent UCB-based algorithm is optimal. We then move forward to the more challenging case, where users are divided among two types. While naive approaches cannot handle this setting, we provide an efficient learning algorithm that achieves O(sqrt(T)ln(T)) regret, where T is the number of users."}}
{"id": "KzzLcJYpMS", "cdate": 1640995200000, "mdate": 1682456239179, "content": {"title": "Modeling Attrition in Recommender Systems with Departing Bandits", "abstract": "Traditionally, when recommender systems are formalized as multi-armed bandits, the policy of the recommender system influences the rewards accrued, but not the length of interaction. However, in real-world systems, dissatisfied users may depart (and never come back). In this work, we propose a novel multi-armed bandit setup that captures such policy-dependent horizons. Our setup consists of a finite set of user types, and multiple arms with Bernoulli payoffs. Each (user type, arm) tuple corresponds to an (unknown) reward probability. Each user's type is initially unknown and can only be inferred through their response to recommendations. Moreover, if a user is dissatisfied with their recommendation, they might depart the system. We first address the case where all users share the same type, demonstrating that a recent UCB-based algorithm is optimal. We then move forward to the more challenging case, where users are divided among two types. While naive approaches cannot handle this setting, we provide an efficient learning algorithm that achieves $\\tilde{O}(\\sqrt{T})$ regret, where $T$ is the number of users."}}
{"id": "v9nDnkuyan", "cdate": 1609459200000, "mdate": 1682456265795, "content": {"title": "Corporate Social Responsibility via Multi-Armed Bandits", "abstract": "We propose a multi-armed bandit setting where each arm corresponds to a subpopulation, and pulling an arm is equivalent to granting an opportunity to this subpopulation. In this setting the decision-maker's fairness policy governs the number of opportunities each subpopulation should receive, which typically depends on the (unknown) reward from granting an opportunity to this subpopulation. The decision-maker can decide whether to provide these opportunities, or pay a pre-defined monetary value for every withheld opportunity. The decision-maker's objective is to maximize her utility, which is the sum of rewards minus the cost paid for withheld opportunities. We provide a no-regret algorithm that maximizes the decision-maker's utility and complement our analysis with an almost-tight lower bound. Finally, we discuss the fairness policy and demonstrate its downstream implications on the utility and opportunities via simulations."}}
{"id": "FNLfCccT1G", "cdate": 1609459200000, "mdate": 1682456265793, "content": {"title": "Protecting the Protected Group: Circumventing Harmful Fairness", "abstract": "The recent literature on fair Machine Learning manifests that the choice of fairness constraints must be driven by the utilities of the population. However, virtually all previous work makes the unrealistic assumption that the exact underlying utilities of the population (representing private tastes of individuals) are known to the regulator that imposes the fairness constraint. In this paper we initiate the discussion of the \\emph{mismatch}, the unavoidable difference between the underlying utilities of the population and the utilities assumed by the regulator. We demonstrate that the mismatch can make the disadvantaged protected group worse off after imposing the fairness constraint and provide tools to design fairness constraints that help the disadvantaged group despite the mismatch."}}
{"id": "rH4w8L_18gO", "cdate": 1599586999985, "mdate": null, "content": {"title": "Optimizing Long-term Social Welfare in Recommender Systems: A Constrained Matching Approach", "abstract": "Most recommender systems (RS) research assumes that a user's utility can be maximized independently of the utility of the other agents (e.g., other users, content providers). In realistic settings, this is often not true---the dynamics of an RS ecosystem couple the long-term utility of all agents. In this work, we explore settings in which content providers cannot remain viable unless they receive a certain level of user engagement.\nWe formulate the recommendation problem in this setting as one of equilibrium selection in the induced dynamical system, and show that it can be solved as an optimal constrained matching problem. \nOur model ensures the system reaches an equilibrium with maximal social welfare supported by a sufficiently diverse set of viable providers.\nWe demonstrate that even in a simple, stylized dynamical RS model, the standard myopic approach to recommendation---always matching a user to the best provider---performs poorly.\nWe develop several scalable techniques to solve the matching problem, and also draw connections to various notions of user regret and fairness, arguing that these outcomes are fairer in a utilitarian sense."}}
{"id": "bWDdO3tydJd", "cdate": 1577836800000, "mdate": 1682456239137, "content": {"title": "Privacy, Altruism, and Experience: Estimating the Perceived Value of Internet Data for Medical Uses", "abstract": "People increasingly turn to the Internet when they have a medical condition. The data they create during this process is a valuable source for medical research and future health services. When used for these purposes, it is imperative to balance use with user privacy. One way to understand how to harmonize these requirements is to match the perceived value that users assign to their data with the value of the services derived from them. Here we describe novel experiments where methods from Mechanism Design, Crowdsourcing and Data Science were used together to elicit truthful valuations from users for their Internet data and for services derived from these data, specifically for medical screening. In these experiments, 880 people from around the world were asked to participate in an auction to provide their data for uses differing in their contribution to the participant and to society, and in the disease they addressed. Some users were offered monetary compensation for their participation, while others were asked to pay to participate. Our findings show that 99% of people were willing to contribute their data in exchange for monetary compensation and an analysis of their data, while 53% were willing to pay to have their data analyzed. The average perceived value users assigned to their data was estimated at US$49. Their value for services which offer personal benefit to them was US$22, while the value of this service offered to the general public was US$20. Our findings show that it is possible to place a monetary value on health-related uses of highly personal data. Our methodology can be extended to other areas where sensitive data may be exchanged for services to individuals and to society."}}
{"id": "ahwRG2MsB5", "cdate": 1577836800000, "mdate": 1681679819850, "content": {"title": "Optimizing Long-term Social Welfare in Recommender Systems: A Constrained Matching Approach", "abstract": "Most recommender systems (RS) research assumes that a user's utility can be maximized independently of the utility of the other agents (e.g., other users, content providers). In realistic settings, this is often not true---the dynamics of an RS ecosystem couple the long-term utility of all agents. In this work, we explore settings in which content providers cannot remain viable unless they receive a certain level of user engagement. We formulate the recommendation problem in this setting as one of equilibrium selection in the induced dynamical system, and show that it can be solved as an optimal constrained matching problem. Our model ensures the system reaches an equilibrium with maximal social welfare supported by a sufficiently diverse set of viable providers. We demonstrate that even in a simple, stylized dynamical RS model, the standard myopic approach to recommendation---always matching a user to the best provider---performs poorly. We develop several scalable techniques to solve the matching problem, and also draw connections to various notions of user regret and fairness, arguing that these outcomes are fairer in a utilitarian sense."}}
{"id": "UdpyyVZOefb", "cdate": 1577836800000, "mdate": 1682456239171, "content": {"title": "Learning under Invariable Bayesian Safety", "abstract": "A recent body of work addresses safety constraints in explore-and-exploit systems. Such constraints arise where, for example, exploration is carried out by individuals whose welfare should be balanced with overall welfare. In this paper, we adopt a model inspired by recent work on a bandit-like setting for recommendations. We contribute to this line of literature by introducing a safety constraint that should be respected in every round and determines that the expected value in each round is above a given threshold. Due to our modeling, the safe explore-and-exploit policy deserves careful planning, or otherwise, it will lead to sub-optimal welfare. We devise an asymptotically optimal algorithm for the setting and analyze its instance-dependent convergence rate."}}
{"id": "NBh5VXC7Kp", "cdate": 1577836800000, "mdate": 1682456238987, "content": {"title": "Predicting Strategic Behavior from Free Text (Extended Abstract)", "abstract": "The connection between messaging and action is fundamental both to web applications, such as web search and sentiment analysis, and to economics. However, while prominent online applications exploit messaging in natural (human) language in order to predict non-strategic action selection, the economics literature focuses on the connection between structured stylized messaging to strategic decisions in games and multi-agent encounters. This paper aims to connect these two strands of research, which we consider highly timely and important due to the vast online textual communication on the web. Particularly, we introduce the following question: can free text expressed in natural language serve for the prediction of action selection in an economic context, modeled as a game? We initiate research on this question by providing preliminary positive results."}}
