{"id": "etPgCVMh8IB", "cdate": 1663850007955, "mdate": null, "content": {"title": "Distraction is All You Need For Fairness", "abstract": "Bias in training datasets must be managed for various groups in classification tasks\nto ensure parity or equal treatment. With the recent growth in artificial intelli-\ngence models and their expanding role in automated decision-making, ensuring\nthat these models are not biased is vital. There is an abundance of evidence sug-\ngesting that these models could contain or even amplify the bias present in the\ndata on which they are trained, inherent to their objective function and learning\nalgorithms; Many researchers direct their attention to this issue in different direc-\ntions, namely, changing data to be statistically independent, adversarial training\nfor restricting the capabilities of a particular competitor who aims to maximize\nparity, etc. These methods result in information loss and do not provide a suitable\nbalance between accuracy and fairness or do not ensure limiting the biases in train-\ning. To this end, we propose a powerful strategy for training deep learning models\ncalled the Distraction module, which can be theoretically proven effective in con-\ntrolling bias from affecting the classification results. This method can be utilized\nwith different data types (e.g., Tabular, images, graphs, etc.). We demonstrate the\npotency of the proposed method by testing it on UCI Adult and Heritage Health\ndatasets (tabular), POKEC-Z, POKEC-N and NBA datasets (graph), and CelebA\ndataset (Vision). Using state-of-the-art methods proposed in the fairness literature\nfor each dataset, we exhibit our model is superior to these proposed methods in\nminimizing bias and maintaining accuracy."}}
{"id": "IYCUjY2YAQe", "cdate": 1640995200000, "mdate": 1648697376760, "content": {"title": "Distraction is All You Need for Fairness", "abstract": "With the recent growth in artificial intelligence models and its expanding role in automated decision making, ensuring that these models are not biased is of vital importance. There is an abundance of evidence suggesting that these models could contain or even amplify the bias present in the data on which they are trained, inherent to their objective function and learning algorithms. In this paper, we propose a novel classification algorithm that improves fairness, while maintaining accuracy of the predictions. Utilizing the embedding layer of a pre-trained classifier for the protected attributes, the network uses an attention layer to distract the classification from depending on the protected attribute in its predictions. We compare our model with six state-of-the-art methodologies proposed in fairness literature, and show that the model is superior to those methods in terms of minimizing bias while maintaining accuracy."}}
{"id": "kEFpx5wjSjj", "cdate": 1609459200000, "mdate": 1648697376831, "content": {"title": "Towards Fairness in AI: Addressing Bias in Data Using GANs", "abstract": "Can we trust machine learning models to make fair decisions? This question becomes more relevant as these algorithms become more pervasive in many aspects of our lives and our society. While the main objective of artificial intelligence (AI) algorithms is traditionally to increase accuracy, the AI community is gradually focusing more on evaluating and developing algorithms to ensure fairness. This work explores the usefulness of adversarial learning, explicitly generative adversarial networks (GAN), in addressing the problem of fairness. We show that the proposed model is able to produce synthetic tabular data to augment the original dataset in order to improve demographic parity, while maintaining data utility. In doing so, our work increases algorithmic fairness while maintaining accuracy."}}
{"id": "Wf-zigEBVsh", "cdate": 1609459200000, "mdate": 1648697376780, "content": {"title": "Multi-agent Naïve Utility Calculus: Intent Recognition in the Stag-Hunt Game", "abstract": "The human ability to utilize social and behavioral cues to infer each other’s intents, infer motivations, and predict future actions is a central process to human social life. This ability represents a facet of human cognition that artificial intelligence has yet to fully mimic and master. Artificial agents with greater social intelligence have wide-ranging applications from enabling the collaboration of human-AI teams to more accurately modelling human behavior in complex systems. Here, we show that the Naïve Utility Calculus generative model is capable of competing with leading models in intent recognition and action prediction when observing stag-hunt, a simple multiplayer game where agents must infer each other’s intentions to maximize rewards. Moreover, we show the model is the first with the capacity to out-compete human observers in intent recognition after the first round of observation."}}
{"id": "UoiHMD9eCut", "cdate": 1609459200000, "mdate": 1648697376769, "content": {"title": "TabFairGAN: Fair Tabular Data Generation with Generative Adversarial Networks", "abstract": "With the increasing reliance on automated decision making, the issue of algorithmic fairness has gained increasing importance. In this paper, we propose a Generative Adversarial Network for tabular data generation. The model includes two phases of training. In the first phase, the model is trained to accurately generate synthetic data similar to the reference dataset. In the second phase we modify the value function to add fairness constraint, and continue training the network to generate data that is both accurate and fair. We test our results in both cases of unconstrained, and constrained fair data generation. In the unconstrained case, i.e. when the model is only trained in the first phase and is only meant to generate accurate data following the same joint probability distribution of the real data, the results show that the model beats state-of-the-art GANs proposed in the literature to produce synthetic tabular data. Also, in the constrained case in which the first phase of training is followed by the second phase, we train the network and test it on four datasets studied in the fairness literature and compare our results with another state-of-the-art pre-processing method, and present the promising results that it achieves. Comparing to other studies utilizing GANs for fair data generation, our model is comparably more stable by using only one critic, and also by avoiding major problems of original GAN model, such as mode-dropping and non-convergence, by implementing a Wasserstein GAN."}}
{"id": "SS1VgIMfSl", "cdate": 1609459200000, "mdate": 1648697376827, "content": {"title": "Quantum Contagion: A Quantum-Like Approach for the Analysis of Social Contagion Dynamics with Heterogeneous Adoption Thresholds", "abstract": "Modeling the information of social contagion processes has recently attracted a substantial amount of interest from researchers due to its wide applicability in network science, multi-agent-systems, information science, and marketing. Unlike in biological spreading, the existence of a reinforcement effect in social contagion necessitates considering the complexity of individuals in the systems. Although many studies acknowledged the heterogeneity of the individuals in their adoption of information, there are no studies that take into account the individuals’ uncertainty during their adoption decision-making. This resulted in less than optimal modeling of social contagion dynamics in the existence of phase transition in the final adoption size versus transmission probability. We employed the Inverse Born Problem (IBP) to represent probabilistic entities as complex probability amplitudes in edge-based compartmental theory, and demonstrated that our novel approach performs better in the prediction of social contagion dynamics through extensive simulations on random regular networks."}}
{"id": "-IDpxPw0kgO", "cdate": 1609459200000, "mdate": 1648697376829, "content": {"title": "A Quantum Leap for Fairness: Quantum Bayesian Approach for Fair Decision Making", "abstract": "With the increasing demand for using artificial intelligence algorithms, the need for a fairness-oriented design in automated decision-making systems emerges as a major concern. Since poorly designed algorithms that ignore the fairness criterion in sensitive attributes (e.g., age, race, and gender) may generate or strengthen bias towards specific groups, researchers try to improve the fairness of AI algorithms without compromising their accuracy. Although many studies focused on the optimization of the trade-off between fairness and accuracy in recent years, understanding the sources of unfairness in decision-making is an essential challenge. To tackle this problem, researchers proposed fair causal learning approaches, which enable us to model cause and effects knowledge structure, to discover the sources of the bias, and to prevent unfair decision-making by amplifying transparency and explainability of AI algorithms. These studies consider fair causal learning problems based on the assumption that the underlying probabilistic model of the world is known; whereas, it is well-known that humans do not obey the classical probability rules in making decisions due to emotional changes, subconscious feelings, and subjective biases, and this yields uncertainty in underlying probabilistic models. In this study, we aim to introduce quantum Bayesian approach as a candidate for fair decision-making in causal learning, motivated by the human decision-making literature in cognitive science. We demonstrated that quantum Bayesian perspective creates well-performing fair decision rules under high uncertainty on the well-known COMPAS (Correctional Offender Management Profiling for Alternative Sanctions) data set."}}
{"id": "6AfAUOv3Z_m", "cdate": 1577836800000, "mdate": 1648697376829, "content": {"title": "A Stance Data Set on Polarized Conversations on Twitter about the Efficacy of Hydroxychloroquine as a Treatment for COVID-19", "abstract": "At the time of this study, the SARS-CoV-2 virus that caused the COVID-19 pandemic has spread significantly across the world. Considering the uncertainty about policies, health risks, financial difficulties, etc. the online media, specially the Twitter platform, is experiencing a high volume of activity related to this pandemic. Among the hot topics, the polarized debates about unconfirmed medicines for the treatment and prevention of the disease have attracted significant attention from online media users. In this work, we present a stance data set, COVID-CQ, of user-generated content on Twitter in the context of COVID-19. We investigated more than 14 thousand tweets and manually annotated the opinions of the tweet initiators regarding the use of \"chloroquine\" and \"hydroxychloroquine\" for the treatment or prevention of COVID-19. To the best of our knowledge, COVID-CQ is the first data set of Twitter users' stances in the context of the COVID-19 pandemic, and the largest Twitter data set on users' stances towards a claim, in any domain. We have made this data set available to the research community via GitHub. We expect this data set to be useful for many research purposes, including stance detection, evolution and dynamics of opinions regarding this outbreak, and changes in opinions in response to the exogenous shocks such as policy decisions and events."}}
{"id": "enwxD5qE5Fq", "cdate": 1451606400000, "mdate": 1648697376825, "content": {"title": "Evaluation of Zika Vector Control Strategies Using Agent-Based Modeling", "abstract": "Aedes Aegypti is the vector of several deadly diseases, including Zika. Effective and sustainable vector control measures must be deployed to keep A. aegypti numbers under control. The distribution of A. Aegypti is subject to spatial and climatic constraints. Using agent-based modeling, we model the population dynamics of A. aegypti subjected to the spatial and climatic constraints of a neighborhood in the Key West. Satellite imagery was used to identify vegetation, houses (CO2 zones) both critical to the mosquito lifecycle. The model replicates the seasonal fluctuation of adult population sampled through field studies and approximates the population at a high of 986 (95% CI: [979, 993]) females and 1031 (95% CI: [1024, 1039]) males in the fall and a low of 316 (95% CI: [313, 319]) females and 333 (95% CI: [330, 336]) males during the winter. We then simulate two biological vector control strategies: 1) Wolbachia infection and 2) Release of Insects carrying a Dominant Lethal gene (RIDL). Our results support the probability of sustained Wolbachia infection within the population for two years after the year of release. egies, our approach provides a realistic simulation environment consisting of male and female Aedes aegypti, breeding spots, vegetation and CO2 sources."}}
{"id": "yQTXP6Rlmpn", "cdate": 1420070400000, "mdate": 1648697376830, "content": {"title": "Role of entrepreneurial support for networking in innovation ecosystems: an agent based approach", "abstract": "Entrepreneurial support organizations are among the most successful approaches for economic growth. There are multiple dimensions of entrepreneurial support activities such as resource provision, funding or networking support. In this paper, we present an approach for the assessment and analysis of entrepreneurial support for networking and its effects on global innovation ecosystems. The innovation ecosystem in our approach is modeled as a complex adaptive network by using an agent-based modeling methodology with a focus on entrepreneurial support organizations. A portion of the economic entities in this ecosystem is provided with entrepreneurial support of different types to assess their effects. The results highlight the positive impact of networking support on the innovation ecosystem."}}
