{"id": "kwe5T61yaY", "cdate": 1673607648126, "mdate": 1673607648126, "content": {"title": "Universally Composable End-to-End Secure Messaging: A Modular Analysis", "abstract": "We provide a full-fledged security analysis of the Signal end-to-end messaging protocol  within the UC framework. In particular:\n\n(1) We formulate an ideal functionality that captures end-to-end secure messaging, in a setting with PKI  and an untrusted server,  against an  adversary that has full control over the network and can adaptively and momentarily compromise parties at any  time and obtain their entire internal states.  In particular our analysis captures the forward and backwards secrecy properties of Signal and the conditions under which they break.\n(2) We model the various components of Signal  (PKI and long-term keys, backbone \"asymmetric ratchet\", epoch-level symmetric ratchets,  authenticated encryption) as individual ideal functionalities that are analysed separately and then composed using the UC and Global-State UC theorems.\n(3) We use the Random Oracle Model to model non-committing encryption for arbitrary-length messages, but the rest of the analysis is in the plain model based on standard primitives. In particular, we show how to realize Signal's key derivation functions in the standard model, from generic components, and under minimalistic cryptographic assumptions.\n\nOur analysis improves on previous ones in the guarantees it provides,  in its relaxed security assumptions,  and in its modularity.  We also uncover some weaknesses of Signal that were not previously discussed.\n\nOur modeling differs from previous UC models of secure communication in that the protocol is modeled as a set of local algorithms, keeping the  communication network completely out of scope. We also make extensive, layered use of global-state composition within the plain UC framework. These innovations may be of separate interest."}}
{"id": "8akYUIEL1j0", "cdate": 1673607575114, "mdate": 1673607575114, "content": {"title": "The Price of Differential Privacy under Continual Observation", "abstract": "We study the accuracy of differentially private mechanisms in the continual release model. A continual release mechanism receives a sensitive dataset as a stream of  inputs and produces, after receiving each input, an accurate output on the obtained inputs. In contrast, a batch algorithm receives the data as one batch and produces a single output. We provide the first strong lower bounds on the error of continual release mechanisms. In particular, for two fundamental problems that are widely studied and used in the batch model, we show that the worst case error of every continual release algorithm is  times larger than that of the best batch algorithm. Previous work shows only a polylogarithimic (in ) gap between the worst case error achievable in these two models; further, for many problems, including the summation of binary attributes, the polylogarithmic gap is tight (Dwork et al., 2010; Chan et al., 2010). Our results show that closely related problems -- specifically, those that require selecting the largest of a set of sums -- are fundamentally harder in the continual release model than in the batch model. Our lower bounds assume only that privacy holds for streams fixed in advance (the \"nonadaptive\" setting). However, we provide matching upper bounds that hold in a model where privacy is required even for adaptively selected streams. This model may be of independent interest."}}
{"id": "6eSLtk047l", "cdate": 1640995200000, "mdate": 1681685482989, "content": {"title": "Universally Composable End-to-End Secure Messaging", "abstract": "We model and analyze the Signal end-to-end messaging protocol within the UC framework. In particular:                                                                                                                                                                                Our modeling introduces additional innovations that enable arguing about the security of Signal irrespective of the underlying communication medium, as well as secure composition of dynamically generated modules that share state. These features, together with the basic modularity of the UC framework, will hopefully facilitate the use of both Signal-as-a-whole and its individual components within cryptographic applications. Two other features of our modeling are the treatment of fully adaptive corruptions, and making minimal use of random oracle abstractions. In particular, we show how to realize continuous key exchange in the plain model, while preserving security against adaptive corruptions."}}
{"id": "4fvPpUMZQg", "cdate": 1640995200000, "mdate": 1681685482981, "content": {"title": "Universally Composable End-to-End Secure Messaging", "abstract": ""}}
{"id": "0epK9UXAHg", "cdate": 1609459200000, "mdate": 1681685482983, "content": {"title": "The Price of Differential Privacy under Continual Observation", "abstract": "We study the accuracy of differentially private mechanisms in the continual release model. A continual release mechanism receives a sensitive dataset as a stream of $T$ inputs and produces, after receiving each input, an accurate output on the obtained inputs. In contrast, a batch algorithm receives the data as one batch and produces a single output. We provide the first strong lower bounds on the error of continual release mechanisms. In particular, for two fundamental problems that are widely studied and used in the batch model, we show that the worst case error of every continual release algorithm is $\\tilde \\Omega(T^{1/3})$ times larger than that of the best batch algorithm. Previous work shows only a polylogarithimic (in $T$) gap between the worst case error achievable in these two models; further, for many problems, including the summation of binary attributes, the polylogarithmic gap is tight (Dwork et al., 2010; Chan et al., 2010). Our results show that problems closely related to summation -- specifically, those that require selecting the largest of a set of sums -- are fundamentally harder in the continual release model than in the batch model. Our lower bounds assume only that privacy holds for streams fixed in advance (the \"nonadaptive\" setting). However, we provide matching upper bounds that hold in a model where privacy is required even for adaptively selected streams. This model may be of independent interest."}}
