{"id": "Jgehr-m0UMK", "cdate": 1683881238528, "mdate": 1683881238528, "content": {"title": "Cross validation for rare events", "abstract": "We derive sanity-check bounds for the cross-validation (CV) estimate of the generalization risk for learning algorithms dedicated to extreme or rare events. We consider classification on extreme regions of the covariate space, a problem analyzed in Jalalzai\net al. 2018. The risk is then a probability of error conditional to the norm of the covariate vector exceeding a high quantile.\nEstablishing sanity-check bounds consist in recovering bounds regarding the CV estimate that are of the same nature as the ones regarding the empirical risk. We achieve this goal both for K-fold CV with an exponential bound and for leave-p-out CV with a polynomial bound, thus extending the state-of-the-art results to the modified version of the risk which is adapted to extreme value analysis."}}
{"id": "kXRn2-N17G", "cdate": 1683881034789, "mdate": null, "content": {"title": "Tail inverse regression for dimension reduction with extreme response", "abstract": "When dealing with imbalanced classification data, reweighting the loss function is standard procedure allowing to equilibrate between the true positive and true negative rate within the risk measure.\nDespite significant theoretical work in this area, existing results do not adequately address a main challenge within the imbalanced classification framework, which is the negligible size of one class in relation to the full sample size and the need to rescale the risk function by a probability tending to zero. To address this gap, we present two novel contributions under the setting where the rare class probability approaches zero: (1) a non asymptotic fast rate probability bound for constrained balanced empirical risk minimization, and (2) a consistent upper bound for balanced nearest neighbors estimates. Our findings provide a clearer understanding of the benefits of class-weighting in realistic settings, opening new avenues for further research in this field."}}
