{"id": "jn_iXf_KV6F", "cdate": 1672531200000, "mdate": 1695993753617, "content": {"title": "Fourier Neural Operators for Arbitrary Resolution Climate Data Downscaling", "abstract": "Climate simulations are essential in guiding our understanding of climate change and responding to its effects. However, it is computationally expensive to resolve complex climate processes at high spatial resolution. As one way to speed up climate simulations, neural networks have been used to downscale climate variables from fast-running low-resolution simulations, but high-resolution training data are often unobtainable or scarce, greatly limiting accuracy. In this work, we propose a downscaling method based on the Fourier neural operator. It trains with data of a small upsampling factor and then can zero-shot downscale its input to arbitrary unseen high resolution. Evaluated both on ERA5 climate model data and on the Navier-Stokes equation solution data, our downscaling model significantly outperforms state-of-the-art convolutional and generative adversarial downscaling models, both in standard single-resolution downscaling and in zero-shot generalization to higher upsampling factors. Furthermore, we show that our method also outperforms state-of-the-art data-driven partial differential equation solvers on Navier-Stokes equations. Overall, our work bridges the gap between simulation of a physical process and interpolation of low-resolution output, showing that it is possible to combine both approaches and significantly improve upon each other."}}
{"id": "dzw-wQsIeZS", "cdate": 1672531200000, "mdate": 1695993753615, "content": {"title": "Multi-variable Hard Physical Constraints for Climate Model Downscaling", "abstract": "Global Climate Models (GCMs) are the primary tool to simulate climate evolution and assess the impacts of climate change. However, they often operate at a coarse spatial resolution that limits their accuracy in reproducing local-scale phenomena. Statistical downscaling methods leveraging deep learning offer a solution to this problem by approximating local-scale climate fields from coarse variables, thus enabling regional GCM projections. Typically, climate fields of different variables of interest are downscaled independently, resulting in violations of fundamental physical properties across interconnected variables. This study investigates the scope of this problem and, through an application on temperature, lays the foundation for a framework introducing multi-variable hard constraints that guarantees physical relationships between groups of downscaled climate variables."}}
{"id": "rM6HO4h1MI", "cdate": 1664815576523, "mdate": null, "content": {"title": "Identifying causes of Pyrocumulonimbus (PyroCb)", "abstract": "A first causal discovery analysis from observational data of pyroCb (storm clouds generated from extreme wildfires) is presented. Invariant Causal Prediction was used to develop tools to understand the causal drivers of pyroCb formation. This includes a conditional independence test for testing $Y \\indep E|X$ for binary variable $Y$ and multivariate, continuous variables $X$ and $E$, and a greedy-ICP search algorithm that relies on fewer conditional independence tests to obtain a smaller more manageable set of causal predictors. With these tools, we identified a subset of seven causal predictors which are plausible when contrasted with domain knowledge: surface sensible heat flux, relative humidity at $850$\\,hPa, a component of wind at $250$\\,hPa, $13.3$\\,\\textmu m thermal emissions, convective available potential energy, and altitude."}}
{"id": "uWqMflnizeB", "cdate": 1640995200000, "mdate": 1695993753615, "content": {"title": "Physics-Informed Learning of Aerosol Microphysics", "abstract": "Aerosol particles play an important role in the climate system by absorbing and scattering radiation and influencing cloud properties. They are also one of the biggest sources of uncertainty for climate modeling. Many climate models do not include aerosols in sufficient detail due to computational constraints. In order to represent key processes, aerosol microphysical properties and processes have to be accounted for. This is done in the ECHAM-HAM global climate aerosol model using the M7 microphysics, but high computational costs make it very expensive to run with finer resolution or for a longer time. We aim to use machine learning to emulate the microphysics model at sufficient accuracy and reduce the computational cost by being fast at inference time. The original M7 model is used to generate data of input-output pairs to train a neural network on it. We are able to learn the variables' tendencies achieving an average $R^2$ score of $77.1\\% $. We further explore methods to inform and constrain the neural network with physical knowledge to reduce mass violation and enforce mass positivity. On a GPU we achieve a speed-up of up to over 64x compared to the original model."}}
{"id": "qalcIPK5Mob", "cdate": 1640995200000, "mdate": 1683889311739, "content": {"title": "Identifying the Causes of Pyrocumulonimbus (PyroCb)", "abstract": "A first causal discovery analysis from observational data of pyroCb (storm clouds generated from extreme wildfires) is presented. Invariant Causal Prediction was used to develop tools to understand the causal drivers of pyroCb formation. This includes a conditional independence test for testing $Y$ conditionally independent of $E$ given $X$ for binary variable $Y$ and multivariate, continuous variables $X$ and $E$, and a greedy-ICP search algorithm that relies on fewer conditional independence tests to obtain a smaller more manageable set of causal predictors. With these tools, we identified a subset of seven causal predictors which are plausible when contrasted with domain knowledge: surface sensible heat flux, relative humidity at $850$ hPa, a component of wind at $250$ hPa, $13.3$ micro-meters, thermal emissions, convective available potential energy, and altitude."}}
{"id": "Rf7UIzUxSy9", "cdate": 1640995200000, "mdate": 1695993753673, "content": {"title": "Abstract error analysis for Cahn-Hilliard type equations with dynamic boundary conditions", "abstract": "This work addresses the problem of solving the Cahn-Hilliard equation numerically. For that we introduce an abstract formulation for Cahn-Hilliard type equations with dynamic boundary conditions, we conduct the spatial semidiscretization via finite elements and prove error bounds based on the technique of energy estimates. The variational formulation for Cahn-Hilliard/Cahn-Hilliard coupling, will apply to a larger abstract class of problems and is similar to the usual weak formulation of parabolic problems. In contrast to problems with non dynamic boundary conditions, the Hilbert spaces $L^2(\\Omega)$ and $H^1(\\Omega)$ are exchanged with the spaces $L^2(\\Omega)\\times L^2(\\Gamma)$ and $\\lbrace v\\in H^1(\\Omega): \\gamma v \\in H^1(\\Gamma)\\rbrace$, respectively. Because we are considering a fourth-order differential equation, which will be described by a system of two second-order differential equations, the variational formulation also consists of a system of two equations."}}
{"id": "P_pRTkdYP4", "cdate": 1640995200000, "mdate": 1681607059063, "content": {"title": "Generating physically-consistent high-resolution climate data with hard-constrained neural networks", "abstract": ""}}
{"id": "00zFXUmhNUl", "cdate": 1640995200000, "mdate": 1683889311706, "content": {"title": "Pyrocast: a Machine Learning Pipeline to Forecast Pyrocumulonimbus (PyroCb) Clouds", "abstract": "Pyrocumulonimbus (pyroCb) clouds are storm clouds generated by extreme wildfires. PyroCbs are associated with unpredictable, and therefore dangerous, wildfire spread. They can also inject smoke particles and trace gases into the upper troposphere and lower stratosphere, affecting the Earth's climate. As global temperatures increase, these previously rare events are becoming more common. Being able to predict which fires are likely to generate pyroCb is therefore key to climate adaptation in wildfire-prone areas. This paper introduces Pyrocast, a pipeline for pyroCb analysis and forecasting. The pipeline's first two components, a pyroCb database and a pyroCb forecast model, are presented. The database brings together geostationary imagery and environmental data for over 148 pyroCb events across North America, Australia, and Russia between 2018 and 2022. Random Forests, Convolutional Neural Networks (CNNs), and CNNs pretrained with Auto-Encoders were tested to predict the generation of pyroCb for a given fire six hours in advance. The best model predicted pyroCb with an AUC of $0.90 \\pm 0.04$."}}
{"id": "nmBW_I2JV_8", "cdate": 1632765015325, "mdate": null, "content": {"title": "Single Image Super-Resolution with Uncertainty Estimation for Lunar Satellite Images", "abstract": "Recently, there has been a renewed interest in returning to the Moon, with many1planned missions targeting the south pole.  This region is of high scientific and commercial interest, mostly due to the presence of water-ice and other volatiles which could enable our sustainable presence on the Moon and beyond. In order to plan safe and effective crewed and robotic missions, access to high-resolution (<0.5 m) surface imagery is critical. However, the overwhelming majority (99.7%) of existing images over the south pole have spatial resolutions >1 m. In order to obtain better images, the only currently available way is to launch a new satellite mission to the Moon with better equipment to gather more precise data. In this work we develop an alternative that can be used directly on previously gathered data and therefore saving a lot of resources. It consist of a single image super-resolution (SR) approach based on generative adversarial networks that is able to super-resolve existing images from 1 m to 0.5 m resolution, unlocking a large catalogue of images (∼50,000) for a more accurate mission planning in the region of interest for the upcoming missions. We show that our enhanced images reveal previously unseen hazards such as small craters and boulders, allowing safer traverse planning. Our approach also includes uncertainty estimation, which allows mission planners to understand the reliability of the super-resolved images."}}
{"id": "rzKcXtqqJGM", "cdate": 1609459200000, "mdate": 1681545561204, "content": {"title": "Detecting AutoAttack Perturbations in the Frequency Domain", "abstract": ""}}
