{"id": "aP9ZoE0sT6y", "cdate": 1609459200000, "mdate": 1681659796909, "content": {"title": "Graph-based Sparse Neural Networks for Traffic Signal Optimization", "abstract": ""}}
{"id": "BnpyN_niZCX", "cdate": 1609459200000, "mdate": 1681659796892, "content": {"title": "Predicting times of waiting on red signals using BERT", "abstract": "We present a method for approximating outcomes of road traffic simulations using BERT-based models, which may find applications in, e.g., optimizing traffic signal settings, especially with the presence of autonomous and connected vehicles. The experiments were conducted on a dataset generated using the Traffic Simulation Framework software runs on a realistic road network. The BERT-based models were compared with 4 other types of machine learning models (LightGBM, fully connected neural networks and 2 types of graph neural networks) and gave the best results in terms of all the considered metrics."}}
{"id": "BjnVeiUCja", "cdate": 1609459200000, "mdate": 1681659796841, "content": {"title": "Modelling mobility and visualizing people's flow patterns in rural areas for future infrastructure development as a good transnational land-governance practice", "abstract": "This paper summarizes a cross-border mobility study, origin-destination mobility modelling and visualization, conducted in support of the infrastructure development efforts of local authorities and NGOs on the area over the Kayanga-Geba River, at the border between Senegal and Guinea Bissau. It builds on the data collected through participatory mapping for the elaboration of the Cross-Border Land Management and Development Plans (Plans PAGET) aiming to harmonize the different national territorial management tools into a unique transnational tool through the consideration of border areas as a territorial unity. Despite a small amount of available mobility data, we were able to build a mobility model for the considered area, and implemented it in the Traffic Simulation Framework, which was later used to calculate origin-destination matrices for the studied regions in two cases: with and without a cross-border mobility. We analyzed the differences in the mobility patterns and visualized the mobility flows, deliberating on what may be the potential impacts of building a bridge in the study area. Our methodology is general and can be applied in similar studies on different areas. However, the quality of results may depend on the available data."}}
{"id": "rteGooL6T7c", "cdate": 1577836800000, "mdate": 1681659796854, "content": {"title": "New Hybrid Quantum Annealing Algorithms for Solving Vehicle Routing Problem", "abstract": ""}}
{"id": "I1n-uaMyq-u", "cdate": 1577836800000, "mdate": 1681659796843, "content": {"title": "Microscopic traffic simulation models for connected and automated vehicles (CAVs) - state-of-the-art", "abstract": ""}}
{"id": "Wo5HH_Qvc5J", "cdate": 1546300800000, "mdate": 1681659796848, "content": {"title": "Solving Traffic Signal Setting Problem Using Machine Learning", "abstract": "We present a method for optimizing traffic signal settings which can be used for offline planning and realtime adaptive traffic management. The method is based on metaheuristics efficiently exploring space of possible settings and evaluating candidate solutions using a microscopic traffic simulation or metamodels of simulations built using machine learning algorithms (e.g., neural networks, LightGBM). We present results of extensive experiments and compare different algorithms and their configurations in order to find the best approach in our use case. Experiments were carried out on a realistic road network of Warsaw (maps originated from the OpenStreetMap service) and showed that LightGBM may outperform neural networks in terms of accuracy of approximations, time efficiency and optimality of traffic signal settings, which is a new and important result. We also show that in terms of traffic optimization genetic algorithms give the best results comparing to other metaheuristics."}}
{"id": "HJxoNtcAcm", "cdate": 1539381554820, "mdate": null, "content": {"title": "Investigating performance of neural networks and gradient boosting models approximating microscopic traffic simulations in traffic optimization tasks", "abstract": "We analyze the accuracy of traffic simulations metamodels based on neural networks and gradient boosting models (LightGBM), applied to traffic optimization as fitness functions of genetic algorithms. Our metamodels approximate outcomes of traffic simulations (the total time of waiting on a red signal) taking as an input different traffic signal settings, in order to efficiently find (sub)optimal settings. Their accuracy was proven to be very good on randomly selected test sets, but it turned out that the accuracy may drop in case of settings expected (according to genetic algorithms) to be close to local optima, which makes the traffic optimization process more difficult. In this work, we investigate 16 different metamodels and 20 settings of genetic algorithms, in order to understand what are the reasons of this phenomenon, what is its scale, how it can be mitigated and what can be potentially done to design better real-time traffic optimization methods."}}
{"id": "pTO1gRhhIx", "cdate": 1514764800000, "mdate": 1681659796853, "content": {"title": "Investigating performance of neural networks and gradient boosting models approximating microscopic traffic simulations in traffic optimization tasks", "abstract": "We analyze the accuracy of traffic simulations metamodels based on neural networks and gradient boosting models (LightGBM), applied to traffic optimization as fitness functions of genetic algorithms. Our metamodels approximate outcomes of traffic simulations (the total time of waiting on a red signal) taking as an input different traffic signal settings, in order to efficiently find (sub)optimal settings. Their accuracy was proven to be very good on randomly selected test sets, but it turned out that the accuracy may drop in case of settings expected (according to genetic algorithms) to be close to local optima, which makes the traffic optimization process more difficult. In this work, we investigate 16 different metamodels and 20 settings of genetic algorithms, in order to understand what are the reasons of this phenomenon, what is its scale, how it can be mitigated and what can be potentially done to design better real-time traffic optimization methods."}}
{"id": "1pTNdUE3IB", "cdate": 1483228800000, "mdate": 1681659796850, "content": {"title": "Training neural networks to approximate traffic simulation outcomes", "abstract": ""}}
{"id": "pMMqdH5a_d", "cdate": 1420070400000, "mdate": 1681659796852, "content": {"title": "Application of Genetic Algorithms and High-Performance Computing to the Traffic Signal Setting Problem", "abstract": ""}}
