{"id": "rYprY6Ihe_", "cdate": 1640995200000, "mdate": 1671958136125, "content": {"title": "Document Image Rectification in Complex Scene Using Stacked Siamese Networks", "abstract": "With the popularity of digital cameras and smart-phones, capturing document images of physical documents for electronic storage has become popular, but the captured document images suffer various deformations. Document image rectification has been studied intensively, but existing methods do not perform sufficiently for document images captured in complex scenes due to the various environmental factors. In this paper, we propose an end-to-end rectification model by stacking 3D and 2D Siamese networks. Three regularization terms are used to enforce 3D reconstruction consistency and 2D texture consistency, respectively. Experimental results on real world datasets demonstrate that the three regularization terms with Siamese networks can significantly improve the rectification performance, and our method performs superiorly compared to state-of-the-art methods."}}
{"id": "b8NA2C-mSO", "cdate": 1609459200000, "mdate": 1671958136084, "content": {"title": "One-Stage Open Set Object Detection with Prototype Learning", "abstract": "Convolutional Neural Network (CNN) based object detection has achieved remarkable progress. However, most existing methods work on closed set assumption and can detect only objects of known classes. In real-world scenes, an image may contain unknown-class foreground objects that are unseen in training set but of potential interest, and open set object detection aims at detecting them as foreground, rather than rejecting them as background. A few methods have been proposed for this task, but they suffer from either low speed or unsatisfactory ability of unknown identification. In this paper, we propose a one-stage open set object detection method based on prototype learning. Benefiting from the compact distributions of known classes yielded by prototype learning, our method shows superior performance on identifying objects of both known and unknown classes from images in the open set scenario. It also inherits all advantages of YOLO v3 such as the high inference speed and the ability of multi-scale detection. To evaluate the performance of our method, we conduct experiments with both closed & open set settings, and especially assess the performance of unknown identification using recall and precision of the unknown class. The experimental results show that our method identifies unknown objects better while keeping the accuracy on known classes."}}
{"id": "PSMEEfwoxpL", "cdate": 1609459200000, "mdate": 1671958136146, "content": {"title": "Learning-based Tensor Decomposition with Adaptive Rank Penalty for CNNs Compression", "abstract": "Low-rank tensor decomposition is a widely-used strategy to compress convolutional neural networks (CNNs). Existing learning-based decomposition methods encourage low-rank filter weights via regularizer of filters’ pair-wise force or nuclear norm during training. However, these methods can not obtain the satisfactory low-rank structure. We propose a new method with an adaptive rank penalty to learn more compact CNNs. Specifically, we transform rank constraint into a differentiable one and impose its adaptive violation-aware penalty on filters. Moreover, this paper is the first work to integrate the learning-based decomposition and group decomposition to make a better trade-off, especially for the tough task of compression of 1×1 convolution.The obtained low-rank model can be easily decomposed while nearly keeping the full accuracy without additional fine-tuning process. The effectiveness is verified by compression experiments of VGG and ResNet on CIFAR-10 and ILSVRC-2012. Our method can reduce about 65% parameters of ResNet-110 with 0.04% Top-1 accuracy drop on CIFAR-10, and reduce about 60% parameters of ResNet-50 with 0.57% Top-1 accuracy drop on ILSVRC-2012."}}
{"id": "woENNCbBwCV", "cdate": 1546300800000, "mdate": null, "content": {"title": "LightweightNet: Toward fast and lightweight convolutional neural networks via architecture distillation", "abstract": "Highlights • We present a new framework of deep convolutional neural network architecture distillation, namely LightweightNet, for acceleration and compression. • We exploit the prior knowledge of pre-defined network architecture to guide the efficient design of acceleration/compression strategies, while not using pre-trained model. • The proposed framework consists of network parameter compression, network structure acceleration, and non-tensor layer improvement. • The proposed framework demonstrates a higher acceleration/compression rate than previous methods in experiments, including a large category handwritten Chinese character recognition task with state-of-the-art performance. Abstract In recent years, deep neural networks have achieved remarkable successes in many pattern recognition tasks. However, the high computational cost and large memory overhead hinder them from applications on resource-limited devices. To address this problem, many deep network acceleration and compression methods have been proposed. One group of methods adopt decomposition and pruning techniques to accelerate and compress a pre-trained model. Another group designs single compact unit to stack their own networks. These methods are subject to complicated training processes, or lack of generality and extensibility. In this paper, we propose a general framework of architecture distillation, namely LightweightNet, to accelerate and compress convolutional neural networks. Rather than compressing a pre-trained model, we directly construct the lightweight network based on a baseline network architecture. The LightweightNet, designed based on a comprehensive analysis of the network architecture, consists of network parameter compression, network structure acceleration, and non-tensor layer improvement. Specifically, we propose the strategy of low-dimensional features of fully-connected layers for substantial memory saving, and design multiple efficient compact blocks to distill convolutional layers of baseline network with accuracy-sensitive distillation rule for notable time saving. Finally, it can effectively reduce the computational cost and the model size by > 4 × with negligible accuracy loss. Benchmarks on MNIST, CIFAR-10, ImageNet and HCCR (handwritten Chinese character recognition) datasets demonstrate the advantages of the proposed framework in terms of speed, performance, storage and training process. In HCCR, our method even outperforms traditional handcrafted features-based classifiers in terms of speed and storage while maintaining state-of-the-art recognition performance."}}
{"id": "gsYM1kuM-0J", "cdate": 1546300800000, "mdate": null, "content": {"title": "Using High-Frequency Local Field Potentials From Multicortex to Decode Reaching and Grasping Movements in Monkey", "abstract": "Intracortical brain-machine interfaces (iBMIs) hold the promise to restore communication and movement ability of paralyzed people. Recent studies showed that local field potentials (LFPs) could be a reliable neural signal for movement intention decoding in iBMIs. However, previous studies investigated primarily on low-frequency LFPs, while the LFPs used were recorded from only one or two cortices. The aim of this paper is to investigate the potential of high-frequency LFPs (200-300 Hz) from multicortex in movement intention decoding. In this paper, LFPs were recorded via microelectrode arrays chronically implanted into the primary motor cortex (M1), somatosensory cortex (S1), and posterior parietal cortex of two monkeys while they were trained to perform 3-D reaching and grasping movements. The wavelet packet transform (WPT) method was used to extract the time and frequency information of the high-frequency LFP signals and the node energy of the WPT coefficients was selected as the features. After feature reduction by the principal component analysis, a support vector machine decoder was used to classify discrete reaching positions and grasping postures. Our results indicate that high decoding accuracy can be achieved by the high-frequency LFPs with WPT method and this kind of LFPs could serve as useful signals in iBMIs for movement intention decoding. Moreover, better and more robust decoding performance can be achieved by LFPs from multicortex than single-cortex."}}
{"id": "07iP4zDk_jk", "cdate": 1546300800000, "mdate": null, "content": {"title": "Insect Recognition Under Natural Scenes Using R-FCN with Anchor Boxes Estimation", "abstract": "Insect species recognition is an important application of computer vision in zoology and agriculture. Most of existing methods resort to hand-crafted features and traditional classifiers, which usually give poor accuracy and apply only to elaborately taken full-size pictures. In this paper, we focus on a more challenging case where the images are taken in the wild with complex backgrounds, and propose to use a deep learning based detection model to deal with it. It exploits multi-class object detection to eliminate interferences from complex backgrounds, while taking advantages of deep learning to significantly improve the performance of recognition. After evaluating several popular detection methods, R-FCN is selected as the base model. To further improve its performance, we introduce a clustering algorithm for estimation of the anchor boxes instead of using predefined ones. The experimental results on a dataset of insect images collected in the wild prove the effectiveness of our proposed method in improving both accuracy and speed."}}
{"id": "mmpicIXeHx", "cdate": 1483228800000, "mdate": null, "content": {"title": "From Classification to Regression: Model Transfer for Visual Aesthetic Quality Assessment", "abstract": "Visual aesthetic quality assessment has played an important role in increasing number of computer vision applications. Particularly, estimating the quality score precisely is a main task of aesthetic quality assessment, but the training samples labeled with score are usually expensive to obtain. In this paper, we propose a transfer learning method which can improve the performance of aesthetic score prediction by using the coarse labeled samples, which are much easier to obtain. The proposed method incorporates the coarse information from source domain into the target domain by a novel multi-task framework, which can revise the model in target task. The effectiveness of our method is proven by experimental results that the error is reduced obviously with the help of source domain."}}
{"id": "dl3jg_X4KET", "cdate": 1483228800000, "mdate": null, "content": {"title": "A Semi-Supervised Method for Surveillance-Based Visual Location Recognition", "abstract": "In this paper, we are devoted to solving the problem of crossing surveillance and mobile phone visual location recognition, especially for the case that the query and reference images are captured by mobile phone and surveillance camera, respectively. Besides, we also study the influence of the environmental condition variations on this problem. To explore that problem, we first build a cross-device location recognition dataset, which includes images of 22 locations taken by mobile phones and surveillance cameras under different time and weather conditions. Then based on careful analysis of the problems existing in the data, we specifically design a method which unifies an unsupervised subspace alignment method and the semi-supervised Laplacian support vector machine. Experiments are performed on our dataset. Compared with several related methods, our method shows to be more efficient on the problem of crossing surveillance and mobile phone visual location recognition. Furthermore, the influence of several factors such as feature, time, and weather is studied."}}
{"id": "XTFWiXlAo6Z", "cdate": 1483228800000, "mdate": null, "content": {"title": "CNet: Context-Aware Network for Semantic Segmentation", "abstract": "Semantic segmentation is one of the great challenges in computer vision. Recently, deep convolutional neural networks (DCNNs) have achieved great success in most of the computer vision tasks. However, in terms of semantic segmentation, it is still difficult for the DCNN methods to take full advantage of context information and determine the fine boundaries of objects. In this paper, we propose a Context-aware Network (CNet), which utilizes robust context information to improve segmentation results. CNet has two significant components: 1) a feature collection module (FCM), which is constructed to extract low-level contextual features including texture, layout, boundary, local and global relationships by different receptive fields to complement high-level feature learning, and 2) a novel layer named ResGate, which is developed to select robust contextual features from the FCM. The two combined components can thoroughly explore context information to improve boundary segmentation accuracy. We evaluate the proposed method on the popular PASCAL VOC2012 dataset, and obtain promising performance compared with related methods, especially in the situation of similar objects or objects in complex scene."}}
{"id": "Rx_iIH7LDQs", "cdate": 1483228800000, "mdate": null, "content": {"title": "Margin-Aware Binarized Weight Networks for Image Classification", "abstract": "Deep neural networks (DNNs) have achieved remarkable successes in many vision tasks. However, due to the dependence on large memory and high-performance GPUs, it is extremely hard to deploy DNNs on low-power devices. For compressing and accelerating deep neural networks, many techniques have been proposed recently. Particularly, binarized weight networks, which store one weight using only one bit and replace complex floating operations with simple calculations, are attractive from the perspective of hardware implementation. In this paper, we propose a simple strategy to learn better binarized weight networks. Motivated by the phenomenon that the stochastic binarization approach usually converges with real-valued weights close to two boundaries $$\\{-1, +1\\}$$ and gives better performance than deterministic binarization, we construct a margin-aware binarization strategy by adding a weight constraint into the objective function of deterministic scheme to minimize the margins between real-valued weights and boundaries. This constraint can be easily realized by a Binary-L2 regularization without suffering from the complex random number generation. Experimental results on MNIST and CIFAR-10 datasets show that the proposed method yields better performance than recent network binarization schemes and the full precision network counterpart."}}
