{"id": "TWt5x_u5Qq", "cdate": 1640995200000, "mdate": 1681743622185, "content": {"title": "$\\beta$-Intact-VAE: Identifying and Estimating Causal Effects under Limited Overlap", "abstract": "As an important problem in causal inference, we discuss the identification and estimation of treatment effects (TEs) under limited overlap; that is, when subjects with certain features belong to a single treatment group. We use a latent variable to model a prognostic score which is widely used in biostatistics and sufficient for TEs; i.e., we build a generative prognostic model. We prove that the latent variable recovers a prognostic score, and the model identifies individualized treatment effects. The model is then learned as $\\beta$-Intact-VAE––a new type of variational autoencoder (VAE). We derive the TE error bounds that enable representations balanced for treatment groups conditioned on individualized features. The proposed method is compared with recent methods using (semi-)synthetic datasets."}}
{"id": "q7n2RngwOM", "cdate": 1632875439632, "mdate": null, "content": {"title": "$\\beta$-Intact-VAE: Identifying and Estimating Causal Effects under Limited Overlap", "abstract": "As an important problem in causal inference, we discuss the identification and estimation of treatment effects (TEs) under limited overlap; that is, when subjects with certain features belong to a single treatment group. We use a latent variable to model a prognostic score which is widely used in biostatistics and sufficient for TEs; i.e., we build a generative prognostic model. We prove that the latent variable recovers a prognostic score, and the model identifies individualized treatment effects. The model is then learned as $\\beta$-Intact-VAE––a new type of variational autoencoder (VAE). We derive the TE error bounds that enable representations balanced for treatment groups conditioned on individualized features. The proposed method is compared with recent methods using (semi-)synthetic datasets. "}}
{"id": "Z3yd722b5X5", "cdate": 1621630186753, "mdate": null, "content": {"title": "Identifying and Estimating Causal Effects under Weak Overlap by Generative Prognostic Model", "abstract": "As an important problem of causal inference, we discuss the identification and estimation of treatment effects (TEs) under weak overlap, i.e., subjects with certain features all belong to a single treatment group. We use a latent variable to model a prognostic score (PGS), which is widely used in biostatistics and sufficient for TEs, i.e., we build a generative prognostic model. We prove that the latent variable recovers a PGS, and the model identifies individualized treatment effects. The model is then learned as the  Intact-VAE, a new type of variational autoencoder (VAE). We derive counterfactual generalization bounds which motivate representation balanced for treatment groups conditioned on individualized features. The proposed method is compared with recent methods using  (semi-)synthetic datasets. "}}
{"id": "D3TNqCspFpM", "cdate": 1601308370739, "mdate": null, "content": {"title": "Identifying Treatment Effects under Unobserved Confounding by Causal Representation Learning", "abstract": "As an important problem of causal inference, we discuss the estimation of treatment effects under the existence of unobserved confounding. By representing the confounder as a latent variable, we propose Counterfactual VAE, a new variant of variational autoencoder, based on recent advances in identifiability of representation learning. Combining the identifiability and classical identification results of causal inference, under mild assumptions on the generative model and with small noise on the outcome, we theoretically show that the confounder is identifiable up to an affine transformation and then the treatment effects can be identified.  Experiments on synthetic and semi-synthetic datasets demonstrate that our method matches the state-of-the-art, even under settings violating our formal assumptions."}}
{"id": "q_FqlutuADO", "cdate": 1577836800000, "mdate": 1682318611392, "content": {"title": "Causal Mosaic: Cause-Effect Inference via Nonlinear ICA and Ensemble Method", "abstract": "We address the problem of distinguishing cause from effect in bivariate setting. Based on recent developments in nonlinear independent component analysis (ICA), we train general nonlinear causal mo..."}}
