{"id": "ynSfdT6bv-K", "cdate": 1672531200000, "mdate": 1682343679261, "content": {"title": "Causal Repair of Learning-enabled Cyber-physical Systems", "abstract": "Models of actual causality leverage domain knowledge to generate convincing diagnoses of events that caused an outcome. It is promising to apply these models to diagnose and repair run-time property violations in cyber-physical systems (CPS) with learning-enabled components (LEC). However, given the high diversity and complexity of LECs, it is challenging to encode domain knowledge (e.g., the CPS dynamics) in a scalable actual causality model that could generate useful repair suggestions. In this paper, we focus causal diagnosis on the input/output behaviors of LECs. Specifically, we aim to identify which subset of I/O behaviors of the LEC is an actual cause for a property violation. An important by-product is a counterfactual version of the LEC that repairs the run-time property by fixing the identified problematic behaviors. Based on this insights, we design a two-step diagnostic pipeline: (1) construct and Halpern-Pearl causality model that reflects the dependency of property outcome on the component's I/O behaviors, and (2) perform a search for an actual cause and corresponding repair on the model. We prove that our pipeline has the following guarantee: if an actual cause is found, the system is guaranteed to be repaired; otherwise, we have high probabilistic confidence that the LEC under analysis did not cause the property violation. We demonstrate that our approach successfully repairs learned controllers on a standard OpenAI Gym benchmark."}}
{"id": "_o4JUv2lmD", "cdate": 1663850165553, "mdate": null, "content": {"title": "Bridging the Gap between Semi-supervised and Supervised Continual Learning via Data Programming", "abstract": "Semi-supervised continual learning (SSCL) has shown its utility in learning cumulative knowledge with partially labeled data per task. However, the state-of-the-art has yet to explicitly address how to reduce the performance gap between using partially labeled data and fully labeled. In response, we propose a general-purpose SSCL framework, namely DP-SSCL, that uses data programming (DP) to pseudo-label the unlabeled data per task, and then cascades both ground-truth-labeled and pseudo-labeled data to update a downstream supervised continual learning model. The framework includes a feedback loop that brings mutual benefits: On one hand, DP-SSCL inherits guaranteed pseudo-labeling quality from DP techniques to improve continual learning, approaching the performance of using fully supervised data. On the other hand, knowledge transfer from previous tasks facilitates training of the DP pseudo-labeler, taking advantage of cumulative information via self-teaching. Experiments show that (1) DP-SSCL bridges the performance gap, approaching the final accuracy and catastrophic forgetting as using fully labeled data, (2) DP-SSCL outperforms existing SSCL approaches at low cost, by up to $25\\%$ higher final accuracy and lower catastrophic forgetting on standard benchmarks, while reducing memory overhead from $100$ MB level to $1$ MB level at the same time complexity, and (3) DP-SSCL is flexible, maintaining steady performance supporting plug-and-play extensions for a variety of supervised continual learning models."}}
{"id": "R6jio96dcI", "cdate": 1640995200000, "mdate": 1682343679194, "content": {"title": "Confidence Composition for Monitors of Verification Assumptions", "abstract": "Closed-loop verification of cyberphysical systems with neural network controllers offers strong safety guarantees under certain assumptions. It is, however, difficult to determine whether these guar-antees apply at run time because verification assumptions may be violated. To predict safety violations in a verified system, we propose a three-step confidence composition (CoCo) framework for monitoring verification assumptions. First, we represent the sufficient condition for verified safety with a propositional logical formula over assumptions. Second, we build calibrated confidence monitors that evaluate the probability that each assumption holds. Third, we obtain the confidence in the verification guarantees by composing the assumption monitors using a composition function suitable for the logical formula. Our CoCo framework provides theoretical bounds on the calibration and conservatism of compositional monitors. Two case studies show that compositional monitors are calibrated better than their constituents and successfully predict safety violations."}}
{"id": "BSaQpgorGF", "cdate": 1640995200000, "mdate": 1682343679194, "content": {"title": "Fail-Safe: Securing Cyber-Physical Systems against Hidden Sensor Attacks", "abstract": "In Cyber-Physical Systems (CPS), integrating new technologies that interact with and control physical systems raises new security risks beyond the classical cyber security domain. These risks motivated many attack detectors that focus on the binary outcome. However, one pressing risk in CPS is hidden sensor attacks that are well-designed by powerful attackers who gained full knowledge of our systems and detector. The hidden attacks inject such a small malicious signal into sensor measurement that they can stay undetected but eventually lead to a significant deviation. Thus, to secure the CPS, we propose a detection framework to identify these sensor attacks that can drive the system's physical states to an unsafe state within a given period, even if they are not detected. First, we solve optimization problems to find the optimal hidden sensor attack that leads to the minimal distance to a pre-defined unsafe state region within an observation window for a given system and detector. Then, based on this algorithm, we perform offline profiling to search for a conditionally safe region, where the system states are guaranteed to be safe within the observation window as long as the detector does not raise any alerts. Finally, the framework can online discover potential hidden sensor attacks that endanger the system by checking if the current system state moves out of the region and raising a yellow alert. The evaluation shows that the optimal hidden sensor attack results in the minimum distance to unsafe, within a given observation window among existing hidden sensor attacks. We implemented our method on four linear simulators to show the effectiveness of our method. Additionally, we provided a discussion on the challenges of applying the proposed method to non-linear systems."}}
{"id": "gEynpztqZug", "cdate": 1632875531482, "mdate": null, "content": {"title": "Mako: Semi-supervised continual learning with minimal labeled data via data programming", "abstract": "Lifelong machine learning (LML) is a well-known paradigm mimicking the human learning process by utilizing experiences from previous tasks. Nevertheless, an issue that has been rarely addressed is the lack of labels at the individual task level. The state-of-the-art of LML largely addresses supervised learning, with a few semi-supervised continual learning exceptions which require training additional models, which in turn impose constraints on the LML methods themselves. Therefore, we propose Mako, a wrapper tool that mounts on top of supervised LML frameworks, leveraging data programming. Mako imposes no additional knowledge base overhead and enables continual semi-supervised learning with a limited amount of labeled data. This tool achieves similar performance, in terms of per-task accuracy and resistance to catastrophic forgetting, as compared to fully labeled data. We ran extensive experiments on LML task sequences created from standard image classification data sets including MNIST, CIFAR-10 and CIFAR-100, and the results show that after utilizing Mako to leverage unlabeled data, LML tools are able to achieve $97\\%$ performance of supervised learning on fully labeled data in terms of accuracy and catastrophic forgetting prevention. Moreover, when compared to baseline semi-supervised LML tools such as CNNL, ORDisCo and DistillMatch, Mako significantly outperforms them, increasing accuracy by $0.25$ on certain benchmarks."}}
{"id": "yDNDiUDn0sx", "cdate": 1609459200000, "mdate": 1682343679194, "content": {"title": "FRED: Fall Risk Evaluation Database Based on Electronic Health Record Data", "abstract": "This paper presents a four-part database, FRED, for fall risk evaluation based on electronic health record data from MIMIC-III. Part 1 compromises demographic data and admission IDs. Part 2 presents information on Morse Fall Scale intervals and fall risk labels (high, low, increasing or decreasing fall risk). Part 3 shows corresponding physician notes. Part 4 contains administered medication. The database is open-source and available on PhysioNet."}}
{"id": "qhfW6OtWwq3", "cdate": 1609459200000, "mdate": 1682343679193, "content": {"title": "Confidence Composition for Monitors of Verification Assumptions", "abstract": "Closed-loop verification of cyber-physical systems with neural network controllers offers strong safety guarantees under certain assumptions. It is, however, difficult to determine whether these guarantees apply at run time because verification assumptions may be violated. To predict safety violations in a verified system, we propose a three-step confidence composition (CoCo) framework for monitoring verification assumptions. First, we represent the sufficient condition for verified safety with a propositional logical formula over assumptions. Second, we build calibrated confidence monitors that evaluate the probability that each assumption holds. Third, we obtain the confidence in the verification guarantees by composing the assumption monitors using a composition function suitable for the logical formula. Our CoCo framework provides theoretical bounds on the calibration and conservatism of compositional monitors. Two case studies show that compositional monitors are calibrated better than their constituents and successfully predict safety violations."}}
{"id": "Pd9pg_HPgy", "cdate": 1609459200000, "mdate": 1682343679195, "content": {"title": "Real-time Attack-recovery for Cyber-physical Systems Using Linear-quadratic Regulator", "abstract": "The increasing autonomy and connectivity in cyber-physical systems (CPS) come with new security vulnerabilities that are easily exploitable by malicious attackers to spoof a system to perform dangerous actions. While the vast majority of existing works focus on attack prevention and detection, the key question is “what to do after detecting an attack?”. This problem attracts fairly rare attention though its significance is emphasized by the need to mitigate or even eliminate attack impacts on a system. In this article, we study this attack response problem and propose novel real-time recovery for securing CPS. First, this work’s core component is a recovery control calculator using a Linear-Quadratic Regulator (LQR) with timing and safety constraints. This component can smoothly steer back a physical system under control to a target state set before a safe deadline and maintain the system state in the set once it is driven to it. We further propose an Alternating Direction Method of Multipliers (ADMM) based algorithm that can fast solve the LQR-based recovery problem. Second, supporting components for the attack recovery computation include a checkpointer, a state reconstructor, and a deadline estimator. To realize these components respectively, we propose (i) a sliding-window-based checkpointing protocol that governs sufficient trustworthy data, (ii) a state reconstruction approach that uses the checkpointed data to estimate the current system state, and (iii) a reachability-based approach to conservatively estimate a safe deadline. Finally, we implement our approach and demonstrate its effectiveness in dealing with totally 15 experimental scenarios which are designed based on 5 CPS simulators and 3 types of sensor attacks."}}
{"id": "GxX-3k3zsS-", "cdate": 1609459200000, "mdate": 1682343679204, "content": {"title": "RT-ACL: Identification of High-Risk Youth Patients and their Most Significant Risk Factors to Reduce Anterior Cruciate Ligament Reinjury Risk", "abstract": "The anterior cruciate ligament (ACL) is the most commonly injured ligament in the body, accounting for more than 200,000 ACL tears occurring annually in the US and upwards of 90% of patients choosing to undergo reconstruction surgery. After the reconstruction surgery, approximately 30% of youth patients go on to re-tear their ACL, and it has been proven that repeated ACL reconstructions not only have inferior results but can be devastating for all those involved. In this paper, we propose RT-ACL, a system that enhances patient outcomes by reducing their risk of an ACL re-tear by providing personalized recommendations of modifiable risk factors that can be altered during the patient's recovery process. Our system leverages the RT-ACL model that uses labeling functions designed by clinicians to classify the risk level of an ACL re-tear. Further, it identifies modifiable risk factors and suggests interventions to minimize adverse outcomes and complications. We evaluated our system on a dataset of 441 youth patients, 8–21 years of age, that underwent an ACL reconstruction at the Children's Hospital of Philadelphia. The results indicate patients classified as low risk re-tear at a rate of 12%, medium risk at a rate of 30%, and high risk re-tear at a rate of 59%. This demonstrates those classified by our system as high risk are 4.6 times as likely to re-tear their ACL than those classified as low risk."}}
{"id": "hLt8SZxhXjJ", "cdate": 1514764800000, "mdate": null, "content": {"title": "Attack-Resilient Sensor Fusion for Cooperative Adaptive Cruise Control", "abstract": "Cooperative adaptive cruise control (CACC) has the potential to enable vehicle platooning and achieve benefits including improved highway throughput and reduced energy consumption. However, malicious attacks such as sensor jamming or data injection can lead to security vulnerabilities of vehicle platooning and cause catastrophic crashes. We present a novel attack-resilience sensor fusion method for vehicle platooning with CACC, which exploits spatial information provided by multiple vehicles and combines sensor readings to achieve more precise estimation. We demonstrate the feasibility of our method in a set of simulated vehicle platooning experiments with different CACC controllers and malicious attacks."}}
