{"id": "3XvKtSao5N", "cdate": 1640995200000, "mdate": 1680419401276, "content": {"title": "Transformer Language Models without Positional Encodings Still Learn Positional Information", "abstract": ""}}
{"id": "LD4CLnoAal", "cdate": 1609459200000, "mdate": 1680419401275, "content": {"title": "How to Train BERT with an Academic Budget", "abstract": ""}}
{"id": "2lcw84iq4R", "cdate": 1577836800000, "mdate": 1680419401277, "content": {"title": "Exploring the Boundaries of Low-Resource BERT Distillation", "abstract": ""}}
{"id": "YuG67Ome6d", "cdate": 1546300800000, "mdate": 1680419401312, "content": {"title": "Training Compact Models for Low Resource Entity Tagging using Pre-trained Language Models", "abstract": ""}}
{"id": "VgxIdgE7NJF", "cdate": 1546300800000, "mdate": 1680419401290, "content": {"title": "Q8BERT: Quantized 8Bit BERT", "abstract": ""}}
{"id": "ewYA4ZBby1Y", "cdate": 1514764800000, "mdate": 1682318091908, "content": {"title": "Term Set Expansion based on Multi-Context Term Embeddings: an End-to-end Workflow", "abstract": "We present SetExpander, a corpus-based system for expanding a seed set of terms into a more complete set of terms that belong to the same semantic class. SetExpander implements an iterative end-to end workflow for term set expansion. It enables users to easily select a seed set of terms, expand it, view the expanded set, validate it, re-expand the validated set and store it, thus simplifying the extraction of domain-specific fine-grained semantic classes. SetExpander has been used for solving real-life use cases including integration in an automated recruitment system and an issues and defects resolution system. A video demo of SetExpander is available at https://drive.google.com/open?id=1e545bB87Autsch36DjnJHmq3HWfSd1Rv (some images were blurred for privacy reasons)."}}
{"id": "HJWP9MzuWB", "cdate": 1514764800000, "mdate": null, "content": {"title": "Term Set Expansion based NLP Architect by Intel AI Lab", "abstract": "We present SetExpander, a corpus-based system for expanding a seed set of terms into amore complete set of terms that belong to the same semantic class. SetExpander implements an iterative end-to-end workflow. It enables users to easily select a seed set of terms, expand it, view the expanded set, validate it, re-expand the validated set and store it, thus simplifying the extraction of domain-specific fine-grained semantic classes.SetExpander has been used successfully in real-life use cases including integration into an automated recruitment system and an issues and defects resolution system. A video demo of SetExpander is available at https://drive.google.com/open?id=1e545bB87Autsch36DjnJHmq3HWfSd1Rv (some images were blurred for privacy reasons)"}}
{"id": "D1kTk5YHgJQ", "cdate": 1514764800000, "mdate": 1664451971055, "content": {"title": "SetExpander: End-to-end Term Set Expansion Based on Multi-Context Term Embeddings", "abstract": "Jonathan Mamou, Oren Pereg, Moshe Wasserblat, Ido Dagan, Yoav Goldberg, Alon Eirew, Yael Green, Shira Guskin, Peter Izsak, Daniel Korat. Proceedings of the 27th International Conference on Computational Linguistics: System Demonstrations. 2018."}}
{"id": "SJ--aHbuZB", "cdate": 1388534400000, "mdate": null, "content": {"title": "The search duel: a response to a strong ranker", "abstract": "How can a search engine with a relatively weak relevance ranking function compete with a search engine that has a much stronger ranking function? This dual challenge, which to the best of our knowledge has not been addressed in previous work, entails an interesting bi-modal utility function for the weak search engine. That is, the goal is to produce in response to a query a document result list whose effectiveness does not fall much behind that of the strong search engine; and, which is quite different than that of the strong engine. We present a per-query algorithmic approach that leverages fundamental retrieval principles such as pseudo-feedback-based relevance modeling. We demonstrate the merits of our approach using TREC data."}}
{"id": "OeT8PZWs-Q", "cdate": 1356998400000, "mdate": 1682318091923, "content": {"title": "Leveraging memory mirroring for transparent memory scale-out with zero-downtime failover of remote hosts", "abstract": ""}}
