{"id": "V2QjUpqTds", "cdate": 1684136734841, "mdate": 1684136734841, "content": {"title": "ADAPTIVE SUBSAMPLING OF MULTIDOMAIN SIGNALS WITH PRODUCT GRAPHS", "abstract": "In this paper, we propose an adaptive subsampling method for multidomain signals based on the constrained learning of a product\ngraph. Given an input multidomain signal, we search for a product\ngraph on which the signal is bandlimited, i.e. have limited spectral\noccupancy. The subsampling procedure described in this article\nis composed of two successive steps. First, we use the input data\nto learn a graph that will be optimized to favor efficient sampling.\nThen, we derive an algorithm for choosing the best nodes and provide a sampling strategy for multidomain signals. Experiments on\nsynthetic data and two real datasets show the efficiency of the proposed method and its relevance for multidomain data compression\nand storing."}}
{"id": "hdvg4eBTAtN", "cdate": 1546300800000, "mdate": null, "content": {"title": "Multivariate Convolutional Sparse Coding with Low Rank Tensor.", "abstract": "This paper introduces a new multivariate convolutional sparse coding based on tensor algebra with a general model enforcing both element-wise sparsity and low-rankness of the activations tensors. By using the CP decomposition, this model achieves a significantly more efficient encoding of the multivariate signal-particularly in the high order/ dimension setting-resulting in better performance. We prove that our model is closely related to the Kruskal tensor regression problem, offering interesting theoretical guarantees to our setting. Furthermore, we provide an efficient optimization algorithm based on alternating optimization to solve this model. Finally, we evaluate our algorithm with a large range of experiments, highlighting its advantages and limitations."}}
{"id": "ZaweI6auo3V", "cdate": 1546300800000, "mdate": null, "content": {"title": "Subsampling of Multivariate Time-Vertex Graph Signals.", "abstract": "This article presents a new approach for processing and subsampling multivariate time-vertex graph signals. The main idea is to model the relationships within each dimension (time, space, feature space) with different graphs and to merge these structures. A new technique based on tensor formalism is provided, which aims to identify the frequency support of the graph signal in order to preserve its content after subsampling. Results are provided on real EEG data for data interpolation and reconstruction."}}
{"id": "Z2MYC9i-cE9", "cdate": 1546300800000, "mdate": null, "content": {"title": "Selection of the Best Electroencephalogram Channel to Predict the Depth of Anesthesia.", "abstract": "Precise cerebral dynamics of action of the anesthetics are a challenge for neuroscientists. This explains why there is no gold standard for monitoring the Depth of Anesthesia (DoA) and why experimental studies may use several electroencephalogram (EEG) channels, ranging from 2 to 128 EEG-channels. Our study aimed at finding the scalp area providing valuable information about brain activity under general anesthesia (GA) to select the more optimal EEG channel to characterized the DoA. We included 30 patients undergoing elective, minor surgery under GA and used a 32-channel EEG to record their electrical brain activity. In addition, we recorded their physiological parameters and the BIS monitor. Each individual EEG channel data were processed to test their ability to differentiate awake from asleep states. Due to strict quality criteria adopted for the EEG data and the difficulties of the real-life setting of the study, only 8 patients recordings were taken into consideration in the final analysis. Using 2 classification algorithms, we identified the optimal channels to discriminate between asleep and awake states: the frontal and temporal F8 and T7 were retrieved as being the two bests channels to monitor DoA. Then, using only data from the F8 channel, we tried to minimize the number of features required to discriminate between the awake and asleep state. The best algorithm turned out to be the Gaussian Naïve Bayes (GNB) requiring only 5 features (Area Under the ROC Curve - ..."}}
{"id": "YZx8mJD_8Y", "cdate": 1546300800000, "mdate": null, "content": {"title": "Learning Laplacian Matrix from Bandlimited Graph Signals.", "abstract": "In this paper, we present a method for learning an underlying graph topology using observed graph signals as training data. The novelty of our method lies on the combination of two assumptions that are imposed as constraints to the graph learning process: i) the standard assumption used in the literature that signals are smooth with respect to graph structure (i.e. small signal variation at adjacent nodes), with ii) the additional assumption that signals are bandlimited, which implies sparsity in the signals' representation in the spectral domain. The latter assumption affects the inference of the whole eigenvalue decomposition of the Laplacian matrix and leads to a challenging new optimization problem. The conducted experimental evaluation shows that the proposed algorithm to solve this problem outperforms a reference state-of-the-art method that is based only on the smoothness assumption, when compared in the graph learning task on synthetic and real graph signals."}}
{"id": "V7dDLHVj2IPU", "cdate": 1546300800000, "mdate": null, "content": {"title": "Detecting multiple change-points in the time-varying Ising model.", "abstract": "This work focuses on the estimation of multiple change-points in a time-varying Ising model that evolves piece-wise constantly. The aim is to identify both the moments at which significant changes occur in the Ising model, as well as the underlying graph structures. For this purpose, we propose to estimate the neighborhood of each node by maximizing a penalized version of its conditional log-likelihood. The objective of the penalization is twofold: it imposes sparsity in the learned graphs and, thanks to a fused-type penalty, it also enforces them to evolve piece-wise constantly. Using few assumptions, we provide two change-points consistency theorems. Those are the first in the context of unknown number of change-points detection in time-varying Ising model. Finally, experimental results on several synthetic datasets and a real-world dataset demonstrate the performance of our method."}}
