{"id": "dIX34JWnIAL", "cdate": 1664248837741, "mdate": null, "content": {"title": "Robust task-specific adaption of models for drug-target interaction prediction", "abstract": "HyperNetworks have been established as an effective technique to achieve fast adaptation of parameters for neural networks. Recently, HyperNetworks conditioned on descriptors of tasks have improved multi-task generalization in various domains, such as personalized federated learning and neural architecture search. Especially powerful results were achieved in few- and zero-shot settings, attributed to the increased information sharing by the HyperNetwork. With the rise of new diseases fast discovery of drugs is needed which requires proteo-chemometric models that are able to generalize drug-target interaction predictions in low-data scenarios. State-of-the-art methods apply a few fully-connected layers to concatenated learned embeddings of the protein target and drug compound. In this work, we develop a task-conditioned HyperNetwork approach for the problem of predicting drug-target interactions in drug discovery. We show that when model parameters are predicted for the fully-connected layers processing the drug compound embedding, based on the protein target embedding, predictive performance can be improved over previous methods. Two additional components of our architecture, a) switching to L1 loss, and b) integrating a context module for proteins, further boost performance and robustness. On an established benchmark for proteo-chemometrics models, our architecture outperforms previous methods in all settings, including few- and zero-shot settings. In an ablation study, we analyze the importance of each of the components of our HyperNetwork approach."}}
{"id": "ByKnruXSwL7", "cdate": 1626329907702, "mdate": null, "content": {"title": "Characterising activation functions by their backward dynamics around forward fixed points", "abstract": "The forward dynamics in neural networks for various activation functions has beenstudied extensively in the context of initialisation and normalisation strategies, bymean field theory, edge of chaos theory, and fixed point analysis.  However, thestudy of the backward dynamics appears to be largely disconnected to the insightsobtained from the forward analysis.  We argue that many of the ideas from theforward analysis could and should be applied to backward dynamics. We show thatthe ideas of mean field theory and fixed point analysis apply to the backward passand allow to characterise activation functions."}}
{"id": "Rld-9OxQ6HU", "cdate": 1601308338186, "mdate": null, "content": {"title": "MC-LSTM: Mass-conserving LSTM", "abstract": "The success of Convolutional Neural Networks (CNNs) in computer vision is mainly driven by their strong inductive bias,  which is strong enough to allow CNNs to solve vision-related tasks with random weights, meaning without learning. Similarly, Long Short-Term Memory (LSTM) has a strong inductive bias towards storing information over time. However, many real-world systems are governed by conservation laws, which lead to the redistribution of particular quantities —e.g. in physical and economical systems.   Our novel Mass-Conserving LSTM (MC-LSTM) adheres to these conservation laws by extending the inductive bias of LSTM to model the redistribution of those stored quantities. MC-LSTMs set a new state-of-the-art for neural arithmetic units at learning arithmetic operations, such as addition tasks, which have a strong conservation law, as the sum is constant overtime. Further, MC-LSTM is applied to traffic forecasting, modeling a pendulum, and a large benchmark dataset in hydrology, where it sets a new state-of-the-art for predicting peak flows. In the hydrology example, we show that MC-LSTM states correlate with real world processes and are therefore interpretable."}}
{"id": "XuD7fFDUM-9", "cdate": 1546300800000, "mdate": null, "content": {"title": "Using LSTMs for climate change assessment studies on droughts and floods", "abstract": "Climate change affects occurrences of floods and droughts worldwide. However, predicting climate impacts over individual watersheds is difficult, primarily because accurate hydrological forecasts require models that are calibrated to past data. In this work we present a large-scale LSTM-based modeling approach that -- by training on large data sets -- learns a diversity of hydrological behaviors. Previous work shows that this model is more accurate than current state-of-the-art models, even when the LSTM-based approach operates out-of-sample and the latter in-sample. In this work, we show how this model can assess the sensitivity of the underlying systems with regard to extreme (high and low) flows in individual watersheds over the continental US."}}
