{"id": "X3RuacCx1R", "cdate": 1652737826737, "mdate": null, "content": {"title": "Expected Frequency Matrices of Elections: Computation, Geometry, and Preference Learning", "abstract": "We use the \"map of elections\" approach of Szufa et al. (AAMAS 2020) to analyze several well-known vote distributions. For each of them, we give an explicit formula or an efficient algorithm for computing its frequency matrix, which captures the probability that a given candidate appears in a given position in a sampled vote. We use these matrices to draw the \"skeleton map\" of distributions, evaluate its robustness, and analyze its properties. We further develop a general and unified framework for learning the distribution of real-world preferences using the frequency matrices of established vote distributions."}}
{"id": "BjIwLRWgO6B", "cdate": 1546300800000, "mdate": null, "content": {"title": "A Framework for Approval-Based Budgeting Methods.", "abstract": "We define and study a general framework for approval-based budgeting methods and compare certain methods within this framework by their axiomatic and computational properties. Furthermore, we visualize their behavior on certain Euclidean distributions and analyze them experimentally."}}
{"id": "Bijvg-MxdaH", "cdate": 1546300800000, "mdate": null, "content": {"title": "Approximation and Hardness of Shift-Bribery.", "abstract": "In the SHIFT-BRIBERY problem we are given an election, a preferred candidate, and the costs of shifting this preferred candidate up the voters’ preference orders. The goal is to find such a set of shifts that ensures that the preferred candidate wins the election. We give the first polynomial-time approximation scheme for the case of positional scoring rules, and for the Copeland rule we show strong inapproximability results."}}
{"id": "BQvNp-xdaS", "cdate": 1546300800000, "mdate": null, "content": {"title": "How Similar Are Two Elections?", "abstract": "We introduce the ELECTION ISOMORPHISM problem and a family of its approximate variants, which we refer to as dISOMORPHISM DISTANCE (d-ID) problems (where d is a metric between preference orders). We show that ELECTION ISOMORPHISM is polynomial-time solvable, and that the d-ISOMORPHISM DISTANCE problems generalize various classic rank-aggregation methods (e.g., those of Kemeny and Litvak). We establish the complexity of our problems (including their inapproximability) and provide initial experiments regarding the ability to solve them in practice."}}
{"id": "S1WvKlb_ZS", "cdate": 1514764800000, "mdate": null, "content": {"title": "Multiwinner Elections With Diversity Constraints", "abstract": "We develop a model of multiwinner elections that combines performance-based measures of the quality of the committee (such as, e.g., Borda scores of the committee members) with diversity constraints. Specifically, we assume that the candidates have certain attributes (such as being a male or a female, being junior or senior, etc.) and the goal is to elect a committee that, on the one hand, has as high a score regarding a given performance measure, but that, on the other hand, meets certain requirements (e.g., of the form \"at least 30\\%$ of the committee members are junior candidates and at least 40\\%$ are females\"). We analyze the computational complexity of computing winning committees in this model, obtaining polynomial-time algorithms (exact and approximate) and NP-hardness results. We focus on several natural classes of voting rules and diversity constraints."}}
{"id": "HJW5DaeubH", "cdate": 1514764800000, "mdate": null, "content": {"title": "Effective Heuristics for Committee Scoring Rules", "abstract": "Committee scoring rules form an important class of multiwinner voting rules. As computing winning committees under such rules is generally intractable, in this paper we investigate efficient heuristics for this task. We design two novel heuristics for computing approximate results of multiwinner elections under arbitrary committee scoring rules; notably, one of these heuristics uses concepts from cooperative game theory. We then provide an experimental evaluation of our heuristics (and two others, known from the literature): we compare the scores of the committees output by our algorithms to the scores of the optimal committees, and also use the two-dimensional Euclidean domain to compare the visual representations of the outputs of our algorithms."}}
{"id": "BklnOSzuWB", "cdate": 1514764800000, "mdate": null, "content": {"title": "Egalitarian Committee Scoring Rules", "abstract": "We introduce and study the class of egalitarian variants of committee scoring rules, where instead of summing up the scores that voters assign to committees---as is done in the utilitarian variants---the score of a committee is taken to be the lowest score assigned to it by any voter. We focus on five rules, which are egalitarian analogues of SNTV, the k-Borda rule, the Chamberlin--Courant rule, the Bloc rule, and the Pessimist rule. We establish their computational complexity, provide their initial axiomatic study, and perform experiments to represent the action of these rules graphically."}}
{"id": "B1b0YEM_-H", "cdate": 1514764800000, "mdate": null, "content": {"title": "Opinion Diffusion and Campaigning on Society Graphs", "abstract": "We study the effects of campaigning, where the society is partitioned into voter clusters and a diffusion process propagates opinions in a network connecting those clusters. Our model is very general and can incorporate many campaigning actions, various partitions of the society into voter clusters, and very general diffusion processes. Perhaps surprisingly, we show that computing the cheapest campaign for rigging a given election can usually be done efficiently, even with arbitrarily-many voters."}}
{"id": "rkb2OBG_Zr", "cdate": 1483228800000, "mdate": null, "content": {"title": "Committee Scoring Rules: A Call to Arms", "abstract": "Committee scoring rules are a class of voting rules used to select sets of candidates based on the preferences of the voters. The goal of this paper is to present this class and to invite researchers to study its properties (computational and axiomatic alike)."}}
{"id": "rk-57HfuWH", "cdate": 1483228800000, "mdate": null, "content": {"title": "Multiwinner Rules on Paths From k-Borda to Chamberlin-Courant", "abstract": "The classical multiwinner rules are designed for particular purposes. For example, variants of k-Borda are used to find k best competitors in judging contests while the Chamberlin-Courant rule is used to select a diverse set of k products. These rules represent two extremes of the multiwinner world. At times, however, one might need to find an appropriate trade-off between these two extremes. We explore continuous transitions from k-Borda to Chamberlin-Courant and study intermediate rules."}}
