{"id": "vlGmst_EXIZ", "cdate": 1640995200000, "mdate": 1682104709253, "content": {"title": "Structured Model Selection for Recovery of Sparse Representations in Nested Periodic Dictionaries", "abstract": "Periodic signals were shown to admit sparse representations in Nested periodic dictionaries (NPDs). Therefore, sparse recovery frameworks have been employed to estimate the periodicity in signals by finding their sparse representations in such dictionaries. However, existing sparse recovery algorithms such as Orthogonal Matching Pursuit (OMP) are oblivious to the structure of the dictionary, and as a result their performance degrade in settings involving periodic mixtures. In this work, we propose new algorithms for structured model selection, termed nested periodic subspace OMP and nested periodic subspace regularized OMP, that leverage the well-known Euler structure and LCM property of NPDs. We evaluate the performance of these methods using both synthesized and real data and show that they can yield better performance than generic recovery algorithms while also saving in computation time."}}
{"id": "jTL0aJEj9-1", "cdate": 1609459200000, "mdate": 1682104709260, "content": {"title": "Support Recovery Guarantees for Periodic Signals with Nested Periodic Dictionaries", "abstract": "Periodic signals composed of periodic mixtures admit sparse representations in nested periodic dictionaries (NPDs). Therefore, their underlying hidden periods can be estimated by recovering the exact support of said representations. In this paper, support recovery guarantees of such signals are derived both in noise-free and noisy settings. While exact recovery conditions have long been studied in the theory of compressive sensing, existing conditions fall short of yielding meaningful achievability regions in the context of periodic signals with sparse representations in NPDs, in part since existing bounds do not capture structures intrinsic to these dictionaries. We leverage known properties of NPDs to derive several conditions for exact sparse recovery of periodic mixtures in the noise-free setting. These conditions rest on newly introduced notions of nested periodic coherence and restricted coherence, which can be efficiently computed and verified. In the presence of noise, we obtain improved conditions for recovering the exact support set of the sparse representation of the periodic mixture via orthogonal matching pursuit based on the introduced notions of coherence. The theoretical findings are corroborated using numerical experiments for different families of NPDs. Our results show significant improvement over generic recovery bounds as the conditions hold over a larger range of sparsity levels."}}
{"id": "IfwbMOirEcM", "cdate": 1609459200000, "mdate": 1682104709253, "content": {"title": "Sparse Recovery Guarantees of Periodic Signals with Nested Periodic Dictionaries", "abstract": "Periodic signals admit sparse representations in nested periodic dictionaries (NPDs). While sparse recovery algorithms rooted in the theory of compressive sensing can successfully recover their underlying periods, existing recovery conditions derived for random dictionaries are of limited use in this context as they fail to explain the achievability results of said algorithms. In addition, provable achievability guarantees specific to NPDs have been heretofore lacking. In this paper, we derive exact recovery conditions for sparse periodic signals by leveraging prior information about the structure of NPDs. As instances of such dictionaries, we investigate the achievability conditions for the Farey and the Ramanujan Periodicity Transform dictionaries. Our numerical results demonstrate that the newly derived conditions can provide guarantees for exact recovery with the Farey dictionary, and in turn for exact period estimation, for large enough data lengths."}}
{"id": "2ZMR0TNkEyB", "cdate": 1577836800000, "mdate": 1682104709257, "content": {"title": "Improved Block-Sparse Recovery Bound Using Cumulative Block Coherence", "abstract": "Block coherence extends the conventional notion of coherence to capture the interdependence of blocks in a given dictionary. This measure is the basis for various recovery bounds of block-sparse signals, i.e., signals with clustered support, from under-determined systems of equations. In this paper, we extend the block coherence measure by introducing the notion of cumulative block coherence, which measures the maximum coherence between a block and a collection of other blocks. We show analytically that the cumulative block coherence yields relaxed sufficient conditions on the sparsity level for exact recovery of a block-sparse signal."}}
{"id": "7xqHTt21a8wg", "cdate": 1514764800000, "mdate": null, "content": {"title": "Periodicity Transforms For Multichannel and Multiclass Detection of Visual Evoked Potentials", "abstract": "A repetitive visual stimulus induces a brain response known as the Steady State Visual Evoked Potential (SSVEP) whose frequency matches that of the stimulus. Reliable SSVEP-based Brain-Computer-Interfacing (BCI) is premised in part on the ability to efficiently detect and classify the true underlying frequencies in real time. We pose the problem of detecting different frequencies corresponding to different stimuli as a composite multi-hypothesis test, where measurements from multiple electrodes are assumed to admit a sparse representation in a Ramanujan Periodicity Transform (RPT) dictionary. We develop an RPT detector based on a generalized likelihood ratio test of the underlying periodicity that accounts for the spatial correlation between the electrodes. Unlike the existing supervised methods which are highly data-dependent, the RPT detector only uses data to estimate the per-subject spatial correlation. The RPT detector is shown to yield promising results comparable to state-of-the-art methods such as standard CCA and IT CCA based on experiments with real data. Its ability to yield high accuracy with short epochs holds potential to advance real-time BCI technology."}}
{"id": "2M3_tKKMlwT", "cdate": 1483228800000, "mdate": null, "content": {"title": "Detection of Visual Evoked Potentials using Ramanujan Periodicity Transform for real time brain computer interfaces", "abstract": "Repetitive visual stimuli induce periodic Visual Evoked Potentials (VEPs) in the brain that can be potentially identified in an EEG trace. The ability to distinguish frequencies and patterns due to different stimuli is the basis for brain computer interfaces (BCIs) used for communication and control of neurologically disabled patients. Since such responses are recorded in presence of high levels of noise from background brain processes, the detection task is rather challenging. In this work, we propose a detection approach for VEPs based on Ramanujan Periodicity Transform matrices (RPT), which have shown promise in detecting periodicities in data. Our results show that the RPT-based approach can outperform conventional spectral techniques and the state-of-the-art correlation analysis, and is more compatible with real-time BCIs which have to work with short duration EEG epochs. The proposed approach is fairly robust to unknown natural latencies in brain response."}}
{"id": "0CieUwcF2f", "cdate": 1483228800000, "mdate": null, "content": {"title": "On robust detection of brain stimuli with Ramanujan Periodicity Transforms", "abstract": "Visual Evoked Potentials (VEPs) are the brain responses to repetitive visual stimuli. The ability to detect the underlying frequencies of VEPs is crucial to advancing Brain Computer Interfaces (BCIs). This paper considers the detection of such frequencies using a Ramanujan Periodicity Transform based model. We analyze the performance of a generalized likelihood ratio detector and derive the exact distributions of the sufficient statistics under hypotheses corresponding to different stimulus frequencies using confluent hyper-geometric functions, along with flexible approximate distributions. Choosing stimulation periods with non-overlapping divisors is shown to enhance the detection performance. Our analysis provides guidelines for efficient design of stimulus waveforms for BCIs."}}
{"id": "_asNyMdmS2R", "cdate": 1420070400000, "mdate": null, "content": {"title": "Motor imagery classification using multiresolution analysis and sparse representation of EEG signals", "abstract": "Classifying motor imagery brain signals where the signals are obtained based on imagined movement of the limbs is a major, yet very challenging, step in developing Brain Computer Interfaces (BCIs). Of primary importance is to use less data and computationally efficient algorithms to support real-time BCI. To this end, an algorithm that exploits the sparse characteristics of EEGs is proposed to classify these signals. Different feature vectors are extracted based on the energies in different frequency sub-bands of the Wavelet Packet decomposition of EEG trials recorded only by five electrodes near the sensorimotor cortex. Features from a small spatial region are approximated by a sparse linear combination of few atoms from a multi-class dictionary constructed from the wavelet features of the projected EEG training signals for each class. This is used to classify the signals based on the pattern of their sparse representation using a minimum-residual decision rule. The results obtained from real data demonstrate that the combination of energy and entropy features enables efficient classification of motor imagery EEG trials related to hand and foot movements. Also, the decomposition used is shown to provide a frequency resolution consistent with the existence of different levels within the alpha band."}}
{"id": "K2Bq1m2bJd", "cdate": 1420070400000, "mdate": 1682104709258, "content": {"title": "Voice Disorder Signal Classification Using M-Band Wavelets and Support Vector Machine", "abstract": ""}}
