{"id": "i7jzblWa9b", "cdate": 1609459200000, "mdate": 1631908726564, "content": {"title": "Long Horizon Forecasting with Temporal Point Processes", "abstract": "In recent years, marked temporal point processes (MTPPs) have emerged as a powerful modeling machinery to characterize asynchronous events in a wide variety of applications. MTPPs have demonstrated significant potential in predicting event-timings, especially for events arriving in near future. However, due to current design choices, MTPPs often show poor predictive performance at forecasting event arrivals in distant future. To ameliorate this limitation, in this paper, we design DualTPP which is specifically well-suited to long horizon event forecasting. DualTPP has two components. The first component is an intensity free MTPP model, which captures microscopic event dynamics by modeling the time of future events. The second component takes a different dual perspective of modeling aggregated counts of events in a given time-window, thus encapsulating macroscopic event dynamics. Then we develop a novel inference framework jointly over the two models by solving a sequence of constrained quadratic optimization problems. Experiments with a diverse set of real datasets show that DualTPP outperforms existing MTPP methods on long horizon forecasting by substantial margins, achieving almost an order of magnitude reduction in Wasserstein distance between actual events and forecasts. The code and the datasets can be found at the following URL: https://github.com/pratham16cse/DualTPP"}}
{"id": "P7fEshSZlA5", "cdate": 1609459200000, "mdate": 1631908726562, "content": {"title": "Missing Value Imputation on Multidimensional Time Series", "abstract": ""}}
{"id": "iRdr5PWJr5Y", "cdate": 1546300800000, "mdate": 1631908726821, "content": {"title": "Streaming Adaptation of Deep Forecasting Models using Adaptive Recurrent Units", "abstract": "We present ARU, an Adaptive Recurrent Unit for streaming adaptation of deep globally trained time-series forecasting models. The ARU combines the advantages of learning complex data transformations across multiple time series from deep global models, with per-series localization offered by closed-form linear models. Unlike existing methods of adaptation that are either memory-intensive or non-responsive after training, ARUs require only fixed sized state and adapt to streaming data via an easy RNN-like update operation. The core principle driving ARU is simple --- maintain sufficient statistics of conditional Gaussian distributions and use them to compute local parameters in closed form. Our contribution is in embedding such local linear models in globally trained deep models while allowing end-to-end training on the one hand, and easy RNN-like updates on the other. Across several datasets we show that ARU is more effective than recently proposed local adaptation methods that tax the global network to compute local parameters."}}
{"id": "frUBiRzm_6_", "cdate": 1483228800000, "mdate": null, "content": {"title": "MCEIL: An Improved Scoring Function for Overlapping Community Detection using Seed Expansion Methods.", "abstract": "Community detection is one of the most well known problems in complex network analysis. In real-world networks, communities often overlap. Various approaches have been proposed in the literature to detect overlapping communities in networks. Local Expansion and optimization approaches have gained popularity due to their scalability and robustness. In a method based on local expansion, the seeding strategy and scoring function employed are crucial to the performance of the algorithm. In this paper, a scoring function called CEIL score is used with ground-truth seeds in local expansion and optimization algorithm. Using CEIL score has significantly improved performance of the algorithms with respect to evaluation metrics NMI and F1 score. However, CEIL has lower coverage than conductance. An extension to CEIL score, called MCEIL score is proposed. Using MCEIL score returns communities with coverage as high as conductance, and NMI and F1 scores higher than conductance on different kinds of datasets. Experiments on datasets of different types with different seeding strategies show that the improvements in NMI and F1 score obtained by MCEIL score are substantial."}}
