{"id": "jBQaRXpEgO", "cdate": 1621630130959, "mdate": null, "content": {"title": "Can Information Flows Suggest Targets for Interventions in Neural Circuits?", "abstract": "Motivated by neuroscientific and clinical applications, we empirically examine whether observational measures of information flow can suggest interventions. We do so by performing experiments on artificial neural networks in the context of fairness in machine learning, where the goal is to induce fairness in the system through interventions. Using our recently developed M-information flow framework, we measure the flow of information about the true label (responsible for accuracy, and hence desirable), and separately, the flow of information about a protected attribute (responsible for bias, and hence undesirable) on the edges of a trained neural network. We then compare the flow magnitudes against the effect of intervening on those edges by pruning. We show that pruning edges that carry larger information flows about the protected attribute reduces bias at the output to a greater extent. This demonstrates that M-information flow can meaningfully suggest targets for interventions, answering the title's question in the affirmative. We also evaluate bias-accuracy tradeoffs for different intervention strategies, to analyze how one might use estimates of desirable and undesirable information flows (here, accuracy and bias flows) to inform interventions that preserve the former while reducing the latter."}}
{"id": "rQDWgkcPN6", "cdate": 1577836800000, "mdate": null, "content": {"title": "Fairness Under Feature Exemptions: Counterfactual and Observational Measures", "abstract": "With the growing use of ML in highly consequential domains, quantifying disparity with respect to protected attributes, e.g., gender, race, etc., is important. While quantifying disparity is essential, sometimes the needs of an occupation may require the use of certain features that are critical in a way that any disparity that can be explained by them might need to be exempted. E.g., in hiring a software engineer for a safety-critical application, coding-skills may be weighed strongly, whereas name, zip code, or reference letters may be used only to the extent that they do not add disparity. In this work, we propose an information-theoretic decomposition of the total disparity (a quantification inspired from counterfactual fairness) into two components: a non-exempt component which quantifies the part that cannot be accounted for by the critical features, and an exempt component that quantifies the remaining disparity. This decomposition allows one to check if the disparity arose purely due to the critical features (inspired from the business necessity defense of disparate impact law) and also enables selective removal of the non-exempt component if desired. We arrive at this decomposition through canonical examples that lead to a set of desirable properties (axioms) that a measure of non-exempt disparity should satisfy. Our proposed measure satisfies all of them. Our quantification bridges ideas of causality, Simpson's paradox, and a body of work from information theory called Partial Information Decomposition. We also obtain an impossibility result showing that no observational measure can satisfy all the desirable properties, leading us to relax our goals and examine observational measures that satisfy only some of them. We perform case studies to show how one can audit/train models while reducing non-exempt disparity."}}
{"id": "FyNKrnoA-a", "cdate": 1577836800000, "mdate": null, "content": {"title": "Information Flow in Computational Systems", "abstract": "We develop a theoretical framework for defining and identifying flows of information in computational systems. Here, a computational system is assumed to be a directed graph, with “clocked” nodes that send transmissions to each other along the edges of the graph at discrete points in time. We are interested in a definition that captures the dynamic flow of information about a specific message, and which guarantees an unbroken “information path” between appropriately defined inputs and outputs in the directed graph. Prior measures, including those based on Granger Causality and Directed Information, fail to provide clear assumptions and guarantees about when they correctly reflect information flow about a message. We take a systematic approach-iterating through candidate definitions and counterexamples-to arrive at a definition for information flow that is based on conditional mutual information, and which satisfies desirable properties, including the existence of information paths. Finally, we describe how information flow might be detected in a noiseless setting, and provide an algorithm to identify information paths on the time-unrolled graph of a computational system."}}
{"id": "08UZzTwU5eX", "cdate": 1577836800000, "mdate": null, "content": {"title": "How else can we define Information Flow in Neural Circuits?", "abstract": "Recently, we developed a systematic framework for defining and inferring flows of information about a specific message in neural circuits [2], [3]. We defined a computational model of a neural circuit consisting of computational nodes and transmissions being sent between these nodes over time. We then gave a formal definition of information flow pertaining to a specific message, which was capable of identifying paths along which information flowed in such a system. However, this definition also had some non-intuitive properties, such as the existence of \"orphans\"-nodes from which information flowed out, even though no information flowed in. In part, these non-intuitive properties arose because we restricted our attention to measures that were functions of transmissions at a single time instant, and measures that were observational rather than counterfactual. In this paper, we consider alternative definitions, including one that is a function of transmissions at multiple time instants, one that is counterfactual, and a new observational definition. We show that a definition of information flow based on counterfactual causal influence (CCI) guarantees the existence of information paths while also having no orphans. We also prove that no observational definition of information flow that satisfies the information path property can match CCI in every instance. Furthermore, each of the definitions we examine (including CCI) is shown to have examples in which the information flow can take a non-intuitive path. Nevertheless, we believe our framework remains more amenable to drawing clear interpretations than classical tools used in neuroscience, such as Granger Causality."}}
{"id": "-GYkSZQczdu", "cdate": 1577836800000, "mdate": null, "content": {"title": "An Information-Theoretic Quantification of Discrimination with Exempt Features", "abstract": "The needs of a business (e.g., hiring) may require the use of certain features that are critical in a way that any discrimination arising due to them should be exempted. In this work, we propose a novel information-theoretic decomposition of the total discrimination (in a counterfactual sense) into a non-exempt component, which quantifies the part of the discrimination that cannot be accounted for by the critical features, and an exempt component, which quantifies the remaining discrimination. Our decomposition enables selective removal of the non-exempt component if desired. We arrive at this decomposition through examples and counterexamples that enable us to first obtain a set of desirable properties that any measure of non-exempt discrimination should satisfy. We then demonstrate that our proposed quantification of non-exempt discrimination satisfies all of them. This decomposition leverages a body of work from information theory called Partial Information Decomposition (PID). We also obtain an impossibility result showing that no observational measure of non-exempt discrimination can satisfy all of the desired properties, which leads us to relax our goals and examine alternative observational measures that satisfy only some of these properties. We then perform a case study using one observational measure to show how one might train a model allowing for exemption of discrimination due to critical features."}}
{"id": "zQKu6QHD_yP", "cdate": 1546300800000, "mdate": null, "content": {"title": "Information Flow in Computational Systems", "abstract": "We develop a theoretical framework for defining and identifying flows of information in computational systems. Here, a computational system is assumed to be a directed graph, with \"clocked\" nodes that send transmissions to each other along the edges of the graph at discrete points in time. We are interested in a definition that captures the dynamic flow of information about a specific message, and which guarantees an unbroken \"information path\" between appropriately defined inputs and outputs in the directed graph. Prior measures, including those based on Granger Causality and Directed Information, fail to provide clear assumptions and guarantees about when they correctly reflect information flow about a message. We take a systematic approach---iterating through candidate definitions and counterexamples---to arrive at a definition for information flow that is based on conditional mutual information, and which satisfies desirable properties, including the existence of information paths. Finally, we describe how information flow might be detected in a noiseless setting, and provide an algorithm to identify information paths on the time-unrolled graph of a computational system."}}
{"id": "daBUjCgwJO", "cdate": 1546300800000, "mdate": null, "content": {"title": "Efficient Near-Optimal Testing of Community Changes in Balanced Stochastic Block Models.", "abstract": "We propose and analyze the problems of \\textit{community goodness-of-fit and two-sample testing} for stochastic block models (SBM), where changes arise due to modification in community memberships of nodes. Motivated by practical applications, we consider the challenging sparse regime, where expected node degrees are constant, and the inter-community mean degree ($b$) scales proportionally to intra-community mean degree ($a$). Prior work has sharply characterized partial or full community recovery in terms of a ``signal-to-noise ratio'' ($\\mathrm{SNR}$) based on $a$ and $b$. For both problems, we propose computationally-efficient tests that can succeed far beyond the regime where recovery of community membership is even possible. Overall, for large changes, $s \\gg \\sqrt{n}$, we need only $\\mathrm{SNR}= O(1)$ whereas a na\\\"ive test based on community recovery with $O(s)$ errors requires $\\mathrm{SNR}= \\Theta(\\log n)$. Conversely, in the small change regime, $s \\ll \\sqrt{n}$, via an information theoretic lower bound, we show that, surprisingly, no algorithm can do better than the na\\\"ive algorithm that first estimates the community up to $O(s)$ errors and then detects changes. We validate these phenomena numerically on SBMs and on real-world datasets as well as Markov Random Fields where we only observe node data rather than the existence of links."}}
{"id": "XQRq5NLQaWD", "cdate": 1546300800000, "mdate": null, "content": {"title": "How should we define Information Flow in Neural Circuits?", "abstract": "We develop a theoretical framework for defining information flow in neural circuits, within the context of \"eventrelated\" experimental paradigms in neuroscience. Here, a neural circuit is modeled as a directed graph, with \"clocked\" nodes that send transmissions to each other along the edges of the graph at discrete points in time. We are interested in a definition that captures the flow of \"stimulus\"-related information, and which guarantees a continuous information path between appropriately defined inputs and outputs in the directed graph. Prior measures, including those based on Granger Causality and Directed Information, fail to provide clear assumptions and guarantees about when they correctly reflect stimulus-related information flow, due to the absence of a theoretical foundation with a mathematical definition. We take a methodical approach- iterating through candidate definitions and counterexamples- to arrive at a definition for information flow that is based on conditional mutual information, and which satisfies desirable properties, including the existence of information paths."}}
{"id": "IV6AD4PvZ_I", "cdate": 1546300800000, "mdate": null, "content": {"title": "An Algorithm for Automated, Noninvasive Detection of Cortical Spreading Depolarizations Based on EEG Simulations", "abstract": "Objective: We present a novel signal processing algorithm for automated, noninvasive detection of cortical spreading depolarizations (CSDs) using electroencephalography (EEG) signals and validate the algorithm on simulated EEG signals. CSDs are waves of neurochemical changes that suppress the neuronal activity as they propagate across the brain's cortical surface. CSDs are believed to mediate secondary brain damage after brain trauma and cerebrovascular diseases like stroke. We address the following two key challenges in detecting CSDs from EEG signals: i) attenuation and loss of high spatial resolution information; and ii) cortical folds, which complicate tracking CSD waves. Methods: Our algorithm detects and tracks “wavefronts” of a CSD wave, and stitch together data across space and time to make a detection. To test our algorithm, we provide different models of CSD waves, including different widths of CSD suppressions and different patterns, and use them to simulate scalp EEG signals using head models of four subjects. Results and conclusion: Our results suggest that low-density EEG grids (40 electrodes) can detect CSD widths of 1.1 cm on average, while higher density EEG grids (340 electrodes) can detect CSD patterns as thin as 0.43 cm (less than minimum widths reported in prior works), among which single-gyrus CSDs are the hardest to detect because of their small suppression area. Significance: The proposed algorithm is a first step toward noninvasive, automated detection of CSDs, which can help in reducing secondary brain damages."}}
{"id": "zhXHF0Z_OBE", "cdate": 1514764800000, "mdate": null, "content": {"title": "Low-Cost Carbon Fiber-Based Conductive Silicone Sponge EEG Electrodes", "abstract": "We propose a novel carbon fiber-based conductive silicone sponge for low electrode-skin impedance EEG recordings. When this sponge is used with water or saline solution, no gel is required, lowering the setup time drastically compared to classical wet electrodes. Moreover, the wet conductive carbon fiber silicone sponges achieve an electrode-skin impedance as low as 2.5kΩ at 1kHz when wet, making them better than state of the art gel electrodes. Additionally, even as the sponge dries out, it continues to remain conductive and performs as a reliable dry electrode. We demonstrate through experiments that these conductive carbon fiber silicone sponge electrodes, wet or dry, are able to measure alpha wave activity. Our carbon fiber conductive sponge electrodes are low-cost and are highly suitable for designs of portable high density EEG measurement systems."}}
