{"id": "YNDwCq6OrNj", "cdate": 1672531200000, "mdate": 1681607059052, "content": {"title": "Tackling Climate Change with Machine Learning", "abstract": ""}}
{"id": "VOjwYOfGZcL", "cdate": 1621630319590, "mdate": null, "content": {"title": "Adversarially robust learning for security-constrained optimal power flow", "abstract": "In recent years, the ML community has seen surges of interest in both adversarially robust learning and implicit layers, but connections between these two areas have seldom been explored. In this work, we combine innovations from these areas to tackle the problem of N-k security-constrained optimal power flow (SCOPF). N-k SCOPF is a core problem for the operation of electrical grids, and aims to schedule power generation in a manner that is robust to potentially $k$ simultaneous equipment outages. Inspired by methods in adversarially robust training, we frame N-k SCOPF as a minimax optimization problem -- viewing power generation settings as adjustable parameters and equipment outages as (adversarial) attacks -- and solve this problem via gradient-based techniques. The loss function of this minimax problem involves resolving implicit equations representing grid physics and operational decisions, which we differentiate through via the implicit function theorem. We demonstrate the efficacy of our framework in solving N-3 SCOPF, which has traditionally been considered as prohibitively expensive to solve given that the problem size depends combinatorially on the number of potential outages."}}
{"id": "yYDBSvQGGpH", "cdate": 1609459200000, "mdate": 1682341919279, "content": {"title": "Enforcing Policy Feasibility Constraints through Differentiable Projection for Energy Optimization", "abstract": "While reinforcement learning (RL) is gaining popularity in energy systems control, its real-world applications are limited due to the fact that the actions from learned policies may not satisfy functional requirements or be feasible for the underlying physical system. In this work, we propose PROjected Feasibility (PROF), a method to enforce convex operational constraints within neural policies. Specifically, we incorporate a differentiable projection layer within a neural network-based policy to enforce that all learned actions are feasible. We then update the policy end-to-end by propagating gradients through this differentiable projection layer, making the policy cognizant of the operational constraints. We demonstrate our method on two applications: energy-efficient building operation and inverter control. In the building operation setting, we show that PROF maintains thermal comfort requirements while improving energy efficiency by 4% over state-of-the-art methods. In the inverter control setting, PROF perfectly satisfies voltage constraints on the IEEE 37-bus feeder system, as it learns to curtail as little renewable energy as possible within its safety set."}}
{"id": "xnX7vOxWc-", "cdate": 1609459200000, "mdate": 1682341919100, "content": {"title": "Adversarially robust learning for security-constrained optimal power flow", "abstract": "In recent years, the ML community has seen surges of interest in both adversarially robust learning and implicit layers, but connections between these two areas have seldom been explored. In this work, we combine innovations from these areas to tackle the problem of N-k security-constrained optimal power flow (SCOPF). N-k SCOPF is a core problem for the operation of electrical grids, and aims to schedule power generation in a manner that is robust to potentially $k$ simultaneous equipment outages. Inspired by methods in adversarially robust training, we frame N-k SCOPF as a minimax optimization problem -- viewing power generation settings as adjustable parameters and equipment outages as (adversarial) attacks -- and solve this problem via gradient-based techniques. The loss function of this minimax problem involves resolving implicit equations representing grid physics and operational decisions, which we differentiate through via the implicit function theorem. We demonstrate the efficacy of our framework in solving N-3 SCOPF, which has traditionally been considered as prohibitively expensive to solve given that the problem size depends combinatorially on the number of potential outages."}}
{"id": "86ORSai7uS_", "cdate": 1609459200000, "mdate": 1681764722662, "content": {"title": "Enforcing robust control guarantees within neural network policies", "abstract": "When designing controllers for safety-critical systems, practitioners often face a challenging tradeoff between robustness and performance. While robust control methods provide rigorous guarantees on system stability under certain worst-case disturbances, they often yield simple controllers that perform poorly in the average (non-worst) case. In contrast, nonlinear control methods trained using deep learning have achieved state-of-the-art performance on many control tasks, but often lack robustness guarantees. In this paper, we propose a technique that combines the strengths of these two approaches: constructing a generic nonlinear control policy class, parameterized by neural networks, that nonetheless enforces the same provable robustness criteria as robust control. Specifically, our approach entails integrating custom convex-optimization-based projection layers into a neural network-based policy. We demonstrate the power of this approach on several domains, improving in average-case performance over existing robust control methods and in worst-case stability over (non-robust) deep RL methods."}}
{"id": "25rtxdKxVd", "cdate": 1609459200000, "mdate": 1681607059059, "content": {"title": "DC3: A learning method for optimization with hard constraints", "abstract": ""}}
{"id": "V1ZHVxJ6dSS", "cdate": 1601308114437, "mdate": null, "content": {"title": "DC3: A learning method for optimization with hard constraints", "abstract": "Large optimization problems with hard constraints arise in many settings, yet classical solvers are often prohibitively slow, motivating the use of deep networks as cheap \"approximate solvers.\" Unfortunately, naive deep learning approaches typically cannot enforce the hard constraints of such problems, leading to infeasible solutions. In this work, we present Deep Constraint Completion and Correction (DC3), an algorithm to address this challenge. Specifically, this method enforces feasibility via a differentiable procedure, which implicitly completes partial solutions to satisfy equality constraints and unrolls gradient-based corrections to satisfy inequality constraints. We demonstrate the effectiveness of DC3 in both synthetic optimization tasks and the real-world setting of AC optimal power flow, where hard constraints encode the physics of the electrical grid. In both cases, DC3 achieves near-optimal objective values while preserving feasibility."}}
{"id": "5lhWG3Hj2By", "cdate": 1601308114021, "mdate": null, "content": {"title": "Enforcing robust control guarantees within neural network policies", "abstract": "When designing controllers for safety-critical systems, practitioners often face a challenging tradeoff between robustness and performance. While robust control methods provide rigorous guarantees on system stability under certain worst-case disturbances, they often yield simple controllers that perform poorly in the average (non-worst) case. In contrast, nonlinear control methods trained using deep learning have achieved state-of-the-art performance on many control tasks, but often lack robustness guarantees. In this paper, we propose a technique that combines the strengths of these two approaches: constructing a generic nonlinear control policy class, parameterized by neural networks, that nonetheless enforces the same provable robustness criteria as robust control. Specifically, our approach entails integrating custom convex-optimization-based projection layers into a neural network-based policy. We demonstrate the power of this approach on several domains, improving in average-case performance over existing robust control methods and in worst-case stability over (non-robust) deep RL methods."}}
{"id": "t_j2MPIxTfO", "cdate": 1577836800000, "mdate": 1682341919189, "content": {"title": "Matrix Completion for Low-Observability Voltage Estimation", "abstract": "With the rising penetration of distributed energy resources, distribution system control and enabling techniques such as state estimation have become essential to distribution system operation. However, traditional state estimation techniques have difficulty coping with the low-observability conditions often present on the distribution system due to the paucity of sensors and heterogeneity of measurements. To address these limitations, we propose a distribution system state estimation algorithm that employs matrix completion (a tool for estimating missing values in low-rank matrices) augmented with noise-resilient power flow constraints. This method operates under low-observability conditions where standard least-squares-based methods cannot operate, and flexibly incorporates any network quantities measured in the field. We empirically evaluate our method on the IEEE 33- and 123-bus test systems, and find that it provides near-perfect state estimation performance (within 1% mean absolute percent error) across many low-observability data availability regimes."}}
{"id": "SyWYWjZ_-r", "cdate": 1546300800000, "mdate": null, "content": {"title": "SATNet: Bridging deep learning and logical reasoning using a differentiable satisfiability solver", "abstract": "Integrating logical reasoning within deep learning architectures has been a major goal of modern AI systems. In this paper, we propose a new direction toward this goal by introducing a differentiab..."}}
