{"id": "Vly_o6n2FP", "cdate": 1640995200000, "mdate": 1681497658076, "content": {"title": "Compressed Sensing MRI Reconstruction with Co-VeGAN: Complex-Valued Generative Adversarial Network", "abstract": ""}}
{"id": "y_vC5Cdu_z", "cdate": 1632328762605, "mdate": null, "content": {"title": "GradML: A Gradient-based Loss for Deep Metric Learning", "abstract": "Deep metric learning (ML) uses a carefully designed loss function to learn distance metrics for improving the discriminatory ability for tasks like clustering and retrieval. Most loss functions are designed by considering the distance between the embeddings to induce certain properties without exploring how such losses would impact the movement of the said embeddings via their gradients during optimization. In this work, we analyze the gradients of various ML loss functions and propose a gradient-based loss for ML (GradML). Instead of directly formulating the loss, we first formulate the gradients of the loss and use them to derive the loss to be optimized. It has a simple formulation and lowers the computational cost as compared to other methods. We evaluate our approach on three datasets and find that the performance is data-dependent on properties like inter-class variance."}}
{"id": "fPMqXuhvafA", "cdate": 1609459200000, "mdate": 1681497658058, "content": {"title": "LoOp: Looking for Optimal Hard Negative Embeddings for Deep Metric Learning", "abstract": ""}}
{"id": "Vt-twP4LnzE", "cdate": 1577836800000, "mdate": 1631839798946, "content": {"title": "Structure Preserving Compressive Sensing MRI Reconstruction using Generative Adversarial Networks", "abstract": "Compressive sensing magnetic resonance imaging (CS-MRI) accelerates the acquisition of MR images by breaking the Nyquist sampling limit. In this work, a novel generative adversarial network (GAN) based framework for CS-MRI reconstruction is proposed. Leveraging a combination of patch-based discriminator and structural similarity index based loss, our model focuses on preserving high frequency content as well as fine textural details in the reconstructed image. Dense and residual connections have been incorporated in a U-net based generator architecture to allow easier transfer of information as well as variable network length. We show that our algorithm outperforms state-of-the-art methods in terms of quality of reconstruction and robustness to noise. Also, the reconstruction time, which is of the order of milliseconds, makes it highly suitable for real-time clinical use."}}
