{"id": "ur3i8-iSz-", "cdate": 1683881680608, "mdate": 1683881680608, "content": {"title": "Questimator: Generating knowledge assessments for arbitrary topics", "abstract": "Formative assessments allow learners to quickly identify knowledge gaps. In traditional educational settings, expert instructors can create assessments, but in informal learning environment, it is difficult for novice learners to self assess because they don’t know what they don’t know. This paper introduces Questimator, an automated system that generates multiple-choice assessment questions for any topic contained within Wikipedia. Given a topic, Questimator traverses the Wikipedia graph to find and rank related topics, and uses article text to form questions, answers and distractor options. In a study with 833 participants from Mechanical Turk, we found that participants’ scores on Questimatorgenerated quizzes correlated well with their scores on existing online quizzes on topics ranging from philosophy to economics. Also Questimator generates questions with comparable discriminatory power as existing online quizzes. Our results suggest Questimator may be useful for assessing learning in topics for which there is not an existing quiz."}}
{"id": "PnueWLgykXNR", "cdate": 1577836800000, "mdate": 1637053652875, "content": {"title": "DeText: A Deep Text Ranking Framework with BERT", "abstract": "Ranking is the most important component in a search system. Most search systems deal with large amounts of natural language data, hence an effective ranking system requires a deep understanding of text semantics. Recently, deep learning based natural language processing (deep NLP) models have generated promising results on ranking systems. BERT is one of the most successful models that learn contextual embedding, which has been applied to capture complex query-document relations for search ranking. However, this is generally done by exhaustively interacting each query word with each document word, which is inefficient for online serving in search product systems. In this paper, we investigate how to build an efficient BERT-based ranking model for industry use cases. The solution is further extended to a general ranking framework, DeText, that is open sourced and can be applied to various ranking productions. Offline and online experiments of DeText on three real-world search systems present significant improvement over state-of-the-art approaches."}}
{"id": "XDSfC5ApZa", "cdate": 1514764800000, "mdate": 1684907973422, "content": {"title": "Talent Search and Recommendation Systems at LinkedIn: Practical Challenges and Lessons Learned", "abstract": "LinkedIn Talent Solutions business contributes to around 65% of LinkedIn's annual revenue, and provides tools for job providers to reach out to potential candidates and for job seekers to find suitable career opportunities. LinkedIn's job ecosystem has been designed as a platform to connect job providers and job seekers, and to serve as a marketplace for efficient matching between potential candidates and job openings. A key mechanism to help achieve these goals is the LinkedIn Recruiter product, which enables recruiters to search for relevant candidates and obtain candidate recommendations for their job postings. In this work, we highlight a set of unique information retrieval, system, and modeling challenges associated with talent search and recommendation systems."}}
{"id": "5cApY7wUo9y", "cdate": 1514764800000, "mdate": 1684907973419, "content": {"title": "Towards Deep and Representation Learning for Talent Search at LinkedIn", "abstract": ""}}
