{"id": "_YX4J8o6772", "cdate": 1677628800000, "mdate": 1683792602770, "content": {"title": "Image colorization using deep convolutional auto-encoder with multi-skip connections", "abstract": "The colorization of grayscale images is a challenging task in image processing. Recently, deep learning has shown remarkable performance in image colorization. However, the detail loss and color distortion are still serious problem for most existing methods, and some useful features may be lost in the processes of various convolutional layers because of the vanishing gradient problem. Therefore, there is still a considerable space to reach the roof of image colorization. In this work, we propose a deep convolutional auto-encoder with special multi-skip connections for image colorization in YUV color space, and the specific contributions or designs of this work are shown as the following five points. First, a given gray image is used as the Y channel to input a deep learning model to predict U and V channel. Second, the adopted encoder-decoder consists of a main path and two branch paths, and the branch path has two skip connection ways that include one shortcut in each three layers and one shortcut in each six layers. Third, the convolutional kernel size is set as 2*2 that is a special consideration in the path of one shortcut in each six layers. Fourth, a composite loss function is proposed based on the mean square error and gradient that is defined to calculate the errors between the ground truth and the predicted result. Finally, we also discuss the reasonable network parameters, such as the way of shortcut connection, the convolutional kernel size of shortcut connection, and loss function parameters. Experiments on different image datasets show that the proposed image colorization model is effective, and the scores of the PNSR, RMSE, SSIM, and Pearson correlation coefficient are, respectively, to 27.0595, 0.1311, 0.561, and 0.9771."}}
{"id": "ZLCa0bBOIgt", "cdate": 1675209600000, "mdate": 1683792750241, "content": {"title": "Extending Group Role Assignment With Cooperation and Conflict Factors via KD45 Logic", "abstract": "Group role assignment with cooperation and conflict factors (GRACCFs) is a creative social computing method for team establishment. It can maximize the new team’s performance through role assignment considering potential cooperation or conflict factors among agents. However, this method has two bottlenecks in practical applications. First, in the scenario of establishing a new team from several existing teams, collecting the pertinent cooperation or conflict information encounters challenges. Second, GRACCF merely takes the CCFs as a part of the objective function for team performance, but this will underestimate the CCFs’ impacts on the sustainable development of the team. This article tackles these issues by extending GRACCF from a new viewpoint. It first designs a KD45 logic algorithm based on the KD45 logic system, which can discover the implicit cognitive CCFs through logical inferences with closure calculations. Then, it proposes an original team evaluation method that can help decision-makers determine the weights of team performance and CCFs’ impacts based on their demands. Large-scale simulation experiments indicate that the proposed solution is practicable and robust. The proposed method provides a solid decision-making reference for administrators when establishing a sustainable team."}}
{"id": "BkAb6UCwt1w", "cdate": 1675209600000, "mdate": 1683792750242, "content": {"title": "Refugee Resettlement by Extending Group Multirole Assignment", "abstract": "The World Bank estimates that the number of refugees worldwide will reach 140 million by 2050 due to global warming and local wars. Considering the rapid increase in the number of refugees, an efficient and feasible assignment method is required for refugee resettlement. This article formalizes the refugee resettlement issue using the Environments-Classes, Agents, Roles, Groups, and Objects (E-CARGO) model. A novel solution is designed for Refugee reSettling (RS) by extending the Group MultiRole Assignment (GMRA), which applies the agent stability evaluation method as a feedback mechanism while optimally resettling refugees. With this proposed solution, decision-makers can swiftly resettle refugees from multiple suffering countries while appropriately ensuring host countries’ benefit. Finally, large-scale simulation experiments based on the Python PuLP platform are carried out to demonstrate the practicability and robustness of the proposed solution. The simulation results provide a solid decision-making reference for the leaders of the world."}}
{"id": "tfMuFQCYxi", "cdate": 1672531200000, "mdate": 1683792750491, "content": {"title": "Understanding and Constructing Latent Modality Structures in Multi-modal Representation Learning", "abstract": "Contrastive loss has been increasingly used in learning representations from multiple modalities. In the limit, the nature of the contrastive loss encourages modalities to exactly match each other in the latent space. Yet it remains an open question how the modality alignment affects the downstream task performance. In this paper, based on an information-theoretic argument, we first prove that exact modality alignment is sub-optimal in general for downstream prediction tasks. Hence we advocate that the key of better performance lies in meaningful latent modality structures instead of perfect modality alignment. To this end, we propose three general approaches to construct latent modality structures. Specifically, we design 1) a deep feature separation loss for intra-modality regularization; 2) a Brownian-bridge loss for inter-modality regularization; and 3) a geometric consistency loss for both intra- and inter-modality regularization. Extensive experiments are conducted on two popular multi-modal representation learning frameworks: the CLIP-based two-tower model and the ALBEF-based fusion model. We test our model on a variety of tasks including zero/few-shot image classification, image-text retrieval, visual question answering, visual reasoning, and visual entailment. Our method achieves consistent improvements over existing methods, demonstrating the effectiveness and generalizability of our proposed approach on latent modality structure regularization."}}
{"id": "o7YFfWnGxps", "cdate": 1672531200000, "mdate": 1683792603062, "content": {"title": "F-UNet++: Remote Sensing Image Fusion Based on Multipurpose Adaptive Shuffle Attention and Composite Multi-Input Reconstruction Network", "abstract": "The fusion of multispectral (MS) and panchromatic (PAN) images is of great significance for the construction of high-resolution remote sensing images. Because of differences in sensors, no single MS or PAN image can express the complete information of a scene. Therefore, it is a key issue to fuse MS images containing rich spectral content and PAN images with spatial information to construct a high-resolution MS image. In this work, an adaptive shuffle attention (ASA) module and an optimized UNet++ are combined in a fusion-UNet++ (F-UNet++) framework for the problem of MS and PAN image fusion. This ASA module can focus on important information in the mixed domain and adjust the dimensions of tensors. F-UNet++ includes a multiscale feature extraction module, multiscale feature fusion module, and image reconstruction module. The multiscale feature extraction module obtains spectral and spatial information, the multiscale feature fusion module fuses spectral and spatial information, and a composite multi-input image reconstruction module (CMI-UNet++) reconstructs the final image. By combining the ASA attention module, the loss of feature information can be reduced to enhance the fidelity of the spectral and spatial information of the fused image. Experiments show that F-UNet++ is qualitatively and quantitatively superior to current image fusion methods. (The code is available at <uri xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">https://github.com/Josephing/F-UNet</uri> )."}}
{"id": "JrmcMGEd33", "cdate": 1672531200000, "mdate": 1683792750232, "content": {"title": "Active Pose Relocalization for Intelligent Substation Inspection Robot", "abstract": "Intelligent inspection robots widely applied in substations are required to capture the inspection image consistent with the calibration image during routine inspection of electrical equipment. However, it is a challenging work for the inspection robot to capture the inspection image meeting the requirement due to navigation error and mechanical wear. To address this problem, an active pose relocalization (APR) method is proposed in this article. Specifically, an error model describing the relationship between the pixel error in the image plane and the robot pose error is established. Then, a decoupling three-stage proportional–integral control strategy based on the error model is provided to relocate the robot to the calibration pose, wherein, a translation error estimation algorithm based on homography transformation is proposed to compute the absolute translation scale between calibration and inspection poses, which avoid the degradation problem of the classic 2-D–2-D pose estimation algorithm. Finally, the performance of the proposed APR method is demonstrated through comparative relocalization experiments of ten calibration points in virtual and real-world environments, respectively."}}
{"id": "5Lbf0_5yftQ", "cdate": 1669852800000, "mdate": 1683792605802, "content": {"title": "MPFINet: A Multilevel Parallel Feature Injection Network for Panchromatic and Multispectral Image Fusion", "abstract": "The fusion of a high-spatial-resolution panchromatic (PAN) image and a corresponding low-resolution multispectral (MS) image can yield a high-resolution multispectral (HRMS) image, which is also known as pansharpening. Most previous methods based on convolutional neural networks (CNNs) have achieved remarkable results. However, information of different scales has not been fully mined and utilized, and still produces spectral and spatial distortion. In this work, we propose a multilevel parallel feature injection network that contains three scale levels and two parallel branches. In the feature extraction branch, a multi-scale perception dynamic convolution dense block is proposed to adaptively extract the spatial and spectral information. Then, the sufficient multilevel features are injected into the image reconstruction branch, and an attention fusion module based on the spectral dimension is designed in order to fuse shallow contextual features and deep semantic features. In the image reconstruction branch, cascaded transformer blocks are employed to capture the similarities among the spectral bands of the MS image. Extensive experiments are conducted on the QuickBird and WorldView-3 datasets to demonstrate that MPFINet achieves significant improvement over several state-of-the-art methods on both spatial and spectral quality assessments."}}
{"id": "yhYO0XgMqaO", "cdate": 1648771200000, "mdate": 1683792750498, "content": {"title": "Two delayed commensalism models with noise coupling and interval biological parameters", "abstract": "In this contribution, two delayed commensalism models with noise coupling and interval biological parameters are constructed, in which the positive and negative intrinsic growth rates of commensal species are respectively considered. Two sets of sufficient conditions for the persistence and extinction of each species are obtained as well as the existence of a unique ergodic stationary distribution and three pathwise estimations of the solutions. Meticulous numerical simulations are performed to validate our theoretical analysis in detail. The effects of white noises, imprecise biological parameters and delay on the above long-time behaviors are also revealed."}}
{"id": "uz6iegblyQK", "cdate": 1640995200000, "mdate": 1683792604425, "content": {"title": "CASR-Net: A color-aware super-resolution network for panchromatic image", "abstract": ""}}
{"id": "toKjzvSmhxR", "cdate": 1640995200000, "mdate": 1683792751079, "content": {"title": "Quasi Group Role Assignment With Role Awareness in Self-Service Spatiotemporal Crowdsourcing", "abstract": "Self-service spatiotemporal crowdsourcing (SSC), a booming variant of spatiotemporal crowdsourcing (SC), emerges because of the vigorous development of the mobile Internet. Unlike the conventional SCs, the particularity of self-service in SSC may lead to unfinished tasks at the end of the entire assignment process, making a one-time assignment scheme ineffective. SSC is essentially an adaptive collaboration (AC) problem that requires a dynamic assignment strategy for a higher task completion rate. This article tackles this issue by establishing a quasi group role assignment (QGRA) based on a typical SSC scenario, that is, the photographing to make money problem (PMMP). First, it sheds light on a novel role awareness method, which can effectively divide tasks to accelerate the solution while, to some extent, raising the task completion rate. Second, it specifies an agent satisfaction evaluation (ASE) method to quantify the relationship between task completion rate and workers’ satisfaction. This method aims at considerably ameliorating task completion rate. Last, it extends QGRA with a new AC algorithm, which can achieve AC of the workers while accomplishing the crowdsourcing task. Moreover, utilizing the ASE method can help decision-makers balance the task completion rate and the workers’ satisfaction. Large-scale simulation experiments based on the real crowdsourced datasets exemplify the robustness and practicability of the proposed solutions. This article contributes a new version of the group role assignment (GRA) model, that is, quasi GRA (QGRA), a creative formalization to solve the AC problem."}}
