{"id": "ncXarHgImj", "cdate": 1683886362932, "mdate": null, "content": {"title": "A Study of Neural Collapse Phenomenon: Grassmannian Frame, Symmetry and Generalization", "abstract": "In this paper, we extend original Neural Collapse Phenomenon by proving Generalized Neural Collapse hypothesis. We obtain Grassmannian Frame structure from the optimization and generalization of classification. This structure maximally separates features of every two classes on a sphere and does not require a larger feature dimension than the number of classes. Out of curiosity about the symmetry of Grassmannian Frame, we conduct experiments to explore if models with different Grassmannian Frames have different performance. As a result, we discover the Symmetric Generalization phenomenon. We provide a theorem to explain Symmetric Generalization of permutation. However, the question of why different directions of features can lead to such different generalization is still open for future investigation."}}
{"id": "dTgxiMW6wr0", "cdate": 1683886065177, "mdate": 1683886065177, "content": {"title": "Feature Directions Matters: Long-Tailed Learning via Rotated Balanced Representation", "abstract": "Long-tailed learning is one of the most challenging problems in visual recognition. There are some studies aiming to solve long-tailed classification from the perspective of feature learning. Recent work proposes to learn the balanced representation by fixing the linear classifier as Equiangular Tight Frame (ETF), since they argue what matters in classification is the structure of the feature, instead of their directions. Holding a different view, in this paper, we show that features with fixed directions may be harmful to the generalization of models, even if it is completely symmetric. To avoid this issue, we propose Representation-Balanced Learning Framework (RBL), which introduces orthogonal matrices to learn directions while maintaining the geometric structure of ETF. Theoretically, our contributions are two-fold: 1). we point out that the feature learning of RBL is insensitive toward training set label distribution, it always learns a balanced representation space. 2). we provide a generalization analysis of proposed RBL through training stability. To analyze the stability of the parameter with orthogonal constraint, we propose a novel training stability analysis paradigm, Two-Parameter Model Stability. Practically, our method is extremely simple in implementation but shows great superiority on several benchmark datasets.\n"}}
{"id": "V_AzkgoXB5", "cdate": 1683880807837, "mdate": null, "content": {"title": "Towards Decision-Friendly AUC: Learning Multi-Classifier with AUCµ ", "abstract": "Area Under the ROC Curve (AUC) is a widely used ranking metric in imbalanced learning due to its insensitivity to label distributions. As a well-known multiclass extension of AUC, Multiclass AUC (MAUC, a.k.a. M-metric) measures the average AUC of multiple binary classifiers. In this paper, we argue that simply optimizing MAUC is far from enough for imbalanced multi-classification. More precisely, MAUC only focuses on learning scoring functions via ranking optimization, while leaving the decision process unconsidered. Therefore, scoring functions being able to make good decisions might suffer from low performance in terms of MAUC. To overcome this issue, we turn to explore AUCµ, another multiclass variant of AUC, which further takes the decision process into consideration. Motivated by this fact, we propose a surrogate risk optimization framework to improve model performance from the perspective of AUCµ. Practically, we propose a two-stage training framework for multi-classification, where at the first stage a scoring function is learned maximizing AUCµ, and at the second stage we seek for a decision function to improve the F1-metric via our proposed soft F1. Theoretically, we first provide sufficient conditions that optimizing the surrogate losses could lead to the Bayes optimal scoring function. Afterward, we show that the proposed surrogate risk enjoys a generalization bound in order of $\\mathcal{O}(1 / \\sqrt{N})$. Experimental results on four benchmark datasets demonstrate the effectiveness of our proposed method in both AUCµ and F1-metric."}}
{"id": "zFwbM5ro5xK", "cdate": 1680307200000, "mdate": 1681657964841, "content": {"title": "A Tale of HodgeRank and Spectral Method: Target Attack Against Rank Aggregation is the Fixed Point of Adversarial Game", "abstract": "Rank aggregation with pairwise comparisons has shown promising results in elections, sports competitions, recommendations, and information retrieval. However, little attention has been paid to the security issue of such algorithms, in contrast to numerous research work on the computational and statistical characteristics. Driven by huge profit, the potential adversary has strong motivation and incentives to manipulate the ranking list. Meanwhile, the intrinsic vulnerability of the rank aggregation methods is not well studied in the literature. To fully understand the possible risks, we focus on the purposeful adversary who desires to designate the aggregated results by modifying the pairwise data in this paper. From the perspective of the dynamical system, the attack behavior with a target ranking list is a fixed point belonging to the composition of the adversary and the victim. To perform the targeted attack, we formulate the interaction between the adversary and the victim as a game-theoretic framework consisting of two continuous operators while Nash equilibrium is established. Then two procedures against HodgeRank and RankCentrality are constructed to produce the modification of the original data. Furthermore, we prove that the victims will produce the target ranking list once the adversary masters the complete information. It is noteworthy that the proposed methods allow the adversary only to hold incomplete information or imperfect feedback and perform the purposeful attack. The effectiveness of the suggested target attack strategies is demonstrated by a series of toy simulations and several real-world data experiments. These experimental results show that the proposed methods could achieve the attacker's goal in the sense that the leading candidate of the perturbed ranking list is the designated one by the adversary."}}
{"id": "BHdCzHGfV6m", "cdate": 1680307200000, "mdate": 1681657964716, "content": {"title": "Optimizing Partial Area Under the Top-k Curve: Theory and Practice", "abstract": "Top- <inline-formula><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> error has become a popular metric for large-scale classification benchmarks due to the inevitable semantic ambiguity among classes. Existing literature on top- <inline-formula><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> optimization generally focuses on the optimization method of the top- <inline-formula><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> objective, while ignoring the limitations of the metric itself. In this paper, we point out that the top- <inline-formula><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> objective lacks enough discrimination such that the induced predictions may give a totally irrelevant label a top rank. To fix this issue, we develop a novel metric named partial Area Under the top- <inline-formula><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> Curve (AUTKC). Theoretical analysis shows that AUTKC has a better discrimination ability, and its Bayes optimal score function could give a correct top- <inline-formula><tex-math notation=\"LaTeX\">$K$</tex-math></inline-formula> ranking with respect to the conditional probability. This shows that AUTKC does not allow irrelevant labels to appear in the top list. Furthermore, we present an empirical surrogate risk minimization framework to optimize the proposed metric. Theoretically, we present (1) a sufficient condition for Fisher consistency of the Bayes optimal score function; (2) a generalization upper bound which is insensitive to the number of classes under a simple hyperparameter setting. Finally, the experimental results on four benchmark datasets validate the effectiveness of our proposed framework."}}
{"id": "iCowHnjqPI", "cdate": 1679900649341, "mdate": 1679900649341, "content": {"title": "A Tale of HodgeRank and Spectral Method: Target Attack Against Rank Aggregation is the Fixed Point of Adversarial Game", "abstract": "Rank aggregation with pairwise comparisons has shown promising results in elections, sports competitions, recommendations, and information retrieval. However, little attention has been paid to the security issue of such algorithms, in contrast to numerous research work on the computational and statistical characteristics. Driven by huge profit, the potential adversary has strong motivation and incentives to manipulate the ranking list. Meanwhile, the intrinsic vulnerability of the rank aggregation methods is not well studied in the literature. To fully understand the possible risks, we focus on the purposeful adversary who desires to designate the aggregated results by modifying the pairwise data in this paper. From the perspective of the dynamical system, the attack behavior with a target ranking list is a fixed point belonging to the composition of the adversary and the victim. To perform the targeted attack, we formulate the interaction between the adversary and the victim as a game-theoretic framework consisting of two continuous operators while Nash equilibrium is established. Then two procedures against HodgeRank and RankCentrality are constructed to produce the modification of the original data. Furthermore, we prove that the victims will produce the target ranking list once the adversary masters the complete information. It is noteworthy that the proposed methods allow the adversary only to hold incomplete information or imperfect feedback and perform the purposeful attack. The effectiveness of the suggested target attack strategies is demonstrated by a series of toy simulations and several real-world data experiments. These experimental results show that the proposed methods could achieve the attacker's goal in the sense that the leading candidate of the perturbed ranking list is the designated one by the adversary."}}
{"id": "lttBTwHp58b", "cdate": 1672531200000, "mdate": 1681651628271, "content": {"title": "Rethinking Collaborative Metric Learning: Toward an Efficient Alternative Without Negative Sampling", "abstract": ""}}
{"id": "2ilPqCU1Hy", "cdate": 1668690889293, "mdate": 1668690889293, "content": {"title": "Confederated Learning: Going Beyond Centralization", "abstract": "Traditional machine learning implicitly assumes that a single entity (e.g., a person or an organization) could complete all the jobs of the whole learning process: data collection, algorithm design, parameter selection, and model evaluation. However, many practical scenarios require cooperation among entities, and existing paradigms fail to meet cost, privacy, or security requirements and so on. In this paper, we consider a generalized paradigm: different roles are granted multiple permissions to complete their corresponding jobs, called Confederated Learning. Systematic analysis shows that confederated learning generalizes traditional machine learning and the existing distributed paradigms like federation learning. Then, we study an application scenario of confederated learning which could inspire future research in the context of cooperation between different entities. Three methods are proposed as the first trial for the cooperated learning under restricted conditions. Empirical results on three datasets validate the effectiveness of the proposed methods."}}
{"id": "dE463Vrvjcg", "cdate": 1668690792105, "mdate": 1668690792105, "content": {"title": "Quaternion Ordinal Embedding", "abstract": "Ordinal embedding (OE) aims to project objects\ninto a low-dimensional space while preserving their\nordinal constraints as well as possible. Generally\nspeaking, a reasonable OE algorithm should simultaneously capture a) semantic meaning and b) the\nordinal relationship of the objects. However, most\nof the existing methods merely focus on b). To address this issue, our goal in this paper is to seek a\ngeneric OE method to embrace the two features simultaneously. We argue that different dimensions\nof vector-based embedding are naturally entangled\nwith each other. To realize a), we expect to decompose the D dimensional embedding space into D\ndifferent semantic subspaces, where each subspace\nis associated with a matrix representation. Unfortunately, introducing a matrix-based representation\nrequires far more complex parametric space than\nits vector-based counterparts. Thanks to the algebraic property of quaternions, we are able to find\na more efficient way to represent a matrix with\nquaternions. For b), inspired by the classic chordal\nGrassmannian distance, a new distance function is\ndefined to measure the distance between different\nquaternions/matrices, on top of which we construct\na generic OE loss function. Experimental results\nfor different tasks on both simulated and real-world\ndatasets verify the effectiveness of our proposed\nmethod."}}
{"id": "6lUtWdh36d", "cdate": 1668690620118, "mdate": 1668690620118, "content": {"title": "A Tale of HodgeRank and Spectral Method: Target Attack Against Rank Aggregation is the Fixed Point of Adversarial Game", "abstract": "Rank aggregation with pairwise comparisons has shown promising results in elections, sports competitions, recommendations, and information retrieval. However, little attention has been paid to the security issue of such algorithms, in contrast to numerous research work on the computational and statistical characteristics. Driven by huge profit, the potential adversary has strong motivation and incentives to manipulate the ranking list. Meanwhile, the intrinsic vulnerability of the rank aggregation methods is not well studied in the literature. To fully understand the possible risks, we focus on the purposeful adversary who desires to designate the aggregated results by modifying the pairwise data in this paper. From the perspective of the dynamical system, the attack behavior with a target ranking list is a fixed point belonging to the composition of the adversary and the victim. To perform the targeted attack, we formulate the interaction between the adversary and the victim as a game-theoretic framework consisting of two continuous operators while Nash equilibrium is established. Then two procedures against HodgeRank and RankCentrality are constructed to produce the modification of the original data. Furthermore, we prove that the victims will produce the target ranking list once the adversary masters the complete information. It is noteworthy that the proposed methods allow the adversary only to hold incomplete information or imperfect feedback and perform the purposeful attack. The effectiveness of the suggested target attack strategies is demonstrated by a series of toy simulations and several real-world data experiments. These experimental results show that the proposed methods could achieve the attacker’s goal in the sense that the leading candidate of the perturbed ranking list is the designated one by the adversary."}}
