{"id": "mDmY4jTW3-", "cdate": 1696118400000, "mdate": 1699202036351, "content": {"title": "Stopping-Time Control of Multiple Smart Sensors Based on Tradeoffs Between Sensing Accuracy and Energy Consumption While Maintaining Energy Consumption Balance", "abstract": "This paper considers the stopping-time control of multiple smart sensors which independently sample the physical parameter of interests and request the desired data from the common server with probabilities. More samples may lead to higher sensing accuracy but cost more energy. More requests may facilitate the smart sensors to obtain the desired data with higher probability while yet cost more energy. Meanwhile, the heterogeneities of smart sensors issuing the requests may lead to early energy exhaustion for some smart sensors. Therefore, how to make an optimal tradeoff between sensing accuracy and energy consumption while keeping the energy consumption balance arises as an interesting problem. To address this issue, this paper first formulates the stopping-time control policy of an individual smart sensor as a partially observable Markov decision process (POMDP), then coordinates the stopping-time control policies of multiple smart sensors within a noncooperative game (NCG), and finally proposes a noncooperative PODMP game-based algorithm to make the above tradeoff. Theoretical analysis and field experiments jointly document the performance. Note to Practitioners—This paper addresses the interesting tradeoff between sensing accuracy and energy cost while balancing the energy consumption in a sensor network that operates in the environments where the available energy is limited and the early energy exhaustion for some of the smart sensors should be avoided. It helps to improve the operation efficiency of the sensor network with multiple smart sensors and a shared server setting in the area of Internet of Things (IoT) or Cyber-Physical Systems (CPS) to minimize the estimation error, while keeping the accumulative energy cost within a range and balancing the energy consumption. Field experimental investigations show that the solution proposed here outperforms existing solutions."}}
{"id": "qdjRlcbv69", "cdate": 1688169600000, "mdate": 1699202036419, "content": {"title": "A Learning-Based Method for Computing Control Barrier Functions of Nonlinear Systems With Control Constraints", "abstract": "Verifying the safety of states and designing a safety controller are very important for safety critical systems (for example, robotic and automotive systems). Since the reachable set of a state is hard to calculate online, it is difficult to determine whether the current state will enter the unsafe set in the future. Thus, the safe set of a system is usually obtained by calculating the forward invariant set offline. For control affine systems, the control barrier function provides a linear safety constraint on the control, which helps us obtain safety control online. However, the computation of control barrier functions is recognized as difficult, and existing methods make over-approximations or are only applicable to problems without control constraints. In this letter, we propose a learning-based method to compute the control barrier function for nonlinear control affine systems with control constraints. The method consists of a constraint satisfaction (CS) algorithm and a set expansion (SE) algorithm. The CS algorithm computes the control barrier function that satisfies the constraints, and the SE algorithm expands the volume of the safe set. The numerical results demonstrate that our algorithm outperforms existing methods and can improve existing control barrier functions."}}
{"id": "aN7gWQdkWQd", "cdate": 1685577600000, "mdate": 1699202036349, "content": {"title": "A Warm-Start Strategy in Interior Point Methods for Shrinking Horizon Model Predictive Control With Variable Discretization Step", "abstract": "In this article, we present a warm-start point algorithm in interior point methods for shrinking horizon model predictive control with a variable discretization step. In the algorithm, a convex combination of components of the earlier optimal solution is used to construct an interpolation point, and we use the convex combination of the modified interpolation point and the cold-start point to obtain a warm-start point. We prove that the worst-case iteration complexity of our strategy is better than that of the cold-start. In the numerical experiment of fuel-optimal planetary powered-descent guidance problems, our strategy reduces the number of iterations of second-order cone programming by about 80% with the number of samples available in practical applications."}}
{"id": "pX1pwcrJEj", "cdate": 1680307200000, "mdate": 1699202036376, "content": {"title": "Optimal Task-Offloading Control for Edge Computing System With Tasks Offloaded and Computed in Sequence", "abstract": "This paper considers the edge computing system (ECS) in which the tasks with dependencies are offloaded and computed in sequence. Different task-offloading orderings come with different ECS memory-cache execution latency (EMCEL) which is caused by writing and reading (WR) the computed results of earlier offloaded tasks between the ECS memory and cache. Therefore, the optimal ordering to offload all the tasks while leading to the minimum EMCEL arises as an interesting issue in practice. This requires to solve a hard exponential explosion optimization problem. To address this issue, this paper first formulates the tasks and their dependencies as a direct acyclic graph (DAG), then converts the exponential explosion problem into a discrete problem that can be solved in polynomial time, and finally develops some theoretical conditions to guide to determine the optimal task-offloading orderings. A novel algorithm called OTOOA to find the optimal task-offloading orderings in polynomial time is proposed. Field experiments show that OTOOA outperforms the existing algorithms. To our best knowledge, this is the initial work towards this issue. Note to Practitioners—For the edge computing system that operates in the application scenarios in which the ECS cache is small while the size of the tasks is relatively large such that it is not allowed for multiple tasks to be processed in the ECS cache parallelly or at the same time, e.g., the execution latency-sensitive and fast big data-processing scenarios in which the multiple tasks depending on the other are offloaded and computed in sequence, this paper helps such edge computing system to improve the operation efficiency with the minimum EMCEL by finding an optimal task-offloading ordering to guide the wireless devices to offload their tasks to the ECS server. Experimental investigations show that the solution proposed here outperforms existing ones."}}
{"id": "AEPdstBE5i", "cdate": 1680307200000, "mdate": 1699202036419, "content": {"title": "Optimal Control of Wireless Powered Edge Computing System for Balance Between Computation Rate and Energy Harvested", "abstract": "Wireless powered edge computing system (WPECS) enhances the computing power and extends the lifetime of wireless devices (WDs). This paper studies the WPECS with multiple WDs, in which the access point (AP) provides some transmission channels which differ from each other in the channel gain, and the WD powered through the wireless power transfer (WPT) technology has some indivisible tasks and adopts binary task-offloading actions. More energy harvested strengthens the WDs with more computing power, while corresponding to more energy consumption. Therefore, how to make the optimal tradeoff between computation rate and energy harvested arises as an interesting issue. To address this issue, this paper first formulates the switch process of transmission channel as a constrained Markov decision process (CMDP), and then proposed an effective algorithm to maximize the sum of computation rates of all WDs in terms of task data bits computed, within the required level of accumulative energy harvested. Theoretical analysis, simulations and field experiments jointly document and illustrate its performance. Note to Practitioners—This paper addresses the interesting tradeoff between computation rate and energy harvested in a wireless powered edge computing system that operates in the environments with limited available energy. It helps to improve the operation efficiency of the edge computing systems in the area of Internet of Things (IoT) or Cyber-Physical Systems (CPS) that employ wireless power transfer technology to power the wireless devices through the access point over the air to maximize the sum of computations rates of all WDs in terms of task data bits computed, while keeping the accumulative energy harvested within a range. Simulations and experimental investigations show that the solution proposed here outperforms existing solutions."}}
{"id": "rhbl04PGSG", "cdate": 1677628800000, "mdate": 1699202036418, "content": {"title": "Distributed Relative Localization Algorithms for Multi-Robot Networks: A Survey", "abstract": "For a network of robots working in a specific environment, relative localization among robots is the basis for accomplishing various upper-level tasks. To avoid the latency and fragility of long-range or multi-hop communication, distributed relative localization algorithms, in which robots take local measurements and calculate localizations and poses relative to their neighbors distributively, are highly desired. Distributed relative localization has the advantages of a low communication burden and better system robustness but encounters challenges in the distributed algorithm design, communication protocol design, local network organization, etc. This paper presents a detailed survey of the key methodologies designed for distributed relative localization for robot networks. We classify the distributed localization algorithms regarding to the types of measurements, i.e., distance-based, bearing-based, and multiple-measurement-fusion-based. The detailed design methodologies, advantages, drawbacks, and application scenarios of different distributed localization algorithms are introduced and summarized. Then, the research works that support distributed localization, including local network organization, communication efficiency, and the robustness of distributed localization algorithms, are surveyed. Finally, popular simulation platforms are summarized and compared in order to facilitate future research and experiments on distributed relative localization algorithms."}}
{"id": "rhcw5iRBUZI", "cdate": 1672531200000, "mdate": 1699202036497, "content": {"title": "Mean-Semivariance Policy Optimization via Risk-Averse Reinforcement Learning (Extended Abstract)", "abstract": "Keeping risk under control is often more crucial than maximizing expected rewards in real-world decision-making situations, such as finance, robotics, autonomous driving, etc. The most natural choice of risk measures is variance, while it penalizes the upside volatility as much as the downside part. Instead, the (downside) semivariance, which captures negative deviation of a random variable under its mean, is more suitable for risk-averse proposes. This paper aims at optimizing the mean-semivariance (MSV) criterion in reinforcement learning w.r.t. steady reward distribution. Since semivariance is time-inconsistent and does not satisfy the standard Bellman equation, the traditional dynamic programming methods are inapplicable to MSV problems directly. To tackle this challenge, we resort to Perturbation Analysis (PA) theory and establish the performance difference formula for MSV. We reveal that the MSV problem can be solved by iteratively solving a sequence of RL problems with a policy-dependent reward function. Further, we propose two on-policy algorithms based on the policy gradient theory and the trust region method. Finally, we conduct diverse experiments from simple bandit problems to continuous control tasks in MuJoCo, which demonstrate the effectiveness of our proposed methods."}}
{"id": "ixc64KDmgH", "cdate": 1672531200000, "mdate": 1699202036492, "content": {"title": "Learning Diverse Risk Preferences in Population-based Self-play", "abstract": "Among the great successes of Reinforcement Learning (RL), self-play algorithms play an essential role in solving competitive games. Current self-play algorithms optimize the agent to maximize expected win-rates against its current or historical copies, making it often stuck in the local optimum and its strategy style simple and homogeneous. A possible solution is to improve the diversity of policies, which helps the agent break the stalemate and enhances its robustness when facing different opponents. However, enhancing diversity in the self-play algorithms is not trivial. In this paper, we aim to introduce diversity from the perspective that agents could have diverse risk preferences in the face of uncertainty. Specifically, we design a novel reinforcement learning algorithm called Risk-sensitive Proximal Policy Optimization (RPPO), which smoothly interpolates between worst-case and best-case policy learning and allows for policy learning with desired risk preferences. Seamlessly integrating RPPO with population-based self-play, agents in the population optimize dynamic risk-sensitive objectives with experiences from playing against diverse opponents. Empirical results show that our method achieves comparable or superior performance in competitive games and that diverse modes of behaviors emerge. Our code is public online at \\url{https://github.com/Jackory/RPBT}."}}
{"id": "ftpV4blzD_", "cdate": 1672531200000, "mdate": 1699202036417, "content": {"title": "Efficient Policy Transfer in Large-Scale Traffic Light Control via Multi-Agent Hierarchical Reinforcement Learning", "abstract": "Multi-agent reinforcement learning (MARL) is increasingly being used for traffic light control in traffic networks. However, applying MARL to large-scale traffic light control faces challenges due to the time-consuming and resource-intensive nature of learning in such environments. This paper addresses this challenge by leveraging transfer learning, utilizing policies trained in small-scale environments to effectively control large-scale traffic light systems. To enhance the zero-shot transferability of trained policies, we introduce communication channels and sub-task decomposition, while ensuring transferability by sharing all neural network parameters. In our experiments, we assess the zero-shot transferability of policies trained in different small-scale traffic networks, both with and without sub-task decomposition. The results demonstrate the significance of establishing a hierarchical structure through sub-task decomposition for zero-shot transfer."}}
{"id": "UntUm2il-i", "cdate": 1672531200000, "mdate": 1699202036340, "content": {"title": "Joint Optimization and Learning Approach for Smart Operation of Hydrogen-Based Building Energy Systems", "abstract": "In recent years, hydrogen-based multi-energy systems (HMESs) have received wide attention. However, existing works on the optimal operation of HMESs neglect building thermal dynamics, which means that the flexibility of thermal loads can not be utilized for reducing system operation cost. In this paper, we investigate an optimal operation problem of an HMES with the consideration of building thermal dynamics. Specifically, we first formulate an expected operational cost minimization problem related to an HMES. Due to the existence of uncertain parameters, inexplicit building thermal dynamics models, spatially and temporally coupled operational constraints, and nonlinear constraints, it is challenging to solve the formulated problem. Then, we propose an algorithm to solve the problem based on model-based optimization and data-driven based learning. The key idea of the proposed algorithm is summarized as follows: (1) transforming the long-term cost minimization problem into several single-slot subproblems using Lyapunov optimization techniques; (2) dividing each single-slot subproblem into two parts according to the availability of model information; (3) solving one part based on convex optimization and solving another part using multi-agent attention-based deep deterministic policy gradient. Simulation results based on real-world traces show the effectiveness of the proposed algorithm."}}
