{"id": "6ZajpxqTlQ", "cdate": 1663849986488, "mdate": null, "content": {"title": "Generalize Learned Heuristics to Solve Large-scale Vehicle Routing Problems in Real-time", "abstract": "Large-scale Vehicle Routing Problems (VRPs) are widely used in logistics, transportation, supply chain, and robotic systems. Recently, data-driven VRP heuristics are proposed to generate real-time VRP solutions with up to 100 nodes. Despite this progress, current heuristics for large-scale VRPs still face three major challenges: 1) Difficulty in generalizing the heuristics learned on small-scale VRPs to large-scale VRPs without retraining; 2) Challenge in generating real-time solutions for large-scale VRPs; 3) Difficulty in embedding global constraints into learned heuristics. We contribute in the three directions: We propose a Two-stage Divide Method (TAM) to generate sub-route sequence rather than node sequence for generalizing the heuristics learned on small-scale VRPs to solve large-scale VRPs in real-time. A  two-step reinforcement learning method with new reward and padding techniques is proposed to train our TAM.  A global mask function is proposed to keep the global constraints satisfied when dividing a large-scale VRP into several small-scale Traveling Salesman Problems (TSPs). As result, we can solve the small-scale TSPs in parallel quickly. The experiments on synthetic and real-world large-scale VRPs show our method could generalize the learned heuristics trained on datasets of VRP 100 to solve VRPs with over 5000 nodes in real-time while keeping the solution quality better than data-driven heuristics and competitive with traditional heuristics."}}
{"id": "TDt2qocXF59", "cdate": 1640995200000, "mdate": 1681662867530, "content": {"title": "Analytical Adequacy Evaluation for Power Consumers With UPS in Distribution Networks", "abstract": "An uninterruptible power supply (UPS) can reduce power failure loss by responding to power demand during distribution network failures. For reliability-sensitive power consumers, deploying UPSs is a solution for improving power supply reliability. Nevertheless, because of UPS devices’ energy limits and potential failure probability, power consumers with UPSs cannot guarantee 100% adequacy. In future power systems with frequent reconfiguration and massive storage facilities, the power supply adequacy of a consumer with respect to the network configuration and the storage capacity will need to be frequently evaluated. Furthermore, the analytical formulation of a consumer with a UPS should be investigated since the simulation-based method might witness low efficiency and poor convergency. Therefore, this paper proposes a novel analytical availability index calculation framework for adequacy evaluation. The framework models the uncertainties of distribution networks and UPS devices as stochastic processes. Then, the availability index calculation formula is acquired based on the stochastic modeling. Compared with existing methods, this paper incorporates UPS devices’ capacity and characteristics. Moreover, the distribution network configuration and protection device placement are considered. Case studies on an illustrative distribution network, the modified RBTS system, and a real distribution system in China validate the proposed method."}}
{"id": "qPQRIj_Y_EW", "cdate": 1632875483520, "mdate": null, "content": {"title": "Learning to Solve an Order Fulfillment Problem in Milliseconds with Edge-Feature-Embedded Graph Attention", "abstract": "The order fulfillment problem is one of the fundamental combinatorial  optimization problems in supply chain management and it is  required to be solved in real-time for modern online retailing. Such a problem is computationally hard to address by exact mathematical programming methods.  In this paper, we propose a machine learning method to solve it in milliseconds by  formulating a tripartite graph and learning the best assignment policy through the proposed edge-feature-embedded graph attention mechanism. The edge-feature-embedded graph attention considers the high-dimensional edge features and accounts for the heterogeneous information, which are important characteristics of the studied  optimization problem. The model is also size-invariant for problem instances of any scale, and it can address cases that are completely unseen during training. Experiments show that our model substantially outperforms the baseline heuristic method in optimality. The online inference time is milliseconds, which is thousands of times faster than the exact mathematical programming methods."}}
{"id": "byAm9uhltyP", "cdate": 1609459200000, "mdate": 1681662867465, "content": {"title": "Topology and Admittance Estimation: Precision Limits and Algorithms", "abstract": "Distribution grid topology and admittance information are essential for system planning, operation, and protection. In many distribution grids, missing or inaccurate topology and admittance data call for efficient estimation methods. However, measurement data may be insufficient or contaminated with large noise, which will introduce fundamental limits to the estimation accuracy. This work explores the theoretical precision limits of the topology and admittance estimation (TAE) problem, with different measurement devices, noise levels, and the number of measurements. On this basis, we propose a conservative progressive self-adaptive (CPS) algorithm to estimate the topology and admittance. Results on IEEE 33 and 141-bus systems validate that the proposed CPS method can approach the theoretical precision limits under various measurement settings."}}
{"id": "5s3a6DA1nql", "cdate": 1609459200000, "mdate": 1681662867452, "content": {"title": "Evaluating the Dispatchable Capacity of Base Station Backup Batteries in Distribution Networks", "abstract": "Cellular base stations (BSs) are equipped with backup batteries to obtain the uninterruptible power supply (UPS) and maintain the power supply reliability. While maintaining the reliability, the backup batteries of 5G BSs have some spare capacity over time due to the traffic-sensitive characteristic of 5G BS electricity load. Therefore, the spare capacity is dispatchable and can be used as flexibility resources for power systems. This paper evaluates the dispatchable capacity of the BS backup batteries in distribution networks and illustrates how it can be utilized in power systems. The BS reliability model is first established considering potential distribution network interruptions and the effects of backup batteries. Then, the analytical formula of the BS availability index is derived with respect to batteries' backup duration. The dispatchable capacity of BS backup batteries is evaluated in different distribution networks and with differing communication load levels. Furthermore, a potential application, daily operation optimization, is illustrated. Case studies show that the proposed methodology can effectively evaluate the dispatchable capacity and that dispatching the backup batteries can reduce 5G BS electricity bills while satisfying the reliability requirement."}}
{"id": "_fLRjrDf1y", "cdate": 1577836800000, "mdate": 1681662867584, "content": {"title": "Sparse Oblique Decision Tree for Power System Security Rules Extraction and Embedding", "abstract": "Increasing the penetration of variable generation has a substantial effect on the operational reliability of power systems. The higher level of uncertainty that stems from this variability makes it more difficult to determine whether a given operating condition will be secure or insecure. Data-driven techniques provide a promising way to identify security rules that can be embedded in economic dispatch model to keep power system operating states secure. This paper proposes using a sparse weighted oblique decision tree to learn accurate, understandable, and embeddable security rules that are linear and can be extracted as sparse matrices using a recursive algorithm. These matrices can then be easily embedded as security constraints in power system economic dispatch calculations using the Big-M method. Tests on several large datasets with high renewable energy penetration demonstrate the effectiveness of the proposed method. In particular, the sparse weighted oblique decision tree outperforms the state-of-art weighted oblique decision tree while keeping the security rules simple. When embedded in the economic dispatch, these rules significantly increase the percentage of secure states and reduce the average solution time."}}
{"id": "x6qj-hb56N", "cdate": 1546300800000, "mdate": 1681662867535, "content": {"title": "Embedding Lithium-ion Battery Scrapping Criterion and Degradation Model in Optimal Operation of Peak-shaving Energy Storage", "abstract": "Lithium-ion battery systems have been used in practical power systems for peak-shaving, demand response, and frequency regulation. However, a lithium-ion battery is degrading while cycling and would be scrapped when the capacity reduces to a certain threshold (e.g. 80%). Such scrapping criterion may not explore the maximum benefit from the battery storage. In this paper, we propose a novel scrapping criterion for peak-shaving energy storage based on battery efficiency, time-of-use price, and arbitrage benefit. A new battery life model with scrapping parameters is then derived using this criterion. Embedded with the life model, an optimal operation method for peak-shaving energy storage system is presented. The results of case study show that the operation method could maximize the benefits of peak-shaving energy storage while delaying battery degradation. Compared with the traditional 80% capacity-based scrapping criterion, our efficiency-based scrapping criterion can significantly improve the lifetime benefit of the battery."}}
{"id": "iiwWGMzNIc", "cdate": 1546300800000, "mdate": 1681662867535, "content": {"title": "A Linear LMP Model for Active and Reactive Power with Power Loss", "abstract": "Pricing the reactive power is more necessary than ever before because of the increasing challenge of renewable energy integration on reactive power balance and voltage control. However, reactive power price is hard to be efficiently calculated because of the non-linear nature of optimal AC power flow equation. This paper proposes a linear model to calculate active and reactive power LMP simultaneously considering power loss. Firstly, a linearized AC power flow equation is proposed based on an augmented Generation Shift Distribution Factors (GSDF) matrix. Secondly, a linearized LMP model is derived using GSDF and loss factors. The formulation of LMP is further decomposed into four components: energy, congestion, voltage limitation and power loss. Finally, an iterate algorithm is proposed for calculating LMP with the proposed model. The performance of the proposed model is validated by the IEEE-118 bus system."}}
{"id": "OqSKnq0ian", "cdate": 1546300800000, "mdate": 1681662867494, "content": {"title": "Probabilistic duck curve in high PV penetration power system: Concept, modeling, and empirical analysis in China", "abstract": "The high penetration of photovoltaic (PV) is reshaping the electricity net-load curve and has a significant impact on power system operation and planning. The concept of duck curve is widely used to describe the timing imbalance between peak demand and PV generation. The traditional duck curve is deterministic and only shows a single extreme or typical scenario during a day. Thus, it cannot capture both the probability of that scenario and the uncertainty of PV generation and loads. These weaknesses limit the application of the duck curve on power system planning under high PV penetration. To address this issue, the novel concepts of probabilistic duck curve (PDC) and probabilistic ramp curve (PRC) are proposed to accurately model the uncertainty and variability of electricity net load and ramp under high PV penetration. An efficient method is presented for modeling PDC and PRC using kernel density estimation, copula function, and dependent discrete convolution. Several indices are designed to quantify the characteristics of the PDC and PRC. For the application, we demonstrate how the PDC and PRC will benefit flexible resource planning. Finally, an empirical study on the Qinghai provincial power system of China validates the effectiveness of the presented method. The results of PDC and PRC intuitively illustrate that the ramp demand and the valley of net load face considerable uncertainty under high PV penetration. The results of flexible resource planning indicate that retrofitting coal-fired units has remarkable performance on enhancing the power system flexibility in Qinghai. In average, reducing the minimal output of coal-fired units by 1 MW will increase PV accommodation by over 4 MWh each day."}}
