{"id": "34hEdHckfn", "cdate": 1681706279823, "mdate": 1681706279823, "content": {"title": "HypLiLoc: Towards Effective LiDAR Pose Regression with Hyperbolic Fusion", "abstract": "LiDAR relocalization plays a crucial role in many fields, including robotics, autonomous driving, and computer vision. LiDAR-based retrieval from a database typically incurs high computation storage costs and can lead to globally inaccurate pose estimations if the database is too sparse. On the other hand, pose regression methods take images or point clouds as inputs and directly regress global poses in an end-to-end manner. They do not perform database matching and are more computationally efficient than retrieval techniques. We propose HypLiLoc, a new model for LiDAR pose regression. We use two branched backbones to extract 3D features and 2D projection features, respectively. We consider multi-modal feature fusion in both Euclidean and hyperbolic spaces to obtain more effective feature representations. Experimental results indicate that HypLiLoc achieves state-of-the-art performance in both outdoor and indoor datasets. We also conduct extensive ablation studies on the framework design, which demonstrate the effectiveness of multi-modal feature extraction and multi-space embedding. Our code is released at: https://github.com/sijieaaa/HypLiLoc"}}
{"id": "no5rZ5SwHmd", "cdate": 1672531200000, "mdate": 1681650111028, "content": {"title": "Node Embedding from Hamiltonian Information Propagation in Graph Neural Networks", "abstract": ""}}
{"id": "86deEqkasPq", "cdate": 1672531200000, "mdate": 1681705844670, "content": {"title": "The Effective Coverage of Homogeneous Teams with Radial Attenuation Models", "abstract": "For the area coverage (e.g., using a WSN), despite the comprehensive research works on full-plane coverage using a multi-node team equipped with the ideal constant model, only very few works have discussed the coverage of practical models with varying intensity. This paper analyzes the properties of the effective coverage of multi-node teams consisting of a given numbers of nodes. Each node is equipped with a radial attenuation disk model as its individual model of coverage, which conforms to the natural characteristics of devices in the real world. Based on our previous analysis of 2-node teams, the properties of the effective coverage of 3-node and n-node (n≥4) teams in regular geometric formations are analyzed as generalized cases. Numerical analysis and simulations for 3-node and n-node teams (n≥4) are conducted separately. For the 3-node cases, the relations between the side lengths of equilateral triangle formation and the effective coverage of the team equipped with two different types of models are respectively inspected. For the n-node cases (n≥4), the effective coverage of a team in three formations, namely regular polygon, regular star, and equilateral triangular tessellation (for n=6), are investigated. The results can be applied to many scenarios, either dynamic (e.g., robots with sensors) or static, where a team of multiple nodes cooperate to produce a larger effective coverage."}}
{"id": "lhPLT5gnBrH", "cdate": 1663850489751, "mdate": null, "content": {"title": "NEURAL HAMILTONIAN FLOWS IN GRAPH NEURAL NETWORKS", "abstract": "Graph neural networks (GNNs) suffer from oversmoothing and oversquashing problems when node features are updated over too many layers. Embedding spaces can also vary significantly for different data types, leading to the need for different GNN model types. In this paper, we model the embedding of a node feature as a Hamiltonian flow over time. As in physics where Hamiltonian flow conserves the energy over time, its induced GNNs enable a more stable feature updating mechanism. Moreover, since the Hamiltonian flows are defined on a general symplectic manifold, this approach allows us to learn the underlying manifold of the graph in training, in contrast to most of the existing literature that assumes a fixed graph embedding manifold. We test Hamiltonian flows of different forms and demonstrate empirically that our approach achieves better node classification accuracy than popular state-of-the-art GNNs."}}
{"id": "-8tU21J6BcB", "cdate": 1652737707771, "mdate": null, "content": {"title": "On the Robustness of Graph Neural Diffusion to Topology Perturbations", "abstract": "Neural diffusion on graphs is a novel class of graph neural networks that has attracted increasing attention recently. The capability of graph neural partial differential equations (PDEs) in addressing common hurdles of graph neural networks (GNNs), such as the problems of over-smoothing and bottlenecks, has been investigated but not their robustness to adversarial attacks. In this work, we explore the robustness properties of graph neural PDEs. We empirically demonstrate that graph neural PDEs are intrinsically more robust against topology perturbation as compared to other GNNs. We provide insights into this phenomenon by exploiting the stability of the heat semigroup under graph topology perturbations. We discuss various graph diffusion operators and relate them to existing graph neural PDEs. Furthermore, we propose a general graph neural PDE framework based on which a new class of robust GNNs can be defined. We verify that the new model achieves comparable state-of-the-art performance on several benchmark datasets."}}
{"id": "ejJ5Kae2vt0", "cdate": 1640995200000, "mdate": 1681650111164, "content": {"title": "RobustLoc: Robust Camera Pose Regression in Challenging Driving Environments", "abstract": ""}}
{"id": "bcO4QA7Y13", "cdate": 1640995200000, "mdate": 1668763026775, "content": {"title": "On the Robustness of Graph Neural Diffusion to Topology Perturbations", "abstract": "Neural diffusion on graphs is a novel class of graph neural networks that has attracted increasing attention recently. The capability of graph neural partial differential equations (PDEs) in addressing common hurdles of graph neural networks (GNNs), such as the problems of over-smoothing and bottlenecks, has been investigated but not their robustness to adversarial attacks. In this work, we explore the robustness properties of graph neural PDEs. We empirically demonstrate that graph neural PDEs are intrinsically more robust against topology perturbation as compared to other GNNs. We provide insights into this phenomenon by exploiting the stability of the heat semigroup under graph topology perturbations. We discuss various graph diffusion operators and relate them to existing graph neural PDEs. Furthermore, we propose a general graph neural PDE framework based on which a new class of robust GNNs can be defined. We verify that the new model achieves comparable state-of-the-art performance on several benchmark datasets."}}
{"id": "U40XgVxm4H5", "cdate": 1640995200000, "mdate": 1668433732942, "content": {"title": "Location Learning for AVs: LiDAR and Image Landmarks Fusion Localization with Graph Neural Networks", "abstract": "High-accuracy vehicular self-localization plays an important role in autonomous driving. In this paper, we investigate the problem of estimating an autonomous vehicle's location using computer vision and LiDAR information, with respect to (w.r.t.) a reference map composed of landmarks from the environment. The map is generated off-line using static roadside objects such as traffic signs, traffic lights and road-side poles, which are organized into a graph for calibration. We use deep learning techniques to perform automatic feature extraction from sensor measurements. Specifically, we use a Convolutional Neural Network (CNN) to extract features from RGB images captured by an on-vehicle camera and use a Graph Neural Network (GNN) to integrate measurements from LiDAR scans. The vehicle's location is estimated from a regression neural network by comparing the extracted features from the real-time measurements with the calibration landmark map. In our experiments, we perform evaluations using 2 datasets and demonstrate that our approach achieves the state-of-the-art localization accuracy."}}
{"id": "PkfPIDe2CZr", "cdate": 1640995200000, "mdate": 1668433733096, "content": {"title": "Building Facade Parsing R-CNN", "abstract": "Building facade parsing, which predicts pixel-level labels for building facades, has applications in computer vision perception for autonomous vehicle (AV) driving. However, instead of a frontal view, an on-board camera of an AV captures a deformed view of the facade of the buildings on both sides of the road the AV is travelling on, due to the camera perspective. We propose Facade R-CNN, which includes a transconv module, generalized bounding box detection, and convex regularization, to perform parsing of deformed facade views. Experiments demonstrate that Facade R-CNN achieves better performance than the current state-of-the-art facade parsing models, which are primarily developed for frontal views. We also publish a new building facade parsing dataset derived from the Oxford RobotCar dataset, which we call the Oxford RobotCar Facade dataset. This dataset contains 500 street-view images from the Oxford RobotCar dataset augmented with accurate annotations of building facade objects. The published dataset is available at https://github.com/sijieaaa/Oxford-RobotCar-Facade"}}
{"id": "FGGGr4aX9QQ", "cdate": 1640995200000, "mdate": 1668433732921, "content": {"title": "Task Recommendation in Crowdsourcing Based on Learning Preferences and Reliabilities", "abstract": "Workers participating in a crowdsourcing platform can have a wide range of abilities and interests. An important problem in crowdsourcing is the task recommendation problem, in which tasks that best match a particular worker's preferences and reliabilities are recommended to that worker. A task recommendation scheme that assigns tasks more likely to be accepted by a worker who is more likely to complete it reliably results in better performance for the task requester. Without prior information about a worker, his preferences and reliabilities need to be learned over time. In this article, we propose a multi-armed bandit (MAB) framework to learn a worker's preferences and his reliabilities for different categories of tasks. However, unlike the classical MAB problem, the reward from the worker's completion of a task is unobservable. We therefore include the use of gold tasks (i.e., tasks whose solutions are known  <i>a priori</i>  and which do not produce any rewards) in our task recommendation procedure. Our model could be viewed as a new variant of MAB, in which the random rewards can only be observed at those time steps where gold tasks are used, and the accuracy of estimating the expected reward of recommending a task to a worker depends on the number of gold tasks used. We show that the optimal regret is  <inline-formula><tex-math notation=\"LaTeX\">$O(\\sqrt{n})$</tex-math></inline-formula> , where  <inline-formula><tex-math notation=\"LaTeX\">$n$</tex-math></inline-formula>  is the number of tasks recommended to the worker. We develop three task recommendation strategies to determine the number of gold tasks for different task categories, and show that they are order optimal. Simulations verify the efficiency of our approaches."}}
