{"id": "O08VS1aaLGp", "cdate": 1640995200000, "mdate": 1668684367243, "content": {"title": "Real-time Hyperspectral Imaging in Hardware via Trained Metasurface Encoders", "abstract": "Hyperspectral imaging has attracted significant attention to identify spectral signatures for image classification and automated pattern recognition in computer vision. State-of-the-art implementations of snapshot hyperspectral imaging rely on bulky, non-integrated, and expensive optical elements, including lenses, spectrometers, and filters. These macroscopic components do not allow fast data processing for, e.g real-time and high-resolution videos. This work introduces Hyplex, a new integrated architecture addressing the limitations discussed above. Hyplex is a CMOS-compatible, fast hyperspectral camera that replaces bulk optics with nanoscale metasurfaces inversely designed through artificial intelligence. Hyplex does not require spectrometers but makes use of conventional monochrome cameras, opening up the possibility for real-time and high-resolution hyperspectral imaging at inexpensive costs. Hyplex exploits a model-driven optimization, which connects the physical metasurfaces layer with modern visual computing approaches based on end-to-end training. We design and implement a prototype version of Hyplex and compare its performance against the state-of-the-art for typical imaging tasks such as spectral reconstruction and semantic segmentation. In all benchmarks, Hyplex reports the smallest reconstruction error. We additionally present what is, to the best of our knowledge, the largest publicly available labeled hyperspectral dataset for semantic segmentation."}}
{"id": "9BFnWNm5LQg", "cdate": 1640995200000, "mdate": 1668684367238, "content": {"title": "Real-time Hyperspectral Imaging in Hardware via Trained Metasurface Encoders", "abstract": "Hyperspectral imaging has attracted significant attention to identify spectral signatures for image classification and automated pattern recognition in computer vision. State-of-the-art implementations of snapshot hyperspectral imaging rely on bulky, non-integrated, and expensive optical elements, including lenses, spectrometers, and filters. These macroscopic components do not allow fast data processing for, e.g. real-time and high-resolution videos. This work introduces Hyplex™, a new integrated architecture addressing the limitations discussed above. Hyplex™ is a CMOS-compatible, fast hyperspectral camera that replaces bulk optics with nanoscale metasurfaces inversely designed through artificial intelligence. Hyplex™ does not require spectrometers but makes use of conventional monochrome cameras, opening up the possibility for real-time and high-resolution hyperspectral imaging at inexpensive costs. Hyplex™ exploits a model-driven optimization, which connects the physical metasurfaces layer with modern visual computing approaches based on end-to-end training. We design and implement a prototype version of Hyplex™ and compare its performance against the state-of-the-art for typical imaging tasks such as spectral reconstruction and semantic segmentation. In all benchmarks, Hyplex™ reports the smallest reconstruction error. We additionally present what is, to the best of our knowledge, the largest publicly available labeled hyperspectral dataset for semantic segmentation. <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup> <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup> Dataset available on https://github.com/makamoa/hyplex."}}
{"id": "ph2UbUAFEu", "cdate": 1609459200000, "mdate": 1668684367245, "content": {"title": "Robust and Scalable Flat-Optics on Flexible Substrates via Evolutionary Neural Networks", "abstract": "Flexible Flat-Optics This work, presented in article 2100105 by Andrea Fratalocchi and co-workers, implements an artificial intelligent, end-to-end pipeline for the experimental realization of flexi..."}}
{"id": "ixOxOmwnmn", "cdate": 1609459200000, "mdate": 1668684367246, "content": {"title": "Robust and Scalable Flat-Optics on Flexible Substrates via Evolutionary Neural Networks", "abstract": "The main challenge in nanophotonics is obtaining scalable designs that withstand deformations and manufacturing errors originating from nanoscale processing techniques. This problem is severe in flex..."}}
