{"id": "MRzAR7IuFbJF", "cdate": 1600113365100, "mdate": null, "content": {"title": "Randomized intraclass-distance minimizing binary codes for face recognition", "abstract": "A new algorithm for learning binary codes is pre- sented using randomized initial assignments of bit labels to classes followed by iterative refinement to minimize in- traclass Hamming distance. This Randomized Intraclass- Distance Minimizing Binary Codes (RIDMBC) algorithm is introduced in the context of face recognition, an area of bio- metrics where binary codes have rarely been used (unlike iris recognition). A cross-database experiment is presented training RIDMBC on the Labeled Faces in the Wild (LFW) and testing it on the Point-and-Shoot Challenge (PaSC). The RIDMBC algorithm performs better than both PaSC baselines. RIDMBC is compared with the Predictable Dis- criminative Binary Codes (DBC) algorithm developed by Rastegari et al. The DBC algorithm has an upper bound on the number of bits in a binary code; RIDMBC does not. RIDMBC outperforms DBC when using the same bit code length as DBC’s upper bound and RIDMBC further improves when more bits/features are added."}}
{"id": "HJkuUUFXZp4", "cdate": 1600113192100, "mdate": null, "content": {"title": "A Non-Invasive Fetal Electrocardiogram Extraction Algorithm Based on ICA Neural Network", "abstract": "The extraction of fetal electrocardiogram (ECG) from maternal skin electrode measurements is an open problem in recent decades. Many researchers proposed blind source separation (BSS) or Independent Component Analysis (ICA) based neural network methods to address this problem. However, by these methods all of the source signals are simultaneously separated, but in fact only one source signal is the desired FECG and others are unwanted ones. In contrast, blind source extraction (BSE) only outputs a single source and is closely related to BSS, which is obviously a better choice. In this paper, we propose a non-invasive extraction algorithm based on ICA neural network that can extract the desired FECG with little noise as the first extracted signal. The algorithm is very robust to outliers. The real-data world has shown that the algorithm can achieve satisfying results."}}
{"id": "z-ZuJwA6NRQ", "cdate": 1600112479607, "mdate": null, "content": {"title": "Semi-Nonnegative Matrix Factorization for Motion Segmentation with Missing Data", "abstract": "Motion segmentation is an old problem that is receiving re- newed interest because of its role in video analysis. In this paper, we present a Semi-Nonnegative Matrix Factorization (SNMF)method that models dense point tracks in terms of their optical flow, and decomposes sets of point tracks into semantically meaningful motion components. We show that this formulation of SNMF with missing values outperforms the state-of-the-art algorithm of Brox and Malik in terms of accuracy on 10- frame video segments from the Berkeley test set, while being over 100 times faster. We then show how SNMF can be applied to longer videos using sliding windows. The result is competitive in terms of accuracy with Brox and Malik’s algorithm, while still being two orders of magni- tude faster"}}
