{"id": "cyxmPFDyCg", "cdate": 1672531200000, "mdate": 1672030536072, "content": {"title": "Tight FPT approximation for constrained k-center and k-supplier", "abstract": ""}}
{"id": "Mwid7dITWg", "cdate": 1640995200000, "mdate": 1672030536075, "content": {"title": "On the k-means/median cost function", "abstract": ""}}
{"id": "gISk6JBNKL", "cdate": 1609459200000, "mdate": 1672030536072, "content": {"title": "Hardness of Approximation for Euclidean k-Median", "abstract": "The Euclidean k-median problem is defined in the following manner: given a set 𝒳 of n points in d-dimensional Euclidean space ℝ^d, and an integer k, find a set C ⊂ ℝ^d of k points (called centers) such that the cost function Φ(C,𝒳) ≡ ∑_{x ∈ 𝒳} min_{c ∈ C} ‖x-c‖₂ is minimized. The Euclidean k-means problem is defined similarly by replacing the distance with squared Euclidean distance in the cost function. Various hardness of approximation results are known for the Euclidean k-means problem [Pranjal Awasthi et al., 2015; Euiwoong Lee et al., 2017; Vincent Cohen{-}Addad and {Karthik {C. S.}}, 2019]. However, no hardness of approximation result was known for the Euclidean k-median problem. In this work, assuming the unique games conjecture (UGC), we provide the hardness of approximation result for the Euclidean k-median problem in O(log k) dimensional space. This solves an open question posed explicitly in the work of Awasthi et al. [Pranjal Awasthi et al., 2015]. Furthermore, we study the hardness of approximation for the Euclidean k-means/k-median problems in the bi-criteria setting where an algorithm is allowed to choose more than k centers. That is, bi-criteria approximation algorithms are allowed to output β k centers (for constant β > 1) and the approximation ratio is computed with respect to the optimal k-means/k-median cost. We show the hardness of bi-criteria approximation result for the Euclidean k-median problem for any β < 1.015, assuming UGC. We also show a similar hardness of bi-criteria approximation result for the Euclidean k-means problem with a stronger bound of β < 1.28, again assuming UGC."}}
{"id": "ekd_77JYH6", "cdate": 1609459200000, "mdate": 1672030536390, "content": {"title": "FPT Approximation for Socially Fair Clustering", "abstract": "In this work, we study the socially fair $k$-median/$k$-means problem. We are given a set of points $P$ in a metric space $\\mathcal{X}$ with a distance function $d(.,.)$. There are $\\ell$ groups: $P_1,\\dotsc,P_{\\ell} \\subseteq P$. We are also given a set $F$ of feasible centers in $\\mathcal{X}$. The goal in the socially fair $k$-median problem is to find a set $C \\subseteq F$ of $k$ centers that minimizes the maximum average cost over all the groups. That is, find $C$ that minimizes the objective function $\\Phi(C,P) \\equiv \\max_{j} \\Big\\{ \\sum_{x \\in P_j} d(C,x)/|P_j| \\Big\\}$, where $d(C,x)$ is the distance of $x$ to the closest center in $C$. The socially fair $k$-means problem is defined similarly by using squared distances, i.e., $d^{2}(.,.)$ instead of $d(.,.)$. The current best approximation guarantee for both the problems is $O\\left( \\frac{\\log \\ell}{\\log \\log \\ell} \\right)$ due to Makarychev and Vakilian [COLT 2021]. In this work, we study the fixed parameter tractability of the problems with respect to parameter $k$. We design $(3+\\varepsilon)$ and $(9 + \\varepsilon)$ approximation algorithms for the socially fair $k$-median and $k$-means problems, respectively, in FPT (fixed parameter tractable) time $f(k,\\varepsilon) \\cdot n^{O(1)}$, where $f(k,\\varepsilon) = (k/\\varepsilon)^{{O}(k)}$ and $n = |P \\cup F|$. Furthermore, we show that if Gap-ETH holds, then better approximation guarantees are not possible in FPT time."}}
{"id": "Cc_KI5YwziE", "cdate": 1609459200000, "mdate": 1672030536385, "content": {"title": "Tight FPT Approximation for Constrained k-Center and k-Supplier", "abstract": "In this work, we study a range of constrained versions of the $k$-supplier and $k$-center problems such as: capacitated, fault-tolerant, fair, etc. These problems fall under a broad framework of constrained clustering. A unified framework for constrained clustering was proposed by Ding and Xu [SODA 2015] in context of the $k$-median and $k$-means objectives. In this work, we extend this framework to the $k$-supplier and $k$-center objectives. This unified framework allows us to obtain results simultaneously for the following constrained versions of the $k$-supplier problem: $r$-gather, $r$-capacity, balanced, chromatic, fault-tolerant, strongly private, $\\ell$-diversity, and fair $k$-supplier problems, with and without outliers. We obtain the following results: We give $3$ and $2$ approximation algorithms for the constrained $k$-supplier and $k$-center problems, respectively, with $\\mathsf{FPT}$ running time $k^{O(k)} \\cdot n^{O(1)}$, where $n = |C \\cup L|$. Moreover, these approximation guarantees are tight; that is, for any constant $\\epsilon>0$, no algorithm can achieve $(3-\\epsilon)$ and $(2-\\epsilon)$ approximation guarantees for the constrained $k$-supplier and $k$-center problems in $\\mathsf{FPT}$ time, assuming $\\mathsf{FPT} \\neq \\mathsf{W}[2]$. Furthermore, we study these constrained problems in outlier setting. Our algorithm gives $3$ and $2$ approximation guarantees for the constrained outlier $k$-supplier and $k$-center problems, respectively, with $\\mathsf{FPT}$ running time $(k+m)^{O(k)} \\cdot n^{O(1)}$, where $n = |C \\cup L|$ and $m$ is the number of outliers."}}
{"id": "cOY6V3zDYO", "cdate": 1577836800000, "mdate": 1672030536390, "content": {"title": "FPT Approximation for Constrained Metric k-Median/Means", "abstract": "The Metric k-median problem over a metric space (𝒳, d) is defined as follows: given a set L ⊆ 𝒳 of facility locations and a set C ⊆ 𝒳 of clients, open a set F ⊆ L of k facilities such that the total service cost, defined as Φ(F, C) := ∑_{x ∈ C} min_{f ∈ F} d(x, f), is minimised. The metric k-means problem is defined similarly using squared distances (i.e., d²(., .) instead of d(., .)). In many applications there are additional constraints that any solution needs to satisfy. For example, to balance the load among the facilities in resource allocation problems, a capacity u is imposed on every facility. That is, no more than u clients can be assigned to any facility. This problem is known as the capacitated k-means/k-median problem. Likewise, various other applications have different constraints, which give rise to different constrained versions of the problem such as r-gather, fault-tolerant, outlier k-means/k-median problem. Surprisingly, for many of these constrained problems, no constant-approximation algorithm is known. Moreover, the unconstrained problem itself is known [Marek Adamczyk et al., 2019] to be W[2]-hard when parameterized by k. We give FPT algorithms with constant approximation guarantee for a range of constrained k-median/means problems. For some of the constrained problems, ours is the first constant factor approximation algorithm whereas for others, we improve or match the approximation guarantee of previous works. We work within the unified framework of Ding and Xu [Ding and Xu, 2015] that allows us to simultaneously obtain algorithms for a range of constrained problems. In particular, we obtain a (3+ε)-approximation and (9+ε)-approximation for the constrained versions of the k-median and k-means problem respectively in FPT time. In many practical settings of the k-median/means problem, one is allowed to open a facility at any client location, i.e., C ⊆ L. For this special case, our algorithm gives a (2+ε)-approximation and (4+ε)-approximation for the constrained versions of k-median and k-means problem respectively in FPT time. Since our algorithm is based on simple sampling technique, it can also be converted to a constant-pass log-space streaming algorithm. In particular, here are some of the main highlights of this work: 1) For the uniform capacitated k-median/means problems our results matches previously known results of Addad et al. [Vincent Cohen-Addad and Jason Li, 2019]. 2) For the r-gather k-median/means problem (clustering with lower bound on the size of clusters), our FPT approximation bounds are better than what was previously known. 3) Our approximation bounds for the fault-tolerant, outlier, and uncertain versions is better than all previously known results, albeit in FPT time. 4) For certain constrained settings such as chromatic, l-diversity, and semi-supervised k-median/means, we obtain the first constant factor approximation algorithms to the best of our knowledge. 5) Since our algorithms are based on a simple sampling based approach, we also obtain constant-pass log-space streaming algorithms for most of the above-mentioned problems."}}
{"id": "R2_KsU2QHbV", "cdate": 1577836800000, "mdate": 1672030536386, "content": {"title": "Hardness of Approximation of Euclidean k-Median", "abstract": "The Euclidean $k$-median problem is defined in the following manner: given a set $\\mathcal{X}$ of $n$ points in $\\mathbb{R}^{d}$, and an integer $k$, find a set $C \\subset \\mathbb{R}^{d}$ of $k$ points (called centers) such that the cost function $\\Phi(C,\\mathcal{X}) \\equiv \\sum_{x \\in \\mathcal{X}} \\min_{c \\in C} \\|x-c\\|_{2}$ is minimized. The Euclidean $k$-means problem is defined similarly by replacing the distance with squared distance in the cost function. Various hardness of approximation results are known for the Euclidean $k$-means problem. However, no hardness of approximation results were known for the Euclidean $k$-median problem. In this work, assuming the unique games conjecture (UGC), we provide the first hardness of approximation result for the Euclidean $k$-median problem. Furthermore, we study the hardness of approximation for the Euclidean $k$-means/$k$-median problems in the bi-criteria setting where an algorithm is allowed to choose more than $k$ centers. That is, bi-criteria approximation algorithms are allowed to output $\\beta k$ centers (for constant $\\beta>1$) and the approximation ratio is computed with respect to the optimal $k$-means/$k$-median cost. In this setting, we show the first hardness of approximation result for the Euclidean $k$-median problem for any $\\beta < 1.015$, assuming UGC. We also show a similar bi-criteria hardness of approximation result for the Euclidean $k$-means problem with a stronger bound of $\\beta < 1.28$, again assuming UGC."}}
{"id": "G2KQveYW86M", "cdate": 1577836800000, "mdate": 1672030536396, "content": {"title": "FPT Approximation for Constrained Metric k-Median/Means", "abstract": "The Metric $k$-median problem over a metric space $(\\mathcal{X}, d)$ is defined as follows: given a set $L \\subseteq \\mathcal{X}$ of facility locations and a set $C \\subseteq \\mathcal{X}$ of clients, open a set $F \\subseteq L$ of $k$ facilities such that the total service cost, defined as $\\Phi(F, C) \\equiv \\sum_{x \\in C} \\min_{f \\in F} d(x, f)$, is minimised. The metric $k$-means problem is defined similarly using squared distances. In many applications there are additional constraints that any solution needs to satisfy. This gives rise to different constrained versions of the problem such as $r$-gather, fault-tolerant, outlier $k$-means/$k$-median problem. Surprisingly, for many of these constrained problems, no constant-approximation algorithm is known. We give FPT algorithms with constant approximation guarantee for a range of constrained $k$-median/means problems. For some of the constrained problems, ours is the first constant factor approximation algorithm whereas for others, we improve or match the approximation guarantee of previous works. We work within the unified framework of Ding and Xu that allows us to simultaneously obtain algorithms for a range of constrained problems. In particular, we obtain a $(3+\\varepsilon)$-approximation and $(9+\\varepsilon)$-approximation for the constrained versions of the $k$-median and $k$-means problem respectively in FPT time. In many practical settings of the $k$-median/means problem, one is allowed to open a facility at any client location, i.e., $C \\subseteq L$. For this special case, our algorithm gives a $(2+\\varepsilon)$-approximation and $(4+\\varepsilon)$-approximation for the constrained versions of $k$-median and $k$-means problem respectively in FPT time. Since our algorithm is based on simple sampling technique, it can also be converted to a constant-pass log-space streaming algorithm."}}
{"id": "AlyvVTj9CY", "cdate": 1577836800000, "mdate": 1672030536385, "content": {"title": "On Sampling Based Algorithms for k-Means", "abstract": "We generalise the results of Bhattacharya et al. [Bhattacharya et al., 2018] for the list-k-means problem defined as - for a (unknown) partition X₁, ..., X_k of the dataset X ⊆ ℝ^d, find a list of k-center-sets (each element in the list is a set of k centers) such that at least one of k-center-sets {c₁, ..., c_k} in the list gives an (1+ε)-approximation with respect to the cost function min_{permutation π} [∑_{i = 1}^{k} ∑_{x ∈ X_i} ||x - c_{π(i)}||²]. The list-k-means problem is important for the constrained k-means problem since algorithms for the former can be converted to {PTAS} for various versions of the latter. The algorithm for the list-k-means problem by Bhattacharya et al. is a D²-sampling based algorithm that runs in k iterations. Making use of a constant factor solution for the (classical or unconstrained) k-means problem, we generalise the algorithm of Bhattacharya et al. in two ways - (i) for any fixed set X_{j₁}, ..., X_{j_t} of t ≤ k clusters, the algorithm produces a list of (k/(ε))^{O(t/(ε))} t-center sets such that (w.h.p.) at least one of them is good for X_{j₁}, ..., X_{j_t}, and (ii) the algorithm runs in a single iteration. Following are the consequences of our generalisations: 1) Faster PTAS under stability and a parameterised reduction: Property (i) of our generalisation is useful in scenarios where finding good centers becomes easier once good centers for a few \"bad\" clusters have been chosen. One such case is clustering under stability of Awasthi et al. [Awasthi et al., 2010] where the number of such bad clusters is a constant. Using property (i), we significantly improve the running time of their algorithm from O(dn³) (k log{n})^{poly(1/(β), 1/(ε))} to O (dn³ (k/(ε)) ^{O(1/βε²)}). Another application is a parameterised reduction from the outlier version of k-means to the classical one where the bad clusters are the outliers. 2) Streaming algorithms: The sampling algorithm running in a single iteration (i.e., property (ii)) allows us to design a constant-pass, logspace streaming algorithm for the list-k-means problem. This can be converted to a constant-pass, logspace streaming PTAS for various constrained versions of the k-means problem. In particular, this gives a 3-pass, polylog-space streaming PTAS for the constrained binary k-means problem which in turn gives a 4-pass, polylog-space streaming PTAS for the generalised binary 𝓁₀-rank-r approximation problem. This is the first constant pass, polylog-space streaming algorithm for either of the two problems. Coreset based techniques, which is another approach for designing streaming algorithms in general, is not known to work for the constrained binary k-means problem to the best of our knowledge."}}
{"id": "hi4cF_xW_P", "cdate": 1546300800000, "mdate": 1672030536386, "content": {"title": "Streaming PTAS for Binary 𝓁0-Low Rank Approximation", "abstract": "We give a 3-pass, polylog-space streaming PTAS for the constrained binary $k$-means problem and a 4-pass, polylog-space streaming PTAS for the binary $\\ell_0$-low rank approximation problem. The connection between the above two problems has recently been studied. We design a streaming PTAS for the former and use this connection to obtain streaming PTAS for the latter. This is the first constant pass, polylog-space streaming algorithm for either of the two problems."}}
