{"id": "3P7bi8hCrna", "cdate": 1589791620763, "mdate": null, "content": {"title": "Extreme events evaluation using CRPS distributions", "abstract": "Verification of ensemble forecasts for extreme events remains a challenging question. The general public as well as the media naturely pay particular attention on extreme events and conclude about the global predictive performance of ensembles, which are often unskillful when they are needed. Ashing classical verification tools to focus on such events can lead to unexpected behaviors. To square up these effects, thresholded and weighted scoring rules have been developed. Most of them use derivations of the Continuous Ranked Probability Score (CRPS). However, some properties of the CRPS for extreme events generate undesirable effects on the quality of verification. Using theoretical arguments and simulation examples, we illustrate some pitfalls of conventional verification tools and propose a different direction to assess ensemble forecasts using extreme value theory, considering proper scores as random variables. "}}
{"id": "XG8wP9vjA7S", "cdate": 1589788856794, "mdate": null, "content": {"title": "Functional Peaks-over-threshold Analysis", "abstract": "Peaks-over-threshold analysis using the generalized Pareto distribution is widely applied in modelling tails of univariate random variables, but much information may be lost when complex extreme events are studied using univariate results. In this paper, we extend peaks-over-threshold analysis to extremes of functional data. Threshold exceedances defined using a functional r are modelled by the generalized r-Pareto process, a functional generalization of the generalized Pareto distribution that covers the three classical regimes for the decay of tail probabilities. This process is the only possible limit for the distribution of r-exceedances of a properly rescaled process. We give construction rules, simulation algorithms and inference procedures for generalized r-Pareto processes, discuss model validation, and use the new methodology to study extreme European windstorms and heavy spatial rainfall."}}
{"id": "Mqq5oTMmCa_", "cdate": 1589788747985, "mdate": null, "content": {"title": "Extremal behaviour of aggregated data with an application to downscaling", "abstract": "The distribution of spatially aggregated data from a stochastic process X may exhibit tail behaviour different from that of its marginal distributions. For a large class of aggregating functionals ℓ we introduce the ℓ-extremal coefficient, which quantifies this difference as a function of the extremal spatial dependence in X⁠. We also obtain the joint extremal dependence for multiple aggregation functionals applied to the same process. Formulae for the ℓ-extremal coefficients and multivariate dependence structures are derived in important special cases. The results provide a theoretical link between the extremal distribution of the aggregated data and the corresponding underlying process, which we exploit to develop a method for statistical downscaling. We apply our framework to downscale daily temperature maxima in the south of France from a gridded dataset and use our model to generate high-resolution maps of the warmest day during the 2003 heatwave."}}
{"id": "upJg4KMaEWK", "cdate": 1589788606779, "mdate": null, "content": {"title": "High-dimensional peaks-over-threshold inference", "abstract": "Max-stable processes are increasingly widely used for modelling complex extreme events, but existing fitting methods are computationally demanding, limiting applications to a few dozen variables. r-Pareto processes are mathematically simpler and have the potential advantage of incorporating all relevant extreme events, by generalizing the notion of a univariate exceedance. In this paper we investigate the use of proper scoring rules for high-dimensional peaks-over-threshold inference, focusing on extreme-value processes associated with log-Gaussian random functions, and compare gradient score estimators with the spectral and censored likelihood estimators for regularly varying distributions with normalized marginals, using data with several hundred locations. When simulating from the true model, the spectral estimator performs best, closely followed by the gradient score estimator, but censored likelihood estimation performs better with simulations from the domain of attraction, though it is outperformed by the gradient score in cases of weak extremal dependence. We illustrate the potential and flexibility of our ideas by modelling extreme rainfall on a grid with 3600 locations, based on exceedances for locally intense and for spatially accumulated rainfall, and discuss diagnostics of model fit. The differences between the two fitted models highlight how the definition of rare events affects the estimated dependence structure."}}
