{"id": "gYHRuc-kTBX", "cdate": 1577836800000, "mdate": null, "content": {"title": "Wireless Federated Learning with Local Differential Privacy", "abstract": "In this paper, we study the problem of federated learning (FL) over a wireless channel, modeled by a Gaussian multiple access channel (MAC), subject to local differential privacy (LDP) constraints. We show that the superposition nature of the wireless channel provides a dual benefit of bandwidth efficient gradient aggregation, in conjunction with strong LDP guarantees for the users. We propose a private wireless gradient aggregation scheme, which shows that when aggregating gradients from $K$ users, the privacy leakage per user scales as $\\mathcal{O}\\big(\\frac{1}{\\sqrt{K}} \\big)$ compared to orthogonal transmission in which the privacy leakage scales as a constant. We also present analysis for the convergence rate of the proposed private FL aggregation algorithm and study the tradeoffs between wireless resources, convergence, and privacy."}}
{"id": "fP_SoZPzZis", "cdate": 1577836800000, "mdate": null, "content": {"title": "Latent-variable Private Information Retrieval", "abstract": "In many applications, content accessed by users (movies, videos, news articles, etc.) can leak sensitive latent attributes, such as religious and political views, sexual orientation, ethnicity, gender, and others. To prevent such information leakage, the goal of classical PIR is to hide the identity of the content/message being accessed, which subsequently also hides the latent attributes. This solution, while private, can be too costly, particularly, when perfect (information-theoretic) privacy constraints are imposed. For instance, for a single database holding $K$ messages, privately retrieving one message is possible if and only if the user downloads the entire database of $K$ messages. Retrieving content privately, however, may not be necessary to perfectly hide the latent attributes. Motivated by the above, we formulate and study the problem of latent-variable private information retrieval (LV-PIR), which aims at allowing the user efficiently retrieve one out of $K$ messages (indexed by $\\theta$) without revealing any information about the latent variable (modeled by $S$). We focus on the practically relevant setting of a single database and show that one can significantly reduce the download cost of LV-PIR (compared to the classical PIR) based on the correlation between $\\theta$ and $S$. We present a general scheme for LV-PIR as a function of the statistical relationship between $\\theta$ and $S$, and also provide new results on the capacity/download cost of LV-PIR. Several open problems and new directions are also discussed."}}
{"id": "Sma_mJKp2W", "cdate": 1577836800000, "mdate": null, "content": {"title": "Communication Efficient Federated Learning over Multiple Access Channels", "abstract": "In this work, we study the problem of federated learning (FL), where distributed users aim to jointly train a machine learning model with the help of a parameter server (PS). In each iteration of FL, users compute local gradients, followed by transmission of the quantized gradients for subsequent aggregation and model updates at PS. One of the challenges of FL is that of communication overhead due to FL's iterative nature and large model sizes. One recent direction to alleviate communication bottleneck in FL is to let users communicate simultaneously over a multiple access channel (MAC), possibly making better use of the communication resources. In this paper, we consider the problem of FL learning over a MAC. In particular, we focus on the design of digital gradient transmission schemes over a MAC, where gradients at each user are first quantized, and then transmitted over a MAC to be decoded individually at the PS. When designing digital FL schemes over MACs, there are new opportunities to assign different amount of resources (such as rate or bandwidth) to different users based on a) the informativeness of the gradients at each user, and b) the underlying channel conditions. We propose a stochastic gradient quantization scheme, where the quantization parameters are optimized based on the capacity region of the MAC. We show that such channel aware quantization for FL outperforms uniform quantization, particularly when users experience different channel conditions, and when have gradients with varying levels of informativeness."}}
{"id": "FfOae3ZUOOa", "cdate": 1577836800000, "mdate": null, "content": {"title": "Blind MIMO Cooperative Jamming: Secrecy via ISI Heterogeneity Without CSIT", "abstract": "We investigate the secure degrees of freedom (SDoF) of the multiple-input multiple-output (MIMO) wiretap channel with intersymbol interference (ISI) in the presence of a multi-antenna cooperative jammer. We focus on the practically relevant setting with no channel state information at the transmitters (CSIT). More specifically, the legitimate transmitter and the cooperative jammer only have statistical knowledge of the channel in terms of the effective number of ISI channel taps, i.e., channel impulse response (CIR) lengths, toward the legitimate receiver and the eavesdropper. Our main contribution is to show that in the absence of CSIT, positive SDoF can be achieved by carefully exploiting: 1) the heterogeneity of the CIR lengths toward both receivers and 2) the relative number of antennas at the four terminals. To achieve secrecy, we propose a scheme in which the transmitter strategically sends a mixture of information and artificial noise symbols in a way that exploits the heterogeneity of CIR lengths. Additionally, the cooperative jammer transmits artificial noise symbols in a way that completely masks all the information symbols that are received at the eavesdropping node. Under the proposed scheme, positive SDoF can be achieved, even when the number of antennas at the legitimate receiver is less than the number of antennas at the eavesdropper."}}
{"id": "EzoafExQCB", "cdate": 1577836800000, "mdate": null, "content": {"title": "Local Information Privacy and Its Application to Privacy-Preserving Data Aggregation", "abstract": "In this paper, we study local information privacy (LIP), and design LIP based mechanisms for statistical aggregation while protecting users' privacy without relying on a trusted third party. The notion of context-awareness is incorporated in LIP, which can be viewed as explicit modeling of the adversary's background knowledge. It enables the design of privacy-preserving mechanisms leveraging the prior distribution, which can potentially achieve a better utility-privacy tradeoff than context-free notions such as Local Differential Privacy (LDP). We present an optimization framework to minimize the mean square error in the data aggregation while protecting the privacy of each individual user's input data or a correlated latent variable while satisfying LIP constraints. Then, we study two different types of applications: (weighted) summation and histogram estimation and derive the optimal context-aware data perturbation parameters for each case, based on randomized response type of mechanism. We further compare the utility-privacy tradeoff between LIP and LDP and theoretically explain why the incorporation of prior knowledge enlarges feasible regions of the perturbation parameters, which thereby leads to higher utility. We also extend the LIP-based privacy mechanisms to the more general case when exact prior knowledge is not available. Finally, we validate our analysis by simulations using both synthetic and real-world data. Results show that our LIP-based privacy mechanism provides better utility-privacy tradeoffs than LDP, and the advantage of LIP is even more significant when the prior distribution is more skewed."}}
{"id": "tPngl3f1zT", "cdate": 1546300800000, "mdate": null, "content": {"title": "Random Sampling for Distributed Coded Matrix Multiplication", "abstract": "Matrix multiplication is a fundamental building block for large scale computations arising in various applications, including machine learning. There has been significant recent interest in using coding to speed up distributed matrix multiplication, that are robust to stragglers (i.e., machines that may perform slower computations). In many scenarios, instead of exact computation, approximate matrix multiplication, i.e., allowing for a tolerable error is also sufficient. Such approximate schemes make use of randomization techniques to speed up the computation process. In this paper, we initiate the study of approximate coded matrix multiplication, and investigate the joint synergies offered by randomization and coding. Specifically, we propose two coded randomized sampling schemes that use (a) codes to achieve a desired recovery threshold and (b) random sampling to obtain approximation of the matrix multiplication. Tradeoffs between the recovery threshold and approximation error obtained through random sampling are investigated for a class of coded matrix multiplication schemes."}}
{"id": "qgRfEBcwuJ_", "cdate": 1546300800000, "mdate": null, "content": {"title": "Online Location Trace Privacy: An Information Theoretic Approach", "abstract": "We consider the problem of protecting individual user's location privacy at the trace-level and study the privacy-utility trade-off, which has key applications in privacy-preserving location-based service. Existing works on Location Privacy Protection Mechanisms (LPPMs) have mainly focused on protecting single location, without taking into account the temporal correlations among locations within the trace, which can lead to higher privacy leakage when considering the whole trace. However, to date, there lacks a formal framework to quantify the trace-level location privacy leakage, and a practical mechanism to release location traces in an optimal and online manner. In this paper, we endeavor to solve this problem using an information-theoretic approach. We first propose a location trace privacy metric based on the mutual information between the original and released trace in an offline setting, and formulate the optimal location trace release problem that minimizes trace-level privacy leakage given a utility constraint. We also propose a privacy metric to capture trace-level privacy leakage in an online setting. As directly computing these metrics incur exponential complexity w.r.t. the trace length, we obtain upper and lower bounds on the trace-level privacy leakage by exploiting the Markov structure of the temporal location correlations, which are efficiently computable. The proposed upper bounds enable us to derive efficient online solutions (i.e., LPPMs) by modifying Blahut-Arimoto algorithm in rate-distortion theory. Then we validate the proposed upper and lower bounds and the actual leakage of our LPPM through extensive experiments over both synthetic and real-world location data sets. Our results show the superiority of our LPPM over existing LPPMs in terms of trace-level privacy-utility tradeoff, which is more conspicuous when the location trace is more correlated."}}
{"id": "nRoou7zXJ3j", "cdate": 1546300800000, "mdate": null, "content": {"title": "Secure Retrospective Interference Alignment", "abstract": "In this paper, the K-user interference channel with secrecy constraints is considered with delayed channel state information at transmitters (CSIT). We propose a novel secure retrospective interference alignment scheme in which the transmitters carefully mix information symbols with artificial noises to ensure confidentiality. Achieving positive secure degrees of freedom (SDoF) is challenging due to the delayed nature of CSIT, and the distributed nature of the transmitters. Our scheme works over two phases: Phase one, in which each transmitter sends information symbols mixed with artificial noises, and repeats such transmission over multiple rounds. In the next phase, each transmitter uses the delayed CSIT of the previous phase and sends a function of the net interference and artificial noises (generated in previous phase), which is simultaneously useful for all receivers. These phases are designed to ensure the decodability of the desired messages while satisfying the secrecy constraints. We present our achievable scheme for three models, namely: (1) K-user interference channel with confidential messages (IC-CM), and we show that 1 2 ( K &minus; 6 ) SDoF is achievable; (2) K-user interference channel with an external eavesdropper (IC-EE); and (3) K-user IC with confidential messages and an external eavesdropper (IC-CM-EE). We show that for the K-user IC-EE, 1 2 ( K &minus; 3 ) SDoF is achievable, and for the K-user IC-CM-EE, 1 2 ( K &minus; 6 ) is achievable. To the best of our knowledge, this is the first result on the K-user interference channel with secrecy constrained models and delayed CSIT that achieves an SDoF which scales with K , square-root of number of users."}}
{"id": "knrl9QAQhxT", "cdate": 1546300800000, "mdate": null, "content": {"title": "On the Capacity of Leaky Private Information Retrieval", "abstract": "Private information retrieval (PIR) allows users to retrieve data from databases without revealing the identity of that data. An extensive body of works has investigated efficient schemes to achieve computational and information-theoretic privacy. The latter guarantees that no information is revealed to the databases, irrespective of their computational power. Although information-theoretic PIR (IT-PIR) provides a strong privacy guarantee, it can be too taxing for certain applications. In this paper, we initiate the study of leaky private information retrieval (L-PIR), where a bounded amount of privacy leakage is allowed and measured through a parameter ε. The classical IT-PIR formulation is obtained by setting ε = 0, and for ε > 0, we explore the opportunities offered for reducing the download cost. We derive new upper and lower bounds on the download cost of L-PIR for any arbitrary ε, any number of messages K, and for N = 2 databases."}}
{"id": "dI1OClwNGgk", "cdate": 1546300800000, "mdate": null, "content": {"title": "Finite Alphabet Iterative Decoding of LDPC Codes with Coarsely Quantized Neural Networks", "abstract": "In this paper, we introduce a method of using quantized neural networks (QNN) to design finite alphabet message passing decoders (FAID) for Low-Density Parity Check (LDPC) codes. Specifically, we construct a neural network with low precision activations to optimize a FAID over Additive White Gaussian Noise Channel (AWGNC). The low precision activations cause a critical issue that their gradients vanish almost everywhere, making it difficult to use classical backward propagation. We introduce straight-through estimators (STE) to avoid this problem, by replacing zero derivatives of quantized activations with surrogate gradients in the chain rules. We present a systematic approach to train such networks while minimizing the bit error rate, which is a widely used and accurate metric to measure the performance of iterative decoders. Examples and simulations show that by training a QNN, a FAID with 3-bit of message and 4-bit of channel output can be obtained, which performs better than the more complex floating-point minsum decoding algorithm. This methodology is promising in the sense that it facilitates designing low-precision FAID for LDPC codes while maintaining good error performance in a flexible and efficient manner."}}
