{"id": "GRZtigJljLY", "cdate": 1663850389225, "mdate": null, "content": {"title": "Scalable Batch-Mode Deep Bayesian Active Learning via Equivalence Class Annealing", "abstract": "Active learning has demonstrated data efficiency in many fields. Existing active learning algorithms, especially in the context of batch-mode deep Bayesian active models, rely heavily on the quality of uncertainty estimations of the model, and are often challenging to scale to large batches. In this paper, we propose Batch-BALanCe, a scalable batch-mode active learning algorithm, which combines insights from decision-theoretic active learning, combinatorial information measure, and diversity sampling. At its core, Batch-BALanCe relies on a novel decision-theoretic acquisition function that facilitates differentiation among different equivalence classes. Intuitively, each equivalence class consists of hypotheses (e.g., posterior samples of deep neural networks) with similar predictions, and Batch-BALanCe adaptively adjusts the size of the equivalence classes as learning progresses. To scale up the computation of queries to large batches, we further propose an efficient batch-mode acquisition procedure, which aims to maximize a novel combinatorial information measure defined through the acquisition function. We show that our algorithm can effectively handle realistic multi-class classification tasks, and achieves compelling performance on several benchmark datasets for active learning under both low- and large-batch regimes."}}
{"id": "9-1XvarQwA", "cdate": 1609459200000, "mdate": 1676259605884, "content": {"title": "BALanCe: Deep Bayesian Active Learning via Equivalence Class Annealing", "abstract": "Active learning has demonstrated data efficiency in many fields. Existing active learning algorithms, especially in the context of batch-mode deep Bayesian active models, rely heavily on the quality of uncertainty estimations of the model, and are often challenging to scale to large batches. In this paper, we propose Batch-BALanCe, a scalable batch-mode active learning algorithm, which combines insights from decision-theoretic active learning, combinatorial information measure, and diversity sampling. At its core, Batch-BALanCe relies on a novel decision-theoretic acquisition function that facilitates differentiation among different equivalence classes. Intuitively, each equivalence class consists of hypotheses (e.g., posterior samples of deep neural networks) with similar predictions, and Batch-BALanCe adaptively adjusts the size of the equivalence classes as learning progresses. To scale up the computation of queries to large batches, we further propose an efficient batch-mode acquisition procedure, which aims to maximize a novel information measure defined through the acquisition function. We show that our algorithm can effectively handle realistic multi-class classification tasks, and achieves compelling performance on several benchmark datasets for active learning under both low- and large-batch regimes. Reference code is released at https://github.com/zhangrenyuuchicago/BALanCe."}}
{"id": "zz4NGYT3Im", "cdate": 1577836800000, "mdate": 1676259605874, "content": {"title": "Evaluation of Hyperbolic Attention in Histopathology Images", "abstract": "We bring together into a common framework three key ideas — multi-scale medical image analysis, the attention mechanism, and hyperbolic embeddings. The formulation and evaluation of hyperbolic-attention models for multi-scale medical image analysis have not been previously explored. In this paper, we evaluate a hyperbolic-attention model on two classification tasks using histopathology image datasets. The experiments show improvement compared to other commonly used models. Our method directly captures the multi-scale structure of histopathology images, and we speculate that the hyperbolic attention mechanism naturally singles out one or more structures at one or more scales that are most discriminatory."}}
{"id": "VBokPlYPmXp", "cdate": 1577836800000, "mdate": 1676259605872, "content": {"title": "Evaluating and interpreting caption prediction for histopathology images", "abstract": "The automatic generation of captions from medical images can provide for an efficient way to annotate histopathology images with natural language descriptions. Such large-scale annotation of medica..."}}
{"id": "pH__3sqU6vz", "cdate": 1514764800000, "mdate": 1682347536796, "content": {"title": "Exploration in Mapping Kernel-Based Home Range Models from Remote Sensing Imagery with Conditional Adversarial Networks", "abstract": "Kernel-based home range models are widely-used to estimate animal habitats and develop conservation strategies. They provide a probabilistic measure of animal space use instead of assuming the uniform utilization within an outside boundary. However, this type of models estimates the home ranges from animal relocations, and the inadequate locational data often prevents scientists from applying them in long-term and large-scale research. In this paper, we propose an end-to-end deep learning framework to simulate kernel home range models. We use the conditional adversarial network as a supervised model to learn the home range mapping from time-series remote sensing imagery. Our approach enables scientists to eliminate the persistent dependence on locational data in home range analysis. In experiments, we illustrate our approach by mapping the home ranges of Bar-headed Geese in Qinghai Lake area. The proposed framework outperforms all baselines in both qualitative and quantitative evaluations, achieving visually recognizable results and high mapping accuracy. The experiment also shows that learning the mapping between images is a more effective way to map such complex targets than traditional pixel-based schemes."}}
{"id": "S5494HYSRo9", "cdate": 1483228800000, "mdate": 1668140622935, "content": {"title": "Accurate De Novo Prediction of Protein Contact Map by Ultra-Deep Learning Model", "abstract": ""}}
{"id": "Re3u7Ky9Ax", "cdate": 1451606400000, "mdate": 1668140623093, "content": {"title": "Accurate De Novo Prediction of Protein Contact Map by Ultra-Deep Learning Model", "abstract": ""}}
{"id": "CrjgrWq3Yx-", "cdate": 1451606400000, "mdate": 1682347536818, "content": {"title": "CoinFold: a web server for protein contact prediction and contact-assisted protein folding", "abstract": "CoinFold (http://raptorx2.uchicago.edu/ContactMap/) is a web server for protein contact prediction and contact-assisted de novo structure prediction. CoinFold predicts contacts by integrating joint multi-family evolutionary coupling (EC) analysis and supervised machine learning. This joint EC analysis is unique in that it not only uses residue coevolution information in the target protein family, but also that in the related families which may have divergent sequences but similar folds. The supervised learning further improves contact prediction accuracy by making use of sequence profile, contact (distance) potential and other information. Finally, this server predicts tertiary structure of a sequence by feeding its predicted contacts and secondary structure to the CNS suite. Tested on the CASP and CAMEO targets, this server shows significant advantages over existing ones of similar category in both contact and tertiary structure prediction."}}
