{"id": "Xcys4FKhhmB", "cdate": 1704067200000, "mdate": 1704792920582, "content": {"title": "Interpretable and intervenable ultrasonography-based machine learning models for pediatric appendicitis", "abstract": ""}}
{"id": "tB46FIztFZD", "cdate": 1685577600000, "mdate": 1686899580064, "content": {"title": "Interpretable and explainable machine learning: A methods-centric overview with concrete examples", "abstract": "Interpretability and explainability are essential principles of machine learning model and method design and development for medicine, economics, law, and natural sciences applications. Over the last..."}}
{"id": "xg6mfxZgupb", "cdate": 1672531200000, "mdate": 1679992003436, "content": {"title": "Interpretable and Intervenable Ultrasonography-based Machine Learning Models for Pediatric Appendicitis", "abstract": ""}}
{"id": "3aNX32JI4Iy", "cdate": 1672531200000, "mdate": 1699346794683, "content": {"title": "Breathing New Life into COPD Assessment: Multisensory Home-monitoring for Predicting Severity", "abstract": "Chronic obstructive pulmonary disease (COPD) is a significant public health issue, affecting more than 100 million people worldwide. Remote patient monitoring has shown great promise in the efficient management of patients with chronic diseases. This work presents the analysis of the data from a monitoring system developed to track COPD symptoms alongside patients’ self-reports. In particular, we investigate the assessment of COPD severity using multisensory home-monitoring device data acquired from 30 patients over a period of three months. We describe a comprehensive data pre-processing and feature engineering pipeline for multimodal data from the remote home-monitoring of COPD patients. We develop and validate predictive models forecasting i) the absolute and ii) differenced COPD Assessment Test (CAT) scores based on the multisensory data. The best obtained models achieve Pearson’s correlation coefficient of 0.93 and 0.37 for absolute and differenced CAT scores. In addition, we investigate the importance of individual sensor modalities for predicting CAT scores using group sparse regularization techniques. Our results suggest that feature groups indicative of the patient’s general condition, such as static medical and physiological information, date, spirometer, and air quality, are crucial for predicting the absolute CAT score. For predicting changes in CAT scores, sleep and physical activity features are most important, alongside the previous CAT score value. Our analysis demonstrates the potential of remote patient monitoring for COPD management and investigates which sensor modalities are most indicative of COPD severity as assessed by the CAT score. Our findings contribute to the development of effective and data-driven COPD management strategies."}}
{"id": "z8WJgAYKoPG", "cdate": 1640995200000, "mdate": 1663684318330, "content": {"title": "A Deep Variational Approach to Clustering Survival Data", "abstract": "In this work, we study the problem of clustering survival data — a challenging and so far under-explored task. We introduce a novel semi-supervised probabilistic approach to cluster survival data by leveraging recent advances in stochastic gradient variational inference. In contrast to previous work, our proposed method employs a deep generative model to uncover the underlying distribution of both the explanatory variables and censored survival times. We compare our model to the related work on clustering and mixture models for survival data in comprehensive experiments on a wide range of synthetic, semi-synthetic, and real-world datasets, including medical imaging data. Our method performs better at identifying clusters and is competitive at predicting survival times. Relying on novel generative assumptions, the proposed model offers a holistic perspective on clustering survival data and holds a promise of discovering subpopulations whose survival is regulated by different generative mechanisms."}}
{"id": "MPOPJKvE8NO", "cdate": 1640995200000, "mdate": 1673452356024, "content": {"title": "Introduction to Machine Learning for Physicians: A Survival Guide for Data Deluge", "abstract": ""}}
{"id": "GLBsw6nDkc7", "cdate": 1640995200000, "mdate": 1663684295157, "content": {"title": "Debiasing Deep Chest X-Ray Classifiers using Intra- and Post-processing Methods", "abstract": "Deep neural networks for image-based screening and computer-aided diagnosis have achieved expert-level performance on various medical imaging modalities, including chest radiographs. Recently, several works have indicated that these state-of-the-art classifiers can be biased with respect to sensitive patient attributes, such as race or gender, leading to growing concerns about demographic disparities and discrimination resulting from algorithmic and model-based decision-making in healthcare. Fair machine learning has focused on mitigating such biases against disadvantaged or marginalised groups, mainly concentrating on tabular data or natural images. This work presents two novel intra-processing techniques based on fine-tuning and pruning an already-trained neural network. These methods are simple yet effective and can be readily applied post hoc in a setting where the protected attribute is unknown during the model development and test time. In addition, we compare several intra- and post-processing approaches applied to debiasing deep chest X-ray classifiers. To the best of our knowledge, this is one of the first efforts studying debiasing methods on chest radiographs. Our results suggest that the considered approaches successfully mitigate biases in fully connected and convolutional neural networks offering stable performance under various settings. The discussed methods can help achieve group fairness of deep medical image classifiers when deploying them in domains with different fairness considerations and constraints."}}
{"id": "5xCduxdmZz", "cdate": 1640995200000, "mdate": 1677767071202, "content": {"title": "Debiasing Deep Chest X-Ray Classifiers using Intra- and Post-processing Methods", "abstract": ""}}
{"id": "RQ428ZptQfU", "cdate": 1632875643988, "mdate": null, "content": {"title": "A Deep Variational Approach to Clustering Survival Data", "abstract": "In this work, we study the problem of clustering survival data — a challenging and so far under-explored task. We introduce a novel semi-supervised probabilistic approach to cluster survival data by leveraging recent advances in stochastic gradient variational inference. In contrast to previous work, our proposed method employs a deep generative model to uncover the underlying distribution of both the explanatory variables and censored survival times. We compare our model to the related work on clustering and mixture models for survival data in comprehensive experiments on a wide range of synthetic, semi-synthetic, and real-world datasets, including medical imaging data. Our method performs better at identifying clusters and is competitive at predicting survival times. Relying on novel generative assumptions, the proposed model offers a holistic perspective on clustering survival data and holds a promise of discovering subpopulations whose survival is regulated by different generative mechanisms."}}
{"id": "tPrdq_30pgF", "cdate": 1609459200000, "mdate": 1649347426012, "content": {"title": "Interpretable Models for Granger Causality Using Self-explaining Neural Networks", "abstract": "Exploratory analysis of time series data can yield a better understanding of complex dynamical systems. Granger causality is a practical framework for analysing interactions in sequential data, applied in a wide range of domains. In this paper, we propose a novel framework for inferring multivariate Granger causality under nonlinear dynamics based on an extension of self-explaining neural networks. This framework is more interpretable than other neural-network-based techniques for inferring Granger causality, since in addition to relational inference, it also allows detecting signs of Granger-causal effects and inspecting their variability over time. In comprehensive experiments on simulated data, we show that our framework performs on par with several powerful baseline methods at inferring Granger causality and that it achieves better performance at inferring interaction signs. The results suggest that our framework is a viable and more interpretable alternative to sparse-input neural networks for inferring Granger causality."}}
