{"id": "YAN97j2NmGT", "cdate": 1664310939402, "mdate": null, "content": {"title": "Dimension reduction via score ratio matching", "abstract": "We propose a method to detect a low-dimensional subspace where a non-Gaussian target distribution departs from a known reference distribution (e.g., a standard Gaussian). We identify this subspace from gradients of the log-ratio between the target and reference densities, which we call the score ratio. Given only samples from the target distribution, we estimate these gradients via score ratio matching, with a tailored parameterization and a regularization method that expose the low-dimensional structure we seek. We show that our approach outperforms standard score matching for dimension reduction of in-class distributions, and that several benchmark UCI datasets in fact exhibit this type of low dimensionality. "}}
{"id": "S1NzPsZdWH", "cdate": 1514764800000, "mdate": null, "content": {"title": "Bayesian Optimization of Combinatorial Structures", "abstract": "The optimization of expensive-to-evaluate black-box functions over combinatorial structures is an ubiquitous task in machine learning, engineering and the natural sciences. The combinatorial explos..."}}
{"id": "HkZKp8W_br", "cdate": 1483228800000, "mdate": null, "content": {"title": "Beyond normality: Learning sparse probabilistic graphical models in the non-Gaussian setting", "abstract": "We present an algorithm to identify sparse dependence structure in continuous and non-Gaussian probability distributions, given a corresponding set of data. The conditional independence structure of an arbitrary distribution can be represented as an undirected graph (or Markov random field), but most algorithms for learning this structure are restricted to the discrete or Gaussian cases. Our new approach allows for more realistic and accurate descriptions of the distribution in question, and in turn better estimates of its sparse Markov structure. Sparsity in the graph is of interest as it can accelerate inference, improve sampling methods, and reveal important dependencies between variables. The algorithm relies on exploiting the connection between the sparsity of the graph and the sparsity of transport maps, which deterministically couple one probability measure to another."}}
