{"id": "AswPvx4ZDMn", "cdate": 1683881295833, "mdate": null, "content": {"title": "Neuronal timescales are functionally dynamic and shaped by cortical microarchitecture", "abstract": "Complex cognitive functions such as working memory and decision-making require information maintenance over seconds to years, from transient sensory stimuli to long-term contextual cues. While theoretical accounts predict the emergence of a corresponding hierarchy of neuronal timescales, direct electrophysiological evidence across the human cortex is lacking. Here, we infer neuronal timescales from invasive intracranial recordings. Timescales increase along the principal sensorimotor-to-association axis across the entire human cortex, and scale with single-unit timescales within macaques. Cortex-wide transcriptomic analysis shows direct alignment between timescales and expression of excitation- and inhibition-related genes, as well as genes specific to voltage-gated transmembrane ion transporters. Finally, neuronal timescales are functionally dynamic: prefrontal cortex timescales expand during working memory maintenance and predict individual performance, while cortex-wide timescales compress with aging. Thus, neuronal timescales follow cytoarchitectonic gradients across the human cortex and are relevant for cognition in both short and long terms, bridging microcircuit physiology with macroscale dynamics and behavior."}}
{"id": "9B8DEk2W3bn", "cdate": 1648703744054, "mdate": 1648703744054, "content": {"title": "Flexible and efficient simulation-based inference for models of decision-making", "abstract": "Identifying parameters of computational models that capture experimental data is a central task in cognitive neuroscience. Bayesian statistical inference aims to not only identify a single configuration of best-fitting parameters, but to recover all model parameters that are consistent with the data and prior knowledge. Statistical inference methods usually require the ability to evaluate the likelihood of the model—however, for many models of interest in cognitive neuroscience, the associated likelihoods cannot be computed efficiently. Simulation-based inference (SBI) offers a solution to this problem by only requiring access to simulations produced by the model. Here, we provide an efficient SBI method for models of decision-making. Our approach, Mixed Neural Likelihood Estimation (MNLE), trains neural density estimators on model simulations to emulate the simulator. The likelihoods of the emulator can then be used to perform Bayesian parameter inference on experimental data using standard approximate inference methods like Markov Chain Monte Carlo sampling. While most neural likelihood estimation methods target continuous data, MNLE works with mixed data types, as typically obtained in decision-making experiments (e.g., binary decisions and associated continuous reaction times). We demonstrate MNLE on two variants of the drift-diffusion model (DDM) and compare its performance to a recently proposed method for SBI on DDMs, called likelihood approximation networks (LAN, Fengler et al. 2021). We show that MNLE is substantially more efficient than LANs, requiring six orders of magnitudes fewer model simulations to achieve comparable likelihood accuracy and evaluation time while providing the same level of flexibility. We include an implementation of our algorithm in the user-friendly open-source package sbi."}}
{"id": "Cnb2p2HHoW0", "cdate": 1577836800000, "mdate": 1683881106872, "content": {"title": "For the Sciences They Are A-Changin': A Response to Commentaries on Núñez et al.'s (2019) \"What Happened to Cognitive Science?\"", "abstract": "A recent issue of Topics in Cognitive Science featured 11 thoughtful commentaries responding to our article “What happened to cognitive science?” (Núñez et al., 2019). Here, we identify several theme..."}}
{"id": "7lUP-3VBXr", "cdate": 1546300800000, "mdate": 1683881106949, "content": {"title": "NeuroDSP: A package for neural digital signal processing", "abstract": ""}}
{"id": "rKRKpIdBl4B", "cdate": 1483228800000, "mdate": 1683881106872, "content": {"title": "Automated Generation of Cognitive Ontology via Web Text-Mining", "abstract": "A key goal of cognitive science is to understand and map the relationship between cognitive processes. Previous works have manually curated cognitive terms and relations, effectively creating an ontology, but do they reflect how cognitive scientists study cognition in practice? In addition, cognitive science should provide theories that inform experimentalists in neuroscience studying implementations of cognition in the brain. But do neuroscientists and cognitive scientists study the same things? We set out to answer these questions in a data-driven way by text-mining and automated clustering to build a cognitive ontology from existing literature. We find automatically generated relationships to be missing in existing ontologies, and that cognitive science does not always inform neuroscience. Thus, our work serves as an efficient hypothesis-generating mechanism, inferring relationships between cognitive processes that can be manually refined by experts. Furthermore, our results highlight the gap between theories of cognition and the study of their implementation."}}
{"id": "3rRN3mDKi0", "cdate": 1483228800000, "mdate": 1683881106864, "content": {"title": "Inferring synaptic excitation/inhibition balance from field potentials", "abstract": ""}}
