{"id": "vJQ9iLJHBs", "cdate": 1680870567915, "mdate": null, "content": {"title": "Triangle Search: An Anytime Beam Search", "abstract": "Anytime heuristic search algorithms try to find a (potentially suboptimal) solution as quickly as possible and then work to find better and better solutions until an optimal solution is obtained or time is exhausted. The most widely-known anytime search algorithms are based on best-first search.  In this paper, we propose a new algorithm, triangle search, that is based on beam search. Experimental results on a suite of popular search benchmarks suggest that it is competitive with fixed-width beam search and often performs better than the previous best anytime search algorithms."}}
{"id": "hYrQINQSrR", "cdate": 1649660657634, "mdate": null, "content": {"title": "Trading Monotonicity for Cost in Beam Search", "abstract": "Beam search is a popular satisficing heuristic search algorithm, but increasing the beam width sometimes causes the algorithm to return a worse solution.  A recent variant of beam search, monobead, guarantees nonincreasing solution cost with increasing beam width.  However, the monotonicity of monobead sometimes comes at the price of increased cost and time for small beam widths.  In this paper, we explore two algorithmic variants that lie between beam search and monobead.  We find that, as hoped, our hybrids of beam and monobead can often find solutions with better cost than monobead and typically have more monotonic behavior than bead.  This work improves our understanding of the price of monotonicity in beam search."}}
{"id": "rmWLxMgdTr", "cdate": 1546300800000, "mdate": null, "content": {"title": "On the Optimal Efficiency of Cost-Algebraic A.", "abstract": "Edelkamp et al. (2005) proved that A*, given an admissible heuristic, is guaranteed to return an optimal solution in any cost algebra, not just in the traditional shortest path setting. In this paper, we investigate cost-algebraic A*’s optimal efficiency: in the cost-algebraic setting, under what conditions is A* guaranteed to expand the fewest possible states? In the traditional setting, this question was examined in detail by Dechter & Pearl (1985). They identified five different situations in which A* was optimally efficient. We show that three of them continue to hold in the cost-algebraic setting, but that one does not. We also show that one of them is false, it does not hold even in the traditional setting. We introduce an alternative that does hold in the cost-algebraic setting. Finally, we show that a well-known result due to Nilsson does not hold in the general cost-algebraic setting but does hold in a slightly less general setting."}}
{"id": "SJWULEMOZS", "cdate": 1483228800000, "mdate": null, "content": {"title": "Additive Merge-and-Shrink Heuristics for Diverse Action Costs", "abstract": "In many planning applications, actions can have highly diverse costs. Recent studies focus on the effects of diverse action costs on search algorithms, but not on their effects on domain-independent heuristics. In this paper, we demonstrate there are negative impacts of action cost diversity on merge-and-shrink (M&S), a successful abstraction method for producing high-quality heuristics for planning problems. We propose a new cost partitioning method for M&S to address the negative effects of diverse action costs. We investigate non-unit cost IPC domains, especially those for which diverse action costs have severe negative effects on the quality of the M&S heuristic. Our experiments demonstrate that in these domains, an additive set of M&S heuristics using the new cost partitioning method produces much more informative and effective heuristics than creating a single M&S heuristic which directly encodes diverse costs."}}
{"id": "B1bik4zdWH", "cdate": 1483228800000, "mdate": null, "content": {"title": "Front-to-End Bidirectional Heuristic Search with Near-Optimal Node Expansions", "abstract": "It is well-known that any admissible unidirectional heuristic search algorithm must expand all states whose f-value is smaller than the optimal solution cost when using a consistent heuristic. Such states are called “surely expanded” (s.e.). A recent study characterized s.e. pairs of states for bidirectional search with consistent heuristics: if a pair of states is s.e. then at least one of the two states must be expanded. This paper derives a lower bound, VC, on the minimum number of expansions required to cover all s.e. pairs, and present a new admissible front-to-end bidirectional heuristic search algorithm, Near-Optimal Bidirectional Search (NBS), that is guaranteed to do no more than 2VC expansions. We further prove that no admissible front-to-end algorithm has a worst case better than 2VC. Experimental results show that NBS competes with or outperforms existing bidirectional search algorithms, and often outperforms A* as well."}}
{"id": "ryZasNMdZB", "cdate": 1451606400000, "mdate": null, "content": {"title": "Heuristic Subset Selection in Classical Planning", "abstract": "In this paper we present greedy methods for selecting a subset of heuristic functions for guiding A* search. Our methods are able to optimize various objective functions while selecting a subset from a pool of up to thousands of heuristics. Specifically, our methods minimize approximations of A*'s search tree size, and approximations of A*'s running time. We show empirically that our methods can outperform state-of-the-art planners for deterministic optimal planning."}}
{"id": "SkWlymzdWS", "cdate": 1451606400000, "mdate": null, "content": {"title": "Action Selection for Hammer Shots in Curling", "abstract": "Curling is an adversarial two-player game with a continuous state and action space, and stochastic transitions. This paper focuses on one aspect of the full game, namely, finding the optimal \"hammer shot\", which is the last action taken before a score is tallied. We survey existing methods for finding an optimal action in a continuous, low-dimensional space with stochastic outcomes, and adapt a method based on Delaunay triangulation to our application. Experiments using our curling physics simulator show that the adapted Delaunay triangulation's shot selection outperforms other algorithms, and with some caveats, exceeds Olympic-level human performance."}}
{"id": "H1b6sXMOWr", "cdate": 1451606400000, "mdate": null, "content": {"title": "Improved Heuristic and Tie-Breaking for Optimally Solving Sokoban", "abstract": "We present a novel admissible pattern database heuristic (D) and tie-breaking rule (L) for Sokoban, allowing us to increase the number of optimally solved standard Sokoban instances from 20 to 28 and the number of proved optimal solutions from 25 to 32 compared to previous methods. The previously best heuristic for Sokoban (I) used the idea of an intermediate goal state to enable the effective use of pattern database heuristics in transportation domains, where the mapping of movable objects to goal locations is not fixed beforehand. We extend this idea to allow the use of multiple intermediate goal states and show that heuristic I is no longer effective. We solve this problem and show that our heuristic D is effective in this situation. Sokoban is a well-known single-agent search domain characterized by a large branching factor, long solution lengths, and the presence of unsolvable states. Given the exponential growth in the complexity of standard Sokoban instances, the increase in the number of optimally solved instances represents a major advance in our understanding of how to search in extremely large search spaces."}}
{"id": "H14cKTeO-r", "cdate": 1451606400000, "mdate": null, "content": {"title": "Bidirectional Search That Is Guaranteed to Meet in the Middle", "abstract": "We present MM, the first bidirectional heuristic search algorithm whose forward and backward searches are guaranteed to \"meet in the middle\", i.e. never expand a node beyond the solution midpoint. We also present a novel framework for comparing MM, A*, and brute-force search, and identify conditions favoring each algorithm. Finally, we present experimental results that support our theoretical analysis."}}
{"id": "SkNyBTeO-S", "cdate": 1420070400000, "mdate": null, "content": {"title": "A Generalization of Sleep Sets Based on Operator Sequence Redundancy", "abstract": "Pruning techniques have recently been shown to speed up search algorithms by reducing the branching factor of large search spaces. One such technique is sleep sets, which were originally introduced as a pruning technique for model checking, and which have recently been investigated on a theoretical level for planning. In this paper, we propose a generalization of sleep sets and prove its correctness. While the original sleep sets were based on the commutativity of operators, generalized sleep sets are based on a more general notion of operator sequence redundancy. As a result, our approach dominates the original sleep sets variant in terms of pruning power. On a practical level, our experimental evaluation shows the potential of sleep sets and their generalizations on a large and common set of planning benchmarks."}}
