{"id": "ock8wPTYnnYe", "cdate": 1577836800000, "mdate": null, "content": {"title": "SwarmCom: an infra-red-based mobile ad-hoc network for severely constrained robots.", "abstract": "Swarm robotics investigates groups of relatively simple robots that use decentralized control to achieve a common goal. While the robots of many swarm systems communicate via optical links, the underlying channels and their impact on swarm performance are poorly understood. This paper models the optical channel of a widely used robotic platform, the e-puck. It proposes SwarmCom, a mobile ad-hoc network for mobile robots. SwarmCom has a detector that, with the help of the channel model, was designed to adapt to the environment and nearby robots. Experiments with groups of up to 30 physical e-pucks show that (i) SwarmCom outperforms the state-of-the-art infra-red communication software—libIrcom—in range (up to 3 times further), bit error rate (between 50 and 63% lower), or throughput (up to 8 times higher) and that (ii) the maximum number of communication channels per robot is relatively low, which limits the load per robot even for high-density swarms. Using channel coding, the bit error rate can be further reduced at the expense of throughput. SwarmCom could have profound implications for swarm robotics, contributing to system understanding and reproducibility, while paving the way for novel applications."}}
{"id": "yXGbxULcwyM", "cdate": 1546300800000, "mdate": null, "content": {"title": "Towards a Swarm Robotic System for Autonomous Cereal Harvesting.", "abstract": "Swarm robotics is an emerging technology that has the potential to revolutionise precision agriculture by coordinating fleets of small autonomous vehicles to minimise soil damage, increase farming resolution, lower the cost of automation, and provide solutions that are intrinsically safer and more sustainable than large monolithic systems. Here, we propose a novel swarm robotic system for autonomous harvesting of cereal crops such as wheat and barley. In contrast to existing agricultural swarm robotic systems, we intend to use small autonomous versions of traditional agricultural vehicles, in an attempt to narrow the skills gap for future end-users."}}
{"id": "ScPT3b53b75", "cdate": 1546300800000, "mdate": null, "content": {"title": "Decentralized Gathering of Stochastic, Oblivious Agents on a Grid: A Case Study with 3D M-Blocks.", "abstract": "We propose stochastic control policies for gathering a group of embodied agents in a two-dimensional square tile environment. The policies are fully decentralized and can be executed on anonymous, oblivious agents with chirality, but no sense of orientation. The agents require only 4 ternary digits of information. We prove that a group of agents, irrespective of initial positions, will almost surely reach a Pareto optimal configuration in finite time. For one of the control policies, computer simulations show that groups of up to 20 agents consistently reach Pareto optimal configurations, whereas groups of 1000 agents, given the same amount of time, improve the compactness of their configurations on average by 89.20%. The policy also copes well with sensory noise up to a level of 50%. We also present an experimental validation using 6 physical 3D M-Block modules, demonstrating the feasibility of the stochastic control approach in practice."}}
{"id": "F5zIhPBeREC", "cdate": 1546300800000, "mdate": null, "content": {"title": "Turn-minimizing multirobot coverage.", "abstract": "Multirobot coverage is the problem of planning paths for several identical robots such that the combined regions traced out by the robots completely cover their environment. We consider the problem of multirobot coverage with the objective of minimizing the mission time, which depends on the number of turns taken by the robots. To solve this problem, we first partition the environment into ranks which are long thin rectangles the width of the robot's coverage tool. Our novel partitioning heuristic produces a set of ranks which minimizes the number of turns. Next, we solve a variant of the multiple travelling salesperson problem (m-TSP) on the set of ranks to minimize the robots' mission time. The resulting coverage plan is guaranteed to cover the entire environment. We present coverage plans for a robotic vacuum using real maps of 25 indoor environments and compare the solutions to paths planned without the objective of minimizing turns. Turn minimization reduced the number of turns by 6.7% and coverage time by 3.8% on average for teams of 1-5 robots."}}
{"id": "EMXLTfA4ORZ", "cdate": 1546300800000, "mdate": null, "content": {"title": "Balanced Task Allocation by Partitioning the Multiple Traveling Salesperson Problem.", "abstract": "Task assignment and routing are tightly coupled problems for teams of mobile agents. To fairly balance the workload, each agent should be assigned a set of tasks which take a similar amount of time to complete. The completion time depends on the time needed to travel between tasks which depends on the order of tasks. We formulate the task assignment problem as the minimum Hamiltonian partition problem (MHPP) for m agents, which is equivalent to the minmax multiple traveling salesperson problem (m-TSP). While the MHPP's cost function depends on the order of tasks, its solutions are similar to solutions of the average Hamiltonian partition problem (AHPP) whose cost function is order-invariant. We prove that the AHPP is NP-hard and present an effective heuristic, AHP, for solving it. AHP improves a partitions of a graph using a series of transfer and swap operations which are guaranteed to improve the solution's quality. The solution generated by AHP is used as an initial partition for an algorithm, AHP-mTSP, which solves the combined task assignment and routing problems to near optimality. For n tasks and m agents, each iteration of AHP is O(n^2) and AHP-mTSP has an average run-time that scales with n^2.11 m^0.33. Compared to state-of-the-art approaches, our approach found approximately 10% better solutions for large problems in a similar run-time."}}
{"id": "CX7LQ9IVPcEq", "cdate": 1546300800000, "mdate": null, "content": {"title": "Spatial Coverage Without Computation.", "abstract": "We study the problem of controlling a swarm of anonymous, mobile robots to cooperatively cover an unknown two-dimensional space. The novelty of our proposed solution is that it is applicable to extremely simple robots that lack run-time computation or storage. The solution requires only a single bit of information per robot-whether or not another robot is present in its line of sight. Computer simulations show that our deterministic controller, which was obtained through off-line optimization, achieves around 71-76% coverage in a test scenario with no robot redundancy, which corresponds to a 26-39% reduction of the area that is not covered, when compared to an optimized random walk. A moderately lower level of performance was observed in 20 experimental trials with 25 physical e-puck robots. Moreover, we demonstrate that the same controller can be used in environments of different dimensions and even to navigate a maze. The controller provides a baseline against which one can quantify the performance improvements that more advanced and expensive techniques may offer. Moreover, due to its simplicity, it could potentially be implemented on swarms of sub-millimeter-sized robots. This would pave the way for new applications in micro-medicine."}}
{"id": "Blfq6QlCqMRz", "cdate": 1546300800000, "mdate": null, "content": {"title": "A Soft-Bodied Modular Reconfigurable Robotic System Composed of Interconnected Kilobots.", "abstract": "We describe the Kilobot Soft Robot, a novel soft-bodied robot that is modular and reconfigurable. The Kilobot Soft Robot is realized by inter-connecting a group of miniature mobile modules, based on the commercially available Kilobot, through an elastic material. It moves and deforms fully autonomously. Each module executes a distributed algorithm that exploits only information that is locally obtained using omnidirectional, infrared based signaling. A series of experiments were conducted to validate the algorithm, investigating the ability of the robot to follow a predefined trajectory, to squeeze and extend its shape and to control its motion independently of the number of modules."}}
{"id": "7nqSHGhqU3", "cdate": 1546300800000, "mdate": null, "content": {"title": "Decentralized Pose Control of Modular Reconfigurable Robots Operating in Liquid Environments.", "abstract": "Modular reconfigurable robots are touted for their flexibility, as their bodies can assume a wide range of shapes. A particular challenge is to make them move efficiently in 3D without compromising the scalability of the system. This paper proposes decentralized and fully reactive controllers for pose control of 3D modular reconfigurable robots. The robots operate in liquid environments, and move by routing fluid through themselves. Each module uses only two bits of sensory information per face. Additionally, the modules can use up to five bits of information that are exchanged via shared power lines. We prove that robots of convex shape are guaranteed to reach a goal object with a preferred orientation. Using computer simulations of Modular Hydraulic Propulsion robots, all controllers are assessed for different environments, system sizes and noise, and their performances compared against a centralized controller. Given the simplicity of the solutions, modules could be realized at scales below a millimeter-cube, where robots of high spatial resolution could perform accurate movements in 3D liquid environments."}}
{"id": "1EfupTsszOv", "cdate": 1546300800000, "mdate": null, "content": {"title": "Boundary Detection in a Swarm of Kilobots.", "abstract": "This paper presents a distributed boundary detection method for a swarm of robots. It employs the cyclic-shape algorithm together with a local coordinate identification, thereby allowing boundary detection without bearing measurements. Each robot can communicate with, and estimate the distance to, its neighbouring robots. The method is validated using swarms of up to 45 Kilobot robots."}}
{"id": "i-CqjTae1wlz", "cdate": 1514764800000, "mdate": null, "content": {"title": "Re-Establishing Communication in Teams of Mobile Robots.", "abstract": "As communication is important for cooperation, teams of mobile robots need a way to re-establish a wireless connection if they get separated. We develop a method for mobile robots to maintain a belief of each other's positions using locally available information. They can use their belief to plan paths with high probabilities of reconnection. This approach also works for subteams cooperatively searching for a robot or group of robots that they would like to reconnect with. The problem is formulated as a constrained optimization problem which is solved using a branch-and-bound approach. We present simulation results showing the effectiveness of this strategy at reconnecting teams of up to five robots and compare the results to two other strategies."}}
