{"id": "aU7uUaQHTI-", "cdate": 1631914368322, "mdate": null, "content": {"title": "Private Confidence Sets", "abstract": "We consider statistical inference under privacy constraints. In particular, we give differentially private algorithms for estimating coverage probabilities and computing valid confidence sets, and prove upper bounds on the error of our estimates and the length of our confidence sets. Our bounds apply to broad classes of data distributions and statistics of interest, and for fixed $\\varepsilon$ we match the higher-order asymptotic accuracy of the standard (non-private) non-parametric bootstrap."}}
{"id": "QJZFdgdvAS5v", "cdate": 1598759082276, "mdate": null, "content": {"title": "Explaining Landscape Connectivity of Low-cost Solutions for Multilayer Nets", "abstract": "Mode connectivity is a surprising phenomenon in the loss landscape of deep nets. Optima -- at least those discovered by gradient-based optimization -- turn out to be connected by simple paths on which the loss function is almost constant. Often, these paths can be chosen to be piece-wise linear, with as few as two segments. We give mathematical explanations for this phenomenon, assuming generic properties (such as dropout stability and noise stability) of well-trained deep nets, which have previously been identified as part of understanding the generalization properties of deep nets. Our explanation holds for realistic multilayer nets, and experiments are presented to verify the theory."}}
{"id": "ByzTnBreUr", "cdate": 1567802805428, "mdate": null, "content": {"title": "Explaining Landscape Connectivity of Low-cost Solutions for Multilayer Nets", "abstract": "Mode connectivity is a surprising phenomenon in the loss landscape of deep nets. Optima---at least those discovered by gradient-based optimization---turn out to be connected by simple paths on which the loss function is almost constant. Often, these paths can be chosen to be piece-wise linear, with as few as two segments.   We give mathematical explanations for this phenomenon, assuming generic properties (such as dropout stability and noise stability) of well-trained deep nets, which have previously been identified as part of understanding the generalization properties of deep nets. Our explanation holds for realistic multilayer nets, and experiments are presented to verify the theory. "}}
{"id": "H1xipsA5K7", "cdate": 1538087875382, "mdate": null, "content": {"title": "Learning Two-layer Neural Networks with Symmetric Inputs", "abstract": "We give a new algorithm for learning a two-layer neural network under a very general class of input distributions. Assuming there is a ground-truth two-layer network \ny = A \\sigma(Wx) + \\xi,\nwhere A, W are weight matrices, \\xi represents noise, and the number of neurons in the hidden layer is no larger than the input or output,  our algorithm is guaranteed to recover the parameters A, W of the ground-truth network. The only requirement on the input x is that it is symmetric, which still allows highly complicated and structured input. \n\nOur algorithm is based on the method-of-moments framework and extends several results in tensor decompositions. We use spectral algorithms to avoid the complicated non-convex optimization in learning neural networks. Experiments show that our algorithm can robustly learn the ground-truth neural network with a small number of samples for many symmetric input distributions."}}
