{"id": "gJazaE2v8rR", "cdate": 1704067200000, "mdate": 1705785867315, "content": {"title": "Robust Meta-Model for Predicting the Need for Blood Transfusion in Non-traumatic ICU Patients", "abstract": "Objective: Blood transfusions, crucial in managing anemia and coagulopathy in ICU settings, require accurate prediction for effective resource allocation and patient risk assessment. However, existing clinical decision support systems have primarily targeted a particular patient demographic with unique medical conditions and focused on a single type of blood transfusion. This study aims to develop an advanced machine learning-based model to predict the probability of transfusion necessity over the next 24 hours for a diverse range of non-traumatic ICU patients. Methods: We conducted a retrospective cohort study on 72,072 adult non-traumatic ICU patients admitted to a high-volume US metropolitan academic hospital between 2016 and 2020. We developed a meta-learner and various machine learning models to serve as predictors, training them annually with four-year data and evaluating on the fifth, unseen year, iteratively over five years. Results: The experimental results revealed that the meta-model surpasses the other models in different development scenarios. It achieved notable performance metrics, including an Area Under the Receiver Operating Characteristic (AUROC) curve of 0.97, an accuracy rate of 0.93, and an F1-score of 0.89 in the best scenario. Conclusion: This study pioneers the use of machine learning models for predicting blood transfusion needs in a diverse cohort of critically ill patients. The findings of this evaluation confirm that our model not only predicts transfusion requirements effectively but also identifies key biomarkers for making transfusion decisions."}}
{"id": "y2lb7LCUKy", "cdate": 1672531200000, "mdate": 1705785867316, "content": {"title": "Meta-learning in healthcare: A survey", "abstract": "As a subset of machine learning, meta-learning, or learning to learn, aims at improving the model's capabilities by employing prior knowledge and experience. A meta-learning paradigm can appropriately tackle the conventional challenges of traditional learning approaches, such as insufficient number of samples, domain shifts, and generalization. These unique characteristics position meta-learning as a suitable choice for developing influential solutions in various healthcare contexts, where the available data is often insufficient, and the data collection methodologies are different. This survey discusses meta-learning broad applications in the healthcare domain to provide insight into how and where it can address critical healthcare challenges. We first describe the theoretical foundations and pivotal methods of meta-learning. We then divide the employed meta-learning approaches in the healthcare domain into two main categories of multi/single-task learning and many/few-shot learning and survey the studies. Finally, we highlight the current challenges in meta-learning research, discuss the potential solutions and provide future perspectives on meta-learning in healthcare."}}
{"id": "cyzHhBdPB7", "cdate": 1640995200000, "mdate": 1682385956691, "content": {"title": "Improving Sepsis Prediction Model Generalization With Optimal Transport", "abstract": "Sepsis is a deadly condition affecting many patients in the hospital. There have been many efforts to build models that predict the onset of sepsis, but these models tend to perform terribly when v..."}}
{"id": "FMAdaOiKGAI", "cdate": 1640995200000, "mdate": 1684098192248, "content": {"title": "ALRt: An Active Learning Framework for Irregularly Sampled Temporal Data", "abstract": "Sepsis is a deadly condition affecting many patients in the hospital. Recent studies have shown that patients diagnosed with sepsis have significant mortality and morbidity, resulting from the body's dysfunctional host response to infection. Clinicians often rely on the use of Sequential Organ Failure Assessment (SOFA), Systemic Inflammatory Response Syndrome (SIRS), and the Modified Early Warning Score (MEWS) to identify early signs of clinical deterioration requiring further work-up and treatment. However, many of these tools are manually computed and were not designed for automated computation. There have been different methods used for developing sepsis onset models, but many of these models must be trained on a sufficient number of patient observations in order to form accurate sepsis predictions. Additionally, the accurate annotation of patients with sepsis is a major ongoing challenge. In this paper, we propose the use of Active Learning Recurrent Neural Networks (ALRts) for short temporal horizons to improve the prediction of irregularly sampled temporal events such as sepsis. We show that an active learning RNN model trained on limited data can form robust sepsis predictions comparable to models using the entire training dataset."}}
{"id": "XF3_50iba_L", "cdate": 1609459200000, "mdate": 1684098337612, "content": {"title": "Towards a Learning Architecture to Support Social Scaffolding for an Artificially Intelligent Disability Assistant", "abstract": "Humanoid workers that can improve the joy and achievement of workers with intellectual and developmental disabilities (IDD) hold promise in light manufacturing settings. In this paper, we provide details of an architecture to support social scaffolding for workers with IDD and efforts to adapt it to learn. This architecture is developed for human-robot interaction using the Pepper robot and will support future improvements using machine learning. Additional recommendations based on past experimentation are given for future work."}}
{"id": "QJsE1yOk4J", "cdate": 1577836800000, "mdate": 1684098337613, "content": {"title": "AIDA: Using Social Scaffolding to Assist Workers with Intellectual and Developmental Disabilities", "abstract": "In this paper, we present a social robotics framework to assist workers with intellectual and developmental disabilities (IDD). AIDA, which stands for artificially intelligent disability assistant, will help workers with IDD through social scaffolding techniques. For the experiments, we simulated disabilities with our participants and evaluated the impact of social scaffolding with the Pepper humanoid robot. The results show that stronger forms of scaffolding are required to provide more effective assistance workers with IDD."}}
{"id": "PmFV9GlSzL2", "cdate": 1546300800000, "mdate": 1684098337605, "content": {"title": "AIDA: A Social Co-Robot to Uplift Workers with Intellectual and Developmental Disabilities", "abstract": "As an alternative to social co-robots, or collaborative robots, displacing workers in the workforce, social robots may, in the future, be used to augment workers with intellectual and developmental disabilities (IDD) and improve their work environments. We are developing AIDA, a co-robot to uplift and augment the abilities of workers who have IDD and work in a light manufacturing facility. This paper presents the design process for discovering the workers' needs and a description of our works-in-progress prototype social co-robot, AIDA, an artificially intelligent disability aide designed to function safely and securely alongside these workers."}}
