{"id": "ioBOOEdlsY", "cdate": 1546300800000, "mdate": 1681747109169, "content": {"title": "Learning Linear Dynamical Systems with Semi-Parametric Least Squares", "abstract": "We analyze a simple prefiltered variation of the least squares estimator for the problem of estimation with biased, \\emph{semi-parametric} noise, an error model studied more broadly in causal stati..."}}
{"id": "Ndq03mvcSNK", "cdate": 1546300800000, "mdate": 1696092485921, "content": {"title": "Minimax Lower Bounds for H∞-Norm Estimation", "abstract": "The problem of estimating the H∞ -norm of an LTI system from noisy input/output measurements has attracted recent attention as an alternative to parameter identification for bounding unmodeled dynamics in robust control. In this paper, we study lower bounds for H∞ -norm estimation under a query model where at each iteration the algorithm chooses a bounded input signal and receives the response of the chosen signal corrupted by white noise. We prove that when the underlying system is an FIR filter, H∞ -norm estimation is no more efficient than model identification for passive sampling. For active sampling, we show that norm estimation is at most a factor of log r more sample efficient than model identification, where r is the length of the filter. We complement our theoretical results with experiments which demonstrate that a simple nonadaptive estimator of the norm is competitive with state-of-the-art adaptive norm estimation algorithms."}}
{"id": "JjHaJMXvlB", "cdate": 1546300800000, "mdate": 1696092485917, "content": {"title": "Performance Guarantees in Learning and Robust Control", "abstract": "Author(s): Boczar, Ross J | Advisor(s): Recht, Benjamin | Abstract: As the systems we control become more complex, first-principle modeling becomes either impossible or intractable, motivating the use of machine learning techniques for the control of systems with continuous action spaces. As impressive as the empirical success of these methods have been, strong theoretical guarantees of performance, safety, or robustness are few and far between. This manuscript takes a step towards such providing such guarantees by establishing finite-data performance guarantees for identifying and controlling fully- or partially-unknown dynamical systems.In this manuscript, we explore three different viewpoints that each provide different quantitative guarantees of performance. First, we present a generalization of the classical theory of integral quadratic constraints. This generalization leads to a tractable computational procedure for finding exponential stability certificates for partially-unknown feedback systems. Second, we present non-asymptotic lower and upper bounds for core problems in the field of system identification. Finally, using the recently developed system-level synthesis framework and tools from high-dimensional statistics, we establish finite-sample performance guarantees for robust output-feedback control of an unknown dynamical system."}}
{"id": "rniv0_Lmy-b", "cdate": 1514764800000, "mdate": 1683912227634, "content": {"title": "Finite-Data Performance Guarantees for the Output-Feedback Control of an Unknown System", "abstract": "As the systems we control become more complex, first-principle modeling becomes either impossible or intractable, motivating the use of machine learning techniques for the control of systems with continuous action spaces. As impressive as the empirical successes of these methods have been, strong theoretical guarantees of performance, safety, or robustness are few and far between. This paper takes a step towards providing such guarantees by establishing finite-data performance guarantees for the robust output-feedback control of an unknown FIR SISO system. In particular, we introduce the “Coarse-ID control” pipeline, which is composed of a system identification step followed by a robust controller synthesis procedure, and analyze its end-to-end performance, providing quantitative bounds on the performance degradation suffered due to model uncertainty as a function of the number of experiments used to identify the system. We conclude with numerical examples demonstrating the effectiveness of our method."}}
{"id": "Je19MwUjIrN", "cdate": 1514764800000, "mdate": 1696092485922, "content": {"title": "On the Approximation of Toeplitz Operators for Nonparametric H∞-norm Estimation", "abstract": "Given a stable SISO LTI system G, we investigate the problem of estimating the H <sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">∞</sub> -norm of G, denoted ||G|| <sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">∞</sub> , when G is only accessible via noisy observations. Wahlberg et al. [1] recently proposed a nonparametric algorithm based on the power method for estimating the top eigenvalue of a matrix. In particular, by applying a clever time-reversal trick, Wahlberg et al. implement the power method on the top left n×n corner Tn of the Toeplitz (convolution) operator associated to G. In this paper, we prove sharp non-asymptotic bounds on the necessary length n needed so that ||Tn|| is an ε-additive approximation of ||G|| <sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">∞</sub> . Furthermore, in the process of demonstrating the sharpness of our bounds, we construct a simple family of finite impulse response (FIR) filters where the number of timesteps needed for the power method is arbitrarily worse than the number of timesteps needed for parametric FIR identification via least-squares to achieve the same ε-additive approximation."}}
{"id": "EfkVg190huD", "cdate": 1514764800000, "mdate": 1696092485923, "content": {"title": "Minimax Lower Bounds for ℋ∞-Norm Estimation", "abstract": "The problem of estimating the $\\mathcal{H}_\\infty$-norm of an LTI system from noisy input/output measurements has attracted recent attention as an alternative to parameter identification for bounding unmodeled dynamics in robust control. In this paper, we study lower bounds for $\\mathcal{H}_\\infty$-norm estimation under a query model where at each iteration the algorithm chooses a bounded input signal and receives the response of the chosen signal corrupted by white noise. We prove that when the underlying system is an FIR filter, $\\mathcal{H}_\\infty$-norm estimation is no more efficient than model identification for passive sampling. For active sampling, we show that norm estimation is at most a factor of $\\log{r}$ more sample efficient than model identification, where $r$ is the length of the filter. We complement our theoretical results with experiments which demonstrate that a simple non-adaptive estimator of the norm is competitive with state-of-the-art adaptive norm estimation algorithms."}}
{"id": "vng4yvQDtc", "cdate": 1483228800000, "mdate": 1696092485924, "content": {"title": "On the Approximation of Toeplitz Operators for Nonparametric $\\mathcal{H}_\\infty$-norm Estimation", "abstract": "Given a stable SISO LTI system $G$, we investigate the problem of estimating the $\\mathcal{H}_\\infty$-norm of $G$, denoted $||G||_\\infty$, when $G$ is only accessible via noisy observations. Wahlberg et al. recently proposed a nonparametric algorithm based on the power method for estimating the top eigenvalue of a matrix. In particular, by applying a clever time-reversal trick, Wahlberg et al. implement the power method on the top left $n \\times n$ corner $T_n$ of the Toeplitz (convolution) operator associated with $G$. In this paper, we prove sharp non-asymptotic bounds on the necessary length $n$ needed so that $||T_n||$ is an $\\varepsilon$-additive approximation of $||G||_\\infty$. Furthermore, in the process of demonstrating the sharpness of our bounds, we construct a simple family of finite impulse response (FIR) filters where the number of timesteps needed for the power method is arbitrarily worse than the number of timesteps needed for parametric FIR identification via least-squares to achieve the same $\\varepsilon$-additive approximation."}}
{"id": "U9GGz2EekoP", "cdate": 1483228800000, "mdate": 1696092485935, "content": {"title": "Non-Asymptotic Analysis of Robust Control from Coarse-Grained Identification", "abstract": "This work explores the trade-off between the number of samples required to accurately build models of dynamical systems and the degradation of performance in various control objectives due to a coarse approximation. In particular, we show that simple models can be easily fit from input/output data and are sufficient for achieving various control objectives. We derive bounds on the number of noisy input/output samples from a stable linear time-invariant system that are sufficient to guarantee that the corresponding finite impulse response approximation is close to the true system in the $\\mathcal{H}_\\infty$-norm. We demonstrate that these demands are lower than those derived in prior art which aimed to accurately identify dynamical models. We also explore how different physical input constraints, such as power constraints, affect the sample complexity. Finally, we show how our analysis fits within the established framework of robust control, by demonstrating how a controller designed for an approximate system provably meets performance objectives on the true system."}}
{"id": "K2mOE60CDo", "cdate": 1483228800000, "mdate": 1696092485953, "content": {"title": "Exponential Stability Analysis via Integral Quadratic Constraints", "abstract": "The theory of integral quadratic constraints (IQCs) allows verification of stability and gain-bound properties of systems containing nonlinear or uncertain elements. Gain bounds often imply exponential stability, but it can be challenging to compute useful numerical bounds on the exponential decay rate. This work presents a generalization of the classical IQC results of Megretski and Rantzer that leads to a tractable computational procedure for finding exponential rate certificates that are far less conservative than ones computed from $L_2$ gain bounds alone. An expanded library of IQCs for certifying exponential stability is also provided and the effectiveness of the technique is demonstrated via numerical examples."}}
{"id": "BJbYLhbdbr", "cdate": 1451606400000, "mdate": null, "content": {"title": "Low-rank Solutions of Linear Matrix Equations via Procrustes Flow", "abstract": "In this paper we study the problem of recovering a low-rank matrix from linear measurements. Our algorithm, which we call Procrustes Flow, starts from an initial estimate obtained by a thresholding..."}}
