{"id": "zzCjqS_ouLe", "cdate": 1700896760314, "mdate": 1700896760314, "content": {"title": "Investigating Answerability of LLMs for Long-Form Question Answering", "abstract": "Investigating Answerability of LLMs for Long-Form Question Answering"}}
{"id": "PgBwRUDLu3K", "cdate": 1672626256315, "mdate": 1672626256315, "content": {"title": "LayoutDETR: Detection Transformer Is a Good Multimodal Layout Designer", "abstract": "Graphic layout designs play an essential role in visual communication. Yet handcrafting layout designs are skill-demanding, time-consuming, and non-scalable to batch production. Although generative models emerge to make design automation no longer utopian, it remains non-trivial to customize designs that comply with designers' multimodal desires, i.e., constrained by background images and driven by foreground contents. In this study, we propose \\textit{LayoutDETR} that inherits the high quality and realism from generative modeling, in the meanwhile reformulating content-aware requirements as a detection problem: we learn to detect in a background image the reasonable locations, scales, and spatial relations for multimodal elements in a layout. Experiments validate that our solution yields new state-of-the-art performance for layout generation on public benchmarks and on our newly-curated ads banner dataset. For practical usage, we build our solution into a graphical system that facilitates user studies. We demonstrate that our designs attract more subjective preference than baselines by significant margins. Our code, models, dataset, graphical system, and demos are available at GitHub."}}
{"id": "BJblpbGuZB", "cdate": 1514764800000, "mdate": null, "content": {"title": "Integrating Transformer and Paraphrase Rules for Sentence Simplification", "abstract": "Sentence simplification aims to reduce the complexity of a sentence while retaining its original meaning. Current models for sentence simplification adopted ideas from ma- chine translation studies and implicitly learned simplification mapping rules from normal- simple sentence pairs. In this paper, we explore a novel model based on a multi-layer and multi-head attention architecture and we pro- pose two innovative approaches to integrate the Simple PPDB (A Paraphrase Database for Simplification), an external paraphrase knowledge base for simplification that covers a wide range of real-world simplification rules. The experiments show that the integration provides two major benefits: (1) the integrated model outperforms multiple state- of-the-art baseline models for sentence simplification in the literature (2) through analysis of the rule utilization, the model seeks to select more accurate simplification rules. The code and models used in the paper are available at this https URL Sanqiang/text_simplification."}}
{"id": "SyWHVax_WB", "cdate": 1483228800000, "mdate": null, "content": {"title": "Deep Keyphrase Generation", "abstract": "© 2017 Association for Computational Linguistics. Keyphrase provides highly-summative information that can be effectively used for understanding, organizing and retrieving text content. Though previous studies have provided many workable solutions for automated keyphrase extraction, they commonly divided the to-be-summarized content into multiple text chunks, then ranked and selected the most meaningful ones. These approaches could neither identify keyphrases that do not appear in the text, nor capture the real semantic meaning behind the text. We propose a generative model for keyphrase prediction with an encoder-decoder framework, which can effectively overcome the above drawbacks. We name it as deep keyphrase generation since it attempts to capture the deep semantic meaning of the content with a deep learning method. Empirical analysis on six datasets demonstrates that our proposed model not only achieves a significant performance boost on extracting keyphrases that appear in the source text, but also can generate absent keyphrases based on the semantic meaning of the text. Code and dataset are available at https://github.com/memray/seq2seqkeyphrase."}}
{"id": "Bk-RHL-uWr", "cdate": 1451606400000, "mdate": null, "content": {"title": "Exploring Knowledge Learning in Collaborative Information Seeking Process", "abstract": ""}}
