{"id": "HyEzBc-O-r", "cdate": 1514764800000, "mdate": null, "content": {"title": "Predicting Muscle Activity and Joint Angle from Skin Shape", "abstract": "Muscle of human body can be a clue to recognize the behavior and intention of a person. If the muscle activity is measured only by visual observation, it is useful to estimate the state of the muscle. In this paper, a method of predicting muscle activity and joint angle of human body from skin shape is proposed. Since the muscle activity and the joint angle affect the skin shape, the both factors should be considered simultaneously. The proposed method is a learning-based approach that uses the data set of the skin shape, the muscle activity and the joint angle. It trains a linear regressor for predicting muscle activity and joint angle from skin shape. The deformation of skin shape is calculated as the feature in the active regions, which are extracted from the training data and limits the regions of the skin shape that contribute to the prediction. We acquired a lower limb with simple motion to consider the small number of factors in this paper. In the experiment, the muscle activity and joint angle are predicted even in the case that the both factors change simultaneously. The skin regions that contributes to prediction are given as the result of learning, and the distribution is reasonable from the viewpoint of biomechanics."}}
{"id": "r1VPkbMOZS", "cdate": 1483228800000, "mdate": null, "content": {"title": "Depth Estimation Using Structured Light Flow - Analysis of Projected Pattern Flow on an Object's Surface", "abstract": "Shape reconstruction techniques using structured light have been widely researched and developed due to their robustness, high precision, and density. Because the techniques are based on decoding a pattern to find correspondences, it implicitly requires that the projected patterns be clearly captured by an image sensor, i.e., to avoid defocus and motion blur of the projected pattern. Although intensive researches have been conducted for solving defocus blur, few researches for motion blur and only solution is to capture with extremely fast shutter speed. In this paper, unlike the previous approaches, we actively utilize motion blur, which we refer to as a light flow, to estimate depth. Analysis reveals that minimum two light flows, which are retrieved from two projected patterns on the object, are required for depth estimation. To retrieve two light flows at the same time, two sets of parallel line patterns are illuminated from two video projectors and the size of motion blur of each line is precisely measured. By analyzing the light flows, i.e. lengths of the blurs, scene depth information is estimated. In the experiments, 3D shapes of fast moving objects, which are inevitably captured with motion blur, are successfully reconstructed by our technique."}}
{"id": "SJEJnkMuZB", "cdate": 1483228800000, "mdate": null, "content": {"title": "Illuminant-Camera Communication to Observe Moving Objects under Strong External Light by Spread Spectrum Modulation", "abstract": "Many algorithms of computer vision use light sources to illuminate objects to actively create situation appropriate to extract their characteristics. For example, the shape and reflectance are measured by a projector-camera system, and some human-machine or VR systems use projectors and displays for interaction. As existing active lighting systems usually assume no severe external lights to observe projected lights clearly, it is one of the limitations of active illumination. In this paper, we propose a method of energy-efficient active illumination in an environment with severe external lights. The proposed method extracts the light signals of illuminants by removing external light using spread spectrum modulation. Because an image sequence is needed to observe modulated signals, the proposed method extends signal processing to realize signal detection projected onto moving objects by combining spread spectrum modulation and spatio-temporal filtering. In the experiments, we apply the proposed method to a structured-light system under sunlight, to photometric stereo with external lights, and to insensible image embedding."}}
{"id": "B74VcsBeOaH", "cdate": 1388534400000, "mdate": null, "content": {"title": "Dense 3D Reconstruction from High Frame-Rate Video Using a Static Grid Pattern.", "abstract": "Dense 3D reconstruction of fast moving objects could contribute to various applications such as body structure analysis, accident avoidance, and so on. In this paper, we propose a technique based on a one-shot scanning method, which reconstructs 3D shapes for each frame of a high frame-rate video capturing the scenes projected by a static pattern. To avoid instability of image processing, we restrict the number of colors used in the pattern to less than two. The proposed technique comprises (1) an efficient algorithm to eliminate ambiguity of projected parallel-line patterns by using intersection points, (2) a batch reconstruction algorithm of multiple frames by using spatio-temporal constraints, and (3) an efficient detection method of color-encoded grid pattern based on de Bruijn sequence. In the experiments, the line detection algorithm worked effectively and the dense reconstruction algorithm produces accurate and robust results. We also show the improved results by using temporal constraints. Finally, the dense reconstructions of fast moving objects in a high frame-rate video are presented."}}
{"id": "B1WVAnbO-B", "cdate": 1388534400000, "mdate": null, "content": {"title": "Symmetry-Aware Nonrigid Matching of Incomplete 3D Surfaces", "abstract": "We present a nonrigid shape matching technique for establishing correspondences of incomplete 3D surfaces that exhibit intrinsic reflectional symmetry. The key for solving the symmetry ambiguity problem is to use a point-wise local mesh descriptor that has orientation and is thus sensitive to local reflectional symmetry, e.g. discriminating the left hand and the right hand. We devise a way to compute the descriptor orientation by taking the gradients of a scalar field called the average diffusion distance (ADD). Because ADD is smoothly defined on a surface, invariant under isometry/scale and robust to topological errors, the robustness of the descriptor to non-rigid deformations is improved. In addition, we propose a graph matching algorithm called iterative spectral relaxation which combines spectral embedding and spectral graph matching. This formulation allows us to define pairwise constraints in a scale-invariant manner from k-nearest neighbor local pairs such that non-isometric deformations can be robustly handled. Experimental results show that our method can match challenging surfaces with global intrinsic symmetry, data incompleteness and non-isometric deformations."}}
{"id": "BQNb6xwgu6S", "cdate": 1356998400000, "mdate": null, "content": {"title": "Guest Editorial: 3D Imaging, Processing and Modelling.", "abstract": ""}}
{"id": "S1-kDY-_-B", "cdate": 1325376000000, "mdate": null, "content": {"title": "Single Color One-Shot Scan Using Topology Information", "abstract": "In this paper, we propose a new technique to achieve one-shot scan using single color and static pattern projector; such a method is ideal for acquisition of a moving object. Since a projector-camera systems generally have uncertainties on retrieving correspondences between the captured image and the projected pattern, many solutions have been proposed. Especially for one-shot scan, which means that only a single image is used for reconstruction, positional information of a pixel on the projected pattern should be encoded by spatial and/or color information. Although color information is frequently used for encoding, it is severely affected by texture and material of the object. In this paper, we propose a technique to solve the problem by using topological information instead of colors. Our technique successfully realizes one-shot scan with monochrome pattern."}}
{"id": "SJ-m4ZMObr", "cdate": 1293840000000, "mdate": null, "content": {"title": "Dense one-shot 3D reconstruction by detecting continuous regions with parallel line projection", "abstract": "3D scanning of moving objects has many applications, for example, marker-less motion capture, analysis on fluid dynamics, object explosion and so on. One of the approach to acquire accurate shape is a projector-camera system, especially the methods that reconstructs a shape by using a single image with static pattern is suitable for capturing fast moving object. In this paper, we propose a method that uses a grid pattern consisting of sets of parallel lines. The pattern is spatially encoded by a periodic color pattern. While informations are sparse in the camera image, the proposed method extracts the dense (pixel-wise) phase informations from the sparse pattern. As the result, continuous regions in the camera images can be extracted by analyzing the phase. Since there remain one DOF for each region, we propose the linear solution to eliminate the DOF by using geometric informations of the devices, i.e. epipolar constraint. In addition, solution space is finite because projected pattern consists of parallel lines with same intervals, the linear equation can be efficiently solved by integer least square method. In this paper, the formulations for both single and multiple projectors are presented. We evaluated the accuracy of correspondences and showed the comparison with respect to the number of projectors by simulation. Finally, the dense 3D reconstruction of moving objects are presented in the experiments."}}
{"id": "H1bEykGd-B", "cdate": 1262304000000, "mdate": null, "content": {"title": "One-shot scanning method using an unealibrated projector and camera system", "abstract": "In this paper, we describe a new one-shot scanning technique using a camera and a projector. Generally, a 3D measurement system based on a camera and a projector requires pre-calibration, such as the measurement of the relative position of these devices. If we can eliminate the calibration process, it would greatly improve the convenience of the system. For example, a single capture by a hand-held camera of an object illuminated by a hand-held projector would then allow to reconstruct the object shape. To achieve this, we propose a self-calibration technique using a projected grid pattern, computing the relative pose of projector and camera. This is similar to the relative pose or motion problem for two cameras, but in our case correspondences are not explicitly given. The actual algorithm is based on a simple exhaustive search of a finite set of hypotheses, with a cost function based on the epipolar constraint. In the experiments, successful reconstructions with our proposed method using synthetic and read data are presented."}}
{"id": "S1ZiLZG_-B", "cdate": 1230768000000, "mdate": null, "content": {"title": "Dense 3D reconstruction method using a single pattern for fast moving object", "abstract": "Dense 3D reconstruction of extremely fast moving objects could contribute to various applications such as body structure analysis and accident avoidance and so on. The actual cases for scanning we assume are, for example, acquiring sequential shape at the moment when an object explodes, or observing fast rotating turbine's blades. In this paper, we propose such a technique based on a one-shot scanning method that reconstructs 3D shape from a single image where dense and simple pattern are projected onto an object. To realize dense 3D reconstruction from a single image, there are several issues to be solved; e.g. instability derived from using multiple colors, and difficulty on detecting dense pattern because of influence of object color and texture compression. This paper describes the solutions of the issues by combining two methods, that is (1) an efficient line detection technique based on de Bruijn sequence and belief propagation, and (2) an extension of shape from intersections of lines method. As a result, a scanning system that can capture an object in fast motion has been actually developed by using a high-speed camera. In the experiments, the proposed method successfully captured the sequence of dense shapes of an exploding balloon, and a breaking ceramic dish at 300–1000 fps."}}
