{"id": "useyy4qdeVv", "cdate": 1672531200000, "mdate": 1681725919606, "content": {"title": "Exploring Category Structure with Contextual Language Models and Lexical Semantic Networks", "abstract": "Recent work on predicting category structure with distributional models, using either static word embeddings (Heyman and Heyman, 2019) or contextualized language models (CLMs) (Misra et al., 2021), report low correlations with human ratings, thus calling into question their plausibility as models of human semantic memory. In this work, we revisit this question testing a wider array of methods for probing CLMs for predicting typicality scores. Our experiments, using BERT (Devlin et al., 2018), show the importance of using the right type of CLM probes, as our best BERT-based typicality prediction methods substantially improve over previous works. Second, our results highlight the importance of polysemy in this task: our best results are obtained when using a disambiguation mechanism. Finally, additional experiments reveal that Information Contentbased WordNet (Miller, 1995), also endowed with disambiguation, match the performance of the best BERT-based method, and in fact capture complementary information, which can be combined with BERT to achieve enhanced typicality predictions."}}
{"id": "XslDCQGqPuC", "cdate": 1577836800000, "mdate": null, "content": {"title": "Skill Rating for Multiplayer Games. Introducing Hypernode Graphs and their Spectral Theory", "abstract": "We consider the skill rating problem for multiplayer games, that is how to infer player skills from game outcomes in multiplayer games. We formulate the problem as a minimization problem $\\arg \\min_{s} s^T \\Delta s$ where $\\Delta$ is a positive semidefinite matrix and $s$ a real-valued function, of which some entries are the skill values to be inferred and other entries are constrained by the game outcomes. We leverage graph-based semi-supervised learning (SSL) algorithms for this problem. We apply our algorithms on several data sets of multiplayer games and obtain very promising results compared to Elo Duelling (see Elo, 1978) and TrueSkill (see Herbrich et al., 2006).. As we leverage graph-based SSL algorithms and because games can be seen as relations between sets of players, we then generalize the approach. For this aim, we introduce a new finite model, called hypernode graph, defined to be a set of weighted binary relations between sets of nodes. We define Laplacians of hypernode graphs. Then, we show that the skill rating problem for multiplayer games can be formulated as $\\arg \\min_{s} s^T \\Delta s$ where $\\Delta$ is the Laplacian of a hypernode graph constructed from a set of games. From a fundamental perspective, we show that hypernode graph Laplacians are symmetric positive semidefinite matrices with constant functions in their null space. We show that problems on hypernode graphs can not be solved with graph constructions and graph kernels. We relate hypernode graphs to signed graphs showing that positive relations between groups can lead to negative relations between individuals."}}
{"id": "xIye6NAor4", "cdate": 1388534400000, "mdate": 1681725919740, "content": {"title": "Hypernode Graphs for Spectral Learning on Binary Relations over Sets", "abstract": ""}}
{"id": "h3SaXGaAerz", "cdate": 1356998400000, "mdate": 1681725919842, "content": {"title": "Query induction with schema-guided pruning strategies", "abstract": "Inference algorithms for tree automata that define node selecting queries in unranked trees rely on tree pruning strategies. These impose additional assumptions on node selection that are needed to compensate for small numbers of annotated examples. Pruning-based heuristics in query learning algorithms for Web information extraction often boost the learning quality and speed up the learning process. We will distinguish the class of regular queries that are stable under a given schemaguided pruning strategy, and show that this class is learnable with polynomial time and data. Our learning algorithm is obtained by adding pruning heuristics to the traditional learning algorithm for tree automata from positive and negative examples. While justified by a formal learning model, our learning algorithm for stable queries also performs very well in practice of XML information extraction."}}
{"id": "PyMukzsWAF", "cdate": 1356998400000, "mdate": 1681725919794, "content": {"title": "Learning from Multiple Graphs Using a Sigmoid Kernel", "abstract": ""}}
{"id": "UU2qNwGCBC", "cdate": 1325376000000, "mdate": 1681725919761, "content": {"title": "Learning Multiple Tasks with Boosted Decision Trees", "abstract": ""}}
{"id": "lUjhUMeN_b", "cdate": 1262304000000, "mdate": 1681725919641, "content": {"title": "Boosting Multi-Task Weak Learners with Applications to Textual and Social Data", "abstract": ""}}
