{"id": "jlP7WhJZkB", "cdate": 1640995200000, "mdate": 1694263975454, "content": {"title": "Twilight: A Differentially Private Payment Channel Network", "abstract": ""}}
{"id": "i1aPbLdET-", "cdate": 1640995200000, "mdate": 1694263975313, "content": {"title": "Survey on Blockchain Networking: Context, State-of-the-Art, Challenges", "abstract": "Blockchains, in general, and cryptocurrencies such as Bitcoin, in particular, are realized using distributed systems and hence critically rely on the performance and security of the interconnecting network. The requirements on these networks and their usage, however, can differ significantly from traditional communication networks, with implications on all layers of the protocol stack. This article is motivated by these differences and, in particular, by the observation that many fundamental design aspects of these networks are not well-understood today. To support the networking community to contribute to this emerging application domain, we present a structured overview of the field, from topology and neighbor discovery, over block and transaction propagation, to sharding and off-chain networks, also reviewing existing empirical results from different measurement studies. In particular, for each of these domains, we provide the context, highlighting differences and commonalities with traditional networks, review the state-of-the-art, and identify open research challenges. Our article can hence also be seen as a call-to-arms to improve the foundation on top of which blockchains are built."}}
{"id": "e-nM4PMIc4m", "cdate": 1640995200000, "mdate": 1694263975318, "content": {"title": "Twilight: A Differentially Private Payment Channel Network", "abstract": ""}}
{"id": "3MLDqD0_bFN", "cdate": 1640995200000, "mdate": 1694263975315, "content": {"title": "Blockchain Stretching & Squeezing: Manipulating Time for Your Best Interest", "abstract": "We present a novel way for cryptocurrency miners to manipulate the effective interest-rate on loans or deposits they make on decentralized finance (DeFi) platforms by manipulating difficulty-adjustment algorithms (DAAs) and changing the block-rate. This presents a new class of strategic manipulations available to miners. These manipulations allow miners to stretch and squeeze the time between consecutive blocks. We analyze these manipulations both analytically and empirically, and show that a 25% miner can stretch the time between consecutive blocks by up to 54% in Ethereum and 33% in Bitcoin, and squeeze it by up to 9% in Ethereum. Ethereum is particularly vulnerable, and even relatively small miners can seriously affect the block-rate. An interesting application of these manipulations is to create an artificial interest-rate gap between loans taken from one DeFi platform which accrues interest according to block height (such as Compound [66]) and deposited in some other platform that does so according to elapsed time (like a bank, or other DeFi platforms such as Aave [99]). Hence, stretching and squeezing the block-rate can decrease the interest paid on DeFi loans relative to external financial platforms. The profit made from this interest-rate gap provides a large incentive for miners to deviate. For example, a 25% Ethereum miner using our manipulations can increase mining profits by up to 35%, even after taking potential losses into consideration, such as less block-rewards. Our analysis of these manipulations and their mitigations has broad implications with regards to commonly-used cryptocurrency mechanisms and paradigms, such as Ethereum's difficulty-adjustment algorithm and reward schemes, with Ethereum's handling of uncle blocks being particularly manipulable. Interestingly, Bitcoin's mechanism is more resistant Ethereum's, owing to its larger incentives and a more resilient DAA."}}
{"id": "jt3qnimU8t", "cdate": 1577836800000, "mdate": 1694263975458, "content": {"title": "Proofs of Useless Work - Positive and Negative Results for Wasteless Mining Systems", "abstract": "Many blockchain systems today, including Bitcoin, rely on Proof of Work (PoW). Proof of work is crucial to the liveness and security of cryptocurrencies. The assumption when using PoW is that a lot of trial and error is required on average before a valid block is generated. One of the main concerns raised with regard to this kind of system is the inherent need to \"waste\" energy on \"meaningless\" problems. In fact, the Bitcoin system is believed to consume more electricity than several small countries. In this work we formally define three properties that are necessary for wasteless PoW systems: (1) solve \"meaningful\" problems (2) solve them efficiently and (3) be secure against double-spend attacks. These properties aim to create an open market for problem-solving, in which miners produce solutions to problems in the most efficient way (wasteless). The security of the system stems from the economical incentive created by the demand for solutions to these problems. We analyze these properties, and deduce constraints that must apply to such PoW systems. In our main result, we conclude that under realistic assumptions, the set of allowed problems must be preimage resistant functions in order to keep the system secure and efficient."}}
{"id": "fKXUSj1sQO", "cdate": 1577836800000, "mdate": 1694263975455, "content": {"title": "Survey on Cryptocurrency Networking: Context, State-of-the-Art, Challenges", "abstract": "Cryptocurrencies such as Bitcoin are realized using distributed systems and hence critically rely on the performance and security of the interconnecting network. The requirements on these networks and their usage, however can differ significantly from traditional communication networks, with implications on all layers of the protocol stack. This paper is motivated by these differences, and in particular by the observation that many fundamental design aspects of these networks are not well-understood today. In order to support the networking community to contribute to this emerging application domain, we present a structured overview of the field, from topology and neighbor discovery to block and transaction propagation. In particular, we provide the context, highlighting differences and commonalities with traditional networks, review the state-of-the-art, and identify open research challenges. Our paper can hence also be seen as a call-to-arms to improve the foundation on top of which cryptocurrencies are built."}}
{"id": "WcU5sWC31L3", "cdate": 1577836800000, "mdate": 1694263975465, "content": {"title": "On Search Friction of Route Discovery in Offchain Networks", "abstract": "Offchain networks provide a promising solution to overcome the scalability challenges of cryptocurrencies. However, design tradeoffs of offchain networks are still not well-understood today. In particular, offchain networks typically rely on fees-based incentives and hence require mechanisms for the efficient discovery of \"good routes\": routes with low fees (cost efficiency) and a high success rate of the transaction routing (effectiveness). Furthermore the route discovery should be confidential (privacy), and e.g., not reveal information about who transacts with whom or about the transaction value. This paper provides an analysis of the \"search friction\" of route discovery, i.e., the costs and tradeoffs of route discovery in large-scale offchain networks in which nodes behave strategically. As a case study, we consider the Lightning network and the route discovery service provided by the trampoline nodes, evaluating the tradeoff in different scenarios also empirically. Finally, we initiate the discussion of alternative charging schemes for offchain networks."}}
{"id": "LUq2q7B_0qx", "cdate": 1577836800000, "mdate": 1694263975455, "content": {"title": "SOK: cryptocurrency networking context, state-of-the-art, challenges", "abstract": "Cryptocurrencies such as Bitcoin are realized using distributed systems and hence critically rely on the performance and security of the interconnecting network. The requirements on these networks and their usage, however can differ significantly from traditional communication networks, with implications on all layers of the protocol stack. This paper is motivated by these differences, and in particular by the observation that many fundamental design aspects of these networks are not well-understood today. In order to support the networking community to contribute to this emerging application domain, we present a structured overview of the field, from topology and neighbor discovery to block and transaction propagation. In particular, we provide the context, highlighting differences and commonalities with traditional networks, review the state-of-the-art, and identify open research challenges. Our paper can hence also be seen as a call-to-arms to improve the foundation on top of which cryptocurrencies are built."}}
{"id": "Ge8-JvrH-F", "cdate": 1577836800000, "mdate": 1694263975319, "content": {"title": "How to Pick Your Friends A Game Theoretic Approach to P2P Overlay Construction", "abstract": "A major limitation of many blockchain systems is the lack of strong identities in the underlying P2P network. This allows any nodes to attack the system by creating multiple false personas, thereby disrupting the network's connectivity and sabotaging its operation. In this paper, we focus on P2P networks, and explore practical ways to defend them from such attacks. To do so, we employ a game theoretic approach to the management of each peer's list of known nodes and to the overlay construction mechanisms that utilize this list. We consider the interaction between the defender and attacker as a game. We show that the cost of attacks can be driven up substantially if the defender utilizes available information about peers it chooses to connect to, such as their IP address. In addition to theoretical analysis of the underlying game, we apply our approach to the Bitcoin P2P network and derive effective and practical strategies that guarantee a high safety level against attacks."}}
{"id": "GXnA3aaTdPY", "cdate": 1577836800000, "mdate": 1694263975455, "content": {"title": "On Search Friction of Route Discovery in Offchain Networks", "abstract": "Offchain networks provide a promising solution to overcome the scalability challenges of cryptocurrencies. However, design tradeoffs of offchain networks are still not well-understood today. In particular, offchain networks typically rely on fees-based incentives and hence require mechanisms for the efficient discovery of ``good routes'': routes with low fees (cost efficiency) and a high success rate of the transaction routing (effectiveness). Furthermore, the route discovery should be confidential (privacy), and e.g., not reveal information about who transacts with whom or about the transaction value. This paper provides an analysis of the ``search friction'' of route discovery, i.e., the costs and tradeoffs of route discovery in large-scale offchain networks in which nodes behave strategically. As a case study, we consider the Lighning network and the route discovery service provided by the trampoline nodes, evaluating the tradeoff in different scenarios also empirically. Finally, we initiate the discussion of alternative charging schemes for offchain networks."}}
