{"id": "xIVVKtKaS0", "cdate": 1673748332053, "mdate": 1673748332053, "content": {"title": "Learning from Physics Experiments with Quantum Computers: Applications in Muon Spectroscopy", "abstract": "Computational physics is an important tool for analyzing, verifying, and—at times—replacing physical experiments. Nevertheless, simulating quantum systems and analyzing quantum data has so far resisted an efficient classical treatment in full generality. While programmable quantum systems have been developed to address this challenge, the resources required for classically intractable problems still lie beyond our reach. In this work, we consider a new target for quantum-simulation algorithms; analyzing the data arising from physics experiments—specifically, muon-spectroscopy experiments. These experiments can be used to probe the quantum interactions present in condensed-matter systems. However, fully analyzing their results can require classical computational resources scaling exponentially with the simulated system size, which can limit our understanding of the studied system. We show that this task may be a natural fit for the coming generations of quantum computers. We use classical emulations of our quantum algorithm on systems of up to 29 qubits to analyze real experimental data, and to estimate both the near-term and error-corrected resources required for our proposal. We find that our algorithm exhibits good noise resilience, stemming from our desire to extract global parameters from a fitted curve, rather than targeting any individual data point. In some respects, our fault tolerant resource estimates go further than some prior work in quantum simulation, by estimating the resources required to solve a complete task, rather than just to run a given circuit. Taking the overhead of observable measurement and calculating multiple datapoints into account, we find that significant challenges still remain if our algorithm is to become practical for analyzing muon-spectroscopy data."}}
{"id": "f9C7Fi22CN", "cdate": 1673748244131, "mdate": 1673748244131, "content": {"title": "Quantum state preparation without coherent arithmetic", "abstract": "We introduce a versatile method for preparing a quantum state whose amplitudes are given by some known function. Unlike existing approaches, our method does not require handcrafted reversible arithmetic circuits, or quantum memory loads, to encode the function values. Instead, we use a template quantum eigenvalue transformation circuit to convert a low cost block encoding of the sine function into the desired function. Our method uses only 4 ancilla qubits (3 if the approximating polynomial has definite parity), providing order-of-magnitude qubit count reductions compared to state-of-the-art approaches, while using a similar number of Toffoli gates if the function can be well represented by a polynomial or Fourier approximation. Like black-box methods, the complexity of our approach depends on the 'L2-norm filling-fraction' of the function. We demonstrate the efficiency of our method for preparing states commonly used in quantum algorithms, such as Gaussian and Kaiser window states."}}
{"id": "sxhd1DciBy", "cdate": 1673748171227, "mdate": null, "content": {"title": "A streamlined quantum algorithm for topological data analysis with exponentially fewer qubits", "abstract": "Topological invariants of a dataset, such as the number of holes that survive from one length scale to another (persistent Betti numbers) can be used to analyse and classify data in machine learning applications. We present an improved quantum algorithm for computing persistent Betti numbers, and provide an end-to-end complexity analysis. Our approach provides large polynomial time improvements, and an exponential space saving, over existing quantum algorithms. Subject to gap dependencies, our algorithm obtains an almost quintic speedup in the number of datapoints over rigorous state-of-the-art classical algorithms for calculating the persistent Betti numbers to constant additive error - the salient task for applications. However, this may be reduced to closer to quadratic when compared against heuristic classical methods and observed scalings. We discuss whether quantum algorithms can achieve an exponential speedup for tasks of practical interest, as claimed previously. We conclude that there is currently no evidence that this is the case."}}
