{"id": "xvT62G0b_k", "cdate": 1640995200000, "mdate": 1694499109208, "content": {"title": "Shopping Queries Dataset: A Large-Scale ESCI Benchmark for Improving Product Search", "abstract": "Improving the quality of search results can significantly enhance users experience and engagement with search engines. In spite of several recent advancements in the fields of machine learning and data mining, correctly classifying items for a particular user search query has been a long-standing challenge, which still has a large room for improvement. This paper introduces the \"Shopping Queries Dataset\", a large dataset of difficult Amazon search queries and results, publicly released with the aim of fostering research in improving the quality of search results. The dataset contains around 130 thousand unique queries and 2.6 million manually labeled (query,product) relevance judgements. The dataset is multilingual with queries in English, Japanese, and Spanish. The Shopping Queries Dataset is being used in one of the KDDCup'22 challenges. In this paper, we describe the dataset and present three evaluation tasks along with baseline results: (i) ranking the results list, (ii) classifying product results into relevance categories, and (iii) identifying substitute products for a given query. We anticipate that this data will become the gold standard for future research in the topic of product search."}}
{"id": "MXuFavy8vR", "cdate": 1640995200000, "mdate": 1694499108686, "content": {"title": "Monolith to Microservices: Representing Application Software through Heterogeneous Graph Neural Network", "abstract": "Monolithic software encapsulates all functional capabilities into a single deployable unit. But managing it becomes harder as the demand for new functionalities grow. Microservice architecture is seen as an alternative as it advocates building an application through a set of loosely coupled small services wherein each service owns a single functional responsibility. But the challenges associated with the separation of functional modules, slows down the migration of a monolithic code into microservices. In this work, we propose a representation learning based solution to tackle this problem. We use a heterogeneous graph to jointly represent software artifacts (like programs and resources) and the different relationships they share (function calls, inheritance, etc.), and perform a constraint-based clustering through a novel heterogeneous graph neural network. Experimental studies show that our approach is effective on monoliths of different types."}}
{"id": "Iwz6gsRyiz", "cdate": 1640995200000, "mdate": 1694499108739, "content": {"title": "Dynamic Structure Learning through Graph Neural Network for Forecasting Soil Moisture in Precision Agriculture", "abstract": "Soil moisture is an important component of precision agriculture as it directly impacts the growth and quality of vegetation. Forecasting soil moisture is essential to schedule the irrigation and optimize the use of water. Physics based soil moisture models need rich features and heavy computation which is not scalable. In recent literature, conventional machine learning models have been applied for this problem. These models are fast and simple, but they often fail to capture the spatio-temporal correlation that soil moisture exhibits over a region. In this work, we propose a novel graph neural network based solution that learns temporal graph structures and forecast soil moisture in an end-to-end framework. Our solution is able to handle the problem of missing ground truth soil moisture which is common in practice. We show the merit of our algorithm on real-world soil moisture data."}}
{"id": "A-h-XEdN77", "cdate": 1640995200000, "mdate": 1694499108593, "content": {"title": "A framework to preserve distance-based graph properties in network embedding", "abstract": "Recently, there has been a significant interest in the research community on the topic of graph representation learning or graph embeddings (Bengio et al. in IEEE Trans Pattern Anal Mach Intell 35(8):1798–1828, 2013). Ideally, it is required for any graph embedding algorithm to preserve the structural aspects of the graph as well as the graph properties in the embedding space. While there exists a large number of works in the literature to preserve certain structural properties, there are only a few attempts to preserve distance-based graph properties such as asymmetric transitivity in directed graphs [Ou et al., in: 22nd ACM SIGKDD international conference on knowledge discovery and data mining (SIGKDD), 2016] and structural balance property in signed networks [Derr et al., in: 27th ACM international conference on information and knowledge management (CIKM), 2018; Wang et al., in: SIAM International conference on data mining (SDM), 2017]. In the context of preserving distance-based graph properties in the embedding space, to the best of our knowledge, there does not exist any notable work in the literature that preserves shortest distance-based graph properties such as closeness centrality, diameter, radius, and relative ordering of node pairs based on shortest distances in the embedding space. We address this important research gap in this paper. In particular, we first present a set of four metrics to measure how effectively any graph embedding algorithm preserves certain shortest distance-based graph properties. Surprisingly, we notice that several well-known graph embedding algorithms do not satisfactorily preserve these important graph distance-based properties. To address this research gap, we present a new graph embedding algorithm, CAscading-based Robust Embedding (CARE), which is based on a novel idea of cascading embedding vectors through the underlying graph to effectively preserve shortest distance-based graph properties. We then conduct thorough empirical analysis of the proposed CARE algorithm to demonstrate its efficacy using certain well-known graph analysis tasks (such as clustering, node label classification, and visualization) vis-à-vis several state-of-the-art graph embedding algorithms."}}
{"id": "uN9du0pHOJ", "cdate": 1609459200000, "mdate": 1694499110009, "content": {"title": "A Deep Hybrid Pooling Architecture for Graph Classification with Hierarchical Attention", "abstract": "Graph classification has been a classical problem of interest in machine learning and data mining because of its role in biological and social network analysis. Due to the recent success of graph neural networks for node classification and representation, researchers started extending them for the entire graph classification purpose. The main challenge is to represent the whole graph by a single vector which can be used to classify the graph in an end-to-end fashion. Global pooling, where node representations are directly aggregated to form the graph representation and more recently hierarchical pooling, where the whole graph is converted to a smaller graph through a set of hierarchies, are proposed in the literature. Though hierarchical pooling shows promising results for graph classification, it looses a significant amount of information in the hierarchical architecture. To address this, we propose a novel hybrid graph pooling architecture, which finds the importance of different hierarchies of pooling and aggregates them accordingly. We use a series of graph isomorphism networks, along with a bi-directional LSTM with self attention to implement the proposed hybrid pooling. Experiments show the merit of the proposed architecture with respect to a diverse set of state-of-the-art algorithms on multiple datasets."}}
{"id": "sedqj_PUHkU", "cdate": 1609459200000, "mdate": 1694499108692, "content": {"title": "Graph Neural Network to Dilute Outliers for Refactoring Monolith Application", "abstract": "Microservices are becoming the defacto design choice for software architecture. It involves partitioning the software components into finer modules such that the development can happen independently. It also provides natural benefits when deployed on the cloud since resources can be allocated dynamically to necessary components based on demand. Therefore, enterprises as part of their journey to cloud, are increasingly looking to refactor their monolith application into one or more candidate microservices; wherein each service contains a group of software entities (e.g., classes) that are responsible for a common functionality. Graphs are a natural choice to represent a software system. Each software entity can be represented as nodes and its dependencies with other entities as links. Therefore, this problem of refactoring can be viewed as a graph based clustering task. In this work, we propose a novel method to adapt the recent advancements in graph neural networks in the context of code to better understand the software and apply them in the clustering task. In that process, we also identify the outliers in the graph which can be directly mapped to top refactor candidates in the software. Our solution is able to improve state-of-the-art performance compared to works from both software engineering and existing graph representation based techniques."}}
{"id": "XALJ710jUsT", "cdate": 1609459200000, "mdate": 1694499109227, "content": {"title": "Data Quality for Machine Learning Tasks", "abstract": "The quality of training data has a huge impact on the efficiency, accuracy and complexity of machine learning tasks. Data remains susceptible to errors or irregularities that may be introduced during collection, aggregation or annotation stage. This necessitates profiling and assessment of data to understand its suitability for machine learning tasks and failure to do so can result in inaccurate analytics and unreliable decisions. While researchers and practitioners have focused on improving the quality of models, there are limited efforts towards improving the data quality. Assessing the quality of the data across intelligently designed metrics and developing corresponding transformation operations to address the quality gaps helps to reduce the effort of a data scientist for iterative debugging of the ML pipeline to improve model performance. This tutorial highlights the importance of analysing data quality in terms of its value for ML applications. Finding the data quality issues in data helps different personas like data stewards, data scientists, subject matter experts, or machine learning scientists to get relevant data insights and take remedial actions to rectify any issue. This tutorial surveys all the important data quality related approaches for structured, unstructured and spatio-temporal domains discussed in literature, focusing on the intuition behind them, highlighting their strengths and similarities, and illustrates their applicability to real-world problems. Finally we will discuss the interesting work IBM Research is doing in this space."}}
{"id": "N01X-IXqPx", "cdate": 1609459200000, "mdate": 1694499109504, "content": {"title": "Graph Neural Network to Dilute Outliers for Refactoring Monolith Application", "abstract": "Microservices are becoming the defacto design choice for software architecture. It involves partitioning the software components into finer modules such that the development can happen independently. It also provides natural benefits when deployed on the cloud since resources can be allocated dynamically to necessary components based on demand. Therefore, enterprises as part of their journey to cloud, are increasingly looking to refactor their monolith application into one or more candidate microservices; wherein each service contains a group of software entities (e.g., classes) that are responsible for a common functionality. Graphs are a natural choice to represent a software system. Each software entity can be represented as nodes and its dependencies with other entities as links. Therefore, this problem of refactoring can be viewed as a graph based clustering task. In this work, we propose a novel method to adapt the recent advancements in graph neural networks in the context of code to better understand the software and apply them in the clustering task. In that process, we also identify the outliers in the graph which can be directly mapped to top refactor candidates in the software. Our solution is able to improve state-of-the-art performance compared to works from both software engineering and existing graph representation based techniques."}}
{"id": "Cg5hOceNJRM", "cdate": 1609459200000, "mdate": 1671818756271, "content": {"title": "1st International Workshop on Data Assessment and Readiness for AI", "abstract": ""}}
{"id": "9ZPg1_1Wmgp", "cdate": 1609459200000, "mdate": 1694499109501, "content": {"title": "Unsupervised constrained community detection via self-expressive graph neural network", "abstract": "Graph neural networks (GNNs) are able to achieve promising performance on multiple graph downstream tasks such as node classification and link prediction. Comparatively lesser work has been done to..."}}
