{"id": "JKfcw9Aahk", "cdate": 1673390945604, "mdate": 1673390945604, "content": {"title": "Towards Optimal Randomized Smoothing: A Semi-Infinite Linear Programming Approach", "abstract": "Randomized smoothing is a leading approach\nto producing certifiably robust classifiers. The\ngoal of optimal randomized smoothing is to maximize the average certified radius over the space\nof smoothing distributions. We theoretically\nstudy this problem through the lens of infinitedimensional optimization over measure spaces,\nand prove that the nonconvex infinite program is\nlower-bounded by a conic linear program wherein\nthe classifier’s confidence acts as a surrogate objective to optimize. A semi-infinite linear programming approximation to the problem is presented, whose sub-problems are proven to attain\nnontrivial strong duality. A proof-of-concept experiment demonstrates the effectiveness of the\nproposed approach."}}
{"id": "jm4PMPx8hs", "cdate": 1672531200000, "mdate": 1681765773402, "content": {"title": "Asymmetric Certified Robustness via Feature-Convex Neural Networks", "abstract": "Recent works have introduced input-convex neural networks (ICNNs) as learning models with advantageous training, inference, and generalization properties linked to their convex structure. In this paper, we propose a novel feature-convex neural network architecture as the composition of an ICNN with a Lipschitz feature map in order to achieve adversarial robustness. We consider the asymmetric binary classification setting with one \"sensitive\" class, and for this class we prove deterministic, closed-form, and easily-computable certified robust radii for arbitrary $\\ell_p$-norms. We theoretically justify the use of these models by characterizing their decision region geometry, extending the universal approximation theorem for ICNN regression to the classification setting, and proving a lower bound on the probability that such models perfectly fit even unstructured uniformly distributed data in sufficiently high dimensions. Experiments on Malimg malware classification and subsets of MNIST, Fashion-MNIST, and CIFAR-10 datasets show that feature-convex classifiers attain state-of-the-art certified $\\ell_1$-radii as well as substantial $\\ell_2$- and $\\ell_{\\infty}$-radii while being far more computationally efficient than any competitive baseline."}}
{"id": "3slVJHamkus", "cdate": 1672531200000, "mdate": 1683908343630, "content": {"title": "Meta-Learning Parameterized First-Order Optimizers using Differentiable Convex Optimization", "abstract": "Conventional optimization methods in machine learning and controls rely heavily on first-order update rules. Selecting the right method and hyperparameters for a particular task often involves trial-and-error or practitioner intuition, motivating the field of meta-learning. We generalize a broad family of preexisting update rules by proposing a meta-learning framework in which the inner loop optimization step involves solving a differentiable convex optimization (DCO). We illustrate the theoretical appeal of this approach by showing that it enables one-step optimization of a family of linear least squares problems, given that the meta-learner has sufficient exposure to similar tasks. Various instantiations of the DCO update rule are compared to conventional optimizers on a range of illustrative experimental settings."}}
{"id": "IXsI73NDuqN", "cdate": 1663850149723, "mdate": null, "content": {"title": "Asymmetric Certified Robustness via Feature-Convex Neural Networks", "abstract": "Recent works have introduced input-convex neural networks (ICNNs) as learning models with advantageous training, inference, and generalization properties linked to their convex structure. In this paper, we propose a novel feature-convex neural network (FCNN) architecture as the composition of an ICNN with a Lipschitz feature map in order to achieve adversarial robustness. We consider the asymmetric binary classification setting with one \"sensitive\" class, and for this class we prove deterministic, closed-form, and easily-computable certified robust radii for arbitrary $\\ell_p$-norms. We theoretically justify the use of these models by characterizing their decision region geometry, extending the universal approximation theorem for ICNN regression to the classification setting, and proving a lower bound on the probability that such models perfectly fit even unstructured uniformly distributed data in sufficiently high dimensions. Experiments on Malimg malware classification as well as subsets of MNIST, CIFAR-10, and ImageNet-scale datasets show that FCNNs can attain orders of magnitude larger certified $\\ell_1$-radii than competing methods while maintaining substantial $\\ell_2$- and $\\ell_{\\infty}$-radii."}}
{"id": "i626lyqmp8", "cdate": 1640995200000, "mdate": 1683908343779, "content": {"title": "Safe Reinforcement Learning with Chance-constrained Model Predictive Control", "abstract": "Real-world reinforcement learning (RL) problems often demand that agents behave safely by obeying a set of designed constraints. We address the challenge of safe RL by coupling a safety guide based..."}}
{"id": "-N7x1jUVReu", "cdate": 1640995200000, "mdate": 1683908343655, "content": {"title": "LQR Control with Sparse Adversarial Disturbances", "abstract": "Recent developments in cyber-physical systems and event-triggered control have led to an increased interest in the impact of sparse disturbances on dynamical processes. We study Linear Quadratic Regulator (LQR) control under sparse disturbances by analyzing three distinct policies: the blind online policy, the disturbance-aware policy, and the optimal offline policy. We derive the two-dimensional recurrence structure of the optimal disturbance-aware policy, under the assumption that the controller has information about future disturbance values with only a probabilistic model of their locations in time. Under mild conditions, we show that the disturbance-aware policy converges to the blind online policy if the number of disturbances grows sublinearly in the time horizon. Finally, we provide a finite-horizon regret bound between the blind online policy and optimal offline policy, which is proven to be quadratic in the number of disturbances and in their magnitude. This provides a useful characterization of the suboptimality of a standard LQR controller when confronted with unexpected sparse perturbations."}}
{"id": "MIRkJcOFzgK", "cdate": 1609459200000, "mdate": 1683908343872, "content": {"title": "Discriminability of Single-Layer Graph Neural Networks", "abstract": "Network data can be conveniently modeled as a graph signal, where data values are assigned to the nodes of a graph describing the underlying network topology. Successful learning from network data requires methods that effectively exploit this graph structure. Graph neural networks (GNNs) provide one such method and have exhibited promising performance on a wide range of problems. Understanding why GNNs work is of paramount importance, particularly in applications involving physical networks. We focus on the property of discriminability and establish conditions under which the inclusion of pointwise nonlinearities to a stable graph filter bank leads to an increased discriminative capacity for high-eigenvalue content. We define a notion of discriminability tied to the stability of the architecture, show that GNNs are at least as discriminative as linear graph filter banks, and characterize the signals that cannot be discriminated by either."}}
{"id": "m-kUZ54dtbL", "cdate": 1577836800000, "mdate": null, "content": {"title": "Discriminability of Single-Layer Graph Neural Networks", "abstract": "Network data can be conveniently modeled as a graph signal, where data values are assigned to the nodes of a graph describing the underlying network topology. Successful learning from network data requires methods that effectively exploit this graph structure. Graph neural networks (GNNs) provide one such method and have exhibited promising performance on a wide range of problems. Understanding why GNNs work is of paramount importance, particularly in applications involving physical networks. We focus on the property of discriminability and establish conditions under which the inclusion of pointwise nonlinearities to a stable graph filter bank leads to an increased discriminative capacity for high-eigenvalue content. We define a notion of discriminability tied to the stability of the architecture, show that GNNs are at least as discriminative as linear graph filter banks, and characterize the signals that cannot be discriminated by either."}}
{"id": "Z9teIVxcwJ9", "cdate": 1577836800000, "mdate": 1683908343737, "content": {"title": "ContactNets: Learning Discontinuous Contact Dynamics with Smooth, Implicit Representations", "abstract": "Common methods for learning robot dynamics assume motion is continuous, causing unrealistic model predictions for systems undergoing discontinuous impact and stiction behavior. In this work, we res..."}}
