{"id": "alz8Q-8fSwY", "cdate": 1672531200000, "mdate": 1682354291529, "content": {"title": "An FPGA-Based Semi-Automated Traffic Control System Using Verilog HDL", "abstract": "Traffic Congestion is one of the severe problems in heavily populated countries like Bangladesh where Automated Traffic Control System needs to be implemented. An FPGA-based Semi-automated system is introduced in this paper including a completely new feature \"Safe State\" to avoid sudden unwanted collision. Here we used sequential encoding which has made the program much simpler and so that easy to control and modify. The experimental result showed the automated change in traffic lights according to the specified timing sequences which would be able to conduct maximum possible transitions of vehicles occur at different directions simultaneously without facing any accident."}}
{"id": "d2p2ouioM5M", "cdate": 1640995200000, "mdate": 1678216850978, "content": {"title": "Iterative Scene Graph Generation with Generative Transformers", "abstract": ""}}
{"id": "GQiqnLZjYoF", "cdate": 1640995200000, "mdate": 1666287683504, "content": {"title": "Knowledge guided learning: Open world egocentric action recognition with zero supervision", "abstract": ""}}
{"id": "Zij5rw0h_5", "cdate": 1577836800000, "mdate": 1666287683502, "content": {"title": "Benchmark and Evaluation of Low Resource Object Detection in Biomedical Images", "abstract": "Object detection has seen tremendous progress in recent times, moving significantly closer to human-level performance. However, their performance is limited to domains with large amounts of annotated training data. A carefully curated, balanced data set is necessary for the successful training and deployment of current models. Their ability to adapt to novel domains, particularly those with significant visual variations such as biomedical domains, remains limited. Existing work on biomedical image analysis has focused on recognition with large amounts of training data. To address these limitations, we focus on creating a benchmark and evaluation platform for low-resource object detection, primarily for biomedical images. We introduce a novel data set to evaluate object detection models under resource-constrained environments such as biomedical images. We show that current models do not generalize to such significant domain change and provide a thorough analysis of failure modes to offer a way forward in this challenging task."}}
{"id": "M_6c8T3_FJ7", "cdate": 1577836800000, "mdate": 1682354291522, "content": {"title": "Knowledge Guided Learning: Towards Open Domain Egocentric Action Recognition with Zero Supervision", "abstract": ""}}
