{"id": "kjbVMi4sir", "cdate": 1671856217337, "mdate": 1671856217337, "content": {"title": "PAC-Net: A Model Pruning Approach to Inductive Transfer Learning", "abstract": "Inductive transfer learning aims to learn from a small amount of training data for the target task by utilizing a pre-trained model from the source task. Most strategies that involve large-scale deep learning models adopt initialization with the pre-trained model and fine-tuning for the target task. However, when using over-parameterized models, we can often prune the model without sacrificing the accuracy of the source task. This motivates us to adopt model pruning for transfer learning with deep learning models. In this paper, we propose PAC-Net, a simple yet effective approach for transfer learning based on pruning. PAC-Net consists of three steps: Prune, Allocate, and Calibrate (PAC). The main idea behind these steps is to identify essential weights for the source task, fine-tune on the source task by updating the essential weights, and then calibrate on the target task by updating the remaining redundant weights. Under the various and extensive set of inductive transfer learning experiments, we show that our method achieves state-of-the-art performance by a large margin."}}
{"id": "VG1dJMVeDEs", "cdate": 1648741761813, "mdate": null, "content": {"title": "A Novel Approach for Semiconductor Etching Process with Inductive Biases", "abstract": "The etching process is one of the most important processes in semiconductor manufacturing. We have introduced the state-of-the-art deep learning model to predict the etching profiles. However, the significant problems violating physics have been found through various techniques such as explainable artificial intelligence and representation of prediction uncertainty. To address this problem, this paper presents a novel approach to apply the inductive biases for etching process. We demonstrate that our approach fits the measurement faster than physical simulator while following the physical behavior. Our approach would bring a new opportunity for better etching process with higher accuracy and lower cost."}}
{"id": "MLDxACTqy0", "cdate": 1640995200000, "mdate": 1674870160060, "content": {"title": "PAC-Net: A Model Pruning Approach to Inductive Transfer Learning", "abstract": "Inductive transfer learning aims to learn from a small amount of training data for the target task by utilizing a pre-trained model from the source task. Most strategies that involve large-scale de..."}}
{"id": "5iiSdRHy0E", "cdate": 1640995200000, "mdate": 1682400121915, "content": {"title": "Restructuring TCAD System: Teaching Traditional TCAD New Tricks", "abstract": "Traditional TCAD simulation has succeeded in predicting and optimizing the device performance; however, it still faces a massive challenge - a high computational cost. There have been many attempts to replace TCAD with deep learning, but it has not yet been completely replaced. This paper presents a novel algorithm restructuring the traditional TCAD system. The proposed algorithm predicts three-dimensional (3-D) TCAD simulation in real-time while capturing a variance, enables deep learning and TCAD to complement each other, and fully resolves convergence errors."}}
{"id": "MLeBMPyodzX", "cdate": 1609459200000, "mdate": 1682400121813, "content": {"title": "A Novel Approach for Semiconductor Etching Process with Inductive Biases", "abstract": "The etching process is one of the most important processes in semiconductor manufacturing. We have introduced the state-of-the-art deep learning model to predict the etching profiles. However, the significant problems violating physics have been found through various techniques such as explainable artificial intelligence and representation of prediction uncertainty. To address this problem, this paper presents a novel approach to apply the inductive biases for etching process. We demonstrate that our approach fits the measurement faster than physical simulator while following the physical behavior. Our approach would bring a new opportunity for better etching process with higher accuracy and lower cost."}}
