{"id": "28si4RXwDt1", "cdate": 1677713806378, "mdate": null, "content": {"title": "When Biology has Chemistry: Solubility And Drug Subcategory Prediction using SMILES Strings", "abstract": "Drug discovery is a complex process that requires extensive research and development. One important aspect of drug discovery is the prediction of drug properties, such as solubility. In recent years, sequence-based embedding methods, such as SMILES strings, have gained popularity in the drug discovery community due to their ability to encode chemical structures. SMILES strings are text-based representations of chemical structures that can be easily processed by machine learning models. \nThis research paper presents a study on predicting (i) the solubility ALOGPS (Ghose-Crippen-Viswanadhan octanol-water partition coefficient) and (ii) drug subcategories using traditional molecular fingerprints and sequence-based embedding methods (from the bioinformatics domain) of SMILES strings. The study investigates five types of embeddings: Morgan fingerprint, MACCS fingerprint, $k$-mers, and minimizer-based spectrum. Additionally, a weighted version of $k$-mers that employs inverse document frequency is used to assign weights to each $k$-mer within the spectrum. \nFor the classification task (\\ie, drug subcategory prediction), we use the same embedding methods as input to several classifiers and report classification goodness using several evaluation metrics.\nFor the regression task (\\ie, solubility ALOGPS prediction), we use several popular models \\eg, linear regression, and evaluate the performance using multiple evaluation metrics such as RMSE MAE, MSE, etc.\nThe classification results indicate that the weighted $k$-mers method outperforms the baselines for predictive performance.\nThe regression results indicate that the MACCS fingerprint with random forest regression model outperforms all other embedding methods and regression models.\nOverall, this study provides insights into the effectiveness of different embeddings, regression models, and classification models for solubility and drug subcategory prediction, which can be helpful for future tasks such as drug discovery."}}
{"id": "fRx3H-t-TNN", "cdate": 1672531200000, "mdate": 1681672356649, "content": {"title": "Anderson Acceleration For Bioinformatics-Based Machine Learning", "abstract": "Anderson acceleration (AA) is a well-known method for accelerating the convergence of iterative algorithms, with applications in various fields including deep learning and optimization. Despite its popularity in these areas, the effectiveness of AA in classical machine learning classifiers has not been thoroughly studied. Tabular data, in particular, presents a unique challenge for deep learning models, and classical machine learning models are known to perform better in these scenarios. However, the convergence analysis of these models has received limited attention. To address this gap in research, we implement a support vector machine (SVM) classifier variant that incorporates AA to speed up convergence. We evaluate the performance of our SVM with and without Anderson acceleration on several datasets from the biology domain and demonstrate that the use of AA significantly improves convergence and reduces the training loss as the number of iterations increases. Our findings provide a promising perspective on the potential of Anderson acceleration in the training of simple machine learning classifiers and underscore the importance of further research in this area. By showing the effectiveness of AA in this setting, we aim to inspire more studies that explore the applications of AA in classical machine learning."}}
{"id": "D35q9Cww0c", "cdate": 1672531200000, "mdate": 1681672356545, "content": {"title": "Efficient Classification of SARS-CoV-2 Spike Sequences Using Federated Learning", "abstract": "This paper presents a federated learning (FL) approach to train an AI model for SARS-Cov-2 coronavirus variant identification. We analyze the SARS-CoV-2 spike sequences in a distributed way, without data sharing, to detect different variants of the rapidly mutating coronavirus. A vast amount of sequencing data of SARS-CoV-2 is available due to various genomic monitoring initiatives by several nations. However, privacy concerns involving patient health information and national public health conditions could hinder openly sharing this data. In this work, we propose a lightweight FL paradigm to cooperatively analyze the spike protein sequences of SARS-CoV-2 privately, using the locally stored data to train a prediction model from remote nodes. Our method maintains the confidentiality of local data (that could be stored in different locations) yet allows us to reliably detect and identify different known and unknown variants of the novel coronavirus SARS-CoV-2. We compare the performance of our approach on spike sequence data with the recently proposed state-of-the-art methods for classification from spike sequences. Using the proposed approach, we achieve an overall accuracy of $93\\%$ on the coronavirus variant identification task. To the best of our knowledge, this is the first work in the federated learning paradigm for biological sequence analysis. Since the proposed model is distributed in nature, it could scale on ``Big Data'' easily. We plan to use this proof-of-concept to implement a privacy-preserving pandemic response strategy."}}
{"id": "8nQuwLtCel", "cdate": 1672531200000, "mdate": 1681672356536, "content": {"title": "Exploring The Potential Of GANs In Biological Sequence Analysis", "abstract": "Biological sequence analysis is an essential step toward building a deeper understanding of the underlying functions, structures, and behaviors of the sequences. It can help in identifying the characteristics of the associated organisms, like viruses, etc., and building prevention mechanisms to eradicate their spread and impact, as viruses are known to cause epidemics that can become pandemics globally. New tools for biological sequence analysis are provided by machine learning (ML) technologies to effectively analyze the functions and structures of the sequences. However, these ML-based methods undergo challenges with data imbalance, generally associated with biological sequence datasets, which hinders their performance. Although various strategies are present to address this issue, like the SMOTE algorithm, which creates synthetic data, however, they focus on local information rather than the overall class distribution. In this work, we explore a novel approach to handle the data imbalance issue based on Generative Adversarial Networks (GANs) which use the overall data distribution. GANs are utilized to generate synthetic data that closely resembles the real one, thus this generated data can be employed to enhance the ML models' performance by eradicating the class imbalance problem for biological sequence analysis. We perform 3 distinct classification tasks by using 3 different sequence datasets (Influenza A Virus, PALMdb, VDjDB) and our results illustrate that GANs can improve the overall classification performance."}}
{"id": "uvC0cgGj52", "cdate": 1640995200000, "mdate": 1681672356468, "content": {"title": "Information We Can Extract About a User From 'One Minute Mobile Application Usage'", "abstract": "Understanding human behavior is an important task and has applications in many domains such as targeted advertisement, health analytics, security, and entertainment, etc. For this purpose, designing a system for activity recognition (AR) is important. However, since every human can have different behaviors, understanding and analyzing common patterns become a challenging task. Since smartphones are easily available to every human being in the modern world, using them to track the human activities becomes possible. In this paper, we extracted different human activities using accelerometer, magnetometer, and gyroscope sensors of android smartphones by building an android mobile applications. Using different social media applications, such as Facebook, Instagram, Whatsapp, and Twitter, we extracted the raw sensor values along with the attributes of $29$ subjects along with their attributes (class labels) such as age, gender, and left/right/both hands application usage. We extract features from the raw signals and use them to perform classification using different machine learning (ML) algorithms. Using statistical analysis, we show the importance of different features towards the prediction of class labels. In the end, we use the trained ML model on our data to extract unknown features from a well known activity recognition data from UCI repository, which highlights the potential of privacy breach using ML models. This security analysis could help researchers in future to take appropriate steps to preserve the privacy of human subjects."}}
{"id": "pa7dX6xyYpO", "cdate": 1640995200000, "mdate": 1681672356567, "content": {"title": "Efficient Approximate Kernel Based Spike Sequence Classification", "abstract": "Machine learning (ML) models, such as SVM, for tasks like classification and clustering of sequences, require a definition of distance/similarity between pairs of sequences. Several methods have been proposed to compute the similarity between sequences, such as the exact approach that counts the number of matches between $k$-mers (sub-sequences of length $k$) and an approximate approach that estimates pairwise similarity scores. Although exact methods yield better classification performance, they pose high computational costs, limiting their applicability to a small number of sequences. The approximate algorithms are proven to be more scalable and perform comparably to (sometimes better than) the exact methods -- they are designed in a \"general\" way to deal with different types of sequences (e.g., music, protein, etc.). Although general applicability is a desired property of an algorithm, it is not the case in all scenarios. For example, in the current COVID-19 (coronavirus) pandemic, there is a need for an approach that can deal specifically with the coronavirus. To this end, we propose a series of ways to improve the performance of the approximate kernel (using minimizers and information gain) in order to enhance its predictive performance pm coronavirus sequences. More specifically, we improve the quality of the approximate kernel using domain knowledge (computed using information gain) and efficient preprocessing (using minimizers computation) to classify coronavirus spike protein sequences corresponding to different variants (e.g., Alpha, Beta, Gamma). We report results using different classification and clustering algorithms and evaluate their performance using multiple evaluation metrics. Using two datasets, we show that our proposed method helps improve the kernel's performance compared to the baseline and state-of-the-art approaches in the healthcare domain."}}
{"id": "ngk65a9qmF", "cdate": 1640995200000, "mdate": 1681672356651, "content": {"title": "Impact Of Missing Data Imputation On The Fairness And Accuracy Of Graph Node Classifiers", "abstract": "Analysis of the fairness of machine learning (ML) algorithms has attracted many researchers’ interest. Several studies have shown that ML methods produce a bias toward different groups, which limits the applicability of ML models in many applications, such as crime rate prediction. The data used for ML may have missing values, which, if not appropriately handled, are known to further harmfully affect fairness. To address this issue, many imputation methods have been proposed to deal with missing data. However, research on the effect of missing data imputation on fairness is still rather limited. In this paper, we analyze the impact of imputation on fairness in the context of graph data (node attributes) using different embedding and neural network methods. Extensive experiments on six datasets demonstrate several issues of fairness in graph node classification when dealing with missing data and various imputation techniques. We find that the choice of the imputation method affects both fairness and accuracy. Our results provide valuable insights into fairness ML over graph data and how to handle missingness in graphs efficiently."}}
{"id": "kjFKt6GJE7u", "cdate": 1640995200000, "mdate": 1681490806938, "content": {"title": "Benchmarking Machine Learning Robustness in Covid-19 Genome Sequence Classification", "abstract": ""}}
{"id": "gY0FgXa7qtH", "cdate": 1640995200000, "mdate": 1681672356433, "content": {"title": "Informative Initialization and Kernel Selection Improves t-SNE for Biological Sequences", "abstract": "The t-distributed stochastic neighbor embedding (t-SNE) is a method for interpreting high dimensional (HD) data by mapping each point to a low dimensional (LD) space (usually two-dimensional). It seeks to retain the structure of the data. An important component of the t-SNE algorithm is the initialization procedure, which begins with the random initialization of an LD vector. Points in this initial vector are then updated to minimize the loss function (the KL divergence) iteratively using gradient descent. This leads comparable points to attract one another while pushing dissimilar points apart. We believe that, by default, these algorithms should employ some form of informative initialization. Another essential component of the t-SNE is using a kernel matrix, a similarity matrix comprising the pairwise distances among the sequences. For t-SNE-based visualization, the Gaussian kernel is employed by default in the literature. However, we show that kernel selection can also play a crucial role in the performance of t-SNE.In this work, we assess the performance of t-SNE with various alternative initialization methods and kernels, using four different sets, out of which three are biological sequences (nucleotide, protein, etc.) datasets obtained from various sources, such as the well-known GISAID database for sequences of the SARS-CoV-2 virus. We perform subjective and objective assessments of these alternatives. We use the resulting t-SNE plots and k-ary neighborhood agreement (k-ANA) to evaluate and compare the proposed methods with the baselines. We show that by using different techniques, such as informed initialization and kernel matrix selection, that t-SNE performs significantly better. Moreover, we show that t-SNE also takes fewer iterations to converge faster with more intelligent initialization."}}
{"id": "_EzDg5LyqJe", "cdate": 1640995200000, "mdate": 1681672356409, "content": {"title": "Spike2Signal: Classifying Coronavirus Spike Sequences with Deep Learning", "abstract": "The severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) causes the COVID-19 disease in humans, which has reached the scale of a global pandemic. Changes in the composition of the genome of the virus, in the form of mutations, can alter its ability to infect host cells. These modified forms of the virus are known as variants. The spike region of the SARS-CoV-2 genome has a crown-like structure — where “coronavirus” gets its name. In SARS-CoV-2, it has been noted that mutations happen disproportionately many in the spike region, making this region important for distinguishing different variants.Since amino acids (of the spike protein sequence) are not in a numerical form, they are of no direct use to machine learning algorithms. Thus we use various embedding techniques to make such spike sequence data amenable to machine learning approaches. However, there is ongoing research to find better solutions to study these variants using classification. This paper presents a transformation for spike sequences, called Spike2Signal, to allow the classification of different variants of SARS-CoV-2 using deep learning algorithms. Spike2Signal converts spike sequences into a signal-like representation to allow the classification by state-of-the-art time-series classifiers. Further, we transform this Spike2Signal representation into an image (Spike2Image) to allow the usage of state-of-the-art image classifiers and compare these results with those obtained purely with Spike2Signal. In a wider comparison with existing feature engineering-based methods, we show that the Spike2Signal representation allows to outperform all baselines in predictive power."}}
