{"id": "3GeE-s0NLg-", "cdate": 1546300800000, "mdate": null, "content": {"title": "Learning Safe Unlabeled Multi-Robot Planning with Motion Constraints", "abstract": "In this paper, we present a learning approach to goal assignment and trajectory planning for unlabeled robots operating in 2D, obstacle-filled workspaces. More specifically, we tackle the unlabeled multi-robot motion planning problem with motion constraints as a multi-agent reinforcement learning problem with some sparse global reward. In contrast with previous works, which formulate an entirely new hand-crafted optimization cost or trajectory generation algorithm for a different robot dynamic model, our framework is a general approach that is applicable to arbitrary robot models. Further, by using the velocity obstacle, we devise a smooth projection that guarantees collision free trajectories for all robots with respect to their neighbors and obstacles. The efficacy of our algorithm is demonstrated through varied simulations. A video describing our method and results can be found here."}}
{"id": "xn-pxD9IakT", "cdate": 1514764800000, "mdate": null, "content": {"title": "Aggressive Flight With Suspended Payloads Using Vision-Based Control", "abstract": "Payload manipulation with aerial robots has been an active research area for many years. Recent approaches have sought to plan, control, and execute maneuvers with large, yet deliberate, load swings for more agile, energy-optimal maneuvering. Unfortunately, the system's nonlinear dynamics make executing such trajectories a significant challenge and experimental demonstrations thus far have relied completely on a motion capture system and non-negligible simplifications like restriction of the system to a two-dimensional workspace or closing of the control loop on the quadrotor, instead of the payload. In this work, we observe the payload using a downward-facing camera and estimate its state relative to the quadrotor using an extended Kalman filter. We demonstrate closed-loop payload control in the full three-dimensional workspace, with the planning, estimation, and control pipeline implemented on an onboard processor. We show control of load swings up to 53 <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">o</sup> from the vertical axis. To the best of our knowledge, this represents the first realization of closed-loop control of agile slung-load maneuvers and the largest achieved payload angle."}}
{"id": "LTqwImir8Zj", "cdate": 1514764800000, "mdate": null, "content": {"title": "Hold Or take Optimal Plan (HOOP): A quadratic programming approach to multi-robot trajectory generation", "abstract": "In this work, we present Hold Or take Optimal Plan (HOOP), a centralized trajectory generation algorithm for labeled multi-robot systems operating in obstacle-free, two-dimensional, continuous workspaces. Given a team of N robots, each with nth-order dynamics, our algorithm finds trajectories that navigate vehicles from their start positions to non-interchangeable goal positions in a collision-free manner. The algorithm operates in two phases. In the motion planning step, a geometric algorithm finds a collision-free, piecewise-linear trajectory for each robot. In the trajectory generation step, each robot’s trajectory is refined into a higher-order piecewise polynomial with a quadratic program. The novelty of our method is in this problem decomposition. The motion plan, through abstracting away robots’ dynamics, can be found quickly. It is then subsequently leveraged to construct collision avoidance constraints for N decoupled quadratic programs instead of a single, coupled optimization problem, decreasing computation time. We prove that this method is safe, complete, and generates smooth trajectories that respect robots’ dynamics. We demonstrate the algorithm’s practicality through extensive quadrotor experiments."}}
{"id": "fTyt-rF-qWB", "cdate": 1483228800000, "mdate": null, "content": {"title": "Multi-robot Trajectory Generation for an Aerial Payload Transport System", "abstract": "In this work, we consider the problem of planning safe, feasible trajectories for a team of quadrotors with slung-loads operating in an obstacle-free, three-dimensional workspace. We are particularly interested in generating dynamic trajectories—trajectories where robots’ payloads are allowed to swing in accordance with the system’s natural dynamics—for fast, agile, coordinated payload transportation. This capability is applicable to tasks such as construction, where a single crane performing sequential tasks could be replaced by multiple quadrotors performing tasks in parallel for increased efficiency. We model this problem as a labeled multi-robot planning problem, where robots must navigate payloads from given start positions to fixed, non-interchangeable goal positions. Our system presents three novel challenges: (1.) Each vehicle has eight degrees-of-freedom, significantly increasing the size of the team’s joint state space. (2.) Each vehicle is a nonlinear, $$6\\mathrm{th}$$-order dynamical system with four degrees of under-actuation. (3.) Each vehicle is a multi-body system. We present a safe and complete Quadratic Programming solution and validate its practicality with experiments containing up to nine quadrotors."}}
{"id": "rpK7FVA1R1y", "cdate": 1451606400000, "mdate": null, "content": {"title": "Safe Navigation of Quadrotor Teams to Labeled Goals in Limited Workspaces", "abstract": "In this work, we solve the labeled multi-robot planning problem. Most proposed algorithms to date have modeled robots as kinematic or kinodynamic agents in planar environments, making them impractical for real-world systems. Here, we present experiments to validate a centralized multi-robot planning and trajectory generation method that explicitly accounts for robots with higher-order dynamics. First, we demonstrate successful execution of solution trajectories. Next, we verify the robustness of the robots’ trajectory tracking to unmodeled external disturbances, in particular, the aerodynamic interactions between co-planar neighbors. Finally, we apply our algorithm to navigating quadrotors away from the downwash of their neighbors to improve safety in three-dimensional workspaces."}}
{"id": "ffuqn96VHO", "cdate": 1451606400000, "mdate": null, "content": {"title": "Safe and complete trajectory generation for robot teams with higher-order dynamics", "abstract": "In this work, we consider the labeled multi-robot planning problem. In this paradigm, a team of robots at fixed start positions must navigate to pre-specified and noninterchangable goal positions. While many algorithms have been proposed for finding optimal solutions to this problem, most methods assume that the robots are kinematic agents, whereas in reality, robots often have high-order dynamics that must be respected by their trajectories. Here, we propose a centralized method for generating trajectories for teams of robots with general nth-order dynamics navigating to labeled goals. Our algorithm is safe and complete and additionally allows for decoupled optimization of each robot's trajectory as a Quadratic Program with linear constraints. We present simulation results for teams of up to 20 robots."}}
{"id": "Sq3fiAbzqOt", "cdate": 1451606400000, "mdate": null, "content": {"title": "High speed navigation for quadrotors with limited onboard sensing", "abstract": "We address the problem of high speed autonomous navigation of quadrotor micro aerial vehicles with limited onboard sensing and computation. In particular, we propose a dual range planning horizon method to safely and quickly navigate quadrotors to specified goal locations in previously unknown and unstructured environments. In each planning epoch, a short-range planner uses a local map to generate a new trajectory. At the same time, a safe stopping policy is found. This allows the robot to come to an emergency halt when necessary. Our algorithm guarantees collision avoidance and demonstrates important advances in real-time planning. First, our novel short range planning method allows us to generate and re-plan trajectories that are dynamically feasible, comply with state and input constraints, and avoid obstacles in real-time. Further, previous planning algorithms abstract away the obstacle detection problem by assuming the instantaneous availability of geometric information about the environment. In contrast, our method addresses the challenge of using the raw sensor data to form a map and navigate in real-time. Finally, in addition to simulation examples, we provide physical experiments that demonstrate the entire algorithmic pipeline from obstacle detection to trajectory execution."}}
{"id": "vgmZLaxjRoo", "cdate": 1420070400000, "mdate": null, "content": {"title": "Mixed Integer Quadratic Program trajectory generation for a quadrotor with a cable-suspended payload", "abstract": "In this paper, we present a trajectory planning method to navigate a quadrotor with a cable-suspended payload through known obstacle-filled environments. We model the system as a hybrid dynamical system and formulate the trajectory generation problem as a Mixed Integer Quadratic Program (MIQP). Specifically, we address two novel challenges. First, we plan for a multi-body system, and obstacle avoidance must be guaranteed for the quadrotor, load, and the cable. Second, our method accommodates transitions between subsystems of the hybrid dynamical system, allowing for maneuvers that would otherwise be infeasible if the cable were constrained to remain taut. Numerical and experimental results validate the proposed approach for the full hybrid system."}}
{"id": "nRESekHuxao", "cdate": 1420070400000, "mdate": null, "content": {"title": "A Complete Algorithm for Generating Safe Trajectories for Multi-robot Teams", "abstract": "In this paper, we consider the problem of planning collision-free trajectories to navigate a team of labeled robots from a set of start locations to a set of goal locations, where robots have pre-assigned and non-interchangeable goals. We present a solution to this problem for a centralized team operating in an obstacle-free, two-dimensional workspace. Our algorithm allows robots to follow Optimal Motion Plans (OMPs) to their goals when possible and has them enter Circular HOlding Patterns (CHOPs) to safely navigate congested areas. This OMP $$+$$ CHOP algorithm is shown to be safe and complete, and simulation results show scalability to hundreds of robots."}}
{"id": "c0qB_jyMZkn", "cdate": 1356998400000, "mdate": null, "content": {"title": "A multi-AUV system for cooperative tracking and following of leopard sharks", "abstract": "This paper presents a system of multiple coordinating autonomous underwater vehicles (AUV) that can localize and track a shark tagged with an acoustic transmitter. Each AUV is equipped with a stereo-hydrophone system that provides measurements of the relative bearing to the transmitter, as well as an acoustic modem that allows for inter-AUV communication and hence cooperative shark state estimation and decentralized tracking control. Online state estimation of the shark's state is performed using a Particle Filter in which measurements are shared between AUVs. The decentralized control system enables the AUVs to circumnavigate a dynamic target, (i.e. the estimated shark location). Each AUV circles the target by tracking circles of different radii and at different phase angles with respect to the target so as to obtain simultaneous sensor vantage points and minimize chance of AUV collision. A series of experiments using two AUVs were conducted in Big Fisherman's Cove in Santa Catalina Island, CA and demonstrated the ability to track a tagged leopard shark (Triakis semifasciata). The performance of the tracking was compared to standard manual tracking performed using an directional hydrophone operated by a researcher in a boat. In an additional experiment, the AUVs tracked an acoustic tag attached to the tracking boat to quantify the error of the state estimation of the system."}}
