{"id": "ce3jRAC2Epz", "cdate": 1668681244044, "mdate": 1668681244044, "content": {"title": "Universal Photometric Stereo Network using Global Lighting Contexts", "abstract": "This paper tackles a new photometric stereo task, named\nuniversal photometric stereo. Unlike existing tasks that assumed specific physical lighting models; hence, drastically\nlimited their usability, a solution algorithm of this task is\nsupposed to work for objects with diverse shapes and materials under arbitrary lighting variations without assuming any specific models. To solve this extremely challenging\ntask, we present a purely data-driven method, which eliminates the prior assumption of lighting by replacing the recovery of physical lighting parameters with the extraction\nof the generic lighting representation, named global lighting contexts. We use them like lighting parameters in a calibrated photometric stereo network to recover surface normal vectors pixelwisely. To adapt our network to a wide\nvariety of shapes, materials and lightings, it is trained on\na new synthetic dataset which simulates the appearance of\nobjects in the wild. Our method is compared with other\nstate-of-the-art uncalibrated photometric stereo methods on\nour test data to demonstrate the significance of our method"}}
{"id": "ypnw-Yyvp4Z", "cdate": 1668155063238, "mdate": 1668155063238, "content": {"title": "Efficiency-Enhanced Cost-Volume Filtering featuring Coarse-to-Fine Strategy", "abstract": "Cost-volume filtering (CVF) is one of the most widely used techniques for solving general multi-labeling problems based on a Markov random field (MRF). However it is inefficient when the label space size (i.e., the number of labels) is large. This paper presents a coarse-to-fine strategy for cost-volume filtering that efficiently and accurately addresses multi-labeling problems with a large label space size. Based on the observation that true labels at the same coordinates in images of different scales are highly correlated, we truncate unimportant labels for cost-volume filtering by leveraging the labeling output of lower scales. Experimental results show that our algorithm achieves much higher efficiency than the original CVF method while maintaining a comparable level of accuracy. Although we performed experiments that deal with only stereo matching and optical flow estimation, the proposed method can be employed in many other applications because of the applicability of CVF to general discrete pixel-labeling problems based on an MRF."}}
