{"id": "noyKGZYvHH", "cdate": 1652737387001, "mdate": null, "content": {"title": "coVariance Neural Networks", "abstract": "Graph neural networks (GNN) are an effective framework that exploit inter-relationships within graph-structured data for learning. Principal component analysis (PCA) involves the projection of data on the eigenspace of the covariance matrix and draws similarities with the graph convolutional filters in GNNs. Motivated by this observation, we study a GNN architecture, called coVariance neural network (VNN), that operates on sample covariance matrices as graphs. We theoretically establish the stability of VNNs to perturbations in the covariance matrix, thus, implying an advantage over standard PCA-based data analysis approaches that are prone to instability due to principal components associated with close eigenvalues. Our experiments on real-world datasets validate our theoretical results and show that VNN performance is indeed more stable than PCA-based statistical approaches. Moreover, our experiments on multi-resolution datasets also demonstrate that VNNs are amenable to transferability of performance over covariance matrices of different dimensions; a feature that is infeasible for PCA-based approaches."}}
{"id": "KkiSTJhcL5Z", "cdate": 1640995200000, "mdate": 1653601414087, "content": {"title": "Adaptive Graph-Constrained Group Testing", "abstract": "This paper considers the problem of adaptive group testing for isolating up to <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> defective items from a population of size <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$n$</tex-math></inline-formula> . There exist restrictions or preferences which determine how the items can be pooled for testing. A graphical model formalizes the pooling restrictions and preferences. Such graph-constrained group testing is investigated in three settings: populations with defectives, populations facing the potential presence of inhibitors, and populations with community structures. Adaptive group testing frameworks are provided for each setting. In populations without inhibitors, existing non adaptive frameworks can isolate the defective items perfectly with <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\Theta(k \\log n/k)$</tex-math></inline-formula> number of tests, where is the <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\beta$</tex-math></inline-formula> -mixing time of a random walk over the underlying graph. This paper provides a two-stage framework that can perfectly isolate up to <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> defective items for a regular graph using <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\Theta(k2 \\log n k + k)$</tex-math></inline-formula> number of tests, thus achieving an approximate gain of a factor of <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> over the non-adaptive frameworks. This twostage framework's principles are extended to community-structured graphs and graphs with up to <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$r$</tex-math></inline-formula> inhibitor items. In particular, when inhibitors are present in the graph, a four-stage group testing framework is proposed. The results show that in the regime <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$r= O(k)$</tex-math></inline-formula> for a fully connected graph, <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$\\Theta ((k+r)\\log n/(k+r) + r\\log n)$</tex-math></inline-formula> tests are sufficient for isolating the defective items. This matches the corresponding necessary condition on tests which scales <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$(k+r)\\log n$</tex-math></inline-formula> . The adaptive graphconstrained group testing framework is also empirically evaluated."}}
{"id": "EN_d9qgDsej", "cdate": 1640995200000, "mdate": 1653601414087, "content": {"title": "Summary Markov Models for Event Sequences", "abstract": "Datasets involving sequences of different types of events without meaningful time stamps are prevalent in many applications, for instance when extracted from textual corpora. We propose a family of models for such event sequences -- summary Markov models -- where the probability of observing an event type depends only on a summary of historical occurrences of its influencing set of event types. This Markov model family is motivated by Granger causal models for time series, with the important distinction that only one event can occur in a position in an event sequence. We show that a unique minimal influencing set exists for any set of event types of interest and choice of summary function, formulate two novel models from the general family that represent specific sequence dynamics, and propose a greedy search algorithm for learning them from event sequence data. We conduct an experimental investigation comparing the proposed models with relevant baselines, and illustrate their knowledge acquisition and discovery capabilities through case studies involving sequences from text."}}
{"id": "d7-GwtDWNNJ", "cdate": 1632875716594, "mdate": null, "content": {"title": "Learning Graph Structure from Convolutional Mixtures", "abstract": "Machine learning frameworks such as graph neural networks typically rely on a given, fixed graph to exploit relational inductive biases and thus effectively learn from network data. However, assuming the knowledge of said graphs may be untenable in practice, which motivates the problem of inferring graph structure from data. In this paper, we postulate a graph convolutional relationship between the observed and latent graphs, and formulate the graph learning task as a network inverse (deconvolution) problem. In lieu of eigendecomposition-based spectral methods or iterative optimization solutions, we unroll and truncate proximal gradient iterations to arrive at a parameterized neural network architecture that we call a Graph Deconvolution Network (GDN). GDNs can learn a distribution of graphs in a supervised fashion, and perform link-prediction or edge-weight regression tasks by adapting the loss function. Since layers directly operate on, combine, and refine graph objects (instead of node features), GDNs are inherently inductive and can generalize to larger-sized graphs after training.\nAlgorithm unrolling offers an explicit handle on computational complexity; we trade-off training time in return for quick approximations to the inverse problem solution, obtained via a forward pass through the learnt model. We corroborate GDN's superior graph recovery performance using synthetic data in supervised settings, as well as its ability to generalize to graphs orders of magnitude larger that those seen in training. Using the Human Connectome Project-Young Adult neuroimaging dataset, we demonstrate the robustness and representation power of our model by inferring structural brain networks from functional connectivity estimated using fMRI signals."}}
{"id": "k2eJLgLGx3i", "cdate": 1609459200000, "mdate": null, "content": {"title": "Learning Shared Subgraphs in Ising Model Pairs", "abstract": "Probabilistic graphical models (PGMs) are effective for capturing the statistical dependencies in stochastic databases. In many domains (e.g., working with multimodal data), one faces multiple information layers that can be modeled by structurally similar PGMs. While learning the structures of PGMs in isolation is well-investigated, the algorithmic design and performance limits of learning from multiple coupled PGMs are investigated far less. This paper considers learning the structural similarities shared by a pair of Ising PGMs. The objective is learning the shared structure with no regard for the structures exclusive to either of the graphs, and significantly different from the existing approaches that focus on entire structure of the graphs. We propose an algorithm for the shared structure learning objective, evaluate its performance empirically, and compare with existing approaches on structure learning of single graphs."}}
{"id": "Cod6npUfGzQ", "cdate": 1609459200000, "mdate": 1653601414086, "content": {"title": "Two-Stage Graph-Constrained Group Testing: Theory and Application", "abstract": "This paper formalizes a graph-constrained group testing (GT) framework for isolating up to k defective items from a population of p. In contrast to traditional group testing approaches, an underlying graphical model imposes constraints on how the items can be grouped for testing. The existing theories on graph-constrained GT consider one-stage, non-adaptive frameworks that can isolate the defective items perfectly with Θ(k <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</sup> M <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</sup> log(p/k)) tests, where M is the mixing time associated with the graph. This paper, in contrast, formalizes an adaptive, two-stage framework that requires Θ(kM <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</sup> log(p/k)) tests, that is, a factor k smaller than that of the one-stage (non-adaptive) frameworks. The theoretical results established for the two-stage framework are also evaluated empirically. Furthermore, this framework is extended to address the problem of anomaly detection in the network, where based on the samples from probability distributions conforming to a location-scale family, the decision rules for detecting a defective vertex are characterized."}}
{"id": "aZ7xjrUZi0h", "cdate": 1577836800000, "mdate": null, "content": {"title": "Multimodal Dynamic Brain Connectivity Analysis Based on Graph Signal Processing for Former Athletes With History of Multiple Concussions", "abstract": "The study of structure-function relationships in the brain has been an active area of research in neuroscience. The availability of brain imaging data that captures the structural connectivity and functional co-activation of the brain regions has led to the study of multimodal technical frameworks that can help disentangle the mechanisms linking cognitive abilities and brain structural alterations. This paper analyzes the diffusion and resting state functional magnetic resonance imaging (dMRI and rs-fMRI) data collected from a population consisting of former athletes with a history of multiple concussions and healthy controls with no reported history of concussion. For each subject, the structural connectome is represented by a graph with its nodes associated with cortical brain regions and the adjacency matrix derived from dMRI. Each cortical brain region is associated with a blood oxygen level dependent (BOLD) signal derived from fMRI. This paper uses the tools from graph signal processing (GSP) to select the brain regions of interest (ROIs) that have significant statistical differences in the extracted high and low graph frequency components of the region specific BOLD signal across former athletes and healthy controls, where the graph frequencies represent the extent of spatial variations of the BOLD signal across the brain. The selected ROIs have also been previously identified to be affected in the existing clinical studies on traumatic brain injuries (TBI). Furthermore, the dynamic functional connectivity profiles of the selected ROIs are determined by leveraging the high and low graph frequency components of the BOLD signal and a sliding window based approach. Interestingly, the graph frequency functional connectivity profiles reveal unique characteristics that are not apparent in the unimodal dynamic functional connectivity profiles based on fMRI. Our analysis reveals statistically significant differences in the dwell times in multiple dynamic graph frequency functional connectivity states for the two groups of subjects. Therefore, the results presented in this paper underline the significance of graph signal processing tools for multimodal analysis of brain imaging data and also provide promising direction for applications in clinical research and medical diagnosis."}}
{"id": "K1eIgXOwIdq", "cdate": 1577836800000, "mdate": null, "content": {"title": "Approximate Recovery Of Ising Models with Side Information", "abstract": "This paper considers the problem of recovering the edge structures of two partially identical graphs in the class of Ising models. It is assumed that both graphs have the same number of nodes and a known subset of nodes have identical structures in both graphs. Therefore, inferring the structure of one graph can provide the side information that could be leveraged for inference related to the other graph. The objective is to recover the connectivity of both graphs under an approximate recovery criterion. The degree- and edge-bounded subclass of Ising models is considered and necessary conditions (information-theoretic) and sufficient conditions for the sample complexity to achieve a bounded probability of error are established. Furthermore, the scaling behavior of the sample complexity is analyzed in different regimes and specific regimes are identified for which the necessary and sufficient conditions coincide, thus, establishing the optimal sample complexity."}}
{"id": "2w9msSYSf3", "cdate": 1577836800000, "mdate": null, "content": {"title": "Secure Estimation Under Causative Attacks", "abstract": "This paper considers the problem of secure parameter estimation when an estimation algorithm is prone to causative attacks. Causative attacks, in general, target decision-making algorithms (e.g., inference or learning algorithm) to alter their decisions in specific scenarios (e.g., distort parameter estimates for specific ranges of the parameter of interest). Such attacks influence the decisions via tampering with the mechanisms through which an algorithm acquires the statistical model of the population about which it aims to form a decision. Such attacks are viable, for instance, by contaminating the historical or training data, or by compromising an expert who provides the statistical model. In the presence of causative attacks, inference algorithms operate under a distorted statistical model for the data samples. This paper introduces a notion of secure parameter estimation and formalizes a framework under which secure estimation can be formulated and analyzed. The central premise underlying the secure estimation framework is that forming secure estimates introduces a new dimension to the estimation objective, pertaining to detecting attacks and isolating the true model. Since detection and isolation decisions themselves are imperfect, their inclusion induces an inherent coupling between the desired secure estimation objective and the auxiliary detection and isolation decisions that need to be formed in conjunction with the estimates. This paper establishes the fundamental interplay among these decisions, and characterizes the general decision rules in closed-forms for any desired estimation cost function. Furthermore, to circumvent the computational complexity associated with growing parameter dimension or attack complexity, a scalable estimation algorithm is provided, which is shown to enjoy certain optimality guarantees. Finally, the theory developed is applied to secure parameter estimation in sensor networks."}}
{"id": "HJxYnSBlIH", "cdate": 1567802801202, "mdate": null, "content": {"title": "Structure Learning with Side Information: Sample Complexity", "abstract": "Graphical models encode the stochastic dependencies among random variables (RVs). The vertices represent the  RVs, and the edges signify the conditional dependencies among the RVs. Structure learning is the process of inferring the edges by observing realizations of the RVs, and it has applications in a wide range of technological, social, and biological networks. Learning the structure of graphs when the vertices are treated in isolation from inferential information known about them is well-investigated. In a wide range of domains, however, often there exist additional inferred knowledge about the structure, which can serve as valuable side information. For instance, the gene networks that represent different subtypes of the same cancer share similar edges across all subtypes and also have exclusive edges corresponding to each subtype, rendering partially similar graphical models for gene expression in different cancer subtypes. Hence, an inferential decision regarding a gene network can serve as side information for inferring other related gene networks.  When such side information is leveraged judiciously, it can translate to significant improvement in structure learning. Leveraging such side information can be abstracted as inferring structures of distinct graphical models that are {\\sl partially} similar. This paper focuses on Ising graphical models, and considers the problem of simultaneously learning the structures of two {\\sl partially} similar graphs, where any inference about the structure of one graph offers side information for the other graph. The bounded edge subclass of Ising models is considered, and necessary conditions (information-theoretic ), as well as sufficient conditions (algorithmic) for the sample complexity for achieving a bounded probability of error, are established. Furthermore, specific regimes are identified in which the necessary and sufficient conditions coincide, rendering the optimal sample complexity."}}
