{"id": "JvIJgiFfAgZ", "cdate": 1672531200000, "mdate": 1682347009360, "content": {"title": "Adaptive Power Method: Eigenvector Estimation from Sampled Data", "abstract": "Computing the dominant eigenvectors of a matrix $A$ has many applications, such as principal component analysis, spectral embedding, and PageRank. However, in general, this task relies on the compl..."}}
{"id": "vRjH5hbGc-F", "cdate": 1609459200000, "mdate": 1681702932614, "content": {"title": "Transfer Learning in Bandits with Latent Continuity", "abstract": "Structured stochastic multi-armed bandits provide accelerated regret rates over the standard unstructured bandit problems. Most structured bandits, however, assume the knowledge of the structural parameter such as Lipschitz continuity, which is often not available. To cope with the latent structural parameter, we consider a transfer learning setting in which an agent must learn to transfer the structural information from the prior tasks to the next task, which is inspired by practical problems such as rate adaptation in wireless link. Specifically, we propose a novel framework to provably and accurately estimate the Lipschitz constant based on previous tasks and fully exploit it for the new task at hand. We analyze the efficiency of the proposed framework in two folds: (i) our regret bound on the new task is close to that of the oracle algorithm with the full knowledge of the Lipschitz constant under mild assumptions; and (ii) the sample complexity of our estimator matches with the information-theoretic fundamental limit. Our analysis reveals a set of useful insights on transfer learning for latent Lipschitz constants such as the fundamental challenge a learner faces. Finally, our numerical evaluations confirm our theoretical findings and show the superiority of the proposed framework compared to baselines."}}
{"id": "LXi3EC6a_H", "cdate": 1609459200000, "mdate": 1681702932264, "content": {"title": "Transfer Learning in Bandits with Latent Continuity", "abstract": "Structured stochastic multi-armed bandits provide accelerated regret rates over the standard unstructured bandit problems. Most structured bandits, however, assume the knowledge of the structural parameter such as Lipschitz continuity, which is often not available. To cope with the latent structural parameter, we consider a transfer learning setting in which an agent must learn to transfer the structural information from the prior tasks to the next task, which is inspired by practical problems such as rate adaptation in wireless link. We propose a novel framework to provably and accurately estimate the Lipschitz constant based on previous tasks and fully exploit it for the new task at hand. We analyze the efficiency of the proposed framework in two folds: (i) the sample complexity of our estimator matches with the information-theoretic fundamental limit; and (ii) our regret bound on the new task is close to that of the oracle algorithm with the full knowledge of the Lipschitz constant under mild assumptions. Our analysis reveals a set of useful insights on transfer learning for latent Lipschitzconstants such as the fundamental challenge a learner faces. Our numerical evaluations confirm our theoretical findings and show the superiority of the proposed framework compared to baselines."}}
{"id": "W89_Zz6t7i_", "cdate": 1577836800000, "mdate": 1682347009366, "content": {"title": "Two-Way Function Computation", "abstract": "We explore the role of interaction for the problem of reliable computation over two-way multicast networks. Specifically we consider a four-node network in which two nodes wish to compute a modulo-sum of two independent Bernoulli sources generated from the other two, and a similar task is done in the other direction. The main contribution of this work lies in the characterization of the computation capacity region for a deterministic model of the network via a novel transmission scheme. One consequence of this result is that, not only we can get an interaction gain over the one-way non-feedback computation capacities, but also we can get all the way to perfect-feedback <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup> computation capacities simultaneously in both directions for some channel regimes. This result draws a parallel with the recent result developed in the context of two-way interference channels.This is an idealistic case where feedback links are perfect with infinite capacities and are given for free. We left the exact definition in Section II."}}
{"id": "-Pwuaru2V2c", "cdate": 1577836800000, "mdate": null, "content": {"title": "Capacity of the Erasure Shuffling Channel", "abstract": "Motivated by DNA-based data storage, we study the erasure shuffling channel. This channel takes as input multiple strings, which are passed through an erasure channel and then shuffled out of order. We show that the capacity of this channel, for a large set of channel parameters, is given by the capacity of the binary erasure channel, C <sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">BEC</sub> , minus a term that captures the loss of ordering information due to shuffling."}}
{"id": "kbYF-u0zBG", "cdate": 1514764800000, "mdate": 1682347009361, "content": {"title": "Two-way Function Computation", "abstract": "We explore the role of interaction for the problem of reliable computation over two-way multicast networks. Specifically we consider a four-node network in which two nodes wish to compute a modulo-sum of two independent Bernoulli sources generated from the other two, and a similar task is done in the other direction. The main contribution of this work lies in the characterization of the computation capacity region for a deterministic model of the network via a novel transmission scheme. One consequence of this result is that, not only we can get an interaction gain over the one-way non-feedback computation capacities, but also we can sometimes get all the way to perfect-feedback computation capacities simultaneously in both directions. This result draws a parallel with the recent result developed in the context of two-way interference channels."}}
{"id": "pm75z7A0qsr", "cdate": 1483228800000, "mdate": 1682347009371, "content": {"title": "System Level Simulation of mmWave Based Mobile Xhaul Networks", "abstract": "To support tens of Giga-bits/second (Gbps) data rate, 5G mobile communication systems consider the integration of backhaul and fronthaul links into Xhaul networks. This paper introduces the system-level simulation for mmWave based mobile Xhaul networks. Network scenarios, hybrid beamforming, with large antenna elements, and link-level models are discussed based on the results of the system-level simulation for the mobile Xhaul network. System-level simulation results show that the mobile Xhau network using a 40 GHz carrier frequency band can support a 20 Gbps data rate."}}
{"id": "dvxEBVh4Mg", "cdate": 1483228800000, "mdate": 1682347009365, "content": {"title": "Capacity of a two-way function multicast channel", "abstract": "We explore the role of interaction for the problem of reliable computation over two-way multicast networks. Specifically we consider a four-node network in which two nodes wish to compute a modulo-sum of two independent Bernoulli sources generated from the other two, and a similar task is done in the other direction. The main contribution of this work lies in the characterization of the computation capacity region for a deterministic model of the network via a novel transmission scheme. One consequence of this result is that not only we can get an interaction gain over the one-way non-feedback computation capacities, we can sometime get all the way to perfect-feedback computation capacities simultaneously in both directions. This result draws a parallel with the recent result developed in the context of two-way interference channels [1]."}}
{"id": "dQ5ynBGX_F", "cdate": 1388534400000, "mdate": 1682347009366, "content": {"title": "Two-way function computation", "abstract": "We explore the role of feedback for the problem of reliable computation over two-way multicast networks. Specifically we consider a scenario in which there are forward-message computation demands and feedback is offered through the backward network for aiding the forward-message computation. We characterize the feedback computation capacity of a four-node Avestimehr-Diggavi-Tse deterministic network in which two nodes in one side wish to compute modulo-2 sums of two independent Bernoulli sources generated from the other two nodes. As a consequence of this result, we show that the backward network can be more efficiently used for feedback, rather than if it were used for independent backward-message computation. Our achievability proof builds upon a network decomposition framework developed in our earlier work."}}
