{"id": "ykeXWhlJCYq", "cdate": 1609459200000, "mdate": 1623725879118, "content": {"title": "Shared Latent Space of Font Shapes and Impressions", "abstract": "Styles of typefaces or fonts are often associated with specific impressions, such as heavy, contemporary, or elegant. This indicates that there are certain correlations between font shapes and their impressions. To understand the correlations, this paper realizes a shared latent space where a font and its impressions are embedded nearby. The difficulty is that the impression words attached to a font are often very noisy. This is because impression words are very subjective and diverse. More importantly, some impression words have no direct relevance to the font shapes and will disturb the realization of the shared latent space. We, therefore, use DeepSets for enhancing shape-relevant words and suppressing shape irrelevant words automatically while training the shared latent space. Quantitative and qualitative experimental results with a large-scale font-impression dataset demonstrate that the shared latent space by the proposed method describes the correlation appropriately, especially for the shape-relevant impression words."}}
{"id": "sw0tSsQhMN1", "cdate": 1609459200000, "mdate": 1632965686973, "content": {"title": "Learning the micro deformations by max-pooling for offline signature verification", "abstract": "Highlights • Proving that CNNs have the potential to capture “micro deformations”. • Learning the discrimination from a two-phase CNN based feature extractor. • Achieving state of the art on four benchmark datasets of different languages. Abstract For signature verification systems, micro deformations can be defined as the small differences in the same strokes of signatures or special writing habits of different signers. These micro deformations can reveal the core distinction between the genuine signatures and skilled forgeries. In this paper, we prove that Convolutional Neural Networks (CNNs) have the potential to extract those micro deformations by max-pooling. More specifically, the micro deformations can be determined by watching the location coordinates of the maximum values in pooling windows of max-pooling. Extensive analysis and experiments demonstrate that it is possible to achieve state-of-the-art performance by using this location information as a new feature for capturing micro deformations, along with convolutional features. The proposed method outperforms the state-of-the-art systems on four publicly available datasets of different languages, i.e., English (GPDSsynthetic, CEDAR), Persian (UTSig), and Hindi (BHSig260)."}}
{"id": "r222obMc9ln", "cdate": 1609459200000, "mdate": 1632965686978, "content": {"title": "Font Style that Fits an Image - Font Generation Based on Image Context", "abstract": "When fonts are used on documents, they are intentionally selected by designers. For example, when designing a book cover, the typography of the text is an important factor in the overall feel of the book. In addition, it needs to be an appropriate font for the rest of the book cover. Thus, we propose a method of generating a book title image based on its context within a book cover. We propose an end-to-end neural network that inputs the book cover, a target location mask, and a desired book title and outputs stylized text suitable for the cover. The proposed network uses a combination of a multi-input encoder-decoder, a text skeleton prediction network, a perception network, and an adversarial discriminator. We demonstrate that the proposed method can effectively produce desirable and appropriate book cover text through quantitative and qualitative results."}}
{"id": "ph3BGCG0kWI", "cdate": 1609459200000, "mdate": 1632965687270, "content": {"title": "Mining Neighbor Frames for Person Re-identification by Global Optimal Tracking", "abstract": "Person re-identification is a challenging task aiming to identify the same person across different cameras. However, most of existing image-based person re-identification methods neglect the spatial and temporal constraint, the information in neighbor frames of each person image is rarely exploited by previous studies. In this paper, we propose a novel neighbor frames mining framework (NFM) to exploit the spatial-temporal information. For each gallery image, we use a dynamic programming-based global optimal tracking method to search images of the same person in its neighbor frames. From those images, the image features extracted by the shared convolutional neural network (CNN) in the constructed neighbor sequence are merged via an attention weighted averaging technology. To this end, a novel supervised attention mechanism is designed for dealing with tracking errors. The final feature with multi-view and robust information is used for matching. Experimental results show the superiority and efficiency of the proposed method on two benchmark datasets including DukeMTMC-reID and PRW."}}
{"id": "nCNfxgDFxvp", "cdate": 1609459200000, "mdate": 1632965686826, "content": {"title": "Which Parts Determine the Impression of the Font?", "abstract": "Various fonts give different impressions, such as legible, rough, and comic-text. This paper aims to analyze the correlation between the local shapes, or parts, and the impression of fonts. By focusing on local shapes instead of the whole letter shape, we can realize more general analysis independent from letter shapes. The analysis is performed by newly combining SIFT and DeepSets, to extract an arbitrary number of essential parts from a particular font and aggregate them to infer the font impressions by nonlinear regression. Our qualitative and quantitative analyses prove that (1) fonts with similar parts have similar impressions, (2) many impressions, such as legible and rough, largely depend on specific parts, and (3) several impressions are very irrelevant to parts."}}
{"id": "hH0yORrY0u", "cdate": 1609459200000, "mdate": 1632965686825, "content": {"title": "Attention to Warp: Deep Metric Learning for Multivariate Time Series", "abstract": "Deep time series metric learning is challenging due to the difficult trade-off between temporal invariance to nonlinear distortion and discriminative power in identifying non-matching sequences. This paper proposes a novel neural network-based approach for robust yet discriminative time series classification and verification. This approach adapts a parameterized attention model to time warping for greater and more adaptive temporal invariance. It is robust against not only local but also large global distortions, so that even matching pairs that do not satisfy the monotonicity, continuity, and boundary conditions can still be successfully identified. Learning of this model is further guided by dynamic time warping to impose temporal constraints for stabilized training and higher discriminative power. It can learn to augment the inter-class variation through warping, so that similar but different classes can be effectively distinguished. We experimentally demonstrate the superiority of the proposed approach over previous non-parametric and deep models by combining it with a deep online signature verification framework, after confirming its promising behavior in single-letter handwriting classification on the Unipen dataset."}}
{"id": "cOqHpNAcp4E", "cdate": 1609459200000, "mdate": 1632965686977, "content": {"title": "Meta-learning of Pooling Layers for Character Recognition", "abstract": "In convolutional neural network-based character recognition, pooling layers play an important role in dimensionality reduction and deformation compensation. However, their kernel shapes and pooling operations are empirically predetermined; typically, a fixed-size square kernel shape and max pooling operation are used. In this paper, we propose a meta-learning framework for pooling layers. As part of our framework, a parameterized pooling layer is proposed in which the kernel shape and pooling operation are trainable using two parameters, thereby allowing flexible pooling of the input data. We also propose a meta-learning algorithm for the parameterized pooling layer, which allows us to acquire a suitable pooling layer across multiple tasks. In the experiment, we applied the proposed meta-learning framework to character recognition tasks. The results demonstrate that a pooling layer that is suitable across character recognition tasks was obtained via meta-learning, and the obtained pooling layer improved the performance of the model in both few-shot character recognition and noisy image recognition tasks."}}
{"id": "aOeQm04DCrV", "cdate": 1609459200000, "mdate": 1632965686987, "content": {"title": "Self-Augmented Multi-Modal Feature Embedding", "abstract": "Oftentimes, patterns can be represented through different modalities. For example, leaf data can be in the form of images or contours. Handwritten characters can also be either online or offline. To exploit this fact, we propose the use of self-augmentation and combine it with multi-modal feature embedding. In order to take advantage of the complementary information from the different modalities, the self-augmented multi-modal feature embedding employs a shared feature space. Through experimental results on classification with online handwriting and leaf images, we demonstrate that the proposed method can create effective embeddings."}}
{"id": "ZaNoPEmZOoH", "cdate": 1609459200000, "mdate": 1632965686011, "content": {"title": "Font Style that Fits an Image - Font Generation Based on Image Context", "abstract": "When fonts are used on documents, they are intentionally selected by designers. For example, when designing a book cover, the typography of the text is an important factor in the overall feel of the book. In addition, it needs to be an appropriate font for the rest of the book cover. Thus, we propose a method of generating a book title image based on its context within a book cover. We propose an end-to-end neural network that inputs the book cover, a target location mask, and a desired book title and outputs stylized text suitable for the cover. The proposed network uses a combination of a multi-input encoder-decoder, a text skeleton prediction network, a perception network, and an adversarial discriminator. We demonstrate that the proposed method can effectively produce desirable and appropriate book cover text through quantitative and qualitative results. The code can be found at https://github.com/Taylister/FontFits ."}}
{"id": "ZA5NEUdv9DQ", "cdate": 1609459200000, "mdate": 1632965686827, "content": {"title": "Meta-learning of Pooling Layers for Character Recognition", "abstract": "In convolutional neural network-based character recognition, pooling layers play an important role in dimensionality reduction and deformation compensation. However, their kernel shapes and pooling operations are empirically predetermined; typically, a fixed-size square kernel shape and max pooling operation are used. In this paper, we propose a meta-learning framework for pooling layers. As part of our framework, a parameterized pooling layer is proposed in which the kernel shape and pooling operation are trainable using two parameters, thereby allowing flexible pooling of the input data. We also propose a meta-learning algorithm for the parameterized pooling layer, which allows us to acquire a suitable pooling layer across multiple tasks. In the experiment, we applied the proposed meta-learning framework to character recognition tasks. The results demonstrate that a pooling layer that is suitable across character recognition tasks was obtained via meta-learning, and the obtained pooling layer improved the performance of the model in both few-shot character recognition and noisy image recognition tasks."}}
