{"id": "_AUGy9SHdA", "cdate": 1683904146045, "mdate": 1683904146045, "content": {"title": "Neuronal Organization in the Inferior Colliculus Revisited with Cell-Type-Dependent Monosynaptic Tracing", "abstract": "The inferior colliculus (IC) is a critical integration center in the auditory pathway. However, because the inputs to the IC have typically been studied by the use of conventional anterograde and retrograde tracers, the neuronal organization and cell-type-specific connections in the IC are poorly understood. Here, we used monosynaptic rabies tracing and in situ hybridization combined with excitatory and inhibitory Cre transgenic mouse lines of both sexes to characterize the brainwide and cell-type-specific inputs to specific neuron types within the lemniscal IC core and nonlemniscal IC shell. We observed that both excitatory and inhibitory neurons of the IC shell predominantly received ascending inputs rather than descending or core inputs. Correlation and clustering analyses revealed two groups of excitatory neurons in the shell: one received inputs from a combination of ascending nuclei, and the other received inputs from a combination of descending nuclei, neuromodulatory nuclei, and the contralateral IC. In contrast, inhibitory neurons in the core received inputs from the same combination of all nuclei. After normalizing the extrinsic inputs, we found that core inhibitory neurons received a higher proportion of inhibitory inputs from the ventral nucleus of the lateral lemniscus than excitatory neurons. Furthermore, the inhibitory neurons preferentially received inhibitory inputs from the contralateral IC shell. Because IC inhibitory neurons innervate the thalamus and contralateral IC, the inhibitory inputs we uncovered here suggest two long-range disinhibitory circuits. In summary, we found: (1) dominant ascending inputs to the shell, (2) two subpopulations of shell excitatory neurons, and (3) two disinhibitory circuits."}}
{"id": "UafnNvi6l8f", "cdate": 1683903697476, "mdate": 1683903697476, "content": {"title": "Differential cell-type dependent brain state modulations of sensory representations in the non-lemniscal mouse inferior colliculus", "abstract": "Sensory responses of the neocortex are strongly influenced by brain state changes. However, it remains unclear whether and how the sensory responses of the midbrain are affected. Here we addressed this issue by using in vivo two-photon calcium imaging to monitor the spontaneous and sound-evoked activities in the mouse inferior colliculus (IC). We developed a method enabling us to image the first layer of non-lemniscal IC (IC shell L1) in awake behaving mice. Compared with the awake state, spectral tuning selectivity of excitatory neurons was decreased during isoflurane anesthesia. Calcium imaging in behaving animals revealed that activities of inhibitory neurons were highly correlated with locomotion. Compared with stationary periods, spectral tuning selectivity of excitatory neurons was increased during locomotion. Taken together, our studies reveal that neuronal activities in the IC shell L1 are brain state dependent, whereas the brain state modulates the excitatory and inhibitory neurons differentially."}}
{"id": "p5JvjeiwZvd", "cdate": 1683731115888, "mdate": 1683731115888, "content": {"title": "A framework for the general design and computation of hybrid neural networks", "abstract": "There is a growing trend to design hybrid neural networks (HNNs) by combining spiking neural networks and artificial neural networks to leverage the strengths of both. Here, we propose a framework for general design and computation of HNNs by introducing hybrid units (HUs) as a linkage interface. The framework not only integrates key features of these computing paradigms but also decouples them to improve flexibility and efficiency. HUs are designable and learnable to promote transmission and modulation of hybrid information flows in HNNs. Through three cases, we demonstrate that the framework can facilitate hybrid model design. The hybrid sensing network implements multi-pathway sensing, achieving high tracking accuracy and energy efficiency. The hybrid modulation network implements hierarchical information abstraction, enabling meta-continual learning of multiple tasks. The hybrid reasoning network performs multimodal reasoning in an interpretable, robust and parallel manner. This study advances cross-paradigm modeling for a broad range of intelligent tasks."}}
{"id": "UwzrP-B38jK", "cdate": 1652737442011, "mdate": null, "content": {"title": "Learning Robust Rule Representations for Abstract Reasoning via Internal Inferences", "abstract": "Abstract reasoning, as one of the hallmarks of human intelligence, involves collecting information, identifying abstract rules, and applying the rules to solve new problems. Although neural networks have achieved human-level performances in several tasks, the abstract reasoning techniques still far lag behind due to the complexity of learning and applying the logic rules, especially in an unsupervised manner. In this work, we propose a novel framework, ARII, that learns rule representations for Abstract Reasoning via Internal Inferences. The key idea is to repeatedly apply a rule to different instances in hope of having a comprehensive understanding (i.e., representations) of the rule. Specifically, ARII consists of a rule encoder, a reasoner, and an internal referrer. Based on the representations produced by the rule encoder, the reasoner draws the conclusion while the referrer performs internal inferences to regularize rule representations to be robust and generalizable. We evaluate ARII on two benchmark datasets, including PGM and I-RAVEN. We observe that ARII achieves new state-of-the-art records on the majority of the reasoning tasks, including most of the generalization tests in PGM. Our codes are available at https://github.com/Zhangwenbo0324/ARII."}}
{"id": "6IuXPUQXZS", "cdate": 1640995200000, "mdate": 1683886608244, "content": {"title": "Learning Robust Rule Representations for Abstract Reasoning via Internal Inferences", "abstract": "title> <link rel=\"stylesheet\" href=\"/static/papers/css/papers.css\" /> <meta name=\"citation_title\" content=\"Learning Robust Rule Representations for Abstract Reasoning via Internal Inferences\" /> <meta name=\"citation_author\" content=\"Zhang, Wenbo\" /> <meta name=\"citation_author\" content=\"tang, likai\" /> <meta name=\"citation_author\" content=\"Mo, Site\" /> <meta name=\"citation_author\" content=\"Liu, Xianggen\" /> <meta name=\"citation_author\" content=\"Song, Sen\" /> <meta name=\"citation_journal_title\" content=\"Advances in Neural Information Processing Systems\" /> <meta name=\"citation_volume\" content=\"35\" /> <meta name=\"citation_firstpage\" content=\"33550\" /> <meta name=\"citation_lastpage\" content=\"33562\" /> <meta name=\"citation_pdf_url\" content=\"https://proceedings.neurips.cc/paper_files/paper/2022/file/d951f73c521d069fefbb73396df01424-Paper-Conference.pdf\" /> <meta name=\"citation_publication_date\" content=\"2022-12-06\" /><!-- Bootstrap CSS --> <!-- https://codepen.io/surjithctly/pen/PJqKzQ --> <link rel=\"stylesheet\" href=\"https://stackpath.bootstrapcdn.com/bootstrap/4.4.1/css/bootstrap.min.css\" integrity=\"sha384-Vkoo8x4CGsO3+Hhxv8T/Q5PaXtkKtu6ug5TOeNV6gBiFeWPGFN9MuhOf23Q9Ifjh\" crossorigin=\"anonymous\" /> <link href=\"/static/menus/css/menus.css\" rel=\"stylesheet\" id=\"bootstrap-css\" /> <link rel=\"stylesheet\" href=\"https://use.fontawesome.com/releases/v5.8.1/css/all.css\" integrity=\"sha384-50oBUHEmvpQ+1lW4y57PTFmhCaXp0ML5d60M1M7uH2+nqUivzIebhndOJK28anvf\" crossorigin=\"anonymous\" /> <script type=\"text/javascript\" async=\"async\" src=\"https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.7/latest.js?config=TeX-MML-AM_CHTML\"></script> <script type=\"text/x-mathjax-config\"> <![CDATA[ MathJax.Hub.Config({ \"tex2jax\": { \"inlineMath\": [[\"$\",\"$\"], [\"\\\\(\",\"\\\\)\"]], \"displayMath\": [[\"\\\\[\",\"\\\\]\"]], \"processEscapes\": true } } ); ]]> </script> <style> <![CDATA[ @media (prefers-color-scheme: dark) { body { background-color: #333; color: #eee; } } .btn-spacer { margin: 2px; } .footer { position: fixed; left: 0; bottom: 0; width: 100%; background-color: #eee; color: black; } ]]> </style> <nav class=\"navbar navbar-expand-md navbar-light bg-light\"> <button class=\"navbar-toggler\" type=\"button\" data-toggle=\"collapse\" data-target=\"#navbarToggler6\" aria-controls=\"navbarToggler6\" aria-expanded=\"false\" aria-label=\"Toggle navigation\"><span class=\"navbar-toggler-icon\"></span></button> <div class=\"collapse navbar-collapse\" id=\"navbarToggler6\"> <a class=\"navbar-brand\" href=\"/\">NeurIPS Proceedings</a> <ul class=\"navbar-nav mr-auto mt-2 mt-md-0\"> <li class=\"nav-item\"> <a class=\"nav-link\" href=\"/admin/login/?next=/admin/\"><i class=\"fas fa-sign-in-alt\" title=\"Login\"></i></a> <li class=\"nav-item\"> <a class=\"nav-link\" href=\"/admin/logout/?nextp=/admin\"><i class=\"fas fa-sign-out-alt\" title=\"Logout\"></i></a> <form class=\"form-inline my-2 my-lg-0\" method=\"get\" role=\"search\" action=\"/papers/search\"> <input class=\"form-control mr-sm-2\" type=\"text\" name=\"q\" placeholder=\"Search\" aria-label=\"Search\" id=\"navsearch\" /> <button class=\"btn btn-outline-success my-2 my-sm-0\" type=\"submit\">Search</button>"}}
{"id": "2HqLbz8ZV5d", "cdate": 1640995200000, "mdate": 1681723181993, "content": {"title": "Local Hypergraph-based Nested Named Entity Recognition as Query-based Sequence Labeling", "abstract": "There has been a growing academic interest in the recognition of nested named entities in many domains. We tackle the task with a novel local hypergraph-based method: We first propose start token candidates and generate corresponding queries with their surrounding context, then use a query-based sequence labeling module to form a local hypergraph for each candidate. An end token estimator is used to correct the hypergraphs and get the final predictions. Compared to span-based approaches, our method is free of the high computation cost of span sampling and the risk of losing long entities. Sequential prediction makes it easier to leverage information in word order inside nested structures, and richer representations are built with a local hypergraph. Experiments show that our proposed method outperforms all the previous hypergraph-based and sequence labeling approaches with large margins on all four nested datasets. It achieves a new state-of-the-art F1 score on the ACE 2004 dataset and competitive F1 scores with previous state-of-the-art methods on three other nested NER datasets: ACE 2005, GENIA, and KBP 2017."}}
{"id": "-FaGBUbY8H", "cdate": 1640995200000, "mdate": 1681723181993, "content": {"title": "ZoomNet for Topic-Oriented Fragment Recognition in Long Documents", "abstract": "This work introduces a new information extraction task called <bold xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Topic-Oriented Fragment Recognition (TOFR)</b> , whose goal is to recognize information related to a specific topic in long documents from professional fields. In this paper, we introduce two TOFR datasets to study the problems of processing long documents. We propose a novel neural framework named <bold xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Zooming Network (ZoomNet)</b> , which overcomes the challenge of combining information over long distances with limited computing resources by flexibly switching between skimming and intensive reading in processing long documents. In general, ZoomNet first establishes a hierarchical representation aligned to the text structure, which relieves the conflict between local information and extensive contextual information. Then, it synthesizes different levels of information to assign tags via multi-scale actions. We combine supervised and reinforcement learning methods to train our model. Experiments show that the proposed model outperforms several state-of-the-art sequence labeling models, including BiLSTM-CRF, BERT, XLNET, RoBERTa, and ELECTRA, on both TOFR datasets with big margins."}}
{"id": "BCP_poLFmJT", "cdate": 1620357665679, "mdate": null, "content": {"title": "Rationalizing Translation Elongation by Reinforcement Learning", "abstract": "Translation elongation plays a crucial role in multiple aspects of protein biogenesis. In this study, we develop a novel deep reinforcement learning based framework, named RiboRL, to model the distributions of ribosomes on transcripts. In particular, RiboRL employs a policy network (PolicyNet) to perform a context-dependent feature selection to facilitate the prediction of ribosome density. Extensive tests demonstrate that RiboRL can outperform other state-of-the-art methods in predicting ribosome densities. We also show that the reinforcement learning based strategy can generate more informative features for the prediction task when compared to other commonly used attribution methods in deep learning. Moreover, the in-depth analyses and a case study also indicate the potential applications of the RiboRL framework in generating meaningful biological insights regarding translation elongation dynamics. These results have established RiboRL as a useful computational tool to facilitate the studies of the underlying mechanisms of translational regulation."}}
{"id": "nfpzyC7B_8", "cdate": 1609459200000, "mdate": 1681723181994, "content": {"title": "TrimNet: learning molecular representation from triplet messages for biomedicine", "abstract": ""}}
{"id": "eZvH3HLxUvI", "cdate": 1609459200000, "mdate": 1651067685564, "content": {"title": "Simulated annealing for optimization of graphs and sequences", "abstract": ""}}
