{"id": "RtTmHcIIdtM", "cdate": 1708078331877, "mdate": 1708078331877, "content": {"title": "Frustratingly Easy System Combination for Grammatical Error Correction", "abstract": "In this paper, we formulate system combination for grammatical error correction (GEC) as a simple machine learning task: binary classification. We demonstrate that with the right problem formulation, a simple logistic regression algorithm can be highly effective for combining GEC models. Our method successfully increases the F0.5 score from the highest base GEC system by 4.2 points on the CoNLL-2014 test set and 7.2 points on the BEA-2019 test set. Furthermore, our method outperforms the state of the art by 4.0 points on the BEA-2019 test set, 1.2 points on the CoNLL-2014 test set with original annotation, and 3.4 points on the CoNLL-2014 test set with alternative annotation. We also show that our system combination generates better corrections with higher F0.5 scores than the conventional ensemble."}}
{"id": "iDXpHUGZJYz", "cdate": 1640995200000, "mdate": 1657610387745, "content": {"title": "LM-BFF-MS: Improving Few-Shot Fine-tuning of Language Models based on Multiple Soft Demonstration Memory", "abstract": "Eunhwan Park, Donghyeon Jeon, Seonhoon Kim, Inho Kang, Seung-Hoon Na. Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers). 2022."}}
{"id": "eEpHc1KOeB_", "cdate": 1640995200000, "mdate": 1671194259598, "content": {"title": "JBNU-CCLab at SemEval-2022 Task 12: Machine Reading Comprehension and Span Pair Classification for Linking Mathematical Symbols to Their Descriptions", "abstract": ""}}
{"id": "cvqE3XuYe8", "cdate": 1640995200000, "mdate": 1671194259600, "content": {"title": "JBNU-CCLab at SemEval-2022 Task 7: DeBERTa for Identifying Plausible Clarifications in Instructional Texts", "abstract": ""}}
{"id": "QGBOSNWnR0", "cdate": 1640995200000, "mdate": 1671194259597, "content": {"title": "Frustratingly Easy System Combination for Grammatical Error Correction", "abstract": ""}}
{"id": "CIIL8SJ4lYU", "cdate": 1640995200000, "mdate": 1671194259599, "content": {"title": "Feature Structure Distillation for BERT Transferring", "abstract": "Knowledge distillation is an approach to transfer information on representations from a teacher to a student by reducing their difference. A challenge of this approach is to reduce the flexibility of the student's representations inducing inaccurate learning of the teacher's knowledge. To resolve it in transferring, we investigate distillation of structures of representations specified to three types: intra-feature, local inter-feature, global inter-feature structures. To transfer them, we introduce feature structure distillation methods based on the Centered Kernel Alignment, which assigns a consistent value to similar features structures and reveals more informative relations. In particular, a memory-augmented transfer method with clustering is implemented for the global structures. The methods are empirically analyzed on the nine tasks for language understanding of the GLUE dataset with Bidirectional Encoder Representations from Transformers (BERT), which is a representative neural language model. In the results, the proposed methods effectively transfer the three types of structures and improve performance compared to state-of-the-art distillation methods. Indeed, the code for the methods is available in https://github.com/maroo-sky/FSD."}}
{"id": "2Pvzwq8q7u9", "cdate": 1640995200000, "mdate": 1671194259598, "content": {"title": "SISER: Semantic-Infused Selective Graph Reasoning for Fact Verification", "abstract": ""}}
{"id": "ezN2ShD1vD", "cdate": 1577836800000, "mdate": 1637349995204, "content": {"title": "JBNU at SemEval-2020 Task 4: BERT and UniLM for Commonsense Validation and Explanation", "abstract": "Seung-Hoon Na, Jong-Hyeon Lee. Proceedings of the Fourteenth Workshop on Semantic Evaluation. 2020."}}
{"id": "danyL6f1-YG", "cdate": 1577836800000, "mdate": 1637349996267, "content": {"title": "Word Reordering for Translation into Korean Sign Language Using Syntactically-guided Classification", "abstract": "Machine translation aims to break the language barrier that prevents communication with others and increase access to information. Deaf people face huge language barriers in their daily lives, including access to digital and spoken information. There are very few digital resources for sign language processing. In this article, we present a transfer-based machine translation system for translating Korean-to-Korean Sign Language (KSL) glosses, mainly composed of (1) dictionary-based lexical transfer and (2) a hybrid syntactic transfer based on a data-driven model. In particular, we formulate complicated word reordering problems in syntactic transfer as multi-class classification tasks and propose “syntactically guided” data-driven syntactic transfer. The core part of our study is a neural classification model for reordering order-important constituent pairs with a reordering task that is newly designed for Korean-to-KSL translation. The experiment results evaluated on news transcript data show that the proposed system achieves a BLEU score of 0.512 and a RIBES score of 0.425, significantly improving upon the baseline system performance."}}
{"id": "QBHE8_iIznX", "cdate": 1577836800000, "mdate": 1637349996270, "content": {"title": "JBNU at MRP 2020: AMR Parsing Using a Joint State Model for Graph-Sequence Iterative Inference", "abstract": "Seung-Hoon Na, Jinwoo Min. Proceedings of the CoNLL 2020 Shared Task: Cross-Framework Meaning Representation Parsing. 2020."}}
