{"id": "1LdZJ0Z3vC", "cdate": 1675209600000, "mdate": 1682690525651, "content": {"title": "Distributed Learning Meets 6G: A Communication and Computing Perspective", "abstract": "With the ever improving computing capabilities and storage capacities of mobile devices in line with evolving telecommunication network paradigms, there has been an explosion of research interest toward exploring distributed learning (DL) frameworks to realize stringent key performance indicators (KPIs) that are expected in next-generation/6G cellular networks. In conjunction with edge computing, federated learning (FL) has emerged as the DL architecture of choice in prominent wireless applications. This article provides an outline of how DL in general and FL-based strategies specifically can contribute toward realizing part of the 6G vision and strike a balance between communication and computing constraints. As a practical use case, we apply multi-agent reinforcement learning within the FL framework to the dynamic spectrum access (DSA) problem and present preliminary evaluation results. Top contemporary challenges in applying DL approaches to 6G networks are also highlighted."}}
{"id": "_GGSyOjaoJq", "cdate": 1672531200000, "mdate": 1682690525653, "content": {"title": "Distributed Learning Meets 6G: A Communication and Computing Perspective", "abstract": "With the ever-improving computing capabilities and storage capacities of mobile devices in line with evolving telecommunication network paradigms, there has been an explosion of research interest towards exploring Distributed Learning (DL) frameworks to realize stringent key performance indicators (KPIs) that are expected in next-generation/6G cellular networks. In conjunction with Edge Computing, Federated Learning (FL) has emerged as the DL architecture of choice in prominent wireless applications. This article lays an outline of how DL in general and FL-based strategies specifically can contribute towards realizing a part of the 6G vision and strike a balance between communication and computing constraints. As a practical use case, we apply Multi-Agent Reinforcement Learning (MARL) within the FL framework to the Dynamic Spectrum Access (DSA) problem and present preliminary evaluation results. Top contemporary challenges in applying DL approaches to 6G networks are also highlighted."}}
{"id": "HkPlTXr20TG", "cdate": 1640995200000, "mdate": 1682690525651, "content": {"title": "Error bound characterization for reservoir computing-based OFDM symbol detection", "abstract": "In this paper, we derive an upper bound on the generalization error of reservoir computing (RC), a special category of recurrent neural networks (RNNs). The particular RC implementation considered in this paper is the echo state network (ESN), and the generalization bound is derived via the empirical Rademacher complexity (ERC) approach. While recent work in deriving risk bounds for RC frameworks makes use of a non-standard empirical Rademacher Complexity (ERC) measure and a direct application of its definition, our work uses the standard ERC measure and tools which allow easier extension to deep RC structures and a fair comparison with other RNN structures including the vanilla RNNs. Finally, we train an ESN for the task of symbol detection, a key component in the receive processing of 5G systems and show with an example how the derived generalization bound can guide the underlying system design. To be specific, we utilize the derived generalization error together with the characterized training loss to analytically identify the optimum number of neurons in the reservoir for the symbol detection task. Simulation results using 3GPP specified channels corroborate our theoretical findings, illustrating the significance and practical relevance of our work."}}
{"id": "AucTdlGr_e", "cdate": 1640995200000, "mdate": 1682690525653, "content": {"title": "Anonymous Jamming Detection in 5G with Bayesian Network Model Based Inference Analysis", "abstract": "Jamming and intrusion detection are some of the most important research domains in 5G that aim to maintain use-case reliability, prevent degradation of user experience, and avoid severe infrastructure failure or denial of service in mission-critical applications. This paper introduces an anonymous jamming detection model for 5G and beyond based on critical signal parameters collected from the radio access and core network’s protocol stacks on a 5G testbed. The introduced system leverages both supervised and unsupervised learning to detect jamming with high-accuracy in real time, and allows for robust detection of unknown jamming types. Based on the given types of jamming, supervised instantaneous detection models reach an Area Under the Curve (AUC) within a range of 0.964 to 1 as compared to temporal-based long short-term memory (LSTM) models that reach AUC within a range of 0.923 to 1. The need for data annotation effort and the required knowledge of a vocabulary of known jamming limits the usage of the introduced supervised learning-based approach. To mitigate this issue, an unsupervised auto-encoder-based anomaly detection is also presented. The introduced unsupervised approach has an AUC of 0.987 with training samples collected without any jamming or interference and shows resistance to adversarial training samples within certain percentage. To retain transparency and allow domain knowledge injection, a Bayesian network model based causation analysis is further introduced."}}
{"id": "alSWrp6ZVy", "cdate": 1609459200000, "mdate": 1682690525688, "content": {"title": "Federated Dynamic Spectrum Access", "abstract": "Due to the growing volume of data traffic produced by the surge of Internet of Things (IoT) devices, the demand for radio spectrum resources is approaching their limitation defined by Federal Communications Commission (FCC). To this end, Dynamic Spectrum Access (DSA) is considered as a promising technology to handle this spectrum scarcity. However, standard DSA techniques often rely on analytical modeling wireless networks, making its application intractable in under-measured network environments. Therefore, utilizing neural networks to approximate the network dynamics is an alternative approach. In this article, we introduce a Federated Learning (FL) based framework for the task of DSA, where FL is a distributive machine learning framework that can reserve the privacy of network terminals under heterogeneous data distributions. We discuss the opportunities, challenges, and opening problems of this framework. To evaluate its feasibility, we implement a Multi-Agent Reinforcement Learning (MARL)-based FL as a realization associated with its initial evaluation results."}}
{"id": "LBpxVUec9uo", "cdate": 1609459200000, "mdate": 1682690525652, "content": {"title": "Edge Intelligence for Beyond-5G through Federated Learning", "abstract": ""}}
{"id": "CU4Y6738CYB", "cdate": 1609459200000, "mdate": 1682690525685, "content": {"title": "RCNet: Incorporating Structural Information Into Deep RNN for Online MIMO-OFDM Symbol Detection With Limited Training", "abstract": "In this paper, we investigate online learning-based MIMO-OFDM symbol detection strategies focusing on a special recurrent neural network (RNN) - reservoir computing (RC). We first introduce the Time-Frequency RC to take advantage of the structural information inherent in OFDM signals. Using the time domain RC and the time-frequency RC as building blocks, we provide two extensions of the shallow RC to RCNet: 1) Stacking multiple time domain RCs; 2) Stacking multiple time-frequency RCs into a deep structure. The combination of RNN dynamics, the time-frequency structure of MIMO-OFDM signals, and the deep network enables RCNet to handle the interference and nonlinear distortion of MIMO-OFDM signals to outperform existing methods. Unlike most existing NN-based detection strategies, RCNet is also shown to provide a good generalization performance even with a limited online training set (i.e, similar amount of reference signals/training as standard model-based approaches). Numerical experiments demonstrate that the introduced RCNet can offer a faster learning convergence and as much as 20% gain in bit error rate over a shallow RC structure by compensating for the nonlinear distortion of the MIMO-OFDM signal, such as due to power amplifier compression in the transmitter or due to finite quantization resolution in the receiver."}}
{"id": "aoOPfbArWiB", "cdate": 1602926479913, "mdate": null, "content": {"title": "Learning for Integer-Constrained Optimization through Neural Networks with Limited Training", "abstract": "In this paper, we investigate a neural network-based learning approach towards solving an integer-constrained programming problem using very limited training. Specifically, we introduce a symmetric and decomposed neural network structure, which is fully interpretable in terms of the functionality of its constituent components. By taking advantage of the underlying pattern of the integer constraint, as well as of the affine nature of the objective function, the introduced neural network offers superior generalization performance with limited training, as compared to other generic neural network structures that do not exploit the inherent structure of the integer constraint. In addition, we show that the introduced decomposed approach can be further extended to semi-decomposed frameworks. The introduced learning approach is evaluated via the classification/symbol detection task in the context of wireless communication systems where available training sets are usually limited. Evaluation results demonstrate that the introduced learning strategy is able to effectively perform the classification/symbol detection task in a wide variety of wireless channel environments specified by the 3GPP community."}}
{"id": "v6qdY0tgUn", "cdate": 1577836800000, "mdate": 1682690525655, "content": {"title": "Moving Toward Intelligence: Detecting Symbols on 5G Systems Through Deep Echo State Network", "abstract": "Due to the nonlinear distortion caused by radio-frequency (RF) components in the transceiver, detecting transmitted symbols for multiple-input and multiple-output orthogonal frequency-division multiplexing (MIMO-OFDM) systems can be challenging and resource consuming. In this work, we introduce a Deep Echo State Network (DESN) to serve as the symbol detector for 5G communication networks. Our DESN employs memristive synapses as the dynamic reservoir layer to accelerate the learning algorithm and computation. By cascading multiple dynamic reservoir layers in a hierarchical processing structure, our DESN processes received signal in both spatial and temporal domains. The resulting hybrid memristor-CMOS co-design provides the nonlinear computation required by the reservoir layer while significantly reduces the power consumption. From the benchmark on nonlinear system prediction, our DESN exhibits 10.31 X reduction on the prediction error compared to state-of-the-art neural network designs. Moreover, our DESN records a bit error rate (BER) of 5.76 × 10 <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">-2</sup> on the high-speed transmitted symbol detection task for MIMO-OFDM systems, yielding 47.73% more precise than state-of-the-art techniques in the literate for 5G communication networks."}}
{"id": "pMVbceYZpG", "cdate": 1577836800000, "mdate": 1682690525651, "content": {"title": "Federated Learning in Mobile Edge Computing: An Edge-Learning Perspective for Beyond 5G", "abstract": "Owing to the large volume of sensed data from the enormous number of IoT devices in operation today, centralized machine learning algorithms operating on such data incur an unbearable training time, and thus cannot satisfy the requirements of delay-sensitive inference applications. By provisioning computing resources at the network edge, Mobile Edge Computing (MEC) has become a promising technology capable of collaborating with distributed IoT devices to facilitate federated learning, and thus realize real-time training. However, considering the large volume of sensed data and the limited resources of both edge servers and IoT devices, it is challenging to ensure the training efficiency and accuracy of delay-sensitive training tasks. Thus, in this paper, we design a novel edge computing-assisted federated learning framework, in which the communication constraints between IoT devices and edge servers and the effect of various IoT devices on the training accuracy are taken into account. On one hand, we employ machine learning methods to dynamically configure the communication resources in real-time to accelerate the interactions between IoT devices and edge servers, thus improving the training efficiency of federated learning. On the other hand, as various IoT devices have different training datasets which have varying influence on the accuracy of the global model derived at the edge server, an IoT device selection scheme is designed to improve the training accuracy under the resource constraints at edge servers. Extensive simulations have been conducted to demonstrate the performance of the introduced edge computing-assisted federated learning framework."}}
