{"id": "2PG5ywgZTk", "cdate": 1677628800000, "mdate": 1682925031461, "content": {"title": "Detection of Temporal Shifts in Semantics Using Local Graph Clustering", "abstract": "Many changes in our digital corpus have been brought about by the interplay between rapid advances in digital communication and the current environment characterized by pandemics, political polarization, and social unrest. One such change is the pace with which new words enter the mass vocabulary and the frequency at which meanings, perceptions, and interpretations of existing expressions change. The current state-of-the-art algorithms do not allow for an intuitive and rigorous detection of these changes in word meanings over time. We propose a dynamic graph-theoretic approach to inferring the semantics of words and phrases (“terms”) and detecting temporal shifts. Our approach represents each term as a stochastic time-evolving set of contextual words and is a count-based distributional semantic model in nature. We use local clustering techniques to assess the structural changes in a given word’s contextual words. We demonstrate the efficacy of our method by investigating the changes in the semantics of the phrase “Chinavirus”. We conclude that the term took on a much more pejorative meaning when the White House used the term in the second half of March 2020, although the effect appears to have been temporary. We make both the dataset and the code used to generate this paper’s results available."}}
{"id": "94RCEAqZjGk", "cdate": 1609459200000, "mdate": 1682925031557, "content": {"title": "A General Framework for Spatio-Temporal Modeling of Epidemics With Multiple Epicenters: Application to an Aerially Dispersed Plant Pathogen", "abstract": "The spread dynamics of long-distance-dispersed pathogens are influenced by the dispersal characteristics of a pathogen, anisotropy due to multiple factors, and the presence of multiple sources of inoculum. In this research, we developed a flexible class of phenomenological spatio-temporal models that extend a modeling framework used in plant pathology applications to account for the presence of multiple sources and anisotropy of biological species that can govern disease gradients and spatial spread in time. We use the cucurbit downy mildew pathosystem (caused by Pseudoperonospora cubensis) to formulate a data-driven procedure based on the 2008 to 2010 historical occurrence of the disease in the U.S. available from standardized sentinel plots deployed as part of the Cucurbit Downy Mildew ipmPIPE program. This pathosystem is characterized by annual recolonization and extinction cycles, generating annual disease invasions at the continental scale. This data-driven procedure is amenable to fitting models of disease spread from one or multiple sources of primary inoculum and can be specified to provide estimates of the parameters by regression methods conditional on a function that can accommodate anisotropy in disease occurrence data. Applying this modeling framework to the cucurbit downy mildew data sets, we found a small but consistent reduction in temporal prediction errors by incorporating anisotropy in disease spread. Further, we did not find evidence of an annually occu..."}}
{"id": "AjrRA6WYSW", "cdate": 1601308100334, "mdate": null, "content": {"title": "Estimation of Number of Communities in Assortative Sparse Networks", "abstract": "Most community detection algorithms assume the number of communities, $K$, to be known \\textit{a priori}. Among various approaches that have been proposed to estimate $K$, the non-parametric methods based on the spectral properties of the Bethe Hessian matrices have garnered much popularity for their simplicity, computational efficiency, and robust performance irrespective of the sparsity of the input data. Recently, one such method has been shown to estimate $K$ consistently if the input network is generated from the (semi-dense) stochastic block model, when the average of the expected degrees ($\\tilde{d}$) of all the nodes in the network satisfies $\\tilde{d} \\gg \\log(N)$  ($N$ being the number of nodes in the network). In this paper, we prove some finite sample results that hold for $\\tilde{d} = o(\\log(N))$, which in turn show that the estimation of $K$ based on the spectra of the Bethe Hessian matrices is consistent not only for the semi-dense regime, but also for the sub-logarithmic sparse regime when $1 \\ll \\tilde{d} \\ll \\log(N)$. Thus, our estimation procedure is a robust method for a wide range of problem settings, regardless of the sparsity of the network input."}}
{"id": "vK4ta9RgKMg", "cdate": 1591623705070, "mdate": null, "content": {"title": "Sparse and Low-bias Estimation of High Dimensional Vector Autoregressive Models", "abstract": "Vector autoregressive ($VAR$) models are widely used for causal discovery and forecasting in multivariate time series analysis. In the high-dimensional setting, which is increasingly common in fields such as neuroscience and econometrics, model parameters are inferred by $L_1$-regularized maximum likelihood (RML). A well-known feature of RML inference is that in general the technique produces a trade-off between sparsity and bias that depends on the choice of the regularization hyperparameter. In the context of multivariate time series analysis, sparse estimates are favorable for causal discovery and low-bias estimates are favorable for forecasting. However, owing to a paucity of research on hyperparameter selection methods, practitioners must rely on \\textit{ad-hoc} methods such as cross-validation (or manual tuning). The particular balance that such approaches achieve between the two goals --- causal discovery and forecasting --- is poorly understood. Our paper investigates this behavior and proposes a method ($UoI_{VAR}$) that achieves a better balance between sparsity and bias when the underlying causal influences are in fact sparse. We demonstrate through simulation that RML with a hyperparameter selected by cross-validation tends to overfit, producing relatively dense estimates. We further demonstrate that $UoI_{VAR}$ much more effectively approximates the correct sparsity pattern with only a minor compromise in model fit, particularly so for larger data dimensions, and that the estimates produced by $UoI_{VAR}$ exhibit less bias. We conclude that our method achieves improved performance especially well-suited to applications involving simultaneous causal discovery and forecasting in high-dimensional settings."}}
{"id": "vfz4XbCzAR", "cdate": 1577836800000, "mdate": 1682925031559, "content": {"title": "General Community Detection with Optimal Recovery Conditions for Multi-relational Sparse Networks with Dependent Layers", "abstract": "Multilayer and multiplex networks are becoming common network data sets in recent times. We consider the problem of identifying the common community structure for a special type of multilayer networks called multi-relational networks. We consider extensions of the spectral clustering methods for multi-relational networks and give theoretical guarantees that the spectral clustering methods recover community structure consistently for multi-relational networks generated from multilayer versions of both stochastic and degree-corrected block models even with dependence between network layers. The methods are shown to work under optimal conditions on the degree parameter of the networks to detect both assortative and disassortative community structures with vanishing error proportions even if individual layers of the multi-relational network has the network structures below community detectability threshold. We reinforce the validity of the theoretical results via simulations too."}}
{"id": "r9SkjskAzg", "cdate": 1577836800000, "mdate": null, "content": {"title": "Consistent detection and optimal localization of all detectable change points in piecewise stationary arbitrarily sparse network-sequences", "abstract": "We consider the offline change point detection and localization problem in the context of piecewise stationary networks, where the observable is a finite sequence of networks. We develop algorithms involving some suitably modified CUSUM statistics based on adaptively trimmed adjacency matrices of the observed networks for both detection and localization of single or multiple change points present in the input data. We provide rigorous theoretical analysis and finite sample estimates evaluating the performance of the proposed methods when the input (finite sequence of networks) is generated from an inhomogeneous random graph model, where the change points are characterized by the change in the mean adjacency matrix. We show that the proposed algorithms can detect (resp. localize) all change points, where the change in the expected adjacency matrix is above the minimax detectability (resp. localizability) threshold, consistently without any a priori assumption about (a) a lower bound for the sparsity of the underlying networks, (b) an upper bound for the number of change points, and (c) a lower bound for the separation between successive change points, provided either the minimum separation between successive pairs of change points or the average degree of the underlying networks goes to infinity arbitrarily slowly. We also prove that the above condition is necessary to have consistency."}}
{"id": "_VUB62NjkvI", "cdate": 1577836800000, "mdate": 1682925031560, "content": {"title": "Scaling of Union of Intersections for Inference of Granger Causal Networks from Observational Data", "abstract": "The development of advanced recording and measurement devices in scientific fields is producing high-dimensional time series data. Vector autoregressive (VAR) models are well suited for inferring Granger-causal networks from high dimensional time series data sets, but accurate inference at scale remains a central challenge. We have recently introduced a flexible and scalable statistical machine learning framework, Union of Intersections (UoI), which enables low false-positive and low false-negative feature selection along with low bias and low variance estimation, enhancing interpretation and predictive accuracy. In this paper, we scale the UoI framework for VAR models (algorithm UoI <inf xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V AR</inf> ) to infer network connectivity from large time series data sets (TBs). To achieve this, we optimize distributed convex optimization and introduce novel strategies for improved data read and data distribution times. We study the strong and weak scaling of the algorithm on a Xeon-phi based supercomputer (100,000 cores). These advances enable us to estimate the largest VAR model as known (1000 nodes, corresponding to 1M parameters) and apply it to large time series data from neurophysiology (192 neurons) and finance (470 companies)."}}
{"id": "dAfmEm3kQm", "cdate": 1546300800000, "mdate": null, "content": {"title": "Sparse, Predictive, and Interpretable Functional Connectomics with UoILasso", "abstract": "Network formation from neural activity is a foundational problem in systems neuroscience. Functional networks, after downstream analysis, can provide key insights into the nature of neurobiological structure and computation. The validity of such insights hinges on accurate selection and estimation of the edges connecting nodes. However, commonly used statistical inference procedures generally fail to identify the correct features, and further introduce consequential bias in the estimates. To address these issues, we developed Union of Intersections (UoI), a flexible, modular, and scalable framework for enhanced statistical feature selection and estimation. Methods based on UoI perform feature selection and feature estimation through intersection and union operations, respectively. In the context of linear regression (specifically UoI <sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Lasso</sub> ), we summarize extensive numerical investigation on synthetic data to demonstrate tight control of false-positives and false-negatives in feature selection with low-bias and low-variance estimates of selected parameters, while maintaining high-quality prediction accuracy. We demonstrate, with UoI <sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Lasso</sub> , the extraction of sparse, predictive, and interpretable functional networks from human electrocorticography recordings during speech production and the inference of parsimonious coupling models from nonhuman primate single-unit recordings during reaching tasks. Our results establish that UoI <sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Lasso</sub> generates interpretable and predictive functional connectivity networks."}}
{"id": "_seJEuBg5V2", "cdate": 1514764800000, "mdate": null, "content": {"title": "Optimizing the Union of Intersections LASSO (UoILASSO) and Vector Autoregressive (UoIVAR) Algorithms for Improved Statistical Estimation at Scale", "abstract": "The analysis of scientific data of increasing size and complexity requires statistical machine learning methods that are both interpretable and predictive. Union of Intersections (UoI), a recently developed framework, is a two-step approach that separates model selection and model estimation. A linear regression algorithm based on UoI, $UoI_{LASSO}$, simultaneously achieves low false positives and low false negative feature selection as well as low bias and low variance estimates. Together, these qualities make the results both predictive and interpretable. In this paper, we optimize the $UoI_{LASSO}$ algorithm for single-node execution on NERSC's Cori Knights Landing, a Xeon Phi based supercomputer. We then scale $UoI_{LASSO}$ to execute on cores ranging from 68-278,528 cores on a range of dataset sizes demonstrating the weak and strong scaling of the implementation. We also implement a variant of $UoI_{LASSO}$, $UoI_{VAR}$ for vector autoregressive models, to analyze high dimensional time-series data. We perform single node optimization and multi-node scaling experiments for $UoI_{VAR}$ to demonstrate the effectiveness of the algorithm for weak and strong scaling. Our implementations enable to use estimate the largest VAR model (1000 nodes) we are aware of, and apply it to large neurophysiology data 192 nodes)."}}
{"id": "9cjq9MUc4Q", "cdate": 1514764800000, "mdate": 1682925031559, "content": {"title": "Spectral Clustering for Multiple Sparse Networks: I", "abstract": "Although much of the focus of statistical works on networks has been on static networks, multiple networks are currently becoming more common among network data sets. Usually, a number of network data sets, which share some form of connection between each other are known as multiple or multi-layer networks. We consider the problem of identifying the common community structures for multiple networks. We consider extensions of the spectral clustering methods for the multiple sparse networks, and give theoretical guarantee that the spectral clustering methods produce consistent community detection in case of both multiple stochastic block model and multiple degree-corrected block models. The methods are shown to work under sufficiently mild conditions on the number of multiple networks to detect associative community structures, even if all the individual networks are sparse and most of the individual networks are below community detectability threshold. We reinforce the validity of the theoretical results via simulations too."}}
