{"id": "Y11fVS4n8d9", "cdate": 1655045337330, "mdate": null, "content": {"title": "OOD-CV: A Benchmark for Robustness to Individual Nuisances in Real-World Out-of-Distribution Shifts", "abstract": "Enhancing the robustness of vision algorithms in real-world scenarios is challenging. One reason is that existing robustness benchmarks are limited, as they either rely on synthetic data or ignore the effects of individual nuisance factors. We introduce ROBIN, a benchmark dataset that includes out-of-distribution examples of 10 object categories in terms of pose, shape, texture, context and the weather conditions, and enables benchmarking models for image classification, object detection, and 3D pose estimation. Our experiments using popular baseline methods reveal that: 1) Some nuisance factors have a much stronger negative effect on the performance compared to others, also depending on the vision task. 2) Current approaches to enhance robustness have only marginal effects, and can even reduce robustness. 3) We do not observe significant differences between convolutional and transformer architectures. We believe our dataset provides a rich testbed to study robustness and will help push forward research in this area."}}
{"id": "jpNAc_Z0gKr", "cdate": 1623376566933, "mdate": null, "content": {"title": "Reducing the feature divergence of RGB and near-infrared images using Switchable Normalization", "abstract": "Visual pattern recognition over agricultural areas is an important application of aerial image processing. In this paper, we consider the multi-modality nature of agricultural aerial images and show that naively combining different modalities together without taking the feature divergence into account can lead to sub-optimal results. Thus, we apply a Switchable Normalization block to our DeepLabV3 segmentation model to alleviate the feature divergence. Using the popular symmetric Kullback Leibler divergence measure, we show that our model can greatly reduce the divergence between RGB and near-infrared channels. Together with a hybrid loss function, our model achieves nearly 10\\% improvements in mean IoU over previously published baseline."}}
{"id": "YJHXfcTDaqw", "cdate": 1623152237201, "mdate": null, "content": {"title": "Rail-5k: a Real-World Dataset for Rail Surface Defects Detection", "abstract": "This paper presents the Rail-5k dataset for benchmarking the performance of visual algorithms in a real-world application scenario, namely the rail surface defect detection task.\nWe collected over 5k high-quality images from railways across China and annotated 1100 images with the help of railway experts to identify the most common 13 types of railway defects.\nThe dataset can be used for two settings both with unique challenges, the first is the fully-supervised setting using the 1k labeled images for training, fine-grained nature and long-tailed distribution of defect classes make it hard for visual algorithms to tackle.\nThe second is the semi-supervised learning setting facilitated by the 4k unlabeled images, these 4k images are uncurated containing possible image corruptions and domain shift with the labeled images, which can not be easily tackled by previous semi-supervised learning methods.\nWe believe our dataset could be a valuable benchmark for evaluating the robustness and reliability of visual algorithms."}}
{"id": "u915CND5dDr", "cdate": 1609459200000, "mdate": 1668172839466, "content": {"title": "Making CNNs Interpretable by Building Dynamic Sequential Decision Forests with Top-down Hierarchy Learning", "abstract": ""}}
{"id": "SpuCHa1IvYy", "cdate": 1609459200000, "mdate": 1668172839446, "content": {"title": "ROBIN : A Benchmark for Robustness to Individual Nuisancesin Real-World Out-of-Distribution Shifts", "abstract": ""}}
{"id": "FbNLdLgdF_a", "cdate": 1609459200000, "mdate": 1668172839417, "content": {"title": "Reducing the feature divergence of RGB and near-infrared images using Switchable Normalization", "abstract": ""}}
{"id": "-sQuqqpy_65", "cdate": 1609459200000, "mdate": 1668172839420, "content": {"title": "Rail-5k: a Real-World Dataset for Rail Surface Defects Detection", "abstract": ""}}
{"id": "cfTEWp9BNb", "cdate": 1577836800000, "mdate": 1668172839417, "content": {"title": "The 1st Agriculture-Vision Challenge: Methods and Results", "abstract": ""}}
{"id": "RChgWNCrePE", "cdate": 1577836800000, "mdate": 1668172839447, "content": {"title": "The 1st Agriculture-Vision Challenge: Methods and Results", "abstract": ""}}
{"id": "Qt4A46XGtx", "cdate": 1577836800000, "mdate": 1668172839413, "content": {"title": "Reducing the feature divergence of RGB and near-infrared images using Switchable Normalization", "abstract": ""}}
