{"id": "U6VXdYcSktt", "cdate": 1701388800000, "mdate": 1695953045939, "content": {"title": "Swarm Exploration Mechanism-Based Distributed Water Wave Optimization", "abstract": "Using sparrow search hunting mechanism to improve water wave algorithm (WWOSSA), which combines the water wave optimization (WWO) algorithm and the sparrow search algorithm (SSA), has good optimization ability and fast convergence speed. However, it still suffers from insufficient exploration ability and is easy to fall into local optimum. In this study, we propose a new algorithm for distributed population structure, called swarm exploration mechanism-based distributed water wave optimization (DWSA). In DWSA, an information exchange component and an optimal individual evolution component are designed to improve information exchange between individuals. This multi-part information interaction and distributed population structure algorithm can help the population algorithm to establish a balance between exploitation and exploration more effectively. We contrast DWSA with the original algorithms WWOSSA and other meta-heuristics in order to show the effectiveness of DWSA. The test set consists of 22 actual optimization issues from the CEC2011 set and 29 benchmark functions from the CEC2017 benchmark functions. In addition, an experimental comparison of the parameter values introduced in DWSA is included. According to experimental results, the proposed DWSA performs substantially better than its competitors. Assessments of the population diversity and landscape search trajectory also confirmed DWSA’s outstanding convergence."}}
{"id": "1pECd6g2r8Y", "cdate": 1701388800000, "mdate": 1695953045972, "content": {"title": "Hierarchical Manta Ray Foraging Optimization with Weighted Fitness-Distance Balance Selection", "abstract": "Manta ray foraging optimization (MRFO) tends to get trapped in local optima as it relies on the direction provided by the previous individual and the best individual as guidance to search for the optimal solution. As enriching population diversity can effectively solve this problem, in this paper, we introduce a hierarchical structure and weighted fitness-distance balance selection to improve the population diversity of the algorithm. The hierarchical structure allows individuals in different groups of the population to search for optimal solutions in different places, expanding the diversity of solutions. In MRFO, greedy selection based solely on fitness can lead to local solutions. We innovatively incorporate a distance metric into the selection strategy to increase selection diversity and find better solutions. A hierarchical manta ray foraging optimization with weighted fitness-distance balance selection (HMRFO) is proposed. Experimental results on IEEE Congress on Evolutionary Computation 2017 (CEC2017) functions show the effectiveness of the proposed method compared to seven competitive algorithms, and the proposed method has little effect on the algorithm complexity of MRFO. The application of HMRFO to optimize real-world problems with large dimensions has also obtained good results, and the computational time is very short, making it a powerful alternative for very high-dimensional problems. Finally, the effectiveness of this method is further verified by analyzing the population diversity of HMRFO."}}
{"id": "srtU3A7R4AX", "cdate": 1690848000000, "mdate": 1695953045926, "content": {"title": "Automatic design of machine learning via evolutionary computation: A survey", "abstract": ""}}
{"id": "mSuZFYEcZG", "cdate": 1690848000000, "mdate": 1695953045949, "content": {"title": "An Autonomous Vehicle Group Model in an Urban Scene", "abstract": "Forming a stable autonomous vehicle group is extremely challenging in an urban scene, which is disturbed by many environmental factors, e.g., manned vehicles, roadside obstacles, traffic lights, and pedestrians. Existing work focuses on autonomous vehicle group formation (AVGF) in a highway scene only. Its outcomes cannot be directly applied to an urban scene because of different environmental factors and poor communication quality. This work presents an autonomous vehicle group model in an urban scene. First, it proposes a prediction method to analyze the impact of environmental factors on communications among autonomous vehicles. Then, it defines preperception degree, vehicle activity, and mobility similarity of autonomous vehicles and selects leader vehicles based on them. Next, it measures connectivity, coupling, and timeliness increments of a vehicle group, based on which a vehicle group model is formulated. Finally, it solves the proposed vehicle group model by using a modified distributed multiobjective optimization method, proves its convergence, and analyzes its time complexity. The simulation results on synthetic and real roads show that the proposed prediction method achieves lower errors than XGBoost and a multilayer perceptron, and the proposed vehicle group model outperforms two AVGF methods and a dynamic clustering method for vehicular ad-hoc network."}}
{"id": "K7VI-BqRb0", "cdate": 1688169600000, "mdate": 1695953045941, "content": {"title": "Prediction of PM2.5 time series by seasonal trend decomposition-based dendritic neuron model", "abstract": "The rapid industrial development in the human society has brought about the air pollution, which seriously affects human health. PM2.5 concentration is one of the main factors causing the air pollution. To accurately predict PM2.5 microns, we propose a dendritic neuron model (DNM) trained by an improved state-of-matter heuristic algorithm (DSMS) based on STL-LOESS, namely DS-DNM. Firstly, DS-DNM adopts STL-LOESS for the data preprocessing to obtain three characteristic quantities from original data: seasonal, trend, and residual components. Then, DNM trained by DSMS predicts the residual values. Finally, three sets of feature quantities are summed to obtain the predicted values. In the performance test experiments, five real-world PM2.5 concentration data are used to test DS-DNM. On the other hand, four training algorithms and seven prediction models were selected for comparison to verify the rationality of the training algorithms and the accuracy of the prediction models, respectively. The experimental results show that DS-DNM has the more competitive performance in PM2.5 concentration prediction problem."}}
{"id": "FtXTB4C9pd", "cdate": 1688169600000, "mdate": 1695953045942, "content": {"title": "A chaotic local search-based LSHADE with enhanced memory storage mechanism for wind farm layout optimization", "abstract": ""}}
{"id": "qZ0ynKFzPRV", "cdate": 1685577600000, "mdate": 1695953046011, "content": {"title": "A Dynamic Evolution Method for Autonomous Vehicle Groups in an Urban Scene", "abstract": "Accurately processing dynamic evolution events is extremely challenging for autonomous vehicle groups in an urban scene, which can be disturbed by manned vehicles, roadside obstacles, traffic lights, and pedestrians. Existing work focuses on a dynamic evolution method for such groups in a highway scene only. Its outcomes cannot be directly used to an urban scene due to different environmental factors, incomplete dynamic evolution events, and lack of simulation evaluation with real road networks. In this work, we present a dynamic evolution method for such groups in an urban scene. First, we analyze their dynamic evolution reasons. Then, we abstract five dynamic evolution events, i.e., joining, leaving, merging, splitting, and disappearing, and introduce a dynamic evolution method to process them. Finally, we deduce the evolvability that can reflect dynamic evolution states of a vehicle group. The simulation results in synthetic and real urban scenes show that the connectivity, coupling, timeliness, and evolvability of vehicle groups using the proposed dynamic evolution method are higher than those of using a dynamic evolution method for a highway scene."}}
{"id": "F7HhjIPVRO", "cdate": 1682899200000, "mdate": 1695953046026, "content": {"title": "A Chaotic Local Search-Based Particle Swarm Optimizer for Large-Scale Complex Wind Farm Layout Optimization", "abstract": "Wind energy has been widely applied in power generation to alleviate climate problems. The wind turbine layout of a wind farm is a primary factor of impacting power conversion efficiency due to the wake effect that reduces the power outputs of wind turbines located in downstream. Wind farm layout optimization (WFLO) aims to reduce the wake effect for maximizing the power outputs of the wind farm. Nevertheless, the wake effect among wind turbines increases significantly as the number of wind turbines increases in the wind farm, which severely affect power conversion efficiency. Conventional heuristic algorithms suffer from issues of low solution quality and local optimum for large-scale WFLO under complex wind scenarios. Thus, a chaotic local search-based genetic learning particle swarm optimizer (CGPSO) is proposed to optimize large-scale WFLO problems. CGPSO is tested on four larger-scale wind farms under four complex wind scenarios and compares with eight state-of-the-art algorithms. The experiment results indicate that CGPSO significantly outperforms its competitors in terms of performance, stability, and robustness. To be specific, a success and failure memories-based selection is proposed to choose a chaotic map for chaotic search local. It improves the solution quality. The parameter and search pattern of chaotic local search are also analyzed for WFLO problems."}}
{"id": "DQqYI-e36o", "cdate": 1682899200000, "mdate": 1682681438194, "content": {"title": "An adaptive position-guided gravitational search algorithm for function optimization and image threshold segmentation", "abstract": ""}}
{"id": "8YHNyQ6plt", "cdate": 1680307200000, "mdate": 1682681438202, "content": {"title": "Fully Complex-Valued Dendritic Neuron Model", "abstract": "A single dendritic neuron model (DNM) that owns the nonlinear information processing ability of dendrites has been widely used for classification and prediction. Complex-valued neural networks that consist of a number of multiple/deep-layer McCulloch-Pitts neurons have achieved great successes so far since neural computing was utilized for signal processing. Yet no complex value representations appear in single neuron architectures. In this article, we first extend DNM from a real-value domain to a complex-valued one. Performance of complex-valued DNM (CDNM) is evaluated through a complex XOR problem, a non-minimum phase equalization problem, and a real-world wind prediction task. Also, a comparative analysis on a set of elementary transcendental functions as an activation function is implemented and preparatory experiments are carried out for determining hyperparameters. The experimental results indicate that the proposed CDNM significantly outperforms real-valued DNM, complex-valued multi-layer perceptron, and other complex-valued neuron models."}}
