{"id": "ufhAU2PxER", "cdate": 1640995200000, "mdate": 1674452538468, "content": {"title": "HPODNets: deep graph convolutional networks for predicting human protein-phenotype associations", "abstract": "Deciphering the relationship between human genes/proteins and abnormal phenotypes is of great importance in the prevention, diagnosis and treatment against diseases. The Human Phenotype Ontology (HPO) is a standardized vocabulary that describes the phenotype abnormalities encountered in human disorders. However, the current HPO annotations are still incomplete. Thus, it is necessary to computationally predict human protein–phenotype associations. In terms of current, cutting-edge computational methods for annotating proteins (such as functional annotation), three important features are (i) multiple network input, (ii) semi-supervised learning and (iii) deep graph convolutional network (GCN), whereas there are no methods with all these features for predicting HPO annotations of human protein."}}
{"id": "ohCNh2_TaE", "cdate": 1640995200000, "mdate": 1667640377306, "content": {"title": "META-DDIE: predicting drug-drug interaction events with few-shot learning", "abstract": "Drug–drug interactions (DDIs) are one of the major concerns in pharmaceutical research, and a number of computational methods have been developed to predict whether two drugs interact or not. Recently, more attention has been paid to events caused by the DDIs, which is more useful for investigating the mechanism hidden behind the combined drug usage or adverse reactions. However, some rare events may only have few examples, hindering them from being precisely predicted. To address the above issues, we present a few-shot computational method named META-DDIE, which consists of a representation module and a comparing module, to predict DDI events. We collect drug chemical structures and DDIs from DrugBank, and categorize DDI events into hundreds of types using a standard pipeline. META-DDIE uses the structures of drugs as input and learns the interpretable representations of DDIs through the representation module. Then, the model uses the comparing module to predict whether two representations are similar, and finally predicts DDI events with few labeled examples. In the computational experiments, META-DDIE outperforms several baseline methods and especially enhances the predictive capability for rare events. Moreover, META-DDIE helps to identify the key factors that may cause DDI events and reveal the relationship among different events."}}
{"id": "DMetfDBkxb2", "cdate": 1640995200000, "mdate": 1675349546148, "content": {"title": "GoSum: Extractive Summarization of Long Documents by Reinforcement Learning and Graph Organized discourse state", "abstract": "Extracting summaries from long documents can be regarded as sentence classification using the structural information of the documents. How to use such structural information to summarize a document is challenging. In this paper, we propose GoSum, a novel graph and reinforcement learning based extractive model for long-paper summarization. In particular, GoSum encodes sentence states in reinforcement learning by building a heterogeneous graph for each input document at different discourse levels. An edge in the graph reflects the discourse hierarchy of a document for restraining the semantic drifts across section boundaries. We evaluate GoSum on two datasets of scientific articles summarization: PubMed and arXiv. The experimental results have demonstrated that GoSum achieve state-of-the-art results compared with strong baselines of both extractive and abstractive models. The ablation studies further validate that the performance of our GoSum benefits from the use of discourse information."}}
{"id": "crt57mtML1", "cdate": 1609459200000, "mdate": 1675349546343, "content": {"title": "NetGO 2.0: improving large-scale protein function prediction with massive sequence, text, domain, family and network information", "abstract": "With the explosive growth of protein sequences, large-scale automated protein function prediction (AFP) is becoming challenging. A protein is usually associated with dozens of gene ontology (GO) terms. Therefore, AFP is regarded as a problem of large-scale multi-label classification. Under the learning to rank (LTR) framework, our previous NetGO tool integrated massive networks and multi-type information about protein sequences to achieve good performance by dealing with all possible GO terms (>44 000). In this work, we propose the updated version as NetGO 2.0, which further improves the performance of large-scale AFP. NetGO 2.0 also incorporates literature information by logistic regression and deep sequence information by recurrent neural network (RNN) into the framework. We generate datasets following the critical assessment of functional annotation (CAFA) protocol. Experiment results show that NetGO 2.0 outperformed NetGO significantly in biological process ontology (BPO) and cellular component ontology (CCO). In particular, NetGO 2.0 achieved a 12.6% improvement over NetGO in terms of area under precision-recall curve (AUPR) in BPO and around 2.6% in terms of |$\\mathbf {F_{max}}$| in CCO. These results demonstrate the benefits of incorporating text and deep sequence information for the functional annotation of BPO and CCO. The NetGO 2.0 web server is freely available at http://issubmission.sjtu.edu.cn/ng2/."}}
{"id": "_8dpuyfzf6b", "cdate": 1609459200000, "mdate": 1667632850222, "content": {"title": "GrantRel: Grant Information Extraction via Joint Entity and Relation Extraction", "abstract": ""}}
{"id": "_3o9FBOyzIb", "cdate": 1609459200000, "mdate": 1674452538474, "content": {"title": "HPOFiller: identifying missing protein-phenotype associations by graph convolutional network", "abstract": "Exploring the relationship between human proteins and abnormal phenotypes is of great importance in the prevention, diagnosis and treatment of diseases. The human phenotype ontology (HPO) is a standardized vocabulary that describes the phenotype abnormalities encountered in human diseases. However, the current HPO annotations of proteins are not complete. Thus, it is important to identify missing protein–phenotype associations."}}
{"id": "WagjX7110ZS", "cdate": 1609459200000, "mdate": 1674452538650, "content": {"title": "Drug3D-DTI: Improved Drug-target Interaction Prediction by Incorporating Spatial Information of Small Molecules", "abstract": "A number of machine learning (ML) approaches for drug discovery have been available that rely only on sequential (1D) and planar (2D) information without effectively using the 3D information for generating features of drugs. However, 3D information of small molecules can reflect relative position of atoms more directly, which affects molecular properties. In this work, we present a new deep learning model called Drug3D-DTI for drug-target interaction prediction. Drug3D-DTI takes advantage of molecular spatial information, i.e., atom proximity in three-dimensional (3D) structures. We comprehensively evaluated the performance of Drug3D-DTI on two datasets with two tasks of regression and classification. In particular, we compared Drug3D-DTI with several existing methods including the two cutting-edge methods for compound-protein interaction prediction. From the experimental results, Drug3D-DTI clearly outperformed other methods under all settings. Further, this performance improvement was validated by ablation experiments and a case study. The implementation of Drug3D-DTI is available at (https://github.com/zhiruiliao/Drug3D-DTI)."}}
{"id": "UAcpf9zy8Qy", "cdate": 1609459200000, "mdate": null, "content": {"title": "GrantExtractor: Accurate Grant Support Information Extraction from Biomedical Fulltext Based on Bi-LSTM-CRF", "abstract": "Grant support (GS) in the MEDLINE database refers to funding agencies and contract numbers. It is important for funding organizations to track their funding outcomes from the GS information. As such, how to accurately and automatically extract funding information from biomedical literature is challenging. In this paper, we present a pipeline system called GrantExtractor that is able to accurately extract GS information from fulltext biomedical literature. GrantExtractor effectively integrates several advanced machine learning techniques. In particular, we use a sentence classifier to identify funding sentences from articles first. A bi-directional LSTM and the CRF layer (BiLSTM-CRF), and pattern matching are then used to extract entities of grant numbers and agencies from these identified funding sentences. After removing noisy numbers by a multi-class model, we finally match each grant number with its corresponding agency. Experimental results on benchmark datasets have demonstrated that GrantExtractor clearly outperforms all baseline methods. It is further evident that GrantExtractor won the first place in Task 5C of 2017 BioASQ challenge, with achieving the Micro-recall of 0.9526 for 22,610 articles. Moreover, GrantExtractor has achieved the Micro F-measure score as high as 0.90 in extracting grant pairs."}}
{"id": "EEIiT6_5Pn", "cdate": 1609459200000, "mdate": 1674452538467, "content": {"title": "DeepGraphGO: graph neural network for large-scale, multispecies protein function prediction", "abstract": "Automated function prediction (AFP) of proteins is a large-scale multi-label classification problem. Two limitations of most network-based methods for AFP are (i) a single model must be trained for each species and (ii) protein sequence information is totally ignored. These limitations cause weaker performance than sequence-based methods. Thus, the challenge is how to develop a powerful network-based method for AFP to overcome these limitations."}}
{"id": "Brlj5L52Hi", "cdate": 1609459200000, "mdate": 1674452538467, "content": {"title": "BERTMeSH: deep contextual representation learning for large-scale high-performance MeSH indexing with full text", "abstract": "With the rapid increase of biomedical articles, large-scale automatic Medical Subject Headings (MeSH) indexing has become increasingly important. FullMeSH, the only method for large-scale MeSH indexing with full text, suffers from three major drawbacks: FullMeSH (i) uses Learning To Rank, which is time-consuming, (ii) can capture some pre-defined sections only in full text and (iii) ignores the whole MEDLINE database."}}
