{"id": "xjjII075F3", "cdate": 1640995200000, "mdate": 1673927261161, "content": {"title": "In-Database Machine Learning with CorgiPile: Stochastic Gradient Descent without Full Data Shuffle", "abstract": ""}}
{"id": "nxwcTfJHXGHo", "cdate": 1640995200000, "mdate": 1668257122594, "content": {"title": "FRuDA: Framework for Distributed Adversarial Domain Adaptation", "abstract": "Breakthroughs in unsupervised domain adaptation (uDA) can help in adapting models from a label-rich source domain to unlabeled target domains. Despite these advancements, there is a lack of research on how uDA algorithms, particularly those based on adversarial learning, can work in distributed settings. In real-world applications, target domains are often distributed across thousands of devices, and existing adversarial uDA algorithms – which are centralized in nature – cannot be applied in these settings. To solve this important problem, we introduce FRuDA: an end-to-end framework for distributed adversarial uDA. Through a careful analysis of the uDA literature, we identify the design goals for a distributed uDA system and propose two novel algorithms to increase adaptation accuracy and training efficiency of adversarial uDA in distributed settings. Our evaluation of FRuDA with five image and speech datasets show that it can boost target domain accuracy by up to 50% and improve the training efficiency of adversarial uDA by at least <inline-formula><tex-math notation=\"LaTeX\">$11\\times$</tex-math></inline-formula> ."}}
{"id": "Spwd6dVhlU", "cdate": 1640995200000, "mdate": 1682524234089, "content": {"title": "Few-shot Named Entity Recognition with Entity-level Prototypical Network Enhanced by Dispersedly Distributed Prototypes", "abstract": "Few-shot named entity recognition (NER) enables us to build a NER system for a new domain using very few labeled examples. However, existing prototypical networks for this task suffer from roughly estimated label dependency and closely distributed prototypes, thus often causing misclassifications. To address the above issues, we propose EP-Net, an Entity-level Prototypical Network enhanced by dispersedly distributed prototypes. EP-Net builds entity-level prototypes and considers text spans to be candidate entities, so it no longer requires the label dependency. In addition, EP-Net trains the prototypes from scratch to distribute them dispersedly and aligns spans to prototypes in the embedding space using a space projection. Experimental results on two evaluation tasks and the Few-NERD settings demonstrate that EP-Net consistently outperforms the previous strong models in terms of overall performance. Extensive analyses further validate the effectiveness of EP-Net."}}
{"id": "RYi3FsAiR_X", "cdate": 1640995200000, "mdate": 1682524234091, "content": {"title": "Few-shot Named Entity Recognition with Entity-level Prototypical Network Enhanced by Dispersedly Distributed Prototypes", "abstract": ""}}
{"id": "NtGn5dwTbc", "cdate": 1640995200000, "mdate": 1673927261103, "content": {"title": "Stochastic Gradient Descent without Full Data Shuffle", "abstract": ""}}
{"id": "tTlgKiJ6gW", "cdate": 1609459200000, "mdate": 1648697656271, "content": {"title": "BAGUA: Scaling up Distributed Learning with System Relaxations", "abstract": "Recent years have witnessed a growing list of systems for distributed data-parallel training. Existing systems largely fit into two paradigms, i.e., parameter server and MPI-style collective operations. On the algorithmic side, researchers have proposed a wide range of techniques to lower the communication via system relaxations: quantization, decentralization, and communication delay. However, most, if not all, existing systems only rely on standard synchronous and asynchronous stochastic gradient (SG) based optimization, therefore, cannot take advantage of all possible optimizations that the machine learning community has been developing recently. Given this emerging gap between the current landscapes of systems and theory, we build BAGUA, a MPI-style communication library, providing a collection of primitives, that is both flexible and modular to support state-of-the-art system relaxation techniques of distributed training. Powered by this design, BAGUA has a great ability to implement and extend various state-of-the-art distributed learning algorithms. In a production cluster with up to 16 machines (128 GPUs), BAGUA can outperform PyTorch-DDP, Horovod and BytePS in the end-to-end training time by a significant margin (up to 2 times) across a diverse range of tasks. Moreover, we conduct a rigorous tradeoff exploration showing that different algorithms and system relaxations achieve the best performance over different network conditions."}}
{"id": "pmyy1xJOayK", "cdate": 1609459200000, "mdate": 1648697656289, "content": {"title": "1-bit Adam: Communication Efficient Large-Scale Training with Adam's Convergence Speed", "abstract": "Scalable training of large models (like BERT and GPT-3) requires careful optimization rooted in model design, architecture, and system capabilities. From a system standpoint, communication has beco..."}}
{"id": "owWK5Aqe_", "cdate": 1609459200000, "mdate": 1674154784018, "content": {"title": "Towards Demystifying Serverless Machine Learning Training", "abstract": "The appeal of serverless (FaaS) has triggered a growing interest on how to use it in data-intensive applications such as ETL, query processing, or machine learning (ML). Several systems exist for training large-scale ML models on top of serverless infrastructures (e.g., AWS Lambda) but with inconclusive results in terms of their performance and relative advantage over \"serverful\" infrastructures (IaaS). In this paper we present a systematic, comparative study of distributed ML training over FaaS and IaaS. We present a design space covering design choices such as optimization algorithms and synchronization protocols, and implement a platform, LambdaML, that enables a fair comparison between FaaS and IaaS. We present experimental results using LambdaML, and further develop an analytic model to capture cost/performance tradeoffs that must be considered when opting for a serverless infrastructure. Our results indicate that ML training pays off in serverless only for models with efficient (i.e., reduced) communication and that quickly converge. In general, FaaS can be much faster but it is never significantly cheaper than IaaS."}}
{"id": "kHpRevDgSj2", "cdate": 1609459200000, "mdate": 1648697656300, "content": {"title": "1-bit Adam: Communication Efficient Large-Scale Training with Adam's Convergence Speed", "abstract": "Scalable training of large models (like BERT and GPT-3) requires careful optimization rooted in model design, architecture, and system capabilities. From a system standpoint, communication has become a major bottleneck, especially on commodity systems with standard TCP interconnects that offer limited network bandwidth. Communication compression is an important technique to reduce training time on such systems. One of the most effective methods is error-compensated compression, which offers robust convergence speed even under 1-bit compression. However, state-of-the-art error compensation techniques only work with basic optimizers like SGD and momentum SGD, which are linearly dependent on the gradients. They do not work with non-linear gradient-based optimizers like Adam, which offer state-of-the-art convergence efficiency and accuracy for models like BERT. In this paper, we propose 1-bit Adam that reduces the communication volume by up to $5\\times$, offers much better scalability, and provides the same convergence speed as uncompressed Adam. Our key finding is that Adam's variance (non-linear term) becomes stable (after a warmup phase) and can be used as a fixed precondition for the rest of the training (compression phase). Experiments on up to 256 GPUs show that 1-bit Adam enables up to $3.3\\times$ higher throughput for BERT-Large pre-training and up to $2.9\\times$ higher throughput for SQuAD fine-tuning. In addition, we provide theoretical analysis for our proposed work."}}
{"id": "dF6QqUU4bpL", "cdate": 1609459200000, "mdate": null, "content": {"title": "Ease.ML: A Lifecycle Management System for Machine Learning", "abstract": ""}}
