{"id": "yqjyPKGeSr", "cdate": 1672531200000, "mdate": 1692020624499, "content": {"title": "Goal-Oriented Communications in Federated Learning via Feedback on Risk-Averse Participation", "abstract": "We treat the problem of client selection in a Federated Learning (FL) setup, where the learning objective and the local incentives of the participants are used to formulate a goal-oriented communication problem. Specifically, we incorporate the risk-averse nature of participants and obtain a communication-efficient on-device performance, while relying on feedback from the Parameter Server (\\texttt{PS}). A client has to decide its transmission plan on when not to participate in FL. This is based on its intrinsic incentive, which is the value of the trained global model upon participation by this client. Poor updates not only plunge the performance of the global model with added communication cost but also propagate the loss in performance on other participating devices. We cast the relevance of local updates as \\emph{semantic information} for developing local transmission strategies, i.e., making a decision on when to ``not transmit\". The devices use feedback about the state of the PS and evaluate their contributions in training the learning model in each aggregation period, which eventually lowers the number of occupied connections. Simulation results validate the efficacy of our proposed approach, with up to $1.4\\times$ gain in communication links utilization as compared with the baselines."}}
{"id": "W8rLNXkxWe", "cdate": 1672531200000, "mdate": 1692020624497, "content": {"title": "Scheduling Policy for Value-of-Information (VoI) in Trajectory Estimation for Digital Twins", "abstract": "This letter presents an approach to schedule observations from different sensors in an environment to ensure their timely delivery and build a digital twin (DT) model of the system dynamics. At the cloud platform, DT models estimate and predict the system’s state, then compute the optimal scheduling policy and resource allocation strategy to be executed in the physical world. However, given limited network resources, partial state vector information, and measurement errors at the distributed sensing agents, the acquisition of data (i.e., observations) for efficient state estimation of system dynamics is a non-trivial problem. We propose a Value of Information (VoI)-based algorithm that provides a polynomial-time solution for selecting the most informative subset of sensing agents to improve confidence in the state estimation of DT models. Numerical results confirm that the proposed method outperforms other benchmarks, reducing the communication overhead by half while maintaining the required estimation accuracy."}}
{"id": "Ed528MSNKC", "cdate": 1672531200000, "mdate": 1692020624499, "content": {"title": "Semi-Private Computation of Data Similarity With Applications to Data Valuation and Pricing", "abstract": "Consider two data providers that want to contribute data to a certain learning model. Recent works have shown that the value of the data of one of the providers is dependent on the similarity with the data owned by the other provider. It would thus be beneficial if the two providers can calculate the similarity of their data, while keeping the actual data private. In this work, we devise multiparty computation-protocols to compute similarity of two data sets based on correlation, while offering controllable privacy guarantees. We consider a simple model with two participating providers and develop methods to compute exact and approximate correlation, respectively, with controlled information leakage. Both protocols have computational and communication complexities that are linear in the number of data samples. We also provide general bounds on the maximal error in the approximation case, and analyse the resulting errors for practical parameter choices."}}
{"id": "EXiyHSO1Ud", "cdate": 1672531200000, "mdate": 1681142483476, "content": {"title": "Game Networking and its Evolution towards Supporting Metaverse through the 6G Wireless Systems", "abstract": ""}}
{"id": "u8eB_1q_LRX", "cdate": 1663939400617, "mdate": null, "content": {"title": "FedToken: Tokenized Incentives for Data Contribution in Federated Learning", "abstract": "Incentives that compensate for the involved costs in the decentralized training of a Federated Learning (FL) model act as a key stimulus for clients' long-term participation. However, it is challenging to convince clients for quality participation in FL due to the absence of: (i) full information on the client's data quality and properties; (ii) the value of client's data contributions; and (iii) the trusted mechanism for monetary incentive offers. This often leads to poor efficiency in training and communication. While several works focus on strategic incentive designs and client selection to overcome this problem, there is a major knowledge gap in terms of an overall design tailored to the foreseen digital economy, including Web 3.0, while simultaneously meeting the learning objectives. To address this gap, we propose a contribution-based tokenized incentive scheme, namely \\texttt{FedToken}, backed by blockchain technology that ensures fair allocation of tokens amongst the clients that corresponds to the valuation of their data during model training. Leveraging the engineered Shapley-based scheme, we first approximate the contribution of local models during model aggregation, then strategically schedule clients lowering the communication rounds for convergence and anchor ways to allocate \\emph{affordable} tokens under a constrained monetary budget. Extensive simulations demonstrate the efficacy of our proposed method."}}
{"id": "pghf3O6z_U", "cdate": 1640995200000, "mdate": 1681142483475, "content": {"title": "A Contribution-based Device Selection Scheme in Federated Learning", "abstract": ""}}
{"id": "ln6O4Ozg9i", "cdate": 1640995200000, "mdate": 1681142483485, "content": {"title": "Participation and Data Valuation in IoT Data Markets through Distributed Coalitions", "abstract": ""}}
{"id": "SsTA-j_ZLO", "cdate": 1640995200000, "mdate": 1681142483478, "content": {"title": "FedToken: Tokenized Incentives for Data Contribution in Federated Learning", "abstract": ""}}
{"id": "H67TaSEXtS", "cdate": 1640995200000, "mdate": 1681142483473, "content": {"title": "Edge-Assisted Democratized Learning Toward Federated Analytics", "abstract": ""}}
{"id": "D_0WNmDGNmC", "cdate": 1640995200000, "mdate": 1681142483480, "content": {"title": "CDKT-FL: Cross-Device Knowledge Transfer using Proxy Dataset in Federated Learning", "abstract": ""}}
