{"id": "EnOHM_xFpM", "cdate": 1620872040902, "mdate": null, "content": {"title": "Big Self-Supervised Models Advance Medical Image Classification", "abstract": "Self-supervised pretraining followed by supervised fine-tuning has seen success in image recognition, especially when labeled examples are scarce, but has received limited attention in medical image analysis. This paper studies the effectiveness of self-supervised learning as a pretraining strategy for medical image classification. We conduct experiments on two distinct tasks: dermatology skin condition classification from digital camera images and multi-label chest X-ray classification, and demonstrate that self-supervised learning on ImageNet, followed by additional self-supervised learning on unlabeled domain-specific medical images significantly improves the accuracy of medical image classifiers. We introduce a novel Multi-Instance Contrastive Learning (MICLe) method that uses multiple images of the underlying pathology per patient case, when available, to construct more informative positive pairs for self-supervised learning. Combining our contributions, we achieve an improvement of 6.7% in top-1 accuracy and an improvement of 1.1% in mean AUC on dermatology and chest X-ray classification respectively, outperforming strong supervised baselines pretrained on ImageNet. In addition, we show that big self-supervised models are robust to distribution shift and can learn efficiently with a small number of labeled medical images.\n"}}
{"id": "S1lOQ6RExN", "cdate": 1545035040446, "mdate": null, "content": {"title": "Classifying cancer grades using temporal ultrasound for transrectal prostate biopsy", "abstract": ""}}
{"id": "r1xkRnA4eV", "cdate": 1545034950842, "mdate": null, "content": {"title": "Detection and grading of prostate cancer using temporal enhanced ultrasound: combining deep neural networks and tissue mimicking simulations", "abstract": ""}}
{"id": "B1xaK2CEe4", "cdate": 1545034885265, "mdate": null, "content": {"title": "Investigation of Physical Phenomena Underlying Temporal-Enhanced Ultrasound as a New Diagnostic Imaging Technique: Theory and Simulations", "abstract": ""}}
{"id": "rJgyL3C4lN", "cdate": 1545034822879, "mdate": null, "content": {"title": "Learning from Noisy Label Statistics: Detecting High Grade Prostate Cancer in Ultrasound Guided Biopsy", "abstract": ""}}
{"id": "S1lCns0NgN", "cdate": 1545034678253, "mdate": null, "content": {"title": "Deep Recurrent Neural Networks for Prostate Cancer Detection: Analysis of Temporal Enhanced Ultrasound", "abstract": ""}}
{"id": "Hklgis0cF7", "cdate": 1538087831571, "mdate": null, "content": {"title": "Radial Basis Feature Transformation to Arm CNNs Against Adversarial Attacks", "abstract": "The linear and non-flexible nature of deep convolutional models makes them vulnerable to carefully crafted adversarial perturbations. To tackle this problem, in this paper, we propose a nonlinear radial basis convolutional feature transformation by learning the Mahalanobis distance function that maps the input convolutional features from the same class into tight clusters. In such a space, the clusters become compact and well-separated, which prevent small adversarial perturbations from forcing a sample to cross the decision boundary. We test the proposed method on three publicly available image classification and segmentation data-sets namely, MNIST, ISBI ISIC skin lesion, and NIH ChestX-ray14. We evaluate the robustness of our method to different gradient (targeted and untargeted) and non-gradient based attacks and compare it to several non-gradient masking defense strategies. Our results demonstrate that the proposed method can boost the performance of deep convolutional neural networks against adversarial perturbations without accuracy drop on clean data."}}
