{"id": "nRl57076S8c", "cdate": 1577836800000, "mdate": null, "content": {"title": "Neural Physicist: Learning Physical Dynamics from Image Sequences", "abstract": "We present a novel architecture named Neural Physicist (NeurPhy) to learn physical dynamics directly from image sequences using deep neural networks. For any physical system, given the global system parameters, the time evolution of states is governed by the underlying physical laws. How to learn meaningful system representations in an end-to-end way and estimate accurate state transition dynamics facilitating long-term prediction have been long-standing challenges. In this paper, by leveraging recent progresses in representation learning and state space models (SSMs), we propose NeurPhy, which uses variational auto-encoder (VAE) to extract underlying Markovian dynamic state at each time step, neural process (NP) to extract the global system parameters, and a non-linear non-recurrent stochastic state space model to learn the physical dynamic transition. We apply NeurPhy to two physical experimental environments, i.e., damped pendulum and planetary orbits motion, and achieve promising results. Our model can not only extract the physically meaningful state representations, but also learn the state transition dynamics enabling long-term predictions for unseen image sequences. Furthermore, from the manifold dimension of the latent state space, we can easily identify the degree of freedom (DoF) of the underlying physical systems."}}
{"id": "fUMFKu-oZqN", "cdate": 1577836800000, "mdate": null, "content": {"title": "A Riemannian Primal-dual Algorithm Based on Proximal Operator and its Application in Metric Learning", "abstract": "In this paper, we consider optimizing a smooth, convex, lower semicontinuous function in Riemannian space with constraints. To solve the problem, we first convert it to a dual problem and then propose a general primal-dual algorithm to optimize the primal and dual variables iteratively. In each optimization iteration, we employ a proximal operator to search optimal solution in the primal space. We prove convergence of the proposed algorithm and show its non-asymptotic convergence rate. By utilizing the proposed primal-dual optimization technique, we propose a novel metric learning algorithm which learns an optimal feature transformation matrix in the Riemannian space of positive definite matrices. Preliminary experimental results on an optimal fund selection problem in fund of funds (FOF) management for quantitative investment showed its efficacy."}}
{"id": "UBta_emNKFe", "cdate": 1577836800000, "mdate": null, "content": {"title": "Riemannian Proximal Policy Optimization", "abstract": "In this paper, We propose a general Riemannian proximal optimization algorithm with guaranteed convergence to solve Markov decision process (MDP) problems. To model policy functions in MDP, we employ Gaussian mixture model (GMM) and formulate it as a nonconvex optimization problem in the Riemannian space of positive semidefinite matrices. For two given policy functions, we also provide its lower bound on policy improvement by using bounds derived from the Wasserstein distance of GMMs. Preliminary experiments show the efficacy of our proposed Riemannian proximal policy optimization algorithm."}}
{"id": "zgysXSR78i2", "cdate": 1546300800000, "mdate": null, "content": {"title": "A Riemannian Primal-dual Algorithm Based on Proximal Operator and its Application in Metric Learning", "abstract": "In this paper, we consider optimizing a smooth, convex, lower semicontinuous function in Riemannian space with constraints. To solve the problem, we first convert it to a dual problem and then propose a general primal-dual algorithm to optimize the primal and dual variables iteratively. In each optimization iteration, we employ a proximal operator to search optimal solution in the primal space. We prove convergence of the proposed algorithm and show its non-asymptotic convergence rate. By utilizing the proposed primal-dual optimization technique, we propose a novel metric learning algorithm which learns an optimal feature transformation matrix in the Riemannian space of positive definite matrices. Preliminary experimental results on an optimal fund selection problem in fund of funds (FOF) management for quantitative investment showed its efficacy."}}
{"id": "xYyzzhSXeC1", "cdate": 1451606400000, "mdate": null, "content": {"title": "Active appearance model and deep learning for more accurate prostate segmentation on MRI", "abstract": "Prostate segmentation on 3D MR images is a challenging task due to image artifacts, large inter-patient prostate shape and texture variability, and lack of a clear prostate boundary specifically at apex and base levels. We propose a supervised machine learning model that combines atlas based Active Appearance Model (AAM) with a Deep Learning model to segment the prostate on MR images. The performance of the segmentation method is evaluated on 20 unseen MR image datasets. The proposed method combining AAM and Deep Learning achieves a mean Dice Similarity Coefficient (DSC) of 0.925 for whole 3D MR images of the prostate using axial cross-sections. The proposed model utilizes the adaptive atlas-based AAM model and Deep Learning to achieve significant segmentation accuracy."}}
{"id": "sIaoPC0sp8N", "cdate": 1420070400000, "mdate": null, "content": {"title": "Efficient Hilbert transform-based alternative to Tofts physiological models for representing MRI dynamic contrast-enhanced images in computer-aided diagnosis of prostate cancer", "abstract": "In computer-aided diagnosis (CAD) systems for prostate cancer, dynamic contrast enhanced (DCE) magnetic resonance imaging is useful for distinguishing cancerous and benign tissue. The Tofts physiological model is a commonly used representation of the DCE image data, but the parameters require extensive computation. Hence, we developed an alternative representation based on the Hilbert transform of the DCE images. The time maximum of the Hilbert transform, a binary metric of early enhancement, and a pre-DCE value was assigned to each voxel and appended to a standard feature set derived from T2-weighted images and apparent diffusion coefficient maps. A cohort of 40 patients was used for training the classifier, and 20 patients were used for testing. The AUC was calculated by pooling the voxel-wise prediction values and comparing with the ground truth. The resulting AUC of 0.92 (95% CI [0.87 0.97]) is not significantly different from an AUC calculated using Tofts physiological models of 0.92 (95% CI [0.87 0.97]), as validated by a Wilcoxon signed rank test on each patient’s AUC (p = 0.19). The time required for calculation and feature extraction is 11.39 seconds (95% CI [10.95 11.82]) per patient using the Hilbert-based feature set, two orders of magnitude faster than the 1319 seconds (95% CI [1233 1404]) required for the Tofts parameter-based feature set (p&lt;0.001). Hence, the features proposed herein appear useful for CAD systems integrated into clinical workflows where efficiency is important."}}
{"id": "b83MlaTWZG-", "cdate": 1420070400000, "mdate": null, "content": {"title": "Computer-aided detection of exophytic renal lesions on non-contrast CT images", "abstract": "Highlights • We developed a novel computer-aided diagnosis system to detect renal lesions on non-contrast CT images. • We designed an efficient belief propagation method to accurately segment kidneys on non-contrast CT images. • Manifold diffusion was developed to accurately and smoothly measure shape changes on the kidney surface. • We detected renal lesions with local maximum diffusion response on the kidney surface graph. • Manifold diffusion achieved 95% sensitivity with 15 false positives per patient on 167 patients. Abstract Renal lesions are important extracolonic findings on computed tomographic colonography (CTC). They are difficult to detect on non-contrast CTC images due to low image contrast with surrounding objects. In this paper, we developed a novel computer-aided diagnosis system to detect a subset of renal lesions, exophytic lesions, by (1) exploiting efficient belief propagation to segment kidneys, (2) establishing an intrinsic manifold diffusion on kidney surface, (3) searching for potential lesion-caused protrusions with local maximum diffusion response, and (4) exploring novel shape descriptors, including multi-scale diffusion response, with machine learning to classify exophytic renal lesions. Experimental results on the validation dataset with 167 patients revealed that manifold diffusion significantly outperformed conventional shape features ( p < 1 e - 3 ) and resulted in 95% sensitivity with 15 false positives per patient for detecting exophytic renal lesions. Fivefold cross-validation also demonstrated that our method could stably detect exophytic renal lesions. These encouraging results demonstrated that manifold diffusion is a key means to enable accurate computer-aided diagnosis of renal lesions."}}
{"id": "KWfILoLuXgs", "cdate": 1420070400000, "mdate": null, "content": {"title": "Optimizing area under the ROC curve using semi-supervised learning", "abstract": "Highlights • Optimizing area under the ROC curve using semi-supervised learning. • A large margin maximization semi-supervised learning framework for AUC maximization. • Closed-form solution based on semi-definite programming. • Superior performance on 34 UCI machine learning datasets determined by power analysis. • Showed efficacy on a CT colonography dataset for colonic polyp classification. Abstract Receiver operating characteristic (ROC) analysis is a standard methodology to evaluate the performance of a binary classification system. The area under the ROC curve (AUC) is a performance metric that summarizes how well a classifier separates two classes. Traditional AUC optimization techniques are supervised learning methods that utilize only labeled data (i.e., the true class is known for all data) to train the classifiers. In this work, inspired by semi-supervised and transductive learning, we propose two new AUC optimization algorithms hereby referred to as semi-supervised learning receiver operating characteristic (SSLROC) algorithms, which utilize unlabeled test samples in classifier training to maximize AUC. Unlabeled samples are incorporated into the AUC optimization process, and their ranking relationships to labeled positive and negative training samples are considered as optimization constraints. The introduced test samples will cause the learned decision boundary in a multi-dimensional feature space to adapt not only to the distribution of labeled training data, but also to the distribution of unlabeled test data. We formulate the semi-supervised AUC optimization problem as a semi-definite programming problem based on the margin maximization theory. The proposed methods SSLROC1 (1-norm) and SSLROC2 (2-norm) were evaluated using 34 (determined by power analysis) randomly selected datasets from the University of California, Irvine machine learning repository. Wilcoxon signed rank tests showed that the proposed methods achieved significant improvement compared with state-of-the-art methods. The proposed methods were also applied to a CT colonography dataset for colonic polyp classification and showed promising results.1"}}
{"id": "G9trQGWbIPD", "cdate": 1420070400000, "mdate": null, "content": {"title": "Sequential Monte Carlo tracking of the marginal artery by multiple cue fusion and random forest regression", "abstract": "Highlights • We formulate vessel detection on contrast-enhanced computed tomography angiogram images as a Bayesian tracking problem. • A new vessel detection method by fusing multiple cues extracted from CT images. • Use of colon atlas and random forest to prune tracking results and reduce false positives. • Our proposed method showed a significant increase in the F1 score when compared to the traditional Hessian vesselness method. Abstract Given the potential importance of marginal artery localization in automated registration in computed tomography colonography (CTC), we have devised a semi-automated method of marginal vessel detection employing sequential Monte Carlo tracking (also known as particle filtering tracking) by multiple cue fusion based on intensity, vesselness, organ detection, and minimum spanning tree information for poorly enhanced vessel segments. We then employed a random forest algorithm for intelligent cue fusion and decision making which achieved high sensitivity and robustness. After applying a vessel pruning procedure to the tracking results, we achieved statistically significantly improved precision compared to a baseline Hessian detection method (2.7% versus 75.2%, p < 0.001). This method also showed statistically significantly improved recall rate compared to a 2-cue baseline method using fewer vessel cues (30.7% versus 67.7%, p < 0.001). These results demonstrate that marginal artery localization on CTC is feasible by combining a discriminative classifier (i.e., random forest) with a sequential Monte Carlo tracking mechanism. In so doing, we present the effective application of an anatomical probability map to vessel pruning as well as a supplementary spatial coordinate system for colonic segmentation and registration when this task has been confounded by colon lumen collapse."}}
{"id": "sx3vomZI2Oi", "cdate": 1388534400000, "mdate": null, "content": {"title": "A New 2.5D Representation for Lymph Node Detection Using Random Sets of Deep Convolutional Neural Network Observations", "abstract": "Automated Lymph Node (LN) detection is an important clinical diagnostic task but very challenging due to the low contrast of surrounding structures in Computed Tomography (CT) and to their varying sizes, poses, shapes and sparsely distributed locations. State-of-the-art studies show the performance range of 52.9% sensitivity at 3.1 false-positives per volume (FP/vol.), or 60.9% at 6.1 FP/vol. for mediastinal LN, by one-shot boosting on 3D HAAR features. In this paper, we first operate a preliminary candidate generation stage, towards ~100% sensitivity at the cost of high FP levels (~40 per patient), to harvest volumes of interest (VOI). Our 2.5D approach consequently decomposes any 3D VOI by resampling 2D reformatted orthogonal views N times, via scale, random translations, and rotations with respect to the VOI centroid coordinates. These random views are then used to train a deep Convolutional Neural Network (CNN) classifier. In testing, the CNN is employed to assign LN probabilities for all N random views that can be simply averaged (as a set) to compute the final classification probability per VOI. We validate the approach on two datasets: 90 CT volumes with 388 mediastinal LNs and 86 patients with 595 abdominal LNs. We achieve sensitivities of 70%/83% at 3 FP/vol. and 84%/90% at 6 FP/vol. in mediastinum and abdomen respectively, which drastically improves over the previous state-of-the-art work."}}
