{"id": "5fwhYVhwY-r", "cdate": 1577836800000, "mdate": null, "content": {"title": "An exploration of the Razumikhin stability theorem with applications in stabilization of delay systems", "abstract": "In this paper, we establish a new evolution property of Lyapunov functions that satisfy the Razumikhin Stability Theorem conditions. The derived property is shown to be a valid alternative criterion to prove the asymptotic stability of a delay system without calculating the derivative of the Lyapunov function, and it is especially useful in solving stabilization problems for time delay systems when the delay is unknown. As an example application of this derived property, we investigate the stabilization of continuous-time linear systems with an unknown time-varying delay, by proposing a switched low gain feedback control technique that utilizes the derived property. Existing literature on stabilization of continuous time delay systems all require some knowledge, such as an upper bound, of the delay. In this work, by proposing a switched low gain feedback control law utilizing the derived property, we are able to achieve asymptotic stabilization of the system without any knowledge of the delay. Furthermore, the proposed switched low gain feedback law also significantly improves the closed-loop system performance in terms of overshoot and convergence speed, in comparison with the traditional fixed gain low gain feedback design. Simulation study verifies the theoretical results."}}
{"id": "u4o8h1PoAs9", "cdate": 1546300800000, "mdate": null, "content": {"title": "Stabilization of Discrete-Time Linear Systems With an Unknown Time-Varying Delay by Switched Low-Gain Feedback", "abstract": "In this note, we investigate the stabilization of discrete-time linear systems with an unknown time-varying delay. Existing literature on the stabilization of time-delay systems require some knowledge, such as an upper bound, of the delay. In this paper, by proposing a switched low-gain feedback control law, we are able to achieve asymptotic stabilization of the system without any knowledge of the delay. In addition, the proposed switched low-gain feedback law also significantly improves the closed-loop system performance in terms of overshoot and convergence speed in comparison with the traditional fixed gain design. Simulation study illustrates the effectiveness of our theoretical results."}}
{"id": "1Z1lnQ3Rg37", "cdate": 1546300800000, "mdate": null, "content": {"title": "Connectivity enhancing coordinated tracking control of multi-agent systems with a state-dependent jointly-connected dynamic interaction topology", "abstract": "We revisit the problem of virtual leader tracking by a group of agents of second order dynamics when only a portion of the agents are informed of the information of the virtual leader, under a state-dependent interaction topology. By proposing a simpler controller structure, we obtain results on coordinated tracking control under a jointly connected topology, both in the presence and in the absence of the virtual leader velocity information. The simplification in control protocols also enables us to arrive at our second contribution on connectivity enhancing coordinated control. In comparison with the existing connectivity preserving control algorithms, our proposed connectivity enhancing mechanism is effective in maintaining both the initially existent topology edges and those newly formed topology edges that were not initially existent. Besides, our proposed algorithms are designed in such a way that the local Lipschitz condition is satisfied and thus technical issues on solution uniqueness of the closed-loop system are avoided. Our proposed technique applies to both consensus tracking and flocking."}}
{"id": "XCgo0bBOwa2", "cdate": 1514764800000, "mdate": null, "content": {"title": "A Multiple Lyapunov Function Approach to Distributed Synchronization Control of Multi-Agent Systems With Switching Directed Communication Topologies and Unknown Nonlinearities", "abstract": "This paper investigates the distributed adaptive control problem for synchronization of multi-agent systems where the dynamics of the agents are nonlinear, nonidentical, unknown and subject to external disturbances. In our recent work, we solved this problem for general higher order systems under two types of communication topologies, represented, respectively, by a fixed strongly connected directed graph and by a switching connected undirected graph. A common Lyapunov function technique is employed to establish the results. In this paper, we solve the problem for a more general communication topology which is represented by a switching strongly-connected directed graph. We construct a sequence of different Lyapunov functions and use them to establish our results. Simulation study verifies the effectiveness of our theoretical results."}}
{"id": "wiUcZeuD9a", "cdate": 1483228800000, "mdate": null, "content": {"title": "Distributed virtual leader tracking of multi-agent systems with second order agent dynamics under a state dependent jointly connected topology", "abstract": "We revisit the problem of virtual leader tracking by a group of agents of second order dynamics when only a portion of the agents are informed of the information of the virtual leader. By proposing a simpler controller structure, we obtain results on coordinated consensus tracking control under a state dependent jointly connected topology. Such a network connectivity condition is weaker than the assumption that the interaction topology is connected all the time, which is an assumption made in most existing literature on this type of problems."}}
{"id": "mjWsSGt6L8w", "cdate": 1451606400000, "mdate": null, "content": {"title": "Distributed Consensus Control of Multi-Agent Systems With Higher Order Agent Dynamics and Dynamically Changing Directed Interaction Topologies", "abstract": "In 2005, Ren and Beard, under the network connectivity assumption that the union of the directed interaction graphs contains a spanning tree frequently enough, proposed a control protocol to solve the distributed consensus control problem for a multi-agent system with first order integrator agent dynamics. The consensus control protocol for second order systems proposed by the same authors, Ren and Beard, requires that the switching directed interaction graph has a spanning tree at every time instant to guarantee consensus. In this technical note, we propose a distributed consensus control protocol which extends the first order system results of Ren and Beard to agents represented by a general higher order controllable linear system, under the same network connectivity assumption that the union of the directed interaction graphs contains a spanning tree frequently enough. We show that the consensus can be achieved asymptotically by the group of agents under our proposed distributed control protocol. Simulation study illustrates the effectiveness of our proposed method."}}
{"id": "-PwbDklzHIL", "cdate": 1451606400000, "mdate": null, "content": {"title": "Distributed Synchronization Control of Multiagent Systems With Unknown Nonlinearities", "abstract": "This paper revisits the distributed adaptive control problem for synchronization of multiagent systems where the dynamics of the agents are nonlinear, nonidentical, unknown, and subject to external disturbances. Two communication topologies, represented, respectively, by a fixed strongly-connected directed graph and by a switching connected undirected graph, are considered. Under both of these communication topologies, we use distributed neural networks to approximate the uncertain dynamics. Decentralized adaptive control protocols are then constructed to solve the cooperative tracker problem, the problem of synchronization of all follower agents to a leader agent. In particular, we show that, under the proposed decentralized control protocols, the synchronization errors are ultimately bounded, and their ultimate bounds can be reduced arbitrarily by choosing the control parameter appropriately. Simulation study verifies the effectiveness of our proposed protocols."}}
{"id": "jxdGtHkvD96", "cdate": 1420070400000, "mdate": null, "content": {"title": "Distributed synchronization control of multi-agent systems with switching directed communication topologies and unknown nonlinearities", "abstract": "This paper studies the distributed adaptive control problem for synchronization of multi-agent systems where the dynamics of the agents are nonlinear, nonidentical, unknown and subject to external disturbances. In our recent work, we solved this problem for general higher order systems under two types of communication topologies, represented, respectively, by a fixed strongly connected directed graph and by a switching connected undirected graph. The common Lyapunov function technique is employed to establish the results. In this paper, we solve the problem for a more general communication topology which is represented by a switching strongly-connected directed graph. We construct a sequence of different Lyapunov functions and use them to establish our results."}}
{"id": "uAo3D8qqnNm", "cdate": 1388534400000, "mdate": null, "content": {"title": "Distributed synchronization control of multi-agent systems with unknown nonlinearities: The case of fixed directed communication topology", "abstract": "This paper revisits the distributed adaptive control problem for synchronization of multi-agent systems where the dynamics of the agents are nonlinear, nonidentical, unknown and subject to external disturbances. The communication topology under consideration is represented by a fixed strongly-connected directed graph. Distributed neural networks are used to approximate the uncertain dynamics and decentralized control protocols using local neighborhood information are proposed to solve the cooperative tracker problem, the problem of synchronization of all follower agents to a leader agent. In particular, we show that, under the proposed decentralized control protocols, the synchronization errors are ultimately bounded and their ultimate bounds can be reduced arbitrarily by choosing the control parameter appropriately."}}
