{"id": "0SD-uuvShZx", "cdate": 1664833377885, "mdate": null, "content": {"title": "Behavioral Classification of Sequential Neural Activity Using Time Varying Recurrent Neural Networks", "abstract": "Shifts in data distribution across time can strongly affect early classification of time-series data. When decoding behavior from neural activity, early detection of behavior may help in devising corrective neural stimulation before the onset of behavior. Recurrent Neural Networks (RNNs) are common models to model sequence data. However, standard RNNs are not able to handle data with temporal distribution shifts to guarantee robust classification across time. To enable the network to utilize all temporal features of the neural input data, and to enhance the memory of an RNN, we propose a novel approach: RNNs with time-varying weights, here termed Time-Varying RNNs (TV-RNNs). These models are able to not only predict the class of the time-sequence correctly but also lead to accurate classification earlier in the sequence than standard RNNs. In this work, we focus on early robust sequential classification of brain-wide neural activity across time using TV-RNNs as subjects perform a motor task."}}
{"id": "pn5aREXSPr", "cdate": 1640995200000, "mdate": 1682530584049, "content": {"title": "Recurrent neural networks controlling musculoskeletal models predict motor cortex activity during novel limb movements", "abstract": "Goal-driven networks trained to perform a task analogous to that performed by biological neural populations are being increasingly utilized as insightful computational models of motor control. The resulting dynamics of the trained networks are then analyzed to uncover the neural strategies employed by the motor cortex to produce movements. However, these networks do not take into account the role of sensory feedback in producing movement, nor do they consider the complex biophysical underpinnings of the underlying musculoskeletal system. Moreover, these models can not be used in context of predictive neuromechanical simulations for hypothesis generation and prediction of neural strategies during novel movements. In this research, we adapt state-of-the-art deep reinforcement learning (DRL) algorithms to train a controller to drive a developed anatomically accurate monkey arm model to track experimentally recorded kinematics. We validate that the trained controller mimics biologically observed neural strategies to produce movement. The trained controller generalizes well to unobserved conditions as well as to perturbation analyses. The recorded firing rates of motor cortex neurons can be predicted from the controller activity with high accuracy even on unseen conditions. Finally, we validate that the trained controller outperforms existing goal-driven and representational models of motor cortex in single neuron decoding accuracy, thus showing the utility of the complex underpinnings of anatomically accurate models in shaping motor cortex neural activity during limb movements. The learned controller can be used for hypothesis generation and prediction of neural strategies during novel movements and unobserved conditions."}}
{"id": "J2d7sj4vXD", "cdate": 1640995200000, "mdate": 1682530592757, "content": {"title": "Modeling the behavior of multiple subjects using a Cauchy-Schwarz regularized Partitioned Subspace Variational AutoEncoder (CS-PS-VAE)", "abstract": "Effectively modeling and quantifying behavior is essential for our understanding of the brain. Modeling behavior across different subjects in a unified manner remains a significant challenge in the field of behavioral quantification, which necessitates partitioning the behavioral data into features that are common across subjects, and others that are distinct to each subject. We build on a semi-supervised approach to partition the subspace adequately known as a Partitioned Subspace Variational AutoEncoder (PS-VAE), and propose a novel regularization based on the Cauchy-Schwarz divergence to model the distinct features across subjects. Our model, called the Cauchy-Schwarz regularized Partitioned Subspace Variational AutoEncoder (CS-PS-VAE), successfully models continuously varying differences in behavior, and models distinct features of the behavioral videos across subjects in an unsupervised manner. This method is also successful at uncovering the relationships between recorded neural data and the ensuing behavior."}}
{"id": "FbH9C0oYKD", "cdate": 1640995200000, "mdate": 1682530597722, "content": {"title": "Recurrent neural networks controlling musculoskeletal models predict motor cortex activity during novel limb movements", "abstract": "Goal-driven networks trained to perform a task analogous to that performed by biological neural populations are being increasingly utilized as insightful computational models of motor control. The resulting dynamics of the trained networks are then analyzed to uncover the neural strategies employed by the motor cortex to produce movements. However, these networks do not take into account the role of sensory feedback in producing movement, nor do they consider the complex biophysical underpinnings of the underlying musculoskeletal system. Moreover, these models can not be used in context of predictive neuromechanical simulations for hypothesis generation and prediction of neural strategies during novel movements. In this research, we adapt state-of-the-art deep reinforcement learning (DRL) algorithms to train a controller to drive a developed anatomically accurate monkey arm model to track experimentally recorded kinematics. We validate that the trained controller mimics biologically observed neural strategies to produce movement. The trained controller generalizes well to unobserved conditions as well as to perturbation analyses. The recorded firing rates of motor cortex neurons can be predicted from the controller activity with high accuracy even on unseen conditions. Finally, we validate that the trained controller outperforms existing goal-driven and representational models of motor cortex in single neuron decoding accuracy, thus showing the utility of the complex underpinnings of anatomically accurate models in shaping motor cortex neural activity during limb movements. The learned controller can be used for hypothesis generation and prediction of neural strategies during novel movements and unobserved conditions."}}
{"id": "8iR2Q112EG1", "cdate": 1640995200000, "mdate": 1682530584024, "content": {"title": "Modeling the behavior of multiple subjects using a Cauchy-Schwarz regularized Partitioned Subspace Variational AutoEncoder (CS-PS-VAE)", "abstract": "Effectively modeling and quantifying behavior is essential for our understanding of the brain. Modeling behavior across different subjects in a unified manner remains a significant challenge in the field of behavioral quantification, which necessitates partitioning the behavioral data into features that are common across subjects, and others that are distinct to each subject. We build on a semi-supervised approach to partition the subspace adequately known as a Partitioned Subspace Variational AutoEncoder (PS-VAE), and propose a novel regularization based on the Cauchy-Schwarz divergence to model the distinct features across subjects. Our model, called the Cauchy-Schwarz regularized Partitioned Subspace Variational AutoEncoder (CS-PS-VAE), successfully models continuously varying differences in behavior, and models distinct features of the behavioral videos across subjects in an unsupervised manner. This method is also successful at uncovering the relationships between recorded neural data and the ensuing behavior."}}
{"id": "w5qNxZwI6T", "cdate": 1609459200000, "mdate": 1682530584169, "content": {"title": "Uncovering the effect of different brain regions on behavioral classification using recurrent neural networks", "abstract": "As our ability to record neural activity from a larger number of brain areas increases, we need to develop tools to understand how this activity is related to ongoing behavior. Recurrent neural networks (RNNs) have been shown to perform successful classification for sequence data. However, they are black box models: once trained, it is difficult to uncover the mechanisms that they are using to classify. In this study, we analyze the effect of RNNs on classifying behavior using a simulated dataset and a widefield neural activity dataset as mice perform a self-initiated behavior. We show that RNNs are comparable to, or outperform, traditional classification methods such as Support Vector Machine (SVM), and can also lead to accurate prediction of behavior. Using dimensionality reduction, we visualize the activity of the RNNs to better understand the classification mechanisms of the RNNs. Finally, we are able to accurately pinpoint the effect of different regions on behavioral classification. This study highlights the utility and interpretability of RNNs while classifying behavior using neural activity from different regions."}}
{"id": "UF1aYSMZjg", "cdate": 1577836800000, "mdate": 1682530584051, "content": {"title": "Performance Limitations in Sensorimotor Control: Trade-Offs Between Neural Computation and Accuracy in Tracking Fast Movements", "abstract": "The ability to move fast and accurately track moving objects is fundamentally constrained by the biophysics of neurons and dynamics of the muscles involved. Yet the corresponding trade-offs between these factors and tracking motor commands have not been rigorously quantified. We use feedback control principles to quantify performance limitations of the sensorimotor control system (SCS) to track fast periodic movements. We show that (1) linear models of the SCS fail to predict known undesirable phenomena, including skipped cycles, overshoot and undershoot, produced when tracking signals in the “fast regime,” while nonlinear pulsatile control models can predict such undesirable phenomena, and (2) tools from nonlinear control theory allow us to characterize fundamental limitations in this fast regime. Using a validated and tractable nonlinear model of the SCS, we derive an analytical upper bound on frequencies that the SCS model can reliably track before producing such undesirable phenomena as a function of the neurons' biophysical constraints and muscle dynamics. The performance limitations derived here have important implications in sensorimotor control. For example, if the primary motor cortex is compromised due to disease or damage, the theory suggests ways to manipulate muscle dynamics by adding the necessary compensatory forces using an assistive neuroprosthetic device to restore motor performance and, more important, fast and agile movements. Just how one should compensate can be informed by our SCS model and the theory developed here."}}
{"id": "K0GQFRzdv_", "cdate": 1577836800000, "mdate": 1682530583949, "content": {"title": "Localized semi-nonnegative matrix factorization (LocaNMF) of widefield calcium imaging data", "abstract": "Author summary While recording from multiple regions of the brain, how does one best incorporate prior information about anatomical regions while accurately representing the data? Here, we introduce Localized semi-NMF (LocaNMF), an algorithm that efficiently decomposes widefield video data into meaningful spatial and temporal components that can be decoded and compared across different behavioral sessions and experimental conditions. Mapping the inferred components onto well-defined brain regions using a widely-used brain atlas provides an interpretable, stable decomposition. LocaNMF allows us to satisfactorily extract the activity of the different brain regions in individual mice in a data-driven manner, while taking into account mouse-specific and preparation-specific differences."}}
{"id": "YiQsXV6wi9h", "cdate": 1546300800000, "mdate": null, "content": {"title": "BehaveNet: nonlinear embedding and Bayesian neural decoding of behavioral videos", "abstract": "A fundamental goal of systems neuroscience is to understand the relationship between neural activity and behavior. Behavior has traditionally been characterized by low-dimensional, task-related variables such as movement speed or response times. More recently, there has been a growing interest in automated analysis of high-dimensional video data collected during experiments. Here we introduce a probabilistic framework for the analysis of behavioral video and neural activity. This framework provides tools for compression, segmentation, generation, and decoding of behavioral videos. Compression is performed using a convolutional autoencoder (CAE), which yields a low-dimensional continuous representation of behavior. We then use an autoregressive hidden Markov model (ARHMM) to segment the CAE representation into discrete \"behavioral syllables.\" The resulting generative model can be used to simulate behavioral video data. Finally, based on this generative model, we develop a novel Bayesian decoding approach that takes in neural activity and outputs probabilistic estimates of the full-resolution behavioral video. We demonstrate this framework on two different experimental paradigms using distinct behavioral and neural recording technologies."}}
{"id": "SJMO2iCct7", "cdate": 1538087855906, "mdate": null, "content": {"title": "A NOVEL VARIATIONAL FAMILY FOR HIDDEN NON-LINEAR MARKOV MODELS", "abstract": "Latent variable models have been widely applied for the analysis and visualization of large datasets. In the case of sequential data, closed-form inference is possible when the transition and observation functions are linear. However, approximate inference techniques are usually necessary when dealing with nonlinear evolution and observations. Here, we propose a novel variational inference framework for the explicit modeling of time series, Variational Inference for Nonlinear Dynamics (VIND), that is able to uncover nonlinear observation and latent dynamics from sequential data. The framework includes a structured approximate posterior, and an algorithm that relies on the fixed-point iteration method to find the best estimate for latent trajectories. We apply the method to several datasets and show that it is able to accurately infer the underlying dynamics of these systems, in some cases substantially outperforming state-of-the-art methods."}}
