{"id": "EsbUEARx3n_", "cdate": 1620666706329, "mdate": null, "content": {"title": "Optimal Advertising for Information Products", "abstract": "When selling information products, the seller can provide some free partial information to change people's valuations so that the overall revenue can possibly be increased. We study the general problem of advertising information products by revealing partial information. We consider buyers who are decision-makers. The outcomes of the decision problems depend on the state of the world that is unknown to the buyers. The buyers can make their own observations and thus can hold different personal beliefs about the state of the world. There is an information seller who has access to the state of the world. The seller can promote the information by revealing some partial information. We assume that the seller chooses a long-term advertising strategy and then commits to it. The seller's goal is to maximize the expected revenue. We study the problem in two settings. (1) The seller targets buyers of a certain type. In this case, we prove that finding the optimal advertising strategy is equivalent to finding the concave closure of a simple function. The function is a product of two quantities, the likelihood ratio and the cost of uncertainty. Based on this observation, we prove some properties of the optimal mechanism, which allow us to solve for the optimal mechanism by a finite-size convex program. The convex program will have a polynomial-size if the state of the world has a constant number of possible realizations or the buyers face a decision problem with a constant number of options. For the general problem, we prove that it is NP-hard to find the optimal mechanism. (2) When the seller faces buyers of different types and only knows the distribution of their types, we provide an approximation algorithm when it is not too hard to predict the possible type of buyers who will make the purchase. For the general problem, we prove that it is NP-hard to find a constant-factor approximation."}}
{"id": "Y6V1sVsaFUD", "cdate": 1620666648737, "mdate": null, "content": {"title": "Selling Information Through Consulting", "abstract": "We consider a monopoly information holder selling information to a budget-constrained decision\nmaker, who may benefit from the seller’s information. The decision maker has a utility function that\ndepends on his action and an uncertain state of the world. The seller and the buyer each observe a private\nsignal regarding the state of the world, which may be correlated with each other. The seller’s goal is to\nsell her private information to the buyer and extract maximum possible revenue, subject to the buyer’s\nbudget constraints. We consider three different settings with increasing generality, i.e., the seller’s signal\nand the buyer’s signal can be independent, correlated, or follow a general distribution accessed through\na black-box sampling oracle. For each setting, we design information selling mechanisms which are both\noptimal and simple in the sense that they can be naturally interpreted, have succinct representations,\nand can be efficiently computed. Notably, though the optimal mechanism exhibits slightly increasing\ncomplexity as the setting becomes more general, all our mechanisms share the same format of acting\nas a consultant who recommends the best action to the buyer but uses different and carefully designed\npayment rules for different settings. Each of our optimal mechanisms can be easily computed by solving\na single polynomial-size linear program. This significantly simplifies exponential-size LPs solved by the\nEllipsoid method in the previous work, which computes the optimal mechanisms in the same setting\nbut without budget limit. Such simplification is enabled by our new characterizations of the optimal\nmechanism in the (more realistic) budget-constrained setting."}}
{"id": "X0wjuQmREhu", "cdate": 1620666468674, "mdate": null, "content": {"title": "Prior-free Data Acquisition for Accurate Statistical Estimation", "abstract": "We study a data analyst’s problem of acquiring data from self-interested individuals to\nobtain an accurate estimation of some statistic of a population, subject to an expected budget\nconstraint. Each data holder incurs a cost, which is unknown to the data analyst, to acquire\nand report his data. The cost can be arbitrarily correlated with the data. The data analyst\nhas an expected budget that she can use to incentivize individuals to provide their data. The\ngoal is to design a joint acquisition-estimation mechanism to optimize the performance of the\nproduced estimator, without any prior information on the underlying distribution of cost and\ndata. We investigate two types of estimations: unbiased point estimation and confidence interval\nestimation.\nUnbiased estimators: We design a truthful, individually rational, online mechanism to acquire data from individuals and output an unbiased estimator of the population mean\nwhen the data analyst has no prior information on the cost-data distribution and individuals arrive in a random order. The performance of this mechanism matches that of the\noptimal mechanism, which knows the true cost distribution, within a constant factor. The\nperformance of an estimator is evaluated by its variance under the worst-case cost-data\ncorrelation.\nConfidence intervals: We characterize an approximately optimal (within a factor 2) mechanism for obtaining a confidence interval of the population mean when the data analyst\nknows the true cost distribution at the beginning. This mechanism is efficiently computable. We then design a truthful, individually rational, online algorithm that is only\nworse than the approximately optimal mechanism by a constant factor. The performance\nof an estimator is evaluated by its expected length under the worst-case cost-data correlation."}}
{"id": "KY2AD1eKi5", "cdate": 1620666401904, "mdate": null, "content": {"title": "Active Information Acquisition for Linear Optimization", "abstract": "We consider partially-specified optimization\nproblems where the goal is to actively, but\nefficiently, acquire missing information about\nthe problem in order to solve it. An algorithm designer wishes to solve a linear program (LP), max c\nT x s.t. Ax ≤ b, x ≥ 0,\nbut does not initially know some of the parameters. The algorithm can iteratively choose\nan unknown parameter and gather information\nin the form of a noisy sample centered at the\nparameter’s (unknown) value. The goal is to\nfind an approximately feasible and optimal solution to the underlying LP with high probability while drawing a small number of samples. We focus on two cases. (1) When the\nparameters b of the constraints are initially unknown, we propose an efficient algorithm combining techniques from the ellipsoid method\nfor LP and confidence-bound approaches from\nbandit algorithms. The algorithm adaptively\ngathers information about constraints only as\nneeded in order to make progress. We give\nsample complexity bounds for the algorithm\nand demonstrate its improvement over a naive\napproach via simulation. (2) When the parameters c of the objective are initially unknown,\nwe take an information-theoretic approach and\ngive roughly matching upper and lower sample complexity bounds, with an (inefficient)\nsuccessive-elimination algorithm."}}
{"id": "FoqZGVSwvtY", "cdate": 1620666256423, "mdate": null, "content": {"title": "Truthful Data Acquisition via Peer Prediction", "abstract": "We consider the problem of purchasing data for machine learning or statistical\nestimation. The data analyst has a budget to purchase datasets from multiple data\nproviders. She does not have any test data that can be used to evaluate the collected data and can assign payments to data providers solely based on the collected\ndatasets. We consider the problem in the standard Bayesian paradigm and in two\nsettings: (1) data are only collected once; (2) data are collected repeatedly and\neach day’s data are drawn independently from the same distribution. For both settings, our mechanisms guarantee that truthfully reporting one’s dataset is always\nan equilibrium by adopting techniques from peer prediction: pay each provider the\nmutual information between his reported data and other providers’ reported data.\nDepending on the data distribution, the mechanisms can also discourage misreports that would lead to inaccurate predictions. Our mechanisms also guarantee\nindividual rationality and budget feasibility for certain underlying distributions in\nthe first setting and for all distributions in the second setting."}}
