{"id": "AyGJDpN2eR6", "cdate": 1652737741823, "mdate": null, "content": {"title": "Exponentially Improving the Complexity of Simulating the Weisfeiler-Lehman Test with Graph Neural Networks", "abstract": "Recent work shows that the expressive power of Graph Neural Networks (GNNs) in distinguishing non-isomorphic graphs is exactly the same as that of the Weisfeiler-Lehman (WL) graph test. In particular, they show that the WL test can be simulated by GNNs. However, those simulations involve neural networks for the “combine” function of size polynomial or even exponential in the number of graph nodes $n$, as well as feature vectors of length linear in $n$. \n\nWe present an improved simulation of the WL test on GNNs with {\\em exponentially} lower complexity. In particular,  the neural network implementing the  combine function  in each node has only $\\mathrm{polylog}(n)$ parameters, and the feature vectors exchanged by the nodes of GNN consists of only $O(\\log n)$ bits. We also give logarithmic lower bounds for the feature vector length and the size of the neural networks, showing the (near)-optimality of our construction. "}}
{"id": "9lQmaKMxIUD", "cdate": 1652737595021, "mdate": null, "content": {"title": "Near-Optimal Private and Scalable $k$-Clustering", "abstract": "  We study the differentially private (DP) $k$-means and $k$-median clustering problems of $n$ points in $d$-dimensional Euclidean space in the massively parallel computation (MPC) model. We provide two near-optimal algorithms where the near-optimality is in three aspects: they both achieve (1). $O(1)$ parallel computation rounds, (2). near-linear in $n$ and polynomial in $k$ total computational work (i.e., near-linear running time when $n$ is a sufficient polynomial in $k$), (3). $O(1)$ relative approximation and $\\text{poly}(k, d)$ additive error. Note that $\\Omega(1)$ relative approximation is provably necessary even for any polynomial-time non-private algorithm, and $\\Omega(k)$ additive error is a provable lower bound for any polynomial-time DP $k$-means/median algorithm. Our two algorithms provide a tradeoff between the relative approximation and the additive error: the first has $O(1)$ relative approximation and $\\sim (k^{2.5} + k^{1.01} \\sqrt{d})$ additive error, and the second one achieves $(1+\\gamma)$ relative approximation to the optimal non-private algorithm for an arbitrary small constant $\\gamma>0$ and with $\\text{poly}(k, d)$ additive error for a larger polynomial dependence on $k$ and $d$.\n  \n  To achieve our result, we develop a general framework which partitions the data and reduces the DP clustering problem for the entire dataset to the DP clustering problem for each part. To control the blow-up of the additive error introduced by each part, we develop a novel charging argument which might be of independent interest."}}
{"id": "uVFGObm34A", "cdate": 1640995200000, "mdate": 1673155162071, "content": {"title": "Estimating the Effective Support Size in Constant Query Complexity", "abstract": ""}}
{"id": "desueYc2GbA", "cdate": 1640995200000, "mdate": 1673155161659, "content": {"title": "Improved approximations for Euclidean k-means and k-median, via nested quasi-independent sets", "abstract": ""}}
{"id": "bmTsc2vKtR", "cdate": 1640995200000, "mdate": 1673155162017, "content": {"title": "Triangle and Four Cycle Counting with Predictions in Graph Streams", "abstract": ""}}
{"id": "_zKGS_-7Dk", "cdate": 1640995200000, "mdate": 1673155161519, "content": {"title": "Private High-Dimensional Hypothesis Testing", "abstract": ""}}
{"id": "_b0bjRa20P", "cdate": 1640995200000, "mdate": 1673155162060, "content": {"title": "Almost Tight Approximation Algorithms for Explainable Clustering", "abstract": ""}}
{"id": "PaMkBLsiC_W", "cdate": 1640995200000, "mdate": 1673155162022, "content": {"title": "Bias Reduction for Sum Estimation", "abstract": ""}}
{"id": "PCQMjMg5Haj", "cdate": 1640995200000, "mdate": 1673155161717, "content": {"title": "Tight and Robust Private Mean Estimation with Few Users", "abstract": ""}}
{"id": "8HSxfLRFmUj", "cdate": 1640995200000, "mdate": 1673155162020, "content": {"title": "Robustness Implies Privacy in Statistical Estimation", "abstract": ""}}
