{"id": "SXBC7rfPUBx", "cdate": 1664294261029, "mdate": null, "content": {"title": "Redundancy and dependency in brain activities", "abstract": "How many signals in the brain activities can be erased before the encoded information is lost? Surprisingly, we found that both reconstruction and classification of voxel activities can still achieve relatively good performance even after losing 80%-90% of the signals. This leads to questions regarding how the brain performs encoding in such a robust manner. This paper investigates the redundancy and dependency of brain signals using two deep learning models with minimal inductive bias (linear layers). Furthermore, we explored the alignment between the brain and semantic representations, how redundancy differs for different stimuli and regions, as well as the dependency between brain voxels and regions."}}
{"id": "rmU3K_ekONM", "cdate": 1663850205913, "mdate": null, "content": {"title": "SplitMixer: Fat Trimmed From MLP-like Models", "abstract": "We present SplitMixer, a simple and lightweight isotropic MLP-like architecture, for visual recognition. It contains two types of interleaving convolutional operations to mix information across spatial locations (spatial mixing) and channels (channel mixing).\nThe first one includes sequentially applying two depthwise 1D kernels, instead of a 2D kernel, to mix spatial information. The second one is splitting the channels into overlapping or non-overlapping segments, with or without shared parameters, and applying our proposed channel mixing approaches or 3D convolution to mix channel information. Depending on design choices, a number of SplitMixer variants can be constructed to balance accuracy, the number of parameters, and speed. We show, both theoretically and experimentally, that SplitMixer performs on par with the state-of-the-art MLP-like models while having a significantly lower number of parameters and FLOPS. For example, without strong data augmentation and optimization, SplitMixer achieves around 94\\% accuracy on CIFAR-10 with only 0.28M parameters, while ConvMixer achieves the same accuracy with about 0.6M parameters. The well-known MLP-Mixer achieves 85.45\\% with 17.1M parameters. On CIFAR-100 dataset, SplitMixer achieves around 73\\% accuracy, on par with ConvMixer, but with about 52\\% fewer parameters and FLOPS. We hope that our results spark further research towards finding more efficient vision architectures and facilitate the development of MLP-like models. Code is available at [Masked]."}}
{"id": "pHdiaqgh_nf", "cdate": 1652737666606, "mdate": null, "content": {"title": "Mind Reader: Reconstructing complex images from brain activities", "abstract": "Understanding how the brain encodes external stimuli and how these stimuli can be decoded from the measured brain activities are long-standing and challenging questions in neuroscience. In this paper, we focus on reconstructing the complex image stimuli from fMRI (functional magnetic resonance imaging) signals. Unlike previous works that reconstruct images with single objects or simple shapes, our work aims to reconstruct image stimuli that are rich in semantics, closer to everyday scenes, and can reveal more perspectives. However, data scarcity of fMRI datasets is the main obstacle to applying state-of-the-art deep learning models to this problem. We find that incorporating an additional text modality is beneficial for the reconstruction problem compared to directly translating brain signals to images. Therefore, the modalities involved in our method are: (i) voxel-level fMRI signals, (ii) observed images that trigger the brain signals, and (iii) textual description of the images. To further address data scarcity, we leverage an aligned vision-language latent space pre-trained on massive datasets. Instead of training models from scratch to find a latent space shared by the three modalities, we encode fMRI signals into this pre-aligned latent space. Then, conditioned on embeddings in this space, we reconstruct images with a generative model. The reconstructed images from our pipeline balance both naturalness and fidelity: they are photo-realistic and capture the ground truth image contents well."}}
{"id": "IEsx-jwFk3g", "cdate": 1632875604747, "mdate": null, "content": {"title": "Deep Representations for Time-varying Brain Datasets", "abstract": "Finding an appropriate representation of dynamic activities in the brain is crucial for many downstream applications. Due to its highly dynamic nature, temporally averaged fMRI (functional magnetic resonance imaging) cannot capture the whole picture of underlying brain activities, and previous works lack the ability to learn and interpret the latent dynamics in brain architectures. In this paper, we build an efficient graph neural network model that incorporates both region-mapped fMRI sequences and structural connectivities obtained from DWI (diffusion-weighted imaging) as inputs. Through novel sample-level adaptive adjacency matrix learning and multi-resolution inner cluster smoothing, we find good representations of the latent brain dynamics. We also attribute inputs with integrated gradients, which enables us to infer (1) highly involved brain connections and subnetworks for each task (2) keyframes of imaging sequences along the temporal axis, and (3) subnetworks that discriminate between individual subjects. This ability to identify critical subnetworks that characterize brain states across heterogeneous tasks and individuals is of great importance to neuroscience research. Extensive experiments and ablation studies demonstrate our proposed method's superiority and efficiency in spatial-temporal graph signal modeling with insightful interpretations of brain dynamics."}}
{"id": "H1ebhnEYDH", "cdate": 1569438888850, "mdate": null, "content": {"title": "White Noise Analysis of Neural Networks", "abstract": "A white noise analysis of modern deep neural networks is presented to unveil\ntheir biases at the whole network level or the single neuron level. Our analysis is\nbased on two popular and related methods in psychophysics and neurophysiology\nnamely classification images and spike triggered analysis. These methods have\nbeen widely used to understand the underlying mechanisms of sensory systems\nin humans and monkeys. We leverage them to investigate the inherent biases of\ndeep neural networks and to obtain a first-order approximation of their functionality.\nWe emphasize on CNNs since they are currently the state of the art methods\nin computer vision and are a decent model of human visual processing. In\naddition, we study multi-layer perceptrons, logistic regression, and recurrent neural\nnetworks. Experiments over four classic datasets, MNIST, Fashion-MNIST,\nCIFAR-10, and ImageNet, show that the computed bias maps resemble the target\nclasses and when used for classification lead to an over two-fold performance than\nthe chance level. Further, we show that classification images can be used to attack\na black-box classifier and to detect adversarial patch attacks. Finally, we utilize\nspike triggered averaging to derive the filters of CNNs and explore how the behavior\nof a network changes when neurons in different layers are modulated. Our\neffort illustrates a successful example of borrowing from neurosciences to study\nANNs and highlights the importance of cross-fertilization and synergy across machine\nlearning, deep learning, and computational neuroscience."}}
