{"id": "WfOswZq-s9X", "cdate": 1640995200000, "mdate": 1682513034172, "content": {"title": "RedHOT: A Corpus of Annotated Medical Questions, Experiences, and Claims on Social Media", "abstract": "We present Reddit Health Online Talk (RedHOT), a corpus of 22,000 richly annotated social media posts from Reddit spanning 24 health conditions. Annotations include demarcations of spans corresponding to medical claims, personal experiences, and questions. We collect additional granular annotations on identified claims. Specifically, we mark snippets that describe patient Populations, Interventions, and Outcomes (PIO elements) within these. Using this corpus, we introduce the task of retrieving trustworthy evidence relevant to a given claim made on social media. We propose a new method to automatically derive (noisy) supervision for this task which we use to train a dense retrieval model; this outperforms baseline models. Manual evaluation of retrieval results performed by medical doctors indicate that while our system performance is promising, there is considerable room for improvement. Collected annotations (and scripts to assemble the dataset), are available at https://github.com/sominw/redhot."}}
{"id": "RdGvNAI_uPy", "cdate": 1640995200000, "mdate": 1663655806532, "content": {"title": "UserNLP'22: 2022 International Workshop on User-centered Natural Language Processing", "abstract": "We report goals, paper submissions, keynotes, and organizations of this UserNLP workshop. User-centered NLP can fill these gaps by explicitly considering stylistic variations across individuals or groups of individuals and focusing on user-level modeling tasks. While traditional NLP tasks tend to focus on single documents (e.g., sentiment analysis), user-centered NLP aims to make inferences for individual users, on the basis of one or more documents associated with that user. This workshop aims to create a platform where researchers can present rising challenges in building user-centered NLP models and discuss shared issues across multidisciplinary fields. We have received 11 submissions and accepted 6 of the submissions, which were reviewed by our 19 program committee members. The program invited four keynote talks from both academia and industry. We appreciate the valuable contributions from the organizing committee, program committee, keynote speakers, and the manuscript authors."}}
{"id": "laQToWJyy-", "cdate": 1609459200000, "mdate": 1682513034176, "content": {"title": "Early Detection of Online Hate Speech Spreaders with Learned User Representations", "abstract": ""}}
{"id": "gVm7QMW-6E", "cdate": 1609459200000, "mdate": 1682513034221, "content": {"title": "Demographic Representation and Collective Storytelling in the Me Too Twitter Hashtag Activism Movement", "abstract": "The #MeToo movement on Twitter has drawn attention to the pervasive nature of sexual harassment and violence. While #MeToo has been praised for providing support for self-disclosures of harassment or violence and shifting societal response, it has also been criticized for exemplifying how women of color have been discounted for their historical contributions to and excluded from feminist movements. Through an analysis of over 600,000 tweets from over 256,000 unique users, we examine online #MeToo conversations across gender and racial/ethnic identities and the topics that each demographic emphasized. We found that tweets authored by white women were overrepresented in the movement compared to other demographics, aligning with criticism of unequal representation. We found that intersected identities contributed differing narratives to frame the movement, co-opted the movement to raise visibility in parallel ongoing movements, employed the same hashtags both critically and supportively, and revived and created new hashtags in response to pivotal moments. Notably, tweets authored by black women often expressed emotional support and were critical about differential treatment in the justice system and by police. In comparison, tweets authored by white women and men often highlighted sexual harassment and violence by public figures and weaved in more general political discussions. We discuss the implications of this work for digital activism research and design, including suggestions to raise visibility by those who were under-represented in this hashtag activism movement. Content warning: this article discusses issues of sexual harassment and violence."}}
{"id": "3fX3283etu", "cdate": 1609459200000, "mdate": 1682513034175, "content": {"title": "On the Impact of Random Seeds on the Fairness of Clinical Classifiers", "abstract": "Recent work has shown that fine-tuning large networks is surprisingly sensitive to changes in random seed(s). We explore the implications of this phenomenon for model fairness across demographic groups in clinical prediction tasks over electronic health records (EHR) in MIMIC-III -- the standard dataset in clinical NLP research. Apparent subgroup performance varies substantially for seeds that yield similar overall performance, although there is no evidence of a trade-off between overall and subgroup performance. However, we also find that the small sample sizes inherent to looking at intersections of minority groups and somewhat rare conditions limit our ability to accurately estimate disparities. Further, we find that jointly optimizing for high overall performance and low disparities does not yield statistically significant improvements. Our results suggest that fairness work using MIMIC-III should carefully account for variations in apparent differences that may arise from stochasticity and small sample sizes."}}
{"id": "33g42yzglb4", "cdate": 1609459200000, "mdate": 1682513034176, "content": {"title": "On the Impact of Random Seeds on the Fairness of Clinical Classifiers", "abstract": "Silvio Amir, Jan-Willem van de Meent, Byron Wallace. Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. 2021."}}
{"id": "OfcL7wEN0g0", "cdate": 1577836800000, "mdate": 1636407032802, "content": {"title": "Demographic Representation and Collective Storytelling in the Me Too Twitter Hashtag Activism Movement", "abstract": "The #MeToo movement on Twitter has drawn attention to the pervasive nature of sexual harassment and violence. While #MeToo has been praised for providing support for self-disclosures of harassment or violence and shifting societal response, it has also been criticized for exemplifying how women of color have been discounted for their historical contributions to and excluded from feminist movements. Through an analysis of over 600,000 tweets from over 256,000 unique users, we examine online #MeToo conversations across gender and racial/ethnic identities and the topics that each demographic emphasized. We found that tweets authored by white women were overrepresented in the movement compared to other demographics, aligning with criticism of unequal representation. We found that intersected identities contributed differing narratives to frame the movement, co-opted the movement to raise visibility in parallel ongoing movements, employed the same hashtags both critically and supportively, and revived and created new hashtags in response to pivotal moments. Notably, tweets authored by black women often expressed emotional support and were critical about differential treatment in the justice system and by police. In comparison, tweets authored by white women and men often highlighted sexual harassment and violence by public figures and weaved in more general political discussions. We discuss the implications of work for digital activism research and design including suggestions to raise visibility by those who were under-represented in this hashtag activism movement. Content warning: this article discusses issues of sexual harassment and violence."}}
{"id": "L3TK-PLJqWV", "cdate": 1577836800000, "mdate": null, "content": {"title": "Aligning Public Feedback to Requests for Comments on Regulations.gov", "abstract": "In an effort to democratize the regulatory process, the United States Federal government created regulations.gov, a portal through which federal agencies can share proposed regulations and solicit feedback from the public. A proposed regulation will contain several requests for feedback on specific topics, and the public can then submit comments in response. While this reduces barriers to soliciting feedback, it still leaves regulators with a challenge: how to produce a summary and incorporate feedback from the sometimes tens of thousands of submitted comments. We propose an information retrieval system by which comments are aligned to specific regulatory requests. We evaluate several measures of semantic similarity for matching comments to information requests. We evaluate our proposed system over a dataset containing several regulations proposed for electronic cigarettes, an issue that energized tens of thousands of comments in response1."}}
{"id": "FE1jF2CTnb", "cdate": 1577836800000, "mdate": 1637231987385, "content": {"title": "Situational Irony in Farcical News Headlines", "abstract": "Current approaches to the computational modelling of irony mostly address verbal irony and sarcasm, neglecting other productive types of irony, namely situational irony. The function of situational irony is to lay emphasis on (real or fictional) events that evoke peculiar and unexpected images, which usually create a comical effect on the audience. In this paper, we investigate the linguistic and rhetorical devices underlying this phenomenon in a corpus composed of farcical news headlines, aiming at its automatic recognition. Based on a thorough annotation study, we found that in news headlines unexpectedness is mainly achieved by combining terms from different conceptual domains (what we have called out-of-domain contrast). We then explored features for automatically identifying these semantic and pragmatic incongruities and evaluated their discriminating power in a corpus whose irony is expressed by means of out-of-domain contrast. The features explored in our experiments are globally effective in capturing this phenomenon, attaining a six percent improvement in terms of the F-Measure over a baseline that only considers lexical information. Moreover, we observed that the best features typically reported in the literature for identifying incongruity in sarcastic text are not relevant for detecting situational irony in farcical news, thus reinforcing the idea that these phenomena pose different challenges that require distinct modelling approaches."}}
{"id": "sCtMzJp7b9I", "cdate": 1483228800000, "mdate": 1682513034230, "content": {"title": "Expanding Subjective Lexicons for Social Media Mining with Embedding Subspaces", "abstract": "Recent approaches for sentiment lexicon induction have capitalized on pre-trained word embeddings that capture latent semantic properties. However, embeddings obtained by optimizing performance of a given task (e.g. predicting contextual words) are sub-optimal for other applications. In this paper, we address this problem by exploiting task-specific representations, induced via embedding sub-space projection. This allows us to expand lexicons describing multiple semantic properties. For each property, our model jointly learns suitable representations and the concomitant predictor. Experiments conducted over multiple subjective lexicons, show that our model outperforms previous work and other baselines; even in low training data regimes. Furthermore, lexicon-based sentiment classifiers built on top of our lexicons outperform similar resources and yield performances comparable to those of supervised models."}}
