{"id": "u_7qyNFwkP8", "cdate": 1652737853197, "mdate": null, "content": {"title": "The Query Complexity of Cake Cutting", "abstract": "We consider the query complexity of cake cutting in the standard query model and give lower and upper bounds for computing approximately envy-free, perfect, and equitable allocations with the minimum number of cuts. The lower bounds are tight for computing contiguous  envy-free allocations among $n=3$ players and for computing perfect and equitable allocations with minimum number of cuts between $n=2$ players. For $\\epsilon$-envy-free  allocations with contiguous pieces, we also give an upper bound of $O(n/\\epsilon)$ and  lower bound of $\\Omega(\\log(1/\\epsilon))$ queries for any number $n \\geq 3$ of players.\n\nWe also formalize moving knife procedures and show that a large subclass of this family, which captures all the known moving knife procedures, can be simulated efficiently with arbitrarily small error in the Robertson-Webb query model."}}
{"id": "HQYbfWMe_TS", "cdate": 1546300800000, "mdate": null, "content": {"title": "Walrasian Dynamics in Multi-Unit Markets.", "abstract": "In a multi-unit market, a seller brings multiple units of a good and tries to sell them to a set of buyers that have monetary endowments. While a Walrasian equilibrium does not always exist in this model, natural relaxations of the concept that retain its desirable fairness properties do exist. We study the dynamics of (Walrasian) envy-free pricing mechanisms in this environment, showing that for any such pricing mechanism, the best response dynamic starting from truth-telling converges to a pure Nash equilibrium with small loss in revenue and welfare. Moreover, we generalize these bounds to capture all the (reasonable) Nash equilibria for a large class of (monotone) pricing mechanisms. We also identify a natural mechanism, which selects the minimum Walrasian envy-free price, in which for n=2 buyers the best response dynamic converges from any starting profile. We conjecture convergence of the mechanism for any number of buyers and provide simulation results to support our conjecture."}}
{"id": "HJWJZDWdWB", "cdate": 1514764800000, "mdate": null, "content": {"title": "Universal Growth in Production Economies", "abstract": "We study a simple variant of the von Neumann model of an expanding economy, in which multiple producers make goods according to their production function. The players trade their goods at the market and then use the bundles received as inputs for the production in the next round. The decision that players have to make is how to invest their money (i.e. bids) in each round. We show that a simple decentralized dynamic, where players update their bids on the goods in the market proportionally to how useful the investments were, leads to growth of the economy in the long term (whenever growth is possible) but also creates unbounded inequality, i.e. very rich and very poor players emerge. We analyze several other phenomena, such as how the relation of a player with others influences its development and the Gini index of the system."}}
{"id": "SkZUpVz_ZS", "cdate": 1451606400000, "mdate": null, "content": {"title": "To Give or Not to Give: Fair Division for Single Minded Valuations", "abstract": "Single minded agents have strict preferences, in which a bundle is acceptable only if it meets a certain demand. Such preferences arise naturally in scenarios such as allocating computational resources among users, where the goal is to fairly serve as many requests as possible. In this paper we study the fair division problem for such agents, which is complex due to discontinuity and complementarities of preferences.\r\n\r\nOur solution concept--the competitive allocation from equal incomes (CAEI)--is inspired from market equilibria and implements fair outcomes through a pricing mechanism. We study existence and computation of CAEI for multiple divisible goods, discrete goods, and cake cutting. Our solution is useful more generally, when the players have a target set of goods, and very small positive values for any bundle other than their target set."}}
{"id": "SJW05kZObH", "cdate": 1451606400000, "mdate": null, "content": {"title": "An Algorithmic Framework for Strategic Fair Division", "abstract": "We study the paradigmatic fair division problem of fairly allocating a divisible good among agents with heterogeneous preferences, commonly known as cake cutting. Classic cake cutting protocols are susceptible to manipulation. Do their strategic outcomes still guarantee fairness? To address this question we adopt a novel algorithmic approach, proposing a concrete computational model and reasoning about the game-theoretic properties of algorithms that operate in this model. Specifically, we show that each protocol in the class of generalized cut and choose (GCC) protocols — which includes the most important discrete cake cutting protocols — is guaranteed to have approximate subgame perfect Nash equilibria, or even exact equilibria if the protocol's tie-breaking rule is flexible. We further observe that the (approximate) equilibria of proportional protocols — which guarantee each of the n agents a 1/n-fraction of the cake — must be (approximately) proportional, thereby answering the above question in the positive (at least for one common notion of fairness)."}}
{"id": "BkWUiEzdbr", "cdate": 1420070400000, "mdate": null, "content": {"title": "The Adjusted Winner Procedure: Characterizations and Equilibria", "abstract": "The Adjusted Winner procedure is an important mechanism proposed by Brams and Taylor for fairly allocating goods between two agents. It has been used in practice for divorce settlements and analyzing political disputes. Assuming truthful declaration of the valuations, it computes an allocation that is envy-free, equitable and Pareto optimal. We show that Adjusted Winner admits several elegant characterizations, which further shed light on the outcomes reached with strategic agents. We find that the procedure may not admit pure Nash equilibria in either the discrete or continuous variants, but is guaranteed to have e-Nash equilibria for each e > 0. Moreover, under informed tiebreaking, exact pure Nash equilibria always exist, are Pareto optimal, and their social welfare is at least 3/4 of the optimal."}}
{"id": "Bk4s5mMd-S", "cdate": 1420070400000, "mdate": null, "content": {"title": "A Dictatorship Theorem for Cake Cutting", "abstract": "We consider discrete protocols for the classical Steinhaus cake cutting problem. Under mild technical conditions, we show that any deterministic strategy-proof protocol for two agents in the standard Robertson-Webb query model is dictatorial, that is, there is a fixed agent to which the protocol allocates the entire cake. For n > 2 agents, a similar impossibility holds, namely there always exists an agent that gets the empty piece (i.e. no cake). In contrast, we exhibit randomized protocols that are truthful in expectation and compute approximately fair allocations."}}
{"id": "SyW8ygbuWS", "cdate": 1388534400000, "mdate": null, "content": {"title": "The Fisher Market Game: Equilibrium and Welfare", "abstract": "The Fisher market model is one of the most fundamental resource allocation models in economics. In a Fisher market, the prices and allocations of goods are determined according to the preferences and budgets of buyers to clear the market.\r\n\r\nIn a Fisher market game, however, buyers are strategic and report their preferences over goods; the market-clearing prices and allocations are then determined based on their reported preferences rather than their real preferences. We show that the Fisher market game always has a pure Nash equilibrium, for buyers with linear, Leontief, and Cobb-Douglas utility functions, which are three representative classes of utility functions in the important Constant Elasticity of Substitution (CES) family. Furthermore, to quantify the social efficiency, we prove Price of Anarchy bounds for the game when the utility functions of buyers fall into these three classes respectively."}}
{"id": "B1bsw6lO-S", "cdate": 1388534400000, "mdate": null, "content": {"title": "Simultaneous Cake Cutting", "abstract": "We introduce the simultaneous model for cake cutting (the fair allocation of a divisible good), in which agents simultaneously send messages containing a sketch of their preferences over the cake. We show that this model enables the computation of divisions that satisfy proportionality -- a popular fairness notion -- using a protocol that circumvents a standard lower bound via parallel information elicitation. Cake divisions satisfying another prominent fairness notion, envy-freeness, are impossible to compute in the simultaneous model, but admit arbitrarily good approximations."}}
{"id": "r1-tCRlOWB", "cdate": 1356998400000, "mdate": null, "content": {"title": "How Bad Is Selfish Voting?", "abstract": "It is well known that strategic behavior in elections is essentially unavoidable; we therefore ask: how bad can the rational outcome be? We answer this question via the notion of the price of anarchy, using the scores of alternatives as a proxy for their quality and bounding the ratio between the score of the optimal alternative and the score of the winning alternative in Nash equilibrium. Specifically, we are interested in Nash equilibria that are obtained via sequences of rational strategic moves. Focusing on three common voting rules -- plurality, veto, and Borda -- we provide very positive results for plurality and very negative results for Borda, and place veto in the middle of this spectrum."}}
