{"id": "gikSYNRkiGi", "cdate": 1674002104553, "mdate": 1674002104553, "content": {"title": "SCARA: Scalable Graph Neural Networks with Feature-Oriented Optimization", "abstract": "Recent advances in data processing have stimulated the demand for learning graphs of very large scales. Graph Neural Networks\n(GNNs), being an emerging and powerful approach in solving graph learning tasks, are known to be difficult to scale up. Most scalable\nmodels apply node-based techniques in simplifying the expensive graph message-passing propagation procedure of GNN. However,\nwe find such acceleration insufficient when applied to million- or even billion-scale graphs. In this work, we propose SCARA, a scalable GNN with feature-oriented optimization for graph computation. SCARA efficiently computes graph embedding from node features, and further selects and reuses feature computation results to reduce overhead. Theoretical analysis indicates that our model achieves sub-linear time complexity with a guaranteed precision in propagation process as well as GNN training and inference. We conduct extensive experiments on various datasets to evaluate the efficacy and efficiency of SCARA. Performance comparison with baselines shows that SCARA can reach up to 100× graph propagation acceleration than current state-of-the-art methods with fast convergence and comparable accuracy. Most notably, it is efficient to process precomputation on the largest available billion-scale GNN dataset Papers100M (111M nodes, 1.6B edges) in 100 seconds."}}
{"id": "vzWaRjusM3", "cdate": 1672531200000, "mdate": 1681649994729, "content": {"title": "Less is More: Towards Lightweight Cost Estimator for Database Systems", "abstract": ""}}
{"id": "gwhiB3WAXf7", "cdate": 1672531200000, "mdate": 1681649994732, "content": {"title": "Distributed Graph Embedding with Information-Oriented Random Walks", "abstract": ""}}
{"id": "-mgHIRW9Py", "cdate": 1672531200000, "mdate": 1676681206809, "content": {"title": "Multi-Task Processing in Vertex-Centric Graph Systems: Evaluations and Insights", "abstract": ""}}
{"id": "q5mdgY6jhC", "cdate": 1640995200000, "mdate": 1676681208558, "content": {"title": "Efficiently Answering k-hop Reachability Queries in Large Dynamic Graphs for Fraud Feature Extraction", "abstract": "Instant messaging client (IMC) is now an essential tool for mobile users. In the representative IMC We Chat, cybercriminals deceive frauds, causing financial loss to normal users. Through statistical analysis, we find that certain fraud interactions commonly occur among WeChat users who are not k-hop neighbors. Therefore, efficiently answering whether the distance between two vertices is not longer than k at a certain time point (i.e., k-hop reachability queries) over the dynamic social graph of WeChat becomes a crucial task for fraud feature extraction in the detection system: it can help human experts quickly identify suspicious user interactions and the query results can be further used as the input feature to the downstream machine learning based detection methods. In this paper, we illustrate Bidirectional k-hop Reachability Query Processing over a Dynamic Graph (BREAD) that is used in WeChat for extracting the k-hop reachability feature for fraud detection. BREAD adopts the idea of estimating Personalized PageRank value. It first conducts the backward search from the destination vertex to construct an intermediate vertex set. Then, it performs a certain amount of random walks from the start vertex to see whether they can hit the intermediate vertex set, and the results are returned to answer k-hop reachability queries. We further propose <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\text{BREAD}++$</tex> that leverages the massive parallel processing power of GPU to achieve a considerable performance gain. Experiments on several large-scale dynamic graph benchmarks and the social graph of WeChat have demonstrated that <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\text{BREAD}/\\text{BREAD}++$</tex> is superior than existing index-free competitors: our methods provide not only fast but also accurate responses and they are of practical value to k-hop reachability feature extraction in the fraud detection system of WeChat. Our implementation is available at https://github.com/XMUDM/BREAD."}}
{"id": "kyka_-DZY-Rt", "cdate": 1640995200000, "mdate": 1674919147506, "content": {"title": "DMCS : Density Modularity based Community Search", "abstract": "Community Search, or finding a connected subgraph (known as a community) containing the given query nodes in a social network, is a fundamental problem. Most of the existing community search models only focus on the internal cohesiveness of a community. However, a high-quality community often has high modularity, which means dense connections inside communities and sparse connections to the nodes outside the community. In this paper, we conduct a pioneer study on searching a community with high modularity. We point out that while modularity has been popularly used in community detection (without query nodes), it has not been adopted for community search, surprisingly, and its application in community search (related to query nodes) brings in new challenges. We address these challenges by designing a new graph modularity function named Density Modularity. To the best of our knowledge, this is the first work on the community search problem using graph modularity. The community search based on the density modularity, termed as DMCS, is to find a community in a social network that contains all the query nodes and has high density-modularity. We prove that the DMCS problem is NP-hard. To efficiently address DMCS, we present new algorithms that run in log-linear time to the graph size. We conduct extensive experimental studies in real-world and synthetic networks, which offer insights into the efficiency and effectiveness of our algorithms. In particular, our algorithm achieves up to 8.5 times higher accuracy in terms of NMI than baseline algorithms."}}
{"id": "k3CvOabEqU", "cdate": 1640995200000, "mdate": 1676681208130, "content": {"title": "Leveraging enterprise knowledge graph to infer web events' influences via self-supervised learning", "abstract": ""}}
{"id": "hNR1PVXD-A", "cdate": 1640995200000, "mdate": 1676681207911, "content": {"title": "Distributed PageRank computation with improved round complexities", "abstract": ""}}
{"id": "dFhkp1K5H2z", "cdate": 1640995200000, "mdate": 1676681208345, "content": {"title": "VC-Tune: Tuning and Exploring Distributed Vertex-Centric Graph Systems", "abstract": "Distributed vertex-centric graph systems, or VC-systems, have achieved tremendous success in the industry. A common usage pattern of VC-systems is multi-processing, or the concurrent processing of multiple unit tasks. Example multi-processing includes answering multiple single-source shortest path queries on a graph. However, concurrent processing of all the unit tasks may overload the system with excessive memory usage, leading to intolerable system delays. To ad-dress the important challenge, we present V C- Tune, a system with a convenient interface to help practitioners orchestrate the unit tasks for improving the overall performance within the system limit. This demonstration allows the audience to interact with our system to explore the configuration space of multi-processing in VC-systems and compare different sys-tem configurations. In addition, we embed into the system an automatic configuration search algorithm, which can directly recommend to the practitioners a suitable configuration that gives a satisfactory system performance. An introduction video is at (https://sites.google.com/view/vc-tune-video)."}}
{"id": "b_u0Yw7ZwH", "cdate": 1640995200000, "mdate": 1676681209225, "content": {"title": "Proteus: A Self-Designing Range Filter", "abstract": "We introduce Proteus, a novel self-designing approximate range filter, which configures itself based on sampled data in order to optimize its false positive rate (FPR) for a given space requirement. Proteus unifies the probabilistic and deterministic design spaces of state-of-the-art range filters to achieve robust performance across a larger variety of use cases. At the core of Proteus lies our Contextual Prefix FPR (CPFPR) model - a formal framework for the FPR of prefix-based filters across their design spaces. We empirically demonstrate the accuracy of our model and Proteus' ability to optimize over both synthetic workloads and real-world datasets. We further evaluate Proteus in RocksDB and show that it is able to improve end-to-end performance by as much as 5.3x over more brittle state-of-the-art methods such as SuRF and Rosetta. Our experiments also indicate that the cost of modeling is not significant compared to the end-to-end performance gains and that Proteus is robust to workload shifts."}}
