{"id": "WR5UTgN_nuB", "cdate": 1701388800000, "mdate": 1696063291802, "content": {"title": "Adaptive local adversarial attacks on 3D point clouds", "abstract": ""}}
{"id": "rEC8fcD2uLg", "cdate": 1684342598469, "mdate": 1684342598469, "content": {"title": "FedGS: Federate Graph-based Sampling with Arbitrary Client Availability", "abstract": "While federated learning has shown strong results in opti-\nmizing a machine learning model without direct access to\nthe original data, its performance may be hindered by in-\ntermittent client availability which slows down the conver-\ngence and biases the final learned model. There are significant\nchallenges to achieve both stable and bias-free training un-\nder arbitrary client availability. To address these challenges,\nwe propose a framework named Federated Graph-based Sam-\npling (FEDGS), to stabilize the global model update and\nmitigate the long-term bias given arbitrary client availabil-\nity simultaneously. First, we model the data correlations of\nclients with a Data-Distribution-Dependency Graph (3DG)\nthat helps keep the sampled clients data apart from each other,\nwhich is theoretically shown to improve the approximation\nto the optimal model update. Second, constrained by the far-\ndistance in data distribution of the sampled clients, we fur-\nther minimize the variance of the numbers of times that the\nclients are sampled, to mitigate long-term bias. To validate\nthe effectiveness of FEDGS, we conduct experiments on three\ndatasets under a comprehensive set of seven client availability\nmodes. Our experimental results confirm FEDGS’s advantage\nin both enabling a fair client-sampling scheme and improving\nthe model performance under arbitrary client availability. Our\ncode is available at https://github.com/WwZzz/FedGS."}}
{"id": "kLDIZqLuWW", "cdate": 1672531200000, "mdate": 1695950341526, "content": {"title": "FedGS: Federated Graph-Based Sampling with Arbitrary Client Availability", "abstract": "While federated learning has shown strong results in opti- mizing a machine learning model without direct access to the original data, its performance may be hindered by in- termittent client availability which slows down the conver- gence and biases the final learned model. There are significant challenges to achieve both stable and bias-free training un- der arbitrary client availability. To address these challenges, we propose a framework named Federated Graph-based Sam- pling (FEDGS), to stabilize the global model update and mitigate the long-term bias given arbitrary client availabil- ity simultaneously. First, we model the data correlations of clients with a Data-Distribution-Dependency Graph (3DG) that helps keep the sampled clients data apart from each other, which is theoretically shown to improve the approximation to the optimal model update. Second, constrained by the far- distance in data distribution of the sampled clients, we fur- ther minimize the variance of the numbers of times that the clients are sampled, to mitigate long-term bias. To validate the effectiveness of FEDGS, we conduct experiments on three datasets under a comprehensive set of seven client availability modes. Our experimental results confirm FEDGS’s advantage in both enabling a fair client-sampling scheme and improving the model performance under arbitrary client availability. Our code is available at https://github.com/WwZzz/FedGS."}}
{"id": "5sXWEz_aOB", "cdate": 1672531200000, "mdate": 1681815349906, "content": {"title": "CIMI4D: A Large Multimodal Climbing Motion Dataset under Human-scene Interactions", "abstract": "Motion capture is a long-standing research problem. Although it has been studied for decades, the majority of research focus on ground-based movements such as walking, sitting, dancing, etc. Off-grounded actions such as climbing are largely overlooked. As an important type of action in sports and firefighting field, the climbing movements is challenging to capture because of its complex back poses, intricate human-scene interactions, and difficult global localization. The research community does not have an in-depth understanding of the climbing action due to the lack of specific datasets. To address this limitation, we collect CIMI4D, a large rock \\textbf{C}l\\textbf{I}mbing \\textbf{M}ot\\textbf{I}on dataset from 12 persons climbing 13 different climbing walls. The dataset consists of around 180,000 frames of pose inertial measurements, LiDAR point clouds, RGB videos, high-precision static point cloud scenes, and reconstructed scene meshes. Moreover, we frame-wise annotate touch rock holds to facilitate a detailed exploration of human-scene interaction. The core of this dataset is a blending optimization process, which corrects for the pose as it drifts and is affected by the magnetic conditions. To evaluate the merit of CIMI4D, we perform four tasks which include human pose estimations (with/without scene constraints), pose prediction, and pose generation. The experimental results demonstrate that CIMI4D presents great challenges to existing methods and enables extensive research opportunities. We share the dataset with the research community in http://www.lidarhumanmotion.net/cimi4d/."}}
{"id": "4x7z0tNQn0v", "cdate": 1672531200000, "mdate": 1681815349906, "content": {"title": "SLOPER4D: A Scene-Aware Dataset for Global 4D Human Pose Estimation in Urban Environments", "abstract": "We present SLOPER4D, a novel scene-aware dataset collected in large urban environments to facilitate the research of global human pose estimation (GHPE) with human-scene interaction in the wild. Employing a head-mounted device integrated with a LiDAR and camera, we record 12 human subjects' activities over 10 diverse urban scenes from an egocentric view. Frame-wise annotations for 2D key points, 3D pose parameters, and global translations are provided, together with reconstructed scene point clouds. To obtain accurate 3D ground truth in such large dynamic scenes, we propose a joint optimization method to fit local SMPL meshes to the scene and fine-tune the camera calibration during dynamic motions frame by frame, resulting in plausible and scene-natural 3D human poses. Eventually, SLOPER4D consists of 15 sequences of human motions, each of which has a trajectory length of more than 200 meters (up to 1,300 meters) and covers an area of more than 2,000 $m^2$ (up to 13,000 $m^2$), including more than 100K LiDAR frames, 300k video frames, and 500K IMU-based motion frames. With SLOPER4D, we provide a detailed and thorough analysis of two critical tasks, including camera-based 3D HPE and LiDAR-based 3D HPE in urban environments, and benchmark a new task, GHPE. The in-depth analysis demonstrates SLOPER4D poses significant challenges to existing methods and produces great research opportunities. The dataset and code are released at \\url{http://www.lidarhumanmotion.net/sloper4d/}"}}
{"id": "IELWMuIOxA6", "cdate": 1668047910015, "mdate": 1668047910015, "content": {"title": "LiDARCap: Long-range Markerless 3D Human Motion Capture with LiDAR Point Clouds", "abstract": "Existing motion capture datasets are largely short-range and cannot yet fit the need of long-range applications. We propose LiDARHuman26M, a new human motion capture dataset captured by LiDAR at a much longer range to overcome this limitation. Our dataset also includes the ground truth human motions acquired by the IMU system and the synchronous RGB images. We further present a strong base-line method, LiDARCap, for LiDAR point cloud human motion capture. Specifically, we first utilize PointNet++ to encode features of points and then employ the inverse kinematics solver and SMPL optimizer to regress the pose through aggregating the temporally encoded features hierarchically. Quantitative and qualitative experiments show that our method outperforms the techniques based only on RGB images. Ablation experiments demonstrate that our dataset is challenging and worthy of further research. Finally, the experiments on the KITTI Dataset and the Waymo Open Dataset show that our method can be generalized to different LiDAR sensor settings."}}
{"id": "bdnZ_1qHLCW", "cdate": 1652737431858, "mdate": null, "content": {"title": "ResQ: A Residual Q Function-based Approach for Multi-Agent Reinforcement Learning Value Factorization", "abstract": "The factorization of state-action value functions for Multi-Agent Reinforcement Learning (MARL) is important. Existing studies are limited by their representation capability, sample efficiency, and approximation error. To address these challenges, we propose, ResQ, a MARL value function factorization method, which can find the optimal joint policy for any state-action value function through residual functions. ResQ masks some state-action value pairs from a joint state-action value function, which is transformed as the sum of a main function and a residual function. ResQ can be used with mean-value and stochastic-value RL. We theoretically show that ResQ can satisfy both the individual global max (IGM) and the distributional IGM principle without representation limitations. Through experiments on matrix games, the predator-prey, and StarCraft benchmarks, we show that ResQ can obtain better results than multiple expected/stochastic value factorization methods."}}
{"id": "rLr7R_YW11", "cdate": 1640995200000, "mdate": 1668046951734, "content": {"title": "HSC4D: Human-centered 4D Scene Capture in Large-scale Indoor-outdoor Space Using Wearable IMUs and LiDAR", "abstract": ""}}
{"id": "qFS68hov-a", "cdate": 1640995200000, "mdate": 1683882123971, "content": {"title": "Qrelation: an Agent Relation-Based Approach for Multi-Agent Reinforcement Learning Value Function Factorization", "abstract": "The Centralized Training with Decentralized Execution paradigm (CTDE), which trains policies centrally with additional information, is important for Multi-Agent Reinforcement Learning (MARL). For CTDE, value function factorization methods make use of state during training and factorize the value function into multiple local value functions for decentralized execution. These approaches do not fully consider the relational information among agents, resulting in sub-optimal models for complex tasks. To remedy this issue, we propose QRelation which is a graph neural network approach for value function factorization. It considers both the static relations (e.g., agent types) and dynamic relations (e.g., close-by). We show that QRelation can obtain better results than state-of-the-art methods on challenging StarCraft II benchmarks."}}
{"id": "hZAMvbNLV9M", "cdate": 1640995200000, "mdate": 1675520491271, "content": {"title": "FedGS: Federated Graph-based Sampling with Arbitrary Client Availability", "abstract": "While federated learning has shown strong results in optimizing a machine learning model without direct access to the original data, its performance may be hindered by intermittent client availability which slows down the convergence and biases the final learned model. There are significant challenges to achieve both stable and bias-free training under arbitrary client availability. To address these challenges, we propose a framework named Federated Graph-based Sampling (FedGS), to stabilize the global model update and mitigate the long-term bias given arbitrary client availability simultaneously. First, we model the data correlations of clients with a Data-Distribution-Dependency Graph (3DG) that helps keep the sampled clients data apart from each other, which is theoretically shown to improve the approximation to the optimal model update. Second, constrained by the far-distance in data distribution of the sampled clients, we further minimize the variance of the numbers of times that the clients are sampled, to mitigate long-term bias. To validate the effectiveness of FedGS, we conduct experiments on three datasets under a comprehensive set of seven client availability modes. Our experimental results confirm FedGS's advantage in both enabling a fair client-sampling scheme and improving the model performance under arbitrary client availability. Our code is available at \\url{https://github.com/WwZzz/FedGS}."}}
