{"id": "ekEuLj3P9sm", "cdate": 1420070400000, "mdate": null, "content": {"title": "Hardness of Approximation in PSPACE and Separation Results for Pebble Games", "abstract": "We consider the pebble game on DAGs with bounded fan-in introduced in [Paterson and Hewitt '70] and the reversible version of this game in [Bennett '89], and study the question of how hard it is to decide exactly or approximately the number of pebbles needed for a given DAG in these games. We prove that the problem of deciding whether s pebbles suffice to reversibly pebble a DAG G is PSPACE-complete, as was previously shown for the standard pebble game in [Gilbert, Lengauer and Tarjan '80]. Via two different graph product constructions we then strengthen these results to establish that both standard and reversible pebbling space are PSPACE-hard to approximate to within any additive constant. To the best of our knowledge, these are the first hardness of approximation results for pebble games in an unrestricted setting (even for polynomial time). Also, since [Chan '13] proved that reversible pebbling is equivalent to the games in [Dymond and Tompa '85] and [Raz and McKenzie '99], our results apply to the Dymond -- Tompa and Raz -- McKenzie games as well, and from the same paper it follows that resolution depth is PSPACE-hard to determine up to any additive constant. We also obtain a multiplicative logarithmic separation between reversible and standard pebbling space. This improves on the additive logarithmic separation previously known and could plausibly be tight, although we are not able to prove this. We leave as an interesting open problem whether our additive hardness of approximation result could be strengthened to a multiplicative bound if the computational resources are decreased from polynomial space to the more common setting of polynomial time."}}
{"id": "Z1IuKEUTJpQ", "cdate": 1388534400000, "mdate": null, "content": {"title": "Tight Bounds for Monotone Switching Networks via Fourier Analysis", "abstract": "Plain Text Version] We prove tight size bounds on monotone switching networks for the NP-complete problem of $k$-clique, and for an explicit monotone problem by analyzing a pyramid structure of height $h$ for the P-complete problem of generation. This gives alternative proofs of the separations of m-NC from m-P and of m-NC$^i$ from m-NC$^{i+1}$, different from Raz--McKenzie (Combinatorica 1999). The enumerative-combinatorial and Fourier analytic techniques in this paper are very different from a large body of work on circuit depth lower bounds, and may be of independent interest. An earlier version of this paper appeared in the Proceedings of the 44th ACM Symp. on Theory of Computing, pp. 495-504, 2011. DOI: 10.4086/toc.2014.v010a015 © 2014 Siu Man Chan and Aaron Potechin Licensed under a Creative Commons Attribution License (CC-BY)"}}
{"id": "iu2cOWyD3C8", "cdate": 1356998400000, "mdate": null, "content": {"title": "Just a Pebble Game", "abstract": "The two-player pebble game of Dymond-Tompa is identified as a barrier for existing techniques to save space or to speed up parallel algorithms for evaluation problems. Many combinatorial lower bounds to study I versus NI and NC versus P under different restricted settings scale in the same way as the pebbling algorithm of Dymond-Tompa. These lower bounds include, (1) the monotone separation of m-I from m-NI by studying the size of monotone switching networks in Potechin '10; (2) a new semantic separation of NC from P and of NC <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">i</sup> from NC <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">i+1</sup> by studying circuit depth, based on the techniques developed for the semantic separation of NC <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup> from NC <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</sup> by the universal composition relation in Edmonds-Impagliazzo-Rudich-Sgall '01 and in Hastad- Wigderson '97; and (3) the monotone separation of m-NC from m-P and of m-NC <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">i</sup> from m-NC <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">i+1</sup> by studying (a) the depth of monotone circuits in Raz-McKenzie '99; and (b) the size of monotone switching networks in Chan- Potechin '12. This supports the attempt to separate NC from P by focusing on depth complexity, and suggests the study of combinatorial invariants shaped by pebbling for proving lower bounds. An application to proof complexity gives tight bounds for the size and the depth of some refinements of resolution refutations."}}
{"id": "dFumzuXu_WK", "cdate": 1325376000000, "mdate": null, "content": {"title": "Tight Bounds for Monotone Switching Networks via Fourier Analysis", "abstract": "Neuromodulators are signaling molecules that induce long-lasting or network-wide changes in electrical activity, canonically through metabotropic G-coupled protein receptors. In contrast to classical..."}}
{"id": "Lu5HyfLPCO", "cdate": 1325376000000, "mdate": null, "content": {"title": "Tight bounds for monotone switching networks via fourier analysis", "abstract": "We prove tight size bounds on monotone switching networks for the k-clique problem, and for an explicit monotone problem by analyzing the generation problem with a pyramid structure of height h. This gives alternative proofs of the separations of m-NC from m-P and of m-NCi from m-NCi+1, different from Raz-McKenzie (Combinatorica '99). The enumerative-combinatorial and Fourier analytic techniques in this work are very different from a large body of work on circuit depth lower bounds, and may be of independent interest."}}
{"id": "XbPYdvojwsz", "cdate": 1136073600000, "mdate": null, "content": {"title": "Random Separation: A New Method for Solving Fixed-Cardinality Optimization Problems", "abstract": "We develop a new randomized method, random separation, for solving fixed-cardinality optimization problems on graphs, i.e., problems concerning solutions with exactly a fixed number k of elements (e.g., k vertices V′) that optimize solution values (e.g., the number of edges covered by V′). The key idea of the method is to partition the vertex set of a graph randomly into two disjoint sets to separate a solution from the rest of the graph into connected components, and then select appropriate components to form a solution. We can use universal sets to derandomize algorithms obtained from this method. This new method is versatile and powerful as it can be used to solve a wide range of fixed-cardinality optimization problems for degree-bounded graphs, graphs of bounded degeneracy (a large family of graphs that contains degree-bounded graphs, planar graphs, graphs of bounded tree-width, and nontrivial minor-closed families of graphs), and even general graphs."}}
