{"id": "2I89ZGpMJ1", "cdate": 1680307200000, "mdate": 1699207668957, "content": {"title": "Low-Rank Gradient Descent for Memory-Efficient Training of Deep In-Memory Arrays", "abstract": "The movement of large quantities of data during the training of a deep neural network presents immense challenges for machine learning workloads, especially those based on future functional memories deployed to store network models. As the size of network models begins to vastly outstrip traditional silicon computing resources, functional memories based on flash, resistive switches, magnetic tunnel junctions, and other technologies can store these new ultra-large models. However, new approaches are then needed to minimize hardware overhead, especially on the movement and calculation of gradient information that cannot be efficiently contained in these new memory resources. To do this, we introduce streaming batch principal component analysis (SBPCA) as an update algorithm. Streaming batch principal component analysis uses stochastic power iterations to generate a stochastic rank-k approximation of the network gradient. We demonstrate that the low-rank updates produced by streaming batch principal component analysis can effectively train convolutional neural networks on a variety of common datasets, with performance comparable to standard mini-batch gradient descent. Our approximation is made in an expanded vector form that can efficiently be applied to the rows and columns of crossbars for array-level updates. These results promise improvements in the design of application-specific integrated circuits based around large vector-matrix multiplier memories."}}
{"id": "q4blNf0QcAi", "cdate": 1640995200000, "mdate": 1667381516694, "content": {"title": "Infrared Invisible Clothing: Hiding from Infrared Detectors at Multiple Angles in Real World", "abstract": "Thermal infrared imaging is widely used in body temperature measurement, security monitoring, and so on, but its safety research attracted attention only in recent years. We proposed the infrared adversarial clothing, which could fool infrared pedestrian detectors at different angles. We simulated the process from cloth to clothing in the digital world and then designed the adversarial \"QR code\" pattern. The core of our method is to design a basic pattern that can be expanded periodically, and make the pattern after random cropping and deformation still have an adversarial effect, then we can process the flat cloth with an adversarial pattern into any 3D clothes. The results showed that the optimized \"QR code\" pattern lowered the Average Precision (AP) of YOLOv3 by 87.7%, while the random \"QR code\" pattern and blank pattern lowered the AP of YOLOv3 by 57.9% and 30.1%, respectively, in the digital world. We then manufactured an adversarial shirt with a new material: aerogel. Physical-world experiments showed that the adversarial \"QR code\" pattern clothing lowered the AP of YOLOv3 by 64.6%, while the random \"QR code\" pattern clothing and fully heat-insulated clothing lowered the AP of YOLOv3 by 28.3% and 22.8%, respectively. We used the model ensemble technique to improve the attack transferability to unseen models."}}
{"id": "n1MyTq5hV8A", "cdate": 1640995200000, "mdate": 1667381516655, "content": {"title": "Infrared Invisible Clothing: Hiding from Infrared Detectors at Multiple Angles in Real World", "abstract": "Thermal infrared imaging is widely used in body temperature measurement, security monitoring, and so on, but its safety research attracted attention only in recent years. We proposed the infrared adversarial clothing, which could fool infrared pedestrian detectors at different angles. We simulated the process from cloth to clothing in the digital world and then designed the adversarial “QR code” pattern. The core of our method is to design a basic pattern that can be expanded periodically, and make the pattern after random cropping and deformation still have an adversarial effect, then we can process the flat cloth with an adversarial pattern into any 3D clothes. The results showed that the optimized “QR code” pattern lowered the Average Precision (AP) of YOLOv3 by 87.7%, while the random “QR code” pattern and blank pattern lowered the AP of YOLOv3 by 57.9% and 30.1%, respectively, in the digital world. We then manufactured an adversarial shirt with a new material: aerogel. Physical-world experiments showed that the adversarial “QR code” pattern clothing lowered the AP of YOLOv3 by 64.6%, while the random “QR code” pattern clothing and fully heat-insulated clothing lowered the AP of YOLOv3 by 28.3% and 22.8%, respectively. We used the model ensemble technique to improve the attack transferability to unseen models."}}
{"id": "9v-nSNpKtiI", "cdate": 1640995200000, "mdate": 1667381516903, "content": {"title": "Adversarial Texture for Fooling Person Detectors in the Physical World", "abstract": "Nowadays, cameras equipped with AI systems can capture and analyze images to detect people automatically. However, the AI system can make mistakes when receiving deliberately designed patterns in the real world, i.e., physical adversarial examples. Prior works have shown that it is possible to print adversarial patches on clothes to evade DNN-based person detectors. However, these adversarial examples could have catastrophic drops in the attack success rate when the viewing angle (i.e., the camera's angle towards the object) changes. To perform a multi-angle attack, we propose Adversarial Texture (AdvTexture). AdvTexture can cover clothes with arbitrary shapes so that people wearing such clothes can hide from person detectors from different viewing angles. We propose a generative method, named Toroidal-Cropping-based Expandable Generative Attack (TC-EGA), to craft AdvTexture with repetitive structures. We printed several pieces of cloth with AdvTexure and then made T-shirts, skirts, and dresses in the physical world. Experiments showed that these clothes could fool person detectors in the physical world."}}
{"id": "9LSOHNy7uu7", "cdate": 1640995200000, "mdate": 1667381516812, "content": {"title": "Adversarial Texture for Fooling Person Detectors in the Physical World", "abstract": "Nowadays, cameras equipped with AI systems can capture and analyze images to detect people automatically. However, the AI system can make mistakes when receiving deliberately designed patterns in the real world, i.e., physical adversarial examples. Prior works have shown that it is possible to print adversarial patches on clothes to evade DNN-based person detectors. However, these adversarial examples could have catastrophic drops in the attack success rate when the viewing angle (i.e., the camera's angle towards the object) changes. To perform a multi-angle attack, we propose Adversarial Texture (AdvTexture). AdvTexture can cover clothes with arbitrary shapes so that people wearing such clothes can hide from person detectors from different viewing angles. We propose a generative method, named Toroidal-Cropping-based Expandable Generative Attack (TC-EGA), to craft AdvTexture with repetitive structures. We printed several pieces of cloth with AdvTexure and then made T-shirts, skirts, and dresses in the physical world. Experiments showed that these clothes could fool person detectors in the physical world."}}
{"id": "WaFi9gcPQs", "cdate": 1577836800000, "mdate": 1699207668916, "content": {"title": "Memory-efficient training with streaming dimensionality reduction", "abstract": "The movement of large quantities of data during the training of a Deep Neural Network presents immense challenges for machine learning workloads. To minimize this overhead, especially on the movement and calculation of gradient information, we introduce streaming batch principal component analysis as an update algorithm. Streaming batch principal component analysis uses stochastic power iterations to generate a stochastic k-rank approximation of the network gradient. We demonstrate that the low rank updates produced by streaming batch principal component analysis can effectively train convolutional neural networks on a variety of common datasets, with performance comparable to standard mini batch gradient descent. These results can lead to both improvements in the design of application specific integrated circuits for deep learning and in the speed of synchronization of machine learning models trained with data parallelism."}}
{"id": "OmpAsV5g0_", "cdate": 1577836800000, "mdate": 1699207668915, "content": {"title": "Streaming Batch Gradient Tracking for Neural Network Training (Student Abstract)", "abstract": "Faster and more energy efficient hardware accelerators are critical for machine learning on very large datasets. The energy cost of performing vector-matrix multiplication and repeatedly moving neural network models in and out of memory motivates a search for alternative hardware and algorithms. We propose to use streaming batch principal component analysis (SBPCA) to compress batch data during training by using a rank-k approximation of the total batch update. This approach yields comparable training performance to minibatch gradient descent (MBGD) at the same batch size while reducing overall memory and compute requirements."}}
{"id": "-nnSYwsa0x", "cdate": 1577836800000, "mdate": 1699207668950, "content": {"title": "A Deep Learning Model for Early Detection of Fake News on Social Media*", "abstract": "Fake news detection has recently become an important topic of research. This is due to the impact of fake news on the internet especially on social media. Numerous of the models proposed in the previous studies are based on supervised learning. Therefore, these models are unable to deal with the huge amount of unlabeled data about fake news. Few studies focused on early detection. In this study, we built a semi-supervised learning model to detect fake news on social media at an early stage. By using a semi-supervised learning, we make our model able to deal with the huge amount of unlabeled data on social media. We first built a model to extract users' opinion expressed in comments, then we used CredRank Algorithm to evaluate users' credibility and built a small network of users involved in the spread of a given news. The outputs of these three steps serve as inputs of our news classifier SSLNews. SSLNews is composed of three networks: a shared CNN, an unsupervised CNN and a supervised CNN. We used real world datasets to evaluate our model, Politifact and Gossipcop. When using 25% of labeled data, SSLNews reaches an accuracy of 72.25% on Politifact and 70.35% on Gossipcop. When using data produced in the first 10 minutes of the beginning of the spread of the news, SSLNews reaches an accuracy of 71.10% on Politifact and 68.07% on Gossipcop."}}
{"id": "3XQlSj-gzI", "cdate": 1546300800000, "mdate": 1699207668956, "content": {"title": "Streaming Batch Eigenupdates for Hardware Neuromorphic Networks", "abstract": "Neuromorphic networks based on nanodevices, such as metal oxide memristors, phase change memories, and flash memory cells, have generated considerable interest for their increased energy efficiency and density in comparison to graphics processing units (GPUs) and central processing units (CPUs). Though immense acceleration of the training process can be achieved by leveraging the fact that the time complexity of training does not scale with the network size, it is limited by the space complexity of stochastic gradient descent, which grows quadratically. The main objective of this work is to reduce this space complexity by using low-rank approximations of stochastic gradient descent. This low spatial complexity combined with streaming methods allows for significant reductions in memory and compute overhead, opening the doors for improvements in area, time and energy efficiency of training. We refer to this algorithm and architecture to implement it as the streaming batch eigenupdate (SBE) approach."}}
{"id": "M0hcagtyuuD", "cdate": 1483228800000, "mdate": 1699207668949, "content": {"title": "Automatic Prediction of Traffic Flow Based on Deep Residual Networks", "abstract": "Traffic flow often contains massive amounts of information that is related to location and shows some regularity. And the traffic flow analysis based on trajectory data has become one of the most popular research topics in recent years. With the wide application of deep learning and for its higher accuracy than other approaches, methods such as convolution neural network and deep residual network have been introduced in traffic flow research and achieve good results. However, these methods usually require the training of a large number of parameters, which leads to some problems. For example, frequent manual adjustment is needed, and some parameters cannot be dynamically adjusted with the training process. We find that learning rate plays a crucial role in all parameters, which has important influence on the training speed of the residual network. In other words, the soundness of traffic flow predication results depends on the learning rate. Hence, we propose G4 algorithm to automatically determine the learning rate. It can be adjusted automatically in the process of trajectory data mining, and therefore solve the traffic flow prediction problem. Experiments on real data sets show that our method is effective and superior over some traditional optimizing methods of traffic flow analysis."}}
