{"id": "D3VPkCbtVE", "cdate": 1680310800000, "mdate": 1681700149253, "content": {"title": "Blockchain-Aided Network Resource Orchestration in Intelligent Internet of Things", "abstract": "The proliferation of users and data traffic poses substantial pressure on resource management in the Internet of Things (IoT). In addition to beneficially allocating scarce network resources, it also needs to meet differentiated users’ Quality-of-Service (QoS) requirements, such as low delay, high security, etc. The distributed management architecture of blockchain and its inherent security features bring inspiration to resource management in the IoT. In this article, we propose a blockchain-enabled resource orchestration scheme for IoT by deep reinforcement learning (DRL), where the IoT edge server and the end user can reach a consensus on the allocation of network resources based on blockchain theory. Moreover, relying on the policy network, the intelligent agent can be trained by these resource attributes to fully perceive the change of the network’s state and hence make dynamic resource allocation decisions. Finally, simulation results show that the proposed resource orchestration scheme has good performance in comparison to other security resource allocation algorithms. The average revenue, the user request acceptance rate, and the profitability are increased by an average of 8.5%, 1.8%, and 11.9%, respectively, compared with other algorithms."}}
{"id": "NE4CMifkR0", "cdate": 1680307200000, "mdate": 1681700149614, "content": {"title": "Dynamic UAV Deployment for Differentiated Services: A Multi-Agent Imitation Learning Based Approach", "abstract": "Unmanned Aerial Vehicles (UAVs) have been utilized to serve on-ground users with various services, e.g., computing, communication and caching, due to their mobility and flexibility. The main focus of many recent studies on UAVs is to deploy a set of homogeneous UAVs with identical capabilities controlled by one UAV owner/company to provide services. However, little attention has been paid to the issue of how to enable different UAV owners to provide services with differentiated service capabilities in a shared area. To address this issue, we propose a multi-agent imitation learning enabled UAV deployment approach to maximize both profits of UAV owners and utilities of on-ground users. Specially, a Markov game is formulated among UAV owners and we prove that a Nash equilibrium exists based on the full knowledge of the system. For online scheduling with incomplete information, we design agent policies by imitating the behaviors of corresponding experts. A novel neural network model, integrating convolutional neural networks, generative adversarial networks and a gradient-based policy, can be trained and executed in a fully decentralized manner with a guaranteed <inline-formula><tex-math notation=\"LaTeX\">$\\epsilon$</tex-math></inline-formula> -Nash equilibrium. Performance results show that our algorithm has significant superiority in terms of average profits, utilities and execution time compared with other representative algorithms."}}
{"id": "naXqbWI98iX", "cdate": 1677628800000, "mdate": 1681700150016, "content": {"title": "Mobility-Aware Proactive Flow Setup in Software-Defined Mobile Edge Networks", "abstract": "The software-defined network (SDN) enabled mobile edge network greatly facilitates network resource management and promotes many emerging applications. However, user mobility may cause the SDN controller to set flow rules frequently, introduce additional flow setup latency, cause delay jitter, and undermine latency-sensitive services. Proactive flow setup is an effective way to eliminate flow setup latency, but existing work fails to maximize the flow setup hit ratio, a metric for evaluating the quality of proactive flow setup decisions, which is critical for latency-sensitive services. In this paper, we study how to proactively set flow rules to maximize the flow setup hit ratio under limited available network resources to eliminate the flow setup latency as much as possible. Then, we formalize the proactive flow setup problem as two integer linear programming problems under two typical routing strategies, default routing and dynamic routing. Both problems are proved to be NP-hard. To tackle these two problems, we propose a linear programming-based polynomial-time approximation algorithm for the default routing case and a greedy-based heuristic algorithm for the dynamic routing case. Extensive trace-driven experimental and simulation results verify that our algorithms can improve the flow setup hit ratio by up to 30.99% compared to existing solutions."}}
{"id": "VAX8QENIbX", "cdate": 1677628800000, "mdate": 1681700149866, "content": {"title": "Cloud Mining Pool Aided Blockchain-Enabled Internet of Things: An Evolutionary Game Approach", "abstract": "The past few years have witnessed an exponential growth of diverse Internet of Things (IoT) devices as well as compelling applications ranging from industrial production to medical care. Dramatic advances in IoT technology not only brought enormous economic opportunities but also challenges (e.g., privacy and security vulnerabilities). Recently, with the appearance of blockchain technology, the integration of IoT and blockchain (BCoT) is considered a promising solution to address these issues. Blockchain provides a secure and scalable data management framework for IoT devices. However, the huge computation and energy cost of the consensus process in blockchain prevents it from being directly applied as a generic platform. To overcome this challenge, in this article, we propose a cloud mining pool-aided BCoT architecture, where the IoT devices can rent the computing resources from the cloud mining pools to offload the mining process. Based on this architecture, we study the mining pool selection problem and analyze the colony behaviors of IoT devices with different pooling strategies. We propose a centralized evolutionary game-based pool selection algorithm for the sake of maximizing the system utility. Considering the non-cooperative relationship among multiple miners, we also propose a lightweight distributed reinforcement learning algorithm, named the ‘WoLF-PHC’ algorithm."}}
{"id": "7ouE3fUaPQ_", "cdate": 1677628800000, "mdate": 1681700149279, "content": {"title": "Towards Predictive Forwarding Strategy in Vehicular Named Data Networking", "abstract": "Vehicular named data networking (V-NDN) is promising to improve the content delivery efficiency in vehicular ad hoc networks (VANETs). However, the potential broadcast storm caused by Interest packet flooding and return path failures caused by vehicle mobility can significantly degrade the content delivery performance. Existing forwarding strategies based on outdated position information cannot address these issues well. In this paper, we propose a novel <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">predictive forwarding strategy</i> (PRFS) for V-NDN. In PRFS, long short-term memory (LSTM) is employed to amend the neighbor table (NBT) for preciser neighboring vehicles' positions. In addition, the next-hop forwarder is selected among the neighbors, taking into account the link reliability and the distance along the road (DR) in both directions. Furthermore, a new mechanism is designed to notify the selected next-hop forwarder by embedding the forwarder identity in the Interest packet header, so as to accelerate the forwarding process. Finally, extensive simulations are carried out, and experimental results demonstrate that PRFS can reduce the number of forwarded Interest packets and data packets by 21.29% and 25.75%, respectively, and improve the success ratio of satisfied Interest packets by 35.1% compared to the existing baseline algorithms."}}
{"id": "6SNMo8Ownj", "cdate": 1677628800000, "mdate": 1681700149844, "content": {"title": "Edge-Assisted Short Video Sharing With Guaranteed Quality-of-Experience", "abstract": "As a rising star of social apps, short video apps, e.g., TikTok, have attracted a large number of mobile users by providing fresh and short video contents that highly match their watching preferences. Meanwhile, the booming growth of short video apps imposes new technical challenges on the existing computation and communication infrastructure. Traditional solutions maintain all videos on the cloud and stream them to users via contend delivery networks or the Internet. However, they incur huge network traffic and long delay that seriously affects users’ watching experiences. In this article, we propose an edge-assisted short video sharing framework to address these challenges by caching some highly preferred videos at edge servers that can be accessed by users via high-speed network connections. Since edge servers have limited computation and storage resources, we design an online algorithm with provable approximation ratio to decide which videos should be cached at edge servers, without the knowledge of future network quality and watching preferences changes. Furthermore, we improve the performance by jointly considering video fetching and user-edge association. Extensive simulations are conducted to evaluate the proposed algorithms under various system settings, and the results show that our proposals outperform existing schemes."}}
{"id": "jeeVJ3C2Q_d", "cdate": 1675209600000, "mdate": 1681700150085, "content": {"title": "Conservative Novelty Synthesizing Network for Malware Recognition in an Open-Set Scenario", "abstract": "We study the challenging task of malware recognition on both known and novel unknown malware families, called malware open-set recognition (MOSR). Previous works usually assume the malware families are known to the classifier in a close-set scenario, i.e., testing families are the subset or at most identical to training families. However, novel unknown malware families frequently emerge in real-world applications, and as such, require recognizing malware instances in an open-set scenario, i.e., some unknown families are also included in the test set, which has been rarely and nonthoroughly investigated in the cyber-security domain. One practical solution for MOSR may consider jointly classifying known and detecting unknown malware families by a single classifier (e.g., neural network) from the variance of the predicted probability distribution on known families. However, conventional well-trained classifiers usually tend to obtain overly high recognition probabilities in the outputs, especially when the instance feature distributions are similar to each other, e.g., unknown versus known malware families, and thus, dramatically degrade the recognition on novel unknown malware families. To address the problem and construct an applicable MOSR system, we propose a novel model that can conservatively synthesize malware instances to mimic unknown malware families and support a more robust training of the classifier. More specifically, we build upon the generative adversarial networks to explore and obtain marginal malware instances that are close to known families while falling into mimical unknown ones to guide the classifier to lower and flatten the recognition probabilities of unknown families and relatively raise that of known ones to rectify the performance of classification and detection. A cooperative training scheme involving the classification, synthesizing and rectification are further constructed to facilitate the training and jointly improve the model performance. Moreover, we also build a new large-scale malware dataset, named MAL-100, to fill the gap of lacking a large open-set malware benchmark dataset. Experimental results on two widely used malware datasets and our MAL-100 demonstrate the effectiveness of our model compared with other representative methods."}}
{"id": "lStYbL1im", "cdate": 1672531200000, "mdate": 1681700149880, "content": {"title": "Data Quality-aware Mixed-precision Quantization via Hybrid Reinforcement Learning", "abstract": "Mixed-precision quantization mostly predetermines the model bit-width settings before actual training due to the non-differential bit-width sampling process, obtaining sub-optimal performance. Worse still, the conventional static quality-consistent training setting, i.e., all data is assumed to be of the same quality across training and inference, overlooks data quality changes in real-world applications which may lead to poor robustness of the quantized models. In this paper, we propose a novel Data Quality-aware Mixed-precision Quantization framework, dubbed DQMQ, to dynamically adapt quantization bit-widths to different data qualities. The adaption is based on a bit-width decision policy that can be learned jointly with the quantization training. Concretely, DQMQ is modeled as a hybrid reinforcement learning (RL) task that combines model-based policy optimization with supervised quantization training. By relaxing the discrete bit-width sampling to a continuous probability distribution that is encoded with few learnable parameters, DQMQ is differentiable and can be directly optimized end-to-end with a hybrid optimization target considering both task performance and quantization benefits. Trained on mixed-quality image datasets, DQMQ can implicitly select the most proper bit-width for each layer when facing uneven input qualities. Extensive experiments on various benchmark datasets and networks demonstrate the superiority of DQMQ against existing fixed/mixed-precision quantization methods."}}
{"id": "kpYlD85uey", "cdate": 1672531200000, "mdate": 1681700148919, "content": {"title": "Receive Only Necessary: Efficient Tag Category Identification in Large-Scale RFID Systems", "abstract": "RFID systems have been widely deployed for various applications such as inventory control, retail management, and object tracking. In many scenarios, coarse-grained system management of tag categories is more common than traditional system management of individual tags. Existing works on tag category management require knowing category IDs in advance, however, few protocols have been specially designed to obtain category IDs in multi-category RFID systems. In this paper, we propose <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">CIP</i> , a time-efficient protocol specially designed to collect category IDs in multi-category RFID systems. The challenge in solving this problem is to avoid repeatedly collecting category IDs from multiple tags belonging to the same category. We address this challenge by squeezing tags in the same category into the same time slot and letting them reply to the reader simultaneously. Considering that the reader may receive signals from different tags in a slot, we exploit the Manchester coding to decode the aggregated signals. With this design, CIP collects each category ID only once and thus achieves high time efficiency by avoiding redundant identification of the same category ID. We further enhance CIP by utilizing the lightweight vectors to specify the order of tags’ replying and avoid useless slots. Rigorous theoretical analysis is presented to optimize the performance of CIP and guidelines on how to set optimal parameters to minimize the overall execution time are given. We conduct extensive experiments to evaluate the performance of our protocols. The experimental results show that our protocols can significantly improve time efficiency by 67 percent when compared with the state-of-the-art solutions."}}
{"id": "a1Q-mOTcWeB", "cdate": 1672531200000, "mdate": 1667347927367, "content": {"title": "Energy inefficiency diagnosis for Android applications: a literature review", "abstract": "Android applications are becoming increasingly powerful in recent years. While their functionality is still of paramount importance to users, the energy efficiency of these applications is also gaining more and more attention. Researchers have discovered various types of energy defects in Android applications, which could quickly drain the battery power of mobile devices. Such defects not only cause inconvenience to users, but also frustrate Android developers as diagnosing the energy inefficiency of a software product is a non-trivial task. In this work, we perform a literature review to understand the state of the art of energy inefficiency diagnosis for Android applications. We identified 55 research papers published in recent years and classified existing studies from four different perspectives, including power estimation method, hardware component, types of energy defects, and program analysis approach. We also did a cross-perspective analysis to summarize and compare our studied techniques. We hope that our review can help structure and unify the literature and shed light on future research, as well as drawing developers’ attention to build energy-efficient Android applications."}}
