{"id": "uHHqtDM6S12", "cdate": 1640995200000, "mdate": 1683892187781, "content": {"title": "Efficient Analysis for Mitigation of Workload-Dependent Aging Degradation", "abstract": "The effect of negative bias temperature instability (NBTI) varies significantly according to given workloads. Finding a feasible worst case workload is difficult due to logical correlation within the logic circuit under consideration. In this article, we propose an NBTI-aware subset simulation (SS) framework that efficiently and accurately finds the failure probability covering various input duty cycles determined by different workloads. In addition, the proposed method is incorporated with the NBTI mitigation technique to facilitate workload-aware mitigation. Through numerical experiments using benchmark circuits, the proposed method achieves up to 36 times speedup compared to a naive Monte Carlo method. The NBTI mitigation based on SS demonstrates <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$1.78\\times $ </tex-math></inline-formula> better mitigation for multiple input duty cycles compared to the conventional method."}}
{"id": "qRRfGzWOzo", "cdate": 1640995200000, "mdate": 1683892187778, "content": {"title": "Oblivious Online Monitoring for Safety LTL Specification via Fully Homomorphic Encryption", "abstract": "In many Internet of Things (IoT) applications, data sensed by an IoT device are continuously sent to the server and monitored against a specification. Since the data often contain sensitive information, and the monitored specification is usually proprietary, both must be kept private from the other end. We propose a protocol to conduct oblivious online monitoring—online monitoring conducted without revealing the private information of each party to the other—against a safety LTL specification. In our protocol, we first convert a safety LTL formula into a DFA and conduct online monitoring with the DFA. Based on fully homomorphic encryption (FHE), we propose two online algorithms (Reverse and Block) to run a DFA obliviously. We prove the correctness and security of our entire protocol. We also show the scalability of our algorithms theoretically and empirically. Our case study shows that our algorithms are fast enough to monitor blood glucose levels online, demonstrating our protocol’s practical relevance."}}
{"id": "frFbpv7Od2l", "cdate": 1640995200000, "mdate": 1683892187821, "content": {"title": "Oblivious Online Monitoring for Safety LTL Specification via Fully Homomorphic Encryption", "abstract": "In many Internet of Things (IoT) applications, data sensed by an IoT device are continuously sent to the server and monitored against a specification. Since the data often contain sensitive information, and the monitored specification is usually proprietary, both must be kept private from the other end. We propose a protocol to conduct oblivious online monitoring -- online monitoring conducted without revealing the private information of each party to the other -- against a safety LTL specification. In our protocol, we first convert a safety LTL formula into a DFA and conduct online monitoring with the DFA. Based on fully homomorphic encryption (FHE), we propose two online algorithms (Reverse and Block) to run a DFA obliviously. We prove the correctness and security of our entire protocol. We also show the scalability of our algorithms theoretically and empirically. Our case study shows that our algorithms are fast enough to monitor blood glucose levels online, demonstrating our protocol's practical relevance."}}
{"id": "SjFEw3Ltcz", "cdate": 1640995200000, "mdate": 1683892187855, "content": {"title": "VisualNet: An End-to-End Human Visual System Inspired Framework to Reduce Inference Latency of Deep Neural Networks", "abstract": "Acceleration of deep neural network (DNN) inference has gained increasing attention recently with the wide adoption of DNNs for practical applications. For computer vision tasks where inputs are images, existing works mostly focus on improving the throughput of inference for multiple images. However, in many real-time applications, it is critical to reduce the latency of a single image inference, which is more complicated than improving the throughput because of the inherent data dependencies. On the other hand, from human brain's perspective, the complexity in our visual surroundings is first encoded as a pattern of light on a two dimensional array of photoreceptors, with little direct resemblance to the original input or the ultimate percept. Within just a few hundred microns of retinal thickness, this initial signal encoded by our photoreceptors must be transformed into an adequate representation of the entire visual scene. Inspired by how the retina helps human brain incept new information efficiently, we present an end-to-end structured framework built using any existing convolutional neural network (CNN) as the backbone. The proposed framework, called VisualNet, can create task parallelism for the backbone during the inference of a single image. Experiments using a number of neural networks for the ImageNet classification task and the CIFAR-10 classification task on GPUs and CPUs show that the proposed VisualNet reduces the latency of the regular network it builds on by up to 80.6% when both are fully parallelized with state-of-the-art acceleration libraries. At the same time, VisualNet can achieve similar or slightly higher accuracy."}}
{"id": "NvOt4PXizA", "cdate": 1640995200000, "mdate": 1683892187758, "content": {"title": "AxRLWE: A Multilevel Approximate Ring-LWE Co-Processor for Lightweight IoT Applications", "abstract": "This work presents a multilevel approximation exploration undertaken on the Ring-Learning-with-Errors (R-LWE)-based public-key cryptographic (PKC) schemes that belong to quantum-resilient cryptography algorithms. Among the various quantum-resilient cryptography schemes proposed in the currently running NIST’s post-quantum cryptography (PQC) standardization plan, the lattice-based learning-with-error (LWE) schemes have emerged as the most viable and preferred class for the Internet of Things (IoT) applications due to their compact area and memory footprint compared to other alternatives. However, compared to the classical schemes used today, R-LWE is much harder a challenge to fit on embedded IoT (end-node) devices, due to their stricter resource constraints (lower area, memory, and energy budgets) as well as their limited computational capabilities. To the best of our knowledge, this is the first endeavor exploring the inherent approximate nature of the LWE problem to undertake a multilevel approximate R-LWE (AxRLWE) architecture with respective security estimates opt for lightweight IoT devices. Undertaking AxRLWE on field-programmable gate arrays (FPGAs), we benchmarked a 64% area reduction cost compared to earlier accurate R-LWE designs at the cost of reduced quantum security. For the application-specific integrated circuits (ASICs) with 45-nm CMOS technology, AxRLWE was benchmarked to fit well within the same area budget of a lightweight ECC processor and consume a third of energy compared to special class of R-Binary LWE (R-BLWE) designs being proposed for an IoT, with a better security level."}}
{"id": "9iJBe8F4dQ", "cdate": 1640995200000, "mdate": 1683892187854, "content": {"title": "HEDA: Multi-Attribute Unbounded Aggregation over Homomorphically Encrypted Database", "abstract": ""}}
{"id": "7pkPrOeBQfS", "cdate": 1640995200000, "mdate": 1683892187819, "content": {"title": "Approximate Computing for Cryptography", "abstract": "Approximate computing enables construction of circuits that are faster and more compact and consume less power at the cost of accuracy of computation. Generally, it has been employed in a lot of error-tolerant applications such as image/multimedia signal processing, machine learning, etc., applications that allow accuracy degradation without quality degradation. But, approximation has also the potential being utilized to provide area and power efficient solutions in the domain of information security. This chapter will survey the practicality of deployment of approximate computing for the cryptographic primitives and applications along with the possible consequences on their correctness as well as security-level reduction."}}
{"id": "l19EYIS5zk", "cdate": 1609459200000, "mdate": 1683892187909, "content": {"title": "Automatic Parallelism Tuning for Module Learning with Errors Based Post-Quantum Key Exchanges on GPUs", "abstract": ""}}
{"id": "eF_WKflD0yw", "cdate": 1609459200000, "mdate": 1683892187896, "content": {"title": "APAS: Application-Specific Accelerators for RLWE-based Homomorphic Linear Transformations", "abstract": ""}}
{"id": "dtStQ2z4vRV", "cdate": 1609459200000, "mdate": 1683892187870, "content": {"title": "Clonable PUF: On the Design of PUFs That Share Equivalent Responses", "abstract": ""}}
