{"id": "tiSaTiycaip", "cdate": 1696012920635, "mdate": 1696012920635, "content": {"title": "Granger Causal Chain Discovery for Sepsis-Associated Derangements via Continuous-Time Hawkes Processes", "abstract": "Modern health care systems are conducting continuous, automated surveillance of the electronic medical record (EMR) to identify adverse events with increasing frequency; however, many events such as sepsis do not have elucidated prodromes (i.e., event chains) that can be used to identify and intercept the adverse event early in its course. Clinically relevant and interpretable results require a framework that can (i) infer temporal interactions across multiple patient features found in EMR data (e.g., Labs, vital signs, etc.) and (ii) identify patterns that precede and are specific to an impending adverse event (e.g., sepsis). In this work, we propose a linear multivariate Hawkes process model, coupled with ReLU link function, to recover a Granger Causal (GC) graph with both exciting and inhibiting effects. We develop a scalable two-phase gradient-based method to obtain a maximum surrogate-likelihood estimator, which is shown to be effective via extensive numerical simulation. Our method is subsequently extended to a data set of patients admitted to an academic level 1 trauma center located in the South Eastern United States, where the estimated GC graph identifies several highly interpretable chains that precede sepsis. Here, we demonstrate the effectiveness of our approach in learning a Granger Causal graph for Sepsis Associated Derangements (SADs), but it can be generalized to other applications with similar requirements."}}
{"id": "pcP6Cq4JX-3", "cdate": 1683901665701, "mdate": 1683901665701, "content": {"title": "Goodness-of-Fit Test for Mismatched Self-Exciting Processes", "abstract": "Recently there have been many research ef- forts in developing generative models for self- exciting point processes, partly due to their broad applicability for real-world applications. However, rarely can we quantify how well the generative model captures the nature or ground-truth since it is usually unknown. The challenge typically lies in the fact that the generative models typically provide, at most, good approximations to the ground- truth (e.g., through the rich representative power of neural networks), but they cannot be precisely the ground-truth. We thus can- not use the classic goodness-of-fit (GOF) test framework to evaluate their performance. In this paper, we develop a GOF test for genera- tive models of self-exciting processes by mak- ing a new connection to this problem with the classical statistical theory of Quasi-maximum- likelihood estimator (QMLE). We present a non-parametric self-normalizing statistic for the GOF test: the Generalized Score (GS) statistics, and explicitly capture the model misspecification when establishing the asymp- totic distribution of the GS statistic. Nu- merical simulation and real-data experiments validate our theory and demonstrate the pro- posed GS test’s good performance."}}
{"id": "J8PkOLxrrf", "cdate": 1620880404673, "mdate": null, "content": {"title": "Inferring serial correlation with dynamic backgrounds", "abstract": "Sequential data with serial correlation and an unknown, unstructured, and dynamic background is ubiquitous in neuroscience, psychology, and econometrics. Inferring serial correlation for such data is a fundamental challenge in statistics. We propose a total variation constrained least square estimator coupled with hypothesis tests to infer the serial correlation in the presence of unknown and unstructured dynamic background. The total variation constraint on the dynamic background encourages a piece-wise constant structure, which can approximate a wide range of dynamic backgrounds. The tuning parameter is selected via the Ljung-Box test to control the bias-variance trade-off. We establish a non-asymptotic upper bound for the estimation error through variational inequalities. We also derive a lower error bound via Fano's method and show the proposed method is near-optimal. Numerical simulation and a real study in psychology demonstrate the excellent performance of our proposed method compared with the state-of-the-art."}}
