{"id": "dff4bi7zCjR", "cdate": 1621446608146, "mdate": null, "content": {"title": "Dynamic Graph Learning: A Structure-Driven Approach", "abstract": "The purpose of this paper is to infer a dynamic graph as a global (collective) model of time-varying measurements at a set of network nodes. This model captures both pairwise as well as higher order interactions (i.e., more than two nodes) among the nodes. The motivation of this work lies in the search for a connectome model which properly captures brain functionality across all regions of the brain, and possibly at individual neurons. We formulate it as an optimization problem, a quadratic objective functional and tensor information of observed node signals over short time intervals. The proper regularization constraints reflect the graph smoothness and other dynamics involving the underlying graph’s Laplacian, as well as the time evolution smoothness of the underlying graph. The resulting joint optimization is solved by a continuous relaxation of the weight parameters and an introduced novel gradient-projection scheme. While the work may be applicable to any time-evolving data set (e.g., fMRI), we apply our algorithm to a real-world dataset comprising recorded activities of individual brain cells. The resulting model is shown to be not only viable but also efficiently computable."}}
{"id": "EY4DOEcUqzTh", "cdate": 1621446495622, "mdate": null, "content": {"title": "Mesoscale correlation structure with single cell resolution during visual coding", "abstract": "Neural circuitry represents sensory input with patterns of spiking activity. Across brain regions, initial representations are transformed to ultimately drive adaptive behavior. In mammalian neocortex, visual information is processed by primary visual cortex (V1) and multiple higher visual areas (HVAs). The interconnections of these brain regions, over which transformations can occur, span millimeters or more. Shared variability in spiking responses between neurons, called “noise correlations” (NCs), can be due to shared input and/or direct or indirect connectivity. Thus, NCs provide insight into the functional connectivity of neuronal circuits. In this study, we used subcellular resolution, mesoscale field-of-view two-photon calcium imaging to systematically characterize the NCs for pairs of layer 2/3 neurons across V1 and four HVAs (areas LM, LI, AL and PM) of mice. The average NCs for pairs of neurons within or across cortical areas were orders of magnitude larger than trial-shuffled control values. Within-area NCs declined with distance between neurons, but for inter-area NCs the distance-dependence was mixed. NCs were higher for neuron pairs with similar tuning (i.e., signal correlations). To explore tuning-specific NCs in finer detail, we used an unbiased clustering approach to classify neurons based on their responses to orientated gratings. This analysis revealed biases in the coverage of spatiotemporal frequency space across HVAs, and relationships between orientation tuning biases and spatiotemporal frequency preferences. Using the resulting functional groupings, we found group-specific within-area and inter-area patterns of NCs, indicating functionally-specific subnetworks. Overall, these results reveal new principles for the functional organization and correlation structure across multiple cortical areas, which can inform and constrain computational theories of cortical networks."}}
{"id": "bmdOC3EtDG-", "cdate": 1620665423488, "mdate": null, "content": {"title": "Mice use robust and common  strategies to discriminate natural  scenes", "abstract": "Mice use vision to navigate and avoid predators in natural environments. However, their visual systems are compact compared to other mammals, and it is unclear how well mice can discriminate ethologically relevant scenes. Here, we examined natural scene discrimination in mice using an automated touchscreen system. We estimated the discrimination difficulty using the computational metric structural similarity (SSIM), and constructed psychometric curves. However, the performance of each mouse was better predicted by the mean performance of other mice than SSIM. This high inter-mouse agreement indicates that mice use common and robust strategies to discriminate natural scenes. We tested several other image metrics to find an alternative to SSIM for predicting discrimination performance. We found that a simple, primary visual cortex (V1)-inspired model predicted mouse performance with fidelity approaching the inter-mouse agreement. The model involved convolving the images with Gabor filters, \nand its performance varied with the orientation of the Gabor filter. This orientation dependence was driven by the stimuli, rather than an innate biological feature. Together, these results indicate that mice are adept at discriminating natural scenes, and their performance is well predicted by simple models of V1 processing."}}
{"id": "5WYoEvZKTCd", "cdate": 1620662189390, "mdate": null, "content": {"title": "Stream-dependent development of higher visual  cortical areas", "abstract": "Multiple cortical areas contribute to visual processing in mice. However, the functional organization and development of higher \nvisual areas are unclear. Here we used intrinsic signal optical imaging and two-photon calcium imaging to map visual responses \nin adult and developing mice. We found that visually driven activity was well correlated among higher visual areas within two \ndistinct subnetworks resembling the dorsal and ventral visual streams. Visual response magnitude in dorsal stream areas slowly \nincreased over the first 2 weeks of visual experience. By contrast, ventral stream areas exhibited strong responses shortly after \neye opening. Neurons in a dorsal stream area showed little change in their tuning sharpness to oriented gratings while those in \na ventral stream area increased stimulus selectivity and expanded their receptive fields significantly. Together, these findings \nprovide a functional basis for grouping subnetworks of mouse visual areas and revealed stream differences in the development of \nreceptive field properties."}}
{"id": "8y-kHLwamfz", "cdate": 1620662136365, "mdate": null, "content": {"title": "Wide field-of-view, multi-region, two-photon imaging of  neuronal activity in the mammalian brain", "abstract": "Two-photon calcium imaging provides an optical readout of neuronal activity in populations of neurons with subcellular resolution. However, conventional two-photon imaging systems are limited in their field of view to ~1 mm2, precluding the visualization of multiple cortical areas simultaneously. Here, we demonstrate a two-photon microscope with an expanded field of view (>9.5 mm2) for rapidly reconfigurable simultaneous scanning of widely separated populations of neurons. We custom designed and assembled an optimized scan engine, objective, and two independently positionable, temporally multiplexed excitation pathways. We used this new microscope to measure activity correlations between two cortical visual areas in mice during visual processing."}}
{"id": "NSt0MbWa_KF", "cdate": 1620662027013, "mdate": null, "content": {"title": "Dendritic spikes enhance stimulus selectivity in cortical neurons in vivo", "abstract": "Neuronal dendrites are electrically excitable: they can generate regenerative events such as dendritic spikes in response to sufficiently strong synaptic input1–3. Although such events have been observed in many neuronal types 4–9, it is not well understood how active dendrites contribute to the tuning of neuronal output in vivo. Here we show that dendritic spikes increase the selectivity of neuronal responses to the orientation of a visual stimulus (orientation tuning). We performed direct patch-clamp recordings from the dendrites of pyramidal neurons in the primary visual cortex of lightly anaesthetized and awake mice, during sensory processing. Visual stimulation triggered regenerative local dendritic spikes that were distinct from back-propagating action potentials. These events were orientation tuned and were suppressed by either hyperpolarization of membrane potential or intracellular blockade of NMDA (N-methyl-D-aspartate) receptors. Both of these manipulations also decreased the selectivity of subthreshold orientation tuning measured at the soma, thus linking dendritic regenerative events to somatic orientation tuning. Together, our results suggest that dendritic spikes that are triggered by visual input contribute to a fundamental cortical\ncomputation: enhancing orientation selectivity in the visual cortex. Thus, dendritic excitability is an essential component of behaviourally relevant computations in neurons."}}
