{"id": "IqS2gqSFk1", "cdate": 1640995200000, "mdate": 1682498080014, "content": {"title": "Automatic assessment of Parkinson's patients' dyskinesia using non-invasive machine learning methods", "abstract": "Parkinson's disease is a serious neurodegenerative disorder that causes loss of control of physical movements. This disease is not curable, however its development can be limited, depending on its stages, mainly with medication and specifically with the use of levodopa. However, many times, patients not only experience the symptoms of the disease, but also the disorders caused by long-term administration of levodopa. The detection of various symptoms and disorders is based on the clinical examination of patients with their evaluation according to the UPDRS and UDysRS scales. Therefore, the present work aims to develop a system for the automatic assessment of levodopa-induced dyskinesia according to the UDysRS metric and the use of non-invasive machine learning methods. Video data are used and after the proper processing of the features resulting from their frames, enter a simple and at the same time efficient CNN to be evaluated with efficiency based on the six values of UDysRS."}}
{"id": "8lviQGTr3L", "cdate": 1640995200000, "mdate": 1682498080017, "content": {"title": "AI-MIA: COVID-19 Detection and Severity Analysis Through Medical Imaging", "abstract": "This paper presents the baseline approach for the organized 2nd Covid-19 Competition, occurring in the framework of the AIMIA Workshop in the European Conference on Computer Vision (ECCV 2022). It presents the COV19-CT-DB database which is annotated for COVID-19 detection, consisting of about 7,700 3-D CT scans. Part of the database consisting of Covid-19 cases is further annotated in terms of four Covid-19 severity conditions. We have split the database and the latter part of it in training, validation and test datasets. The former two datasets are used for training and validation of machine learning models, while the latter is used for evaluation of the developed models. The baseline approach consists of a deep learning approach, based on a CNN-RNN network and report its performance on the COVID19-CT-DB database. The paper presents the results of both Challenges organised in the framework of the Competition, also compared to the performance of the baseline scheme."}}
{"id": "AxJ9MENdhlr", "cdate": 1620491577093, "mdate": null, "content": {"title": "Introducing Routing Uncertainty in Capsule Networks", "abstract": "Rather than performing inefficient local iterative routing between adjacent capsule\nlayers, we propose an alternative global view based on representing the inherent uncertainty in part-object assignment. In our formulation, the local routing iterations\nare replaced with variational inference of part-object connections in a probabilistic\ncapsule network, leading to a significant speedup without sacrificing performance.\nIn this way, global context is also considered when routing capsules by introducing\nglobal latent variables that have direct influence on the objective function, and\nare updated discriminatively in accordance with the minimum description length\n(MDL) principle. We focus on enhancing capsule network properties, and perform a\nthorough evaluation on pose-aware tasks, observing improvements in performance\nover previous approaches whilst being more computationally efficient"}}
{"id": "vGeMKtHm93", "cdate": 1609459200000, "mdate": 1682498080184, "content": {"title": "MIA-COV19D: COVID-19 Detection through 3-D Chest CT Image Analysis", "abstract": "Early and reliable COVID-19 diagnosis based on chest 3-D CT scans can assist medical specialists in vital circumstances. Deep learning methodologies constitute a main approach for chest CT scan analysis and disease prediction. However, large annotated databases are necessary for developing deep learning models that are able to provide COVID-19 diagnosis across various medical environments in different countries. Due to privacy issues, publicly available COVID-19 CT datasets are highly difficult to obtain, which hinders the research and development of AI-enabled diagnosis methods of COVID-19 based on CT scans.In this paper we present the COV19-CT-DB database which is annotated for COVID-19, consisting of about 5,000 3-D CT scans, We have split the database in training, validation and test datasets. The former two datasets can be used for training and validation of machine learning models, while the latter will be used for evaluation of the developed models. We present a deep learning approach, based on a CNN-RNN network and report its performance on the COVID19-CT-DB database. Moreover, we present the results of all main techniques that were developed and used in the ICCV COV19D Competition."}}
{"id": "qTzY6FXb5r-", "cdate": 1609459200000, "mdate": null, "content": {"title": "An autoencoder wavelet based deep neural network with attention mechanism for multi-step prediction of plant growth", "abstract": "Multi-step-ahead prediction is considered of major significance for time series analysis in many real life problems. Existing methods mainly focus on one-step-ahead forecasting, since multiple step forecasting generally fails due to accumulation of prediction errors. This paper presents a novel approach for predicting plant growth in agriculture, focusing on prediction of plant Stem Diameter Variations (SDV). The proposed approach consists of three main steps. At first, wavelet decomposition is applied to the original data, so as to facilitate model fitting and reduce noise. Then an encoder-decoder framework is developed using Long Short Term Memory (LSTM) and used for appropriate feature extraction from the data. Finally, a recurrent neural network including LSTM and an attention mechanism is proposed for modelling long-term dependencies in the time series data. Experimental results are presented which illustrate the good performance of the proposed approach and that it significantly outperforms the existing models, in terms of error criteria such as RMSE, MAE and MAPE."}}
{"id": "c6sDEykxco", "cdate": 1609459200000, "mdate": 1682498080016, "content": {"title": "A novel computer vision-based data driven modelling approach for person specific fall detection", "abstract": "In this paper, we propose a novel person specific fall detection system based on a monocular camera, which can be applied for assisting the independent living of an older adult living alone at home. A single camera covering the living area is used for video recordings of an elderly person’s normal daily activities. From the recorded video data, the human silhouette regions in every frame are then extracted based on the codebook background subtraction technique. Low-dimensionality representative features of extracted silhouetted are then extracted by convolutional neural network-based autoencoder (CNN-AE). Features obtained from the CNN-AE are applied to construct an one class support vector machine (OCSVM) model, which is a data driven model based on the video recordings and can be applied for fall detection. From the comprehensive experimental evaluations on different people in a real home environment, it is shown that the proposed fall detection system can successfully detect different types of falls (falls towards different orientations at different positions in a real home environment) with small false alarms."}}
{"id": "Y_CFogcj_7", "cdate": 1609459200000, "mdate": 1682498080014, "content": {"title": "Extracting geographical characteristics about COVID-19 evolution worldwide using machine learning", "abstract": "Since the beginning of 2020, the whole world has been plagued by the coronavirus pandemic. During the last sixteen months, almost every country in the world has faced several epidemic waves. An intriguing question that arises is whether neighboring countries, similar in regard to their socioeconomic status and the restrictions employed to counter the spread of the virus, showcase similarities in their respective number of cases and deaths. To that end, in this paper we form three clusters of similar countries (European and USA, African-Asian and Latin American) and we use their cumulative data as training data for machine learning models (RNN family, TCN and Attention) that predict the respective cases and deaths of 4 fixed neighboring countries, namely Cyprus, Greece, Italy and Spain. The results of the experiments conducted show that these 4 countries accent bigger similarity with the European cluster, as expected. Thus, evidence is provided bolstering the claim that similar neighboring countries exhibit alike behavior regarding the repercussions of the COVID-19."}}
{"id": "RsfAqfnvYR", "cdate": 1609459200000, "mdate": 1682498080016, "content": {"title": "Effects of image quality and quantity on building a competitive COVID-19 diagnosis model", "abstract": "The outbreak of a health crisis, such as Covid-19, leads to decisions that must combine efficiency and speed. Often there is a trade-off between these two values, as the faster a decision is made, the less information is considered. This paper presents a deep learning model pipeline that balances these two values with the primary goal of classifying human lung X-rays into three categories: pneumonia, covid-19 and normal. Through this process, we tried to explore whether the quality of an image can enhance the learning process to a greater extent as opposed to having larger number of images. For this purpose, we follow two approaches by viewing quality and quantity as competing objectives to increasing the level of information obtained. The first is through increasing the number of X-ray images in the dataset, and the second is through improving the quality of the X-ray images. In the first approach, our goal is achieved using a Generative Adversarial Network (GAN) to generate plasmatic covid-19 class X-rays, while in the second approach, we improve the resolution of the X-ray images. To find the hyperparameters in both approaches that lead to better system performance, we exploit the Particle Swarm Optimization (PSO) algorithm. Rapid training and hyperparameter tuning better perform through this algorithm. Our experiments depict the performance that our models, based on the two approaches, achieved. Accuracy reaches 93% while sensitivity reaches 90% over Covid-19 cases. Finally, we conclude which characteristic, quality or quantity, is most useful in our case."}}
{"id": "QDdRZfCXqs", "cdate": 1609459200000, "mdate": 1682498080003, "content": {"title": "DeMoCap: Low-Cost Marker-Based Motion Capture", "abstract": "Optical marker-based motion capture (MoCap) remains the predominant way to acquire high-fidelity articulated body motions. We introduce DeMoCap, the first data-driven approach for end-to-end marker-based MoCap, using only a sparse setup of spatio-temporally aligned, consumer-grade infrared-depth cameras. Trading off some of their typical features, our approach is the sole robust option for far lower-cost marker-based MoCap than high-end solutions. We introduce an end-to-end differentiable markers-to-pose model to solve a set of challenges such as under-constrained position estimates, noisy input data and spatial configuration invariance. We simultaneously handle depth and marker detection noise, label and localize the markers, and estimate the 3D pose by introducing a novel spatial 3D coordinate regression technique under a multi-view rendering and supervision concept. DeMoCap is driven by a special dataset captured with 4 spatio-temporally aligned low-cost Intel RealSense D415 sensors and a 24 MXT40S camera professional MoCap system, used as input and ground truth, respectively."}}
{"id": "JVH23Fhaay", "cdate": 1609459200000, "mdate": 1682498080179, "content": {"title": "MIA-COV19D: COVID-19 Detection through 3-D Chest CT Image Analysis", "abstract": "Early and reliable COVID-19 diagnosis based on chest 3-D CT scans can assist medical specialists in vital circumstances. Deep learning methodologies constitute a main approach for chest CT scan analysis and disease prediction. However, large annotated databases are necessary for developing deep learning models that are able to provide COVID-19 diagnosis across various medical environments in different countries. Due to privacy issues, publicly available COVID-19 CT datasets are highly difficult to obtain, which hinders the research and development of AI-enabled diagnosis methods of COVID-19 based on CT scans. In this paper we present the COV19-CT-DB database which is annotated for COVID-19, consisting of about 5,000 3-D CT scans, We have split the database in training, validation and test datasets. The former two datasets can be used for training and validation of machine learning models, while the latter will be used for evaluation of the developed models. We also present a deep learning approach, based on a CNN-RNN network and report its performance on the COVID19-CT-DB database."}}
