{"id": "SKfoQgvkYY", "cdate": 1640995200000, "mdate": 1682669275125, "content": {"title": "Low-complexity scheduling algorithms with constant queue length and throughput guarantees", "abstract": ""}}
{"id": "KpBK53J5Bc", "cdate": 1609459200000, "mdate": 1682669275130, "content": {"title": "Graph Neural Network Based Scheduling: Improved Throughput Under a Generalized Interference Model", "abstract": "In this work, we propose a Graph Convolutional Neural Networks (GCN) based scheduling algorithm for adhoc networks. In particular, we consider a generalized interference model called the k-tolerant conflict graph model and design an efficient approximation for the well-known Max-Weight scheduling algorithm. A notable feature of this work is that the proposed method do not require labelled data set (NP-hard to compute) for training the neural network. Instead, we design a loss function that utilises the existing greedy approaches and trains a GCN that improves the performance of greedy approaches. Our extensive numerical experiments illustrate that using our GCN approach, we can significantly (4–20%) improve the performance of the conventional greedy approach."}}
{"id": "T_O6bdCx-oB", "cdate": 1514764800000, "mdate": null, "content": {"title": "Hierarchical scheduling algorithms with throughput guarantees and low delay", "abstract": "We propose distributed scheduling algorithms that guarantee a constant fraction of the maximum throughput for typical wireless topologies, and have O(1) delay and complexity in the network size. Our algorithms resolve collisions among pairs of conflicting nodes by assigning a master-slave hierarchy. When the master-slave hierarchy is chosen randomly, our algorithm matches the throughput performance of the maximal scheduling policies, with a complexity and delay that do not scale with network size. When the master-slave hierarchy is chosen based on the network topology, the throughput performance of our algorithm is characterized by a parameter of the conflict graph called the master-interference degree. For commonly used conflict graph topologies, our results lead to the best known throughput guarantees among the algorithms that have O(1) delay and complexity. Numerical results indicate that our algorithms out-perform the existing O(1) complexity algorithms like Q-CSMA."}}
{"id": "N--m8lftChZ", "cdate": 1514764800000, "mdate": 1623572123042, "content": {"title": "Efficient CSMA Using Regional Free Energy Approximations", "abstract": ""}}
{"id": "gOJKe6ogY9_", "cdate": 1483228800000, "mdate": 1623572123056, "content": {"title": "Efficient CSMA using Regional Free Energy Approximations", "abstract": "CSMA (Carrier Sense Multiple Access) algorithms based on Gibbs sampling can achieve throughput optimality if certain parameters called the fugacities are appropriately chosen. However, the problem of computing these fugacities is NP-hard. In this work, we derive estimates of the fugacities by using a framework called the regional free energy approximations. In particular, we derive explicit expressions for approximate fugacities corresponding to any feasible service rate vector. We further prove that our approximate fugacities are exact for the class of chordal graphs. A distinguishing feature of our work is that the regional approximations that we propose are tailored to conflict graphs with small cycles, which is a typical characteristic of wireless networks. Numerical results indicate that the fugacities obtained by the proposed method are quite accurate and significantly outperform the existing Bethe approximation based techniques."}}
{"id": "S8CJGIlweI", "cdate": 1483228800000, "mdate": 1623572123155, "content": {"title": "Adaptive CSMA Under the SINR Model: Efficient Approximation Algorithms for Throughput and Utility Maximization", "abstract": "We consider a carrier sense multiple access (CSMA)-based scheduling algorithm for a single-hop wireless network under a realistic signal-to-interference-plus-noise ratio model for the interference. We propose two local optimization-based approximation algorithms to efficiently estimate certain attempt rate parameters of CSMA called fugacities. It is known that adaptive CSMA can achieve throughput optimality by sampling feasible schedules from a Gibbs distribution, with appropriate fugacities. Unfortunately, obtaining these optimal fugacities is an NP-hard problem. Furthermore, the existing adaptive CSMA algorithms use a stochastic gradient descent-based method, which usually entails an impractically slow (exponential in the size of the network) convergence to the optimal fugacities. To address this issue, we first propose an algorithm to estimate the fugacities, that can support a given set of desired service rates. The convergence rate and the complexity of this algorithm are independent of the network size, and depend only on the neighborhood size of a link. Furthermore, we show that the proposed algorithm corresponds exactly to performing the well-known Bethe approximation to the underlying Gibbs distribution. Then, we propose another local algorithm to estimate the optimal fugacities under a utility maximization framework, and characterize its accuracy. Numerical results indicate that the proposed methods have a good degree of accuracy, and achieve extremely fast convergence to near-optimal fugacities, and often outperform the convergence rate of the stochastic gradient descent by a few orders of magnitude."}}
{"id": "_BmQMLuc27E", "cdate": 1451606400000, "mdate": 1623572123160, "content": {"title": "Adaptive CSMA under the SINR Model: Efficient Approximation Algorithms for Throughput and Utility Maximization", "abstract": "We consider a Carrier Sense Multiple Access (CSMA) based scheduling algorithm for a single-hop wireless network under a realistic Signal-to-interference-plus-noise ratio (SINR) model for the interference. We propose two local optimization based approximation algorithms to efficiently estimate certain attempt rate parameters of CSMA called fugacities. It is known that adaptive CSMA can achieve throughput optimality by sampling feasible schedules from a Gibbs distribution, with appropriate fugacities. Unfortunately, obtaining these optimal fugacities is an NP-hard problem. Further, the existing adaptive CSMA algorithms use a stochastic gradient descent based method, which usually entails an impractically slow (exponential in the size of the network) convergence to the optimal fugacities. To address this issue, we first propose an algorithm to estimate the fugacities, that can support a given set of desired service rates. The convergence rate and the complexity of this algorithm are independent of the network size, and depend only on the neighborhood size of a link. Further, we show that the proposed algorithm corresponds exactly to performing the well-known Bethe approximation to the underlying Gibbs distribution. Then, we propose another local algorithm to estimate the optimal fugacities under a utility maximization framework, and characterize its accuracy. Numerical results indicate that the proposed methods have a good degree of accuracy, and achieve extremely fast convergence to near-optimal fugacities, and often outperform the convergence rate of the stochastic gradient descent by a few orders of magnitude."}}
{"id": "fZfdwqkmQuY", "cdate": 1420070400000, "mdate": 1623572123665, "content": {"title": "Spatial CSMA: A distributed scheduling algorithm for the SIR model with time-varying channels", "abstract": "Recent work has shown that adaptive CSMA algorithms can achieve throughput optimality. However, these adaptive CSMA algorithms assume a rather simplistic model for the wireless medium. Specifically, the interference is typically modelled by a conflict graph, and the channels are assumed to be static. In this work, we propose a distributed and adaptive CSMA algorithm under a more realistic signal-to-interference ratio (SIR) based interference model, with time-varying channels. We prove that our algorithm is throughput optimal under this generalized model. Further, we augment our proposed algorithm by using a parallel update technique. Numerical results show that our algorithm outperforms the conflict graph based algorithms, in terms of supportable throughput and the rate of convergence to steady-state."}}
{"id": "FtjlOXchrh3", "cdate": 1420070400000, "mdate": 1623572123185, "content": {"title": "Adaptive CSMA under the SINR model: Fast convergence through local gibbs optimization", "abstract": "In this paper, we consider an adaptive CSMA based scheduling algorithm for a single-hop wireless network under a realistic SINR (signal-to-interference-plus-noise ratio) model for the interference, and propose an efficient local optimization based algorithm to estimate certain parameters of the algorithm called fugacities. It is known that adaptive CSMA based algorithms can achieve throughput optimality, by sampling feasible schedules from a Gibbs distribution with appropriate fugacities. Unfortunately, estimating the optimal fugacities for a desired service rate vector is an NP-hard problem. Further, the existing adaptive CSMA algorithms use a stochastic gradient descent based method, which usually entails an impractically slow (exponential in the size of the network) convergence to the optimal fugacities. In contrast, the convergence rate and the complexity of our algorithm is independent of the network size, and depends only on the neighborhood size of a link. In particular, in spatial networks where the neighborhood size does not scale with the network size, our algorithm is order optimal. We show that the proposed algorithm corresponds exactly to performing the well-known Bethe approximation to the underlying Gibbs distribution. We also consider two special cases of the SINR interference model and obtain the corresponding fugacities in closed form. Numerical results indicate that the proposed method achieves extremely fast convergence to near-optimal fugacities, and often outperforms the convergence rate of the stochastic gradient descent by a few orders of magnitude."}}
{"id": "1k3iSTkqKxV", "cdate": 1420070400000, "mdate": 1623572123163, "content": {"title": "Spatial CSMA: A Distributed Scheduling Algorithm for the SIR Model with Time-varying Channels", "abstract": "Recent work has shown that adaptive CSMA algorithms can achieve throughput optimality. However, these adaptive CSMA algorithms assume a rather simplistic model for the wireless medium. Specifically, the interference is typically modelled by a conflict graph, and the channels are assumed to be static. In this work, we propose a distributed and adaptive CSMA algorithm under a more realistic signal-to-interference ratio (SIR) based interference model, with time-varying channels. We prove that our algorithm is throughput optimal under this generalized model. Further, we augment our proposed algorithm by using a parallel update technique. Numerical results show that our algorithm outperforms the conflict graph based algorithms, in terms of supportable throughput and the rate of convergence to steady-state."}}
