{"id": "P0MBGkWuRTJ", "cdate": 1546300800000, "mdate": null, "content": {"title": "Hierarchical multi-armed bandits for discovering hidden populations", "abstract": "This paper proposes a novel algorithm to discover hidden individuals in a social network. The problem is increasingly important for social scientists as the populations (e.g., individuals with mental illness) that they study converse online. Since these populations do not use the category (e.g., mental illness) to self-describe, directly querying with text is non-trivial. To by-pass the limitations of network and query re-writing frameworks, we focus on identifying hidden populations through attributed search. We propose a hierarchical Multi-Arm Bandit (DT-TMP) sampler that uses a decision tree coupled with reinforcement learning to query the combinatorial attributed search space by exploring and expanding along high yielding decision-tree branches. A comprehensive set of experiments over a suite of twelve sampling tasks on three online web platforms, and three offline entity datasets reveals that DT-TMP outperforms all baseline samplers by upto a margin of 54% on Twitter and 48% on RateMDs. An extensive ablation study confirms DT-TMP's superior performance under different sampling scenarios."}}
{"id": "HJ4KHWb_-B", "cdate": 1546300800000, "mdate": null, "content": {"title": "Growing Attributed Networks through Local Processes", "abstract": "This paper proposes an attributed network growth model. Despite the knowledge that individuals use limited resources to form connections to similar others, we lack an understanding of how local and resource-constrained mechanisms explain the emergence of structural properties found in real-world networks. We make three contributions. First, we propose a simple and accurate model of attributed network growth that jointly explains the emergence of in-degree, local clustering, clustering-degree relationship and attribute mixing patterns. Second, we make use of biased random walks to develop a model that forms edges locally, without recourse to global information. Third, we account for multiple sociological phenomena: bounded rationality; structural constraints; triadic closure; attribute homophily; preferential attachment. Our experiments show that the proposed Attributed Random Walk (ARW) model accurately preserves network structure and attribute mixing patterns of real-world networks; it improves upon the performance of eight well-known models by a significant margin of 2.5-10 × ."}}
{"id": "CRuz0DX968X", "cdate": 1546300800000, "mdate": null, "content": {"title": "Mining Hidden Populations through Attributed Search", "abstract": "Researchers often query online social platforms through their application programming interfaces (API) to find target populations such as people with mental illness~\\cite{De-Choudhury2017} and jazz musicians~\\cite{heckathorn2001finding}. Entities of such target population satisfy a property that is typically identified using an oracle (human or a pre-trained classifier). When the property of the target entities is not directly queryable via the API, we refer to the property as `hidden' and the population as a hidden population. Finding individuals who belong to these populations on social networks is hard because they are non-queryable, and the sampler has to explore from a combinatorial query space within a finite budget limit. By exploiting the correlation between queryable attributes and the population of interest and by hierarchically ordering the query space, we propose a Decision tree-based Thompson sampler (\\texttt{DT-TMP}) that efficiently discovers the right combination of attributes to query. Our proposed sampler outperforms the state-of-the-art samplers in online experiments, for example by 54\\% on Twitter. When the number of matching entities to a query is known in offline experiments, \\texttt{DT-TMP} performs exceedingly well by a factor of 0.9-1.5$\\times$ over the baseline samplers. In the future, we wish to explore the option of finding hidden populations by formulating more complex queries."}}
{"id": "uuu-DiOF2ye", "cdate": 1483228800000, "mdate": null, "content": {"title": "Modeling Network Growth under Resource Constraints", "abstract": "This paper proposes an attributed network growth model. Despite the knowledge that individuals use limited resources to form connections to similar others, we lack an understanding of how local and resource-constrained mechanisms explain the emergence of rich structural properties found in real-world networks. We make three contributions. First, we propose a parsimonious and accurate model of attributed network growth that jointly explains the emergence of in-degree distributions, local clustering, clustering-degree relationship and attribute mixing patterns. Second, our model is based on biased random walks and uses local processes to form edges without recourse to global network information. Third, we account for multiple sociological phenomena: bounded rationality, structural constraints, triadic closure, attribute homophily, and preferential attachment. Our experiments indicate that the proposed Attributed Random Walk (ARW) model accurately preserves network structure and attribute mixing patterns of six real-world networks; it improves upon the performance of eight state-of-the-art models by a statistically significant margin of 2.5-10x."}}
{"id": "z1C3eYwkb8Y", "cdate": 1451606400000, "mdate": null, "content": {"title": "Task-driven sampling of attributed networks", "abstract": "This paper introduces new techniques for sampling attributed networks to support standard Data Mining tasks. The problem is important for two reasons. First, it is commonplace to perform data mining tasks such as clustering and classification of network attributes (attributes of the nodes, including social media posts). Furthermore, the extraordinarily large size of real-world networks necessitates that we work with a smaller graph sample. Second, while random sampling will provide an unbiased estimate of content, random access is often unavailable for many networks. Hence, network samplers such as Snowball sampling, Forest Fire, Random Walk, Metropolis-Hastings Random Walk are widely used; however, these attribute-agnostic samplers were designed to capture salient properties of network structure, not node content. The latter is critical for clustering and classification tasks. There are three contributions of this paper. First, we introduce several attribute-aware samplers based on Information Theoretic principles. Second, we prove that these samplers have a bias towards capturing new content, and are equivalent to uniform sampling in the limit. Finally, our experimental results over large real-world datasets and synthetic benchmarks are insightful: attribute-aware samplers outperform both random sampling and baseline attribute-agnostic samplers by a wide margin in clustering and classification tasks."}}
{"id": "qjfuCp8v90j", "cdate": 1451606400000, "mdate": null, "content": {"title": "GenPerm: A Unified Method for Detecting Non-Overlapping and Overlapping Communities", "abstract": "Detection of non-overlapping and overlapping communities are essentially the same problem. However, current algorithms focus either on finding overlapping or non-overlapping communities. We present a generalized framework that can identify both non-overlapping and overlapping communities, without any prior input about the network or its community distribution. To do so, we introduce a vertex-based metric, GenPerm, that quantifies by how much a vertex belongs to each of its constituent communities. Our community detection algorithm is based on maximizing the GenPerm over all the vertices in the network. We demonstrate, through experiments over synthetic and real-world networks, that GenPerm is more effective than other metrics in evaluating community structure. Further, we show that due to its vertex-centric property, GenPerm can be used to unfold several inferences beyond community detection, such as core-periphery analysis and message spreading. Our algorithm for maximizing GenPerm outperforms six state-of-the-art algorithms in accurately predicting the ground-truth labels. Finally, we discuss the problem of resolution limit in overlapping communities and demonstrate that maximizing GenPerm can mitigate this problem."}}
{"id": "em1I8rzh7U", "cdate": 1451606400000, "mdate": null, "content": {"title": "Sensitivity and reliability in incomplete networks: Centrality metrics to community scoring functions", "abstract": "In this paper we evaluate the effect of noise on community scoring and centrality-based parameters with respect to two different aspects of network analysis: (i) sensitivity, that is how the parameter value changes as edges are removed and (ii) reliability in the context of message spreading, that is how the time taken to broadcast a message changes as edges are removed. Our experiments on synthetic and real-world networks and three different noise models demonstrate that for both the aspects over all networks and all noise models, permanence qualifies as the most effective metric. For the sensitivity experiments closeness centrality is a close second. For the message spreading experiments, closeness and betweenness centrality based initiator selection closely competes with permanence. This is because permanence has a dual characteristic where the cumulative permanence over all vertices is sensitive to noise but the ids of the top-rank vertices, which are used to find seeds during message spreading remain relatively stable under noise."}}
{"id": "EZerSdTInVY", "cdate": 1451606400000, "mdate": null, "content": {"title": "GenPerm: A Unified Method for Detecting Non-overlapping and Overlapping Communities", "abstract": "Detection of non-overlapping and overlapping communities are essentially the same problem. However, current algorithms focus either on finding overlapping or non-overlapping communities. We present a generalized framework that can identify both non-overlapping and overlapping communities, without any prior input about the network or its community distribution. To do so, we introduce a vertex-based metric, GenPerm, that quantifies by how much a vertex belongs to each of its constituent communities. Our community detection algorithm is based on maximizing the GenPerm over all the vertices in the network. We demonstrate, through experiments over synthetic and real-world networks, that GenPerm is more effective than other metrics in evaluating community structure. Further, we show that due to its vertex-centric property, GenPerm can be used to unfold several inferences beyond community detection, such as core-periphery analysis and message spreading. Our algorithm for maximizing GenPerm outperforms six state-of-the-art algorithms in accurately predicting the ground-truth labels. Finally, we discuss the problem of resolution limit in overlapping communities and demonstrate that maximizing GenPerm can mitigate this problem."}}
{"id": "BlBYedzY-C", "cdate": 1451606400000, "mdate": null, "content": {"title": "Sensitivity and Reliability in Incomplete Networks: Centrality Metrics to Community Scoring Functions", "abstract": "Network analysis is an important tool in understanding the behavior of complex systems of interacting entities. However, due to the limitations of data gathering technologies, some interactions might be missing from the network model. This is a ubiquitous problem in all domains that use network analysis, from social networks to hyper-linked web networks to biological networks. Consequently, an important question in analyzing networks is to understand how increasing the noise level (i.e. percentage of missing edges) affects different network parameters. In this paper we evaluate the effect of noise on community scoring and centrality-based parameters with respect to two different aspects of network analysis: (i) sensitivity, that is how the parameter value changes as edges are removed and (ii) reliability in the context of message spreading, that is how the time taken to broadcast a message changes as edges are removed. Our experiments on synthetic and real-world networks and three different noise models demonstrate that for both the aspects over all networks and all noise models, permanence qualifies as the most effective metric. For the sensitivity experiments closeness centrality is a close second. For the message spreading experiments, closeness and betweenness centrality based initiator selection closely competes with permanence. This is because permanence has a dual characteristic where the cumulative permanence over all vertices is sensitive to noise but the ids of the top-rank vertices, which are used to find seeds during message spreading remain relatively stable under noise."}}
{"id": "dQFlJNPMqVE", "cdate": 1420070400000, "mdate": null, "content": {"title": "On the categorization of scientific citation profiles in computer sciences", "abstract": "A common consensus in the literature is that the citation profile of published articles in general follows a universal pattern - an initial growth in the number of citations within the first two to three years after publication followed by a steady peak of one to two years and then a final decline over the rest of the lifetime of the article. This observation has long been the underlying heuristic in determining major bibliometric factors such as the quality of a publication, the growth of scientific communities, impact factor of publication venues etc. In this paper, we gather and analyze a massive dataset of scientific papers from the computer science domain and notice that the citation count of the articles over the years follows a remarkably diverse set of patterns - a profile with an initial peak (PeakInit), with distinct multiple peaks (PeakMul), with a peak late in time (PeakLate), that is monotonically decreasing (MonDec), that is monotonically increasing (MonIncr) and that can not be categorized into any of the above (Oth). We conduct a thorough experiment to investigate several important characteristics of these categories such as how individual categories attract citations, how the categorization is influenced by the year and the venue of publication of papers, how each category is affected by self-citations, the stability of the categories over time, and how much each of these categories contribute to the core of the network. Further, we show that the traditional preferential attachment models fail to explain these citation profiles. Therefore, we propose a novel dynamic growth model that takes both the preferential attachment and the aging factor into account in order to replicate the real-world behavior of various citation profiles. We believe that this paper opens the scope for a serious re-investigation of the existing bibliometric indices for scientific research."}}
