{"id": "RTG9d8W4KYT", "cdate": 1672531200000, "mdate": 1680104302850, "content": {"title": "DualFair: Fair Representation Learning at Both Group and Individual Levels via Contrastive Self-supervision", "abstract": ""}}
{"id": "F4RNpByoqP", "cdate": 1664884606476, "mdate": null, "content": {"title": "Playgrounds for Abstraction and Reasoning", "abstract": "While research on reasoning using large models is in the spotlight, a symbolic method of making a compact model capable of reasoning is also attracting public attention. We introduce the Mini-ARC dataset, a 5x5 compact version of the Abstraction and Reasoning Corpus (ARC) to measure the abductive reasoning capability. The dataset is small but creative, which maintains the difficulty of the original dataset but improves usability for model training. Along with Mini-ARC, we introduce the O2ARC interface, which includes richer features for humans to solve the ARC tasks. By solving Mini-ARC with O2ARC, we collect human trajectories called Mini-ARC traces, which will be helpful in developing an AI with reasoning capability. Mini-ARC is available at https://bit.ly/Mini-ARC."}}
{"id": "xLJko2F5497", "cdate": 1640995200000, "mdate": 1675667037815, "content": {"title": "FedX: Unsupervised Federated Learning with Cross Knowledge Distillation", "abstract": "This paper presents FedX, an unsupervised federated learning framework. Our model learns unbiased representation from decentralized and heterogeneous local data. It employs a two-sided knowledge distillation with contrastive learning as a core component, allowing the federated system to function without requiring clients to share any data features. Furthermore, its adaptable architecture can be used as an add-on module for existing unsupervised algorithms in federated settings. Experiments show that our model improves performance significantly (1.58–5.52pp) on five unsupervised algorithms."}}
{"id": "huHnHiAvnx", "cdate": 1640995200000, "mdate": 1675667037804, "content": {"title": "FedX: Unsupervised Federated Learning with Cross Knowledge Distillation", "abstract": "This paper presents FedX, an unsupervised federated learning framework. Our model learns unbiased representation from decentralized and heterogeneous local data. It employs a two-sided knowledge distillation with contrastive learning as a core component, allowing the federated system to function without requiring clients to share any data features. Furthermore, its adaptable architecture can be used as an add-on module for existing unsupervised algorithms in federated settings. Experiments show that our model improves performance significantly (1.58--5.52pp) on five unsupervised algorithms."}}
{"id": "gqOZAI6G-b", "cdate": 1640995200000, "mdate": 1675667037802, "content": {"title": "Knowledge Sharing via Domain Adaptation in Customs Fraud Detection", "abstract": "Knowledge of the changing traffic is critical in risk management. Customs offices worldwide have traditionally relied on local resources to accumulate knowledge and detect tax fraud. This naturally poses countries with weak infrastructure to become tax havens of potentially illicit trades. The current paper proposes DAS, a memory bank platform to facilitate knowledge sharing across multi-national customs administrations to support each other. We propose a domain adaptation method to share transferable knowledge of frauds as prototypes while safeguarding the local trade information. Data encompassing over 8 million import declarations have been used to test the feasibility of this new system, which shows that participating countries may benefit up to 2-11 times in fraud detection with the help of shared knowledge. We discuss implications for substantial tax revenue potential and strengthened policy against illicit trades."}}
{"id": "NkMg9E3H47B", "cdate": 1640995200000, "mdate": 1680104302755, "content": {"title": "Customs Import Declaration Datasets", "abstract": ""}}
{"id": "GZIgMUzplOQ", "cdate": 1640995200000, "mdate": 1667503266782, "content": {"title": "Coherence-based Label Propagation over Time Series for Accelerated Active Learning", "abstract": "Time-series data are ubiquitous these days, but lack of the labels in time-series data is regarded as a hurdle for its broad applicability. Meanwhile, active learning has been successfully adopted to reduce the labeling efforts in various tasks. Thus, this paper addresses an important issue, time-series active learning. Inspired by the temporal coherence in time-series data, where consecutive data points tend to have the same label, our label propagation framework, called TCLP, automatically assigns a queried label to the data points within an accurately estimated time-series segment, thereby significantly boosting the impact of an individual query. Compared with traditional time-series active learning, TCLP is shown to improve the classification accuracy by up to 7.1 times when only 0.8% of data points in the entire time series are queried for their labels."}}
{"id": "9_dDyKnbQJ0", "cdate": 1640995200000, "mdate": 1675667037793, "content": {"title": "Knowledge Sharing via Domain Adaptation in Customs Fraud Detection", "abstract": "Knowledge of the changing traffic is critical in risk management. Customs offices worldwide have traditionally relied on local resources to accumulate such knowledge and detect tax frauds. This naturally poses countries with weak infrastructure to become tax havens of potentially illicit trades. The current paper proposes DAS, a memory bank platform to facilitate knowledge sharing across multi-national customs administrations to support each other. We propose a domain adaptation method to share transferable knowledge of frauds as prototypes while safeguarding the local trade information. Data encompassing over 8 million import declarations have been used to test the feasibility of this new system, which shows that participating countries may benefit up to 2-11 times in fraud detection with the help of shared knowledge. We discuss implications for substantial tax revenue potential and strengthened policy against illicit trades."}}
{"id": "gjNcH0hj0LM", "cdate": 1632875526761, "mdate": null, "content": {"title": "Coherence-based Label Propagation over Time Series for Accelerated Active Learning", "abstract": "Time-series data are ubiquitous these days, but lack of the labels in time-series data is regarded as a hurdle for its broad applicability. Meanwhile, active learning has been successfully adopted to reduce the labeling efforts in various tasks. Thus, this paper addresses an important issue, time-series active learning. Inspired by the temporal coherence in time-series data, where consecutive data points tend to have the same label, our label propagation framework, called TCLP, automatically assigns a queried label to the data points within an accurately estimated time-series segment, thereby significantly boosting the impact of an individual query. Compared with traditional time-series active learning, TCLP is shown to improve the classification accuracy by up to 7.1 times when only 0.8% of data points in the entire time series are queried for their labels."}}
{"id": "neCvi17Tfn", "cdate": 1609459200000, "mdate": 1680104303013, "content": {"title": "Responses to COVID-19 with Probabilistic Programming", "abstract": ""}}
