{"id": "vWhEwRemyo", "cdate": 1676893603673, "mdate": null, "content": {"title": "Mode Connections For Clinical Incremental Learning:Lessons From The COVID-19 Pandemic", "abstract": "Dynamic distribution shifts caused by evolving diseases and demographic changes require domain-incremental adaptation of clinical deep learning models. However, this process of adaptation is often accompanied by catastrophic forgetting, and even the most sophisticated methods are not good enough for clinical applications. This paper studies incremental learning from the perspective of mode connections, that is, the low-loss paths connecting the minimisers of neural architectures (modes or trained weights) in the parameter space. The paper argues for learning the low-loss paths originating from an existing mode and exploring the learned paths to find an acceptable mode for the new domain. The learned paths, and hence the new domain mode, are a function of the existing mode. As a result, unlike traditional incremental learning, the proposed approach is able to exploit information from a deployed model without changing its weights. Pre-COVID and COVID-19 data collected in Oxford University hospitals is used as a case study to demonstrate the need for domain-incremental learning and the advantages of the proposed approach.   "}}
{"id": "9c3ysZEU8md", "cdate": 1672531200000, "mdate": 1680512217718, "content": {"title": "Synthesizing Mixed-type Electronic Health Records using Diffusion Models", "abstract": ""}}
{"id": "o2TU_26dD-v", "cdate": 1640995200000, "mdate": 1682326330501, "content": {"title": "AI Assistants: A Framework for Semi-Automated Data Wrangling", "abstract": "Data wrangling tasks such as obtaining and linking data from various sources, transforming data formats, and correcting erroneous records, can constitute up to 80% of typical data engineering work. Despite the rise of machine learning and artificial intelligence, data wrangling remains a tedious and manual task. We introduce AI assistants, a class of semi-automatic interactive tools to streamline data wrangling. An AI assistant guides the analyst through a specific data wrangling task by recommending a suitable data transformation that respects the constraints obtained through interaction with the analyst. We formally define the structure of AI assistants and describe how existing tools that treat data cleaning as an optimization problem fit the definition. We implement AI assistants for four common data wrangling tasks and make AI assistants easily accessible to data analysts in an open-source notebook environment for data science, by leveraging the common structure they follow. We evaluate our AI assistants both quantitatively and qualitatively through three example scenarios. We show that the unified and interactive design makes it easy to perform tasks that would be difficult to do manually or with a fully automatic tool."}}
{"id": "IxkpvFVoAw", "cdate": 1640995200000, "mdate": 1682326330497, "content": {"title": "Mixture of Input-Output Hidden Markov Models for Heterogeneous Disease Progression Modeling", "abstract": "A particular challenge for disease progression modeling is the heterogeneity of a disease and its manifestations in the patients. Existing approaches often assume the presence of a single disease progression characteristics which is unlikely for neurodegenerative disorders such as Alzheimer's disease and Parkinson's disease. In this paper, we develop a hierarchical approach based on mixtures of hidden Markov models that can identify similar groups of patients through time-series clustering and separately represent the progression of each group, unlike hidden Markov models which assume that a single dynamics is shared among all patients. The proposed model is an extension of an input-output hidden Markov model that takes into account the clinical assessments of patients' health status and the prescribed medications. We illustrate the benefits of our approach using a synthetically generated dataset and a real-world longitudinal dataset for Parkinson's disease, obtained from the Parkinson's Progression Markers Initiative observational study. While the synthetic data experiments demonstrate the ability of mixture of personalized hidden Markov models to simultaneously learn personalized state effects and multiple disease progression dynamics when the true disease progression dynamics is known, real-data experiments show that a mixture of input-output hidden Markov models is favoured over an input-output hidden Markov model for disease progression modeling."}}
{"id": "y8VgGXMsVM", "cdate": 1609459200000, "mdate": 1682326330525, "content": {"title": "Identifying the Units of Measurement in Tabular Data", "abstract": "We consider the problem of identifying the units of measurement in a data column that contains both numeric values and unit symbols in each row, e.g., \"5.2 l\", \"7 pints\". In this case we seek to identify the dimension of the column (e.g. volume) and relate the unit symbols to valid units (e.g. litre, pint) obtained from a knowledge graph. Below we present PUC, a Probabilistic Unit Canonicalizer that can accurately identify the units of measurement, extract semantic descriptions of quantitative data columns and canonicalize their entries. We present the first messy real-world tabular datasets annotated for units of measurement, which can enable and accelerate the research in this area. Our experiments on these datasets show that PUC achieves better results than existing solutions."}}
{"id": "DQZwBx5JOUB", "cdate": 1609459200000, "mdate": 1682326330562, "content": {"title": "ptype-cat: Inferring the Type and Values of Categorical Variables", "abstract": "Type inference is the task of identifying the type of values in a data column and has been studied extensively in the literature. Most existing type inference methods support data types such as Boolean, date, float, integer and string. However, these methods do not consider non-Boolean categorical variables, where there are more than two possible values encoded by integers or strings. Therefore, such columns are annotated either as integer or string rather than categorical, and need to be transformed into categorical manually by the user. In this paper, we propose a probabilistic type inference method that can identify the general categorical data type (including non-Boolean variables). Additionally, we identify the possible values of each categorical variable by adapting the existing type inference method ptype. Combining these methods, we present ptype-cat which achieves better results than existing applicable solutions."}}
{"id": "VLwIG93XAt", "cdate": 1577836800000, "mdate": 1682326330575, "content": {"title": "ptype: probabilistic type inference", "abstract": ""}}
