{"id": "3KFiH8iAYf9", "cdate": 1594787016599, "mdate": null, "content": {"title": "Variational Bayesian Inference Algorithms for Infinite Relational Model of Network Data", "abstract": "Network data show the relationship among one kind of objects, such as social networks and hyperlinks on the Web. Many statistical models have been proposed for analyzing these data. For modeling cluster structures of networks, the infinite relational model (IRM) was proposed as a Bayesian nonparametric extension of the stochastic block model. In this brief, we derive the inference algorithms for the IRM of network data based on the variational Bayesian (VB) inference methods. After showing the standard VB inference, we derive the collapsed VB (CVB) inference and its variant called the zeroth-order CVB inference. We compared the performances of the inference algorithms using six real network datasets. The CVB inference outperformed the VB inference in most of the datasets, and the differences were especially larger in dense networks.\n"}}
{"id": "OblgrKVQarE", "cdate": 1594786785030, "mdate": null, "content": {"title": "Extracting Search Query Patterns via the Pairwise Coupled Topic Model", "abstract": "A fundamental yet new challenge in information retrieval is the identification of patterns behind search queries. For example, the query \"NY restaurant\" and \"boston hotel\" shares the common pattern \"LOCATION SERVICE\". However, because of the diversity of real queries, existing approaches require data preprocessing by humans or specifying the target query domains, which hinders their applicability.\nWe propose a probabilistic topic model that assumes that each term (e.g., \"NY\") has a topic (LOCATION). The key idea is that we consider topic co-occurrence in a query rather than a topic sequence, which significantly reduces computational cost yet enables us to acquire coherent topics without the preprocessing. Using two real query datasets, we demonstrate that the obtained topics are intelligible by humans, and are highly accurate in keyword prediction and query generation tasks."}}
{"id": "Ho8Zt0WxOpr", "cdate": 1546300800000, "mdate": null, "content": {"title": "Stochastic Submodular Maximization with Performance-Dependent Item Costs.", "abstract": "We formulate a new stochastic submodular maximization problem by introducing the performance-dependent costs of items. In this problem, we consider selecting items for the case where the performance of each item (i.e., how much an item contributes to the objective function) is decided randomly, and the cost of an item depends on its performance. The goal of the problem is to maximize the objective function subject to a budget constraint on the costs of the selected items. We present an adaptive algorithm for this problem with a theoretical guaran-√ tee that its expected objective value is at least (1−1/ 4 e)/2 times the maximum value attained by any adaptive algorithms. We verify the performance of the algorithm through numerical experiments."}}
{"id": "SybhgVfd-r", "cdate": 1451606400000, "mdate": null, "content": {"title": "Identifying Key Observers to Find Popular Information in Advance", "abstract": "Identifying soon-to-be-popular items in web services offers important benefits. We attempt to identify users who can find prospective popular items. Such visionary users are called observers. By adding observers to a favorite user list, they act to find popular items in advance. To identify efficient observers, we propose a feature selection based framework. This uses a classifier to predict item popularity, where the input features are a set of users who adopted an item before others. By training the classifier with sparse and non-negative constraints, observers are extracted as users whose parameters take a non-zero value. In experiments, we test our approach using real social bookmark datasets. The results demonstrate that our approach can find popular items in advance more effectively than baseline methods."}}
