{"id": "Z9OL1_9bYU", "cdate": 1672531200000, "mdate": 1692780030823, "content": {"title": "NLOS-NeuS: Non-line-of-sight Neural Implicit Surface", "abstract": "Non-line-of-sight (NLOS) imaging is conducted to infer invisible scenes from indirect light on visible objects. The neural transient field (NeTF) was proposed for representing scenes as neural radiance fields in NLOS scenes. We propose NLOS neural implicit surface (NLOS-NeuS), which extends the NeTF to neural implicit surfaces with a signed distance function (SDF) for reconstructing three-dimensional surfaces in NLOS scenes. We introduce two constraints as loss functions for correctly learning an SDF to avoid non-zero level-set surfaces. We also introduce a lower bound constraint of an SDF based on the geometry of the first-returning photons. The experimental results indicate that these constraints are essential for learning a correct SDF in NLOS scenes. Compared with previous methods with discretized representation, NLOS-NeuS with the neural continuous representation enables us to reconstruct smooth surfaces while preserving fine details in NLOS scenes. To the best of our knowledge, this is the first study on neural implicit surfaces with volume rendering in NLOS scenes."}}
{"id": "OLAd0ahjeJ", "cdate": 1668685469798, "mdate": 1668685469798, "content": {"title": "Time-of-flight imaging in fog using multiple time-gated exposures", "abstract": "We propose a time-of-flight measurement algorithm for depth and intensity that is robust to fog. The key idea of the algorithm is to compensate for the scattering effects of fog by using multiple time-gating and assigning one time-gated exposure for scattering property estimation. Once the property is estimated, the depth and intensity can be reconstructed from the rest of the exposures via a physics-based model. Several experiments with artificial fog show that our method can measure depth and intensity irrespective of the traits of the fog. We also confirm the effectiveness of our method in real fog through an outdoor experiment."}}
{"id": "mL3ErVYq7x", "cdate": 1640995200000, "mdate": 1667345972559, "content": {"title": "Eliminating Temporal Illumination Variations in Whisk-broom Hyperspectral Imaging", "abstract": "We propose a method for eliminating the temporal illumination variations in whisk-broom (point-scan) hyperspectral imaging. Whisk-broom scanning is useful for acquiring a spatial measurement using a pixel-based hyperspectral sensor. However, when it is applied to outdoor cultural heritages, temporal illumination variations become an issue due to the lengthy measurement time. As a result, the incoming illumination spectra vary across the measured image locations because different locations are measured at different times. To overcome this problem, in addition to the standard raster scan, we propose an additional perpendicular scan that traverses the raster scan. We show that this additional scan allows us to infer the illumination variations over the raster scan. Furthermore, the sparse structure in the illumination spectrum is exploited to robustly eliminate these variations. We quantitatively show that a hyperspectral image captured under sunlight is indeed affected by temporal illumination variations, that a Naïve mitigation method suffers from severe artifacts, and that the proposed method can robustly eliminate the illumination variations. Finally, we demonstrate the usefulness of the proposed method by capturing historic stained-glass windows of a French cathedral."}}
{"id": "1asqLijiNwE", "cdate": 1609459200000, "mdate": 1692780030697, "content": {"title": "Evaluating Registrations of Serial Sections With Distortions of the Ground Truths", "abstract": "Registration of histological serial sections is a challenging task. Serial sections exhibit distortions and damage from sectioning. Missing information on how the tissue looked before cutting makes a realistic validation of 2D registrations extremely difficult. This work proposes methods for ground-truth-based evaluation of registrations. Firstly, we present a methodology to generate test data for registrations. We distort an innately registered image stack in the manner similar to the cutting distortion of serial sections. Test cases are generated from existing 3D data sets, thus the ground truth is known. Secondly, our test case generation premises evaluation of the registrations with known ground truths. Our methodology for such an evaluation technique distinguishes this work from other approaches. Both under- and over-registration become evident in our evaluations. We also survey existing validation efforts. We present a full-series evaluation across six different registration methods applied to our distorted 3D data sets of animal lungs. Our distorted and ground truth data sets are made publicly available."}}
{"id": "_IlP30KWyY", "cdate": 1578477044848, "mdate": null, "content": {"title": "Regression of 3D Rigid Transformations on Real-Valued Vectors in Closed Form", "abstract": "In this paper, we present a regression for predict-ing 3D rigid transformations from real-valued vectors. We usea unit dual quaternion to represent the transformation. Theregression is formulated as blending unit dual quaternions. Toformulate it in a closed form, we introduce an approximationbased on error metrics according to geometric algebra. Finally,we take an articulated motion and an elastic deformation asexamples to present the descriptive power of our method inmodeling the motion and the deformation."}}
{"id": "jJ0QPgkbT", "cdate": 1578476846655, "mdate": null, "content": {"title": "Non-rigid registration of serial section images by blending transforms for 3D reconstruction", "abstract": "In this research, we propose a novel registration method for three-dimensional (3D) reconstruction from serial section images. 3D reconstructed data from serial section images provides structural information with high resolution. However, there are three problems in 3D reconstruction: non-rigid deformation, tissue discontinuity, and accumulation of scale change. To solve the non-rigid deformation, we propose a novel non-rigid registration method using blending rigid transforms. To avoid the tissue discontinuity, we propose a target image selection method using the criterion based on the blending of transforms. To solve the scale change of tissue, we propose a scale adjustment method using the tissue area before and after registration. The experimental results demonstrate that our method can represent non-rigid deformation with a small number of control points, and is robust to a variation in staining. The results also demonstrate that our target selection method avoids tissue discontinuity and our scale adjustment reduces scale change."}}
{"id": "v5Y6jfErpLK", "cdate": 1546300800000, "mdate": 1668041867266, "content": {"title": "Non-rigid registration of serial section images by blending transforms for 3D reconstruction", "abstract": ""}}
