{"id": "1ehuYMrigt", "cdate": 1663850265402, "mdate": null, "content": {"title": "Learning from Asymmetrically-corrupted Data in Regression for Sensor Magnitude", "abstract": "This paper addresses a regression problem in which output label values represent the results of sensing the magnitude of a phenomenon. A low value of such labels can either mean that the actual magnitude of the phenomenon has been low or that the sensor has made an incomplete observation. This leads to a bias toward lower values in labels and its resultant learning because labels for incomplete observations are recorded as lower than those for typical observations, even if both have monitored similar phenomena. Moreover, because an incomplete observation does not provide any tags indicating incompleteness, we cannot eliminate or impute them. To address this issue, we propose a learning algorithm that explicitly models the incomplete observations to be corrupted with an asymmetric noise that always has a negative value. We show that our algorithm is unbiased with a regression learned from the uncorrupted data that does not involve incomplete observations. We demonstrate the advantages of our algorithm through numerical experiments."}}
{"id": "zAuiZpZ478l", "cdate": 1652737651396, "mdate": null, "content": {"title": "Hierarchical Lattice Layer for Partially Monotone Neural Networks", "abstract": "Partially monotone regression is a regression analysis in which the target values are monotonically increasing with respect to a subset of input features.   The TensorFlow Lattice library is one of the standard machine learning libraries for partially monotone regression.  It consists of several neural network layers, and its core component is the lattice layer.  One of the problems of the lattice layer is that it requires the projected gradient descent algorithm with many constraints to train it.  Another problem is that it cannot receive a high-dimensional input vector due to the memory consumption.   We propose a novel neural network layer, the hierarchical lattice layer (HLL), as an extension of the lattice layer so that we can use a standard stochastic gradient descent algorithm to train HLL while satisfying monotonicity constraints and so that it can receive a high-dimensional input vector.  Our experiments demonstrate that HLL did not sacrifice its prediction performance on real datasets compared with the lattice layer."}}
{"id": "xJ9FbdGQp6N", "cdate": 1640995200000, "mdate": 1682317654216, "content": {"title": "Variational Inference for Discriminative Learning with Generative Modeling of Feature Incompletion", "abstract": "We are concerned with the problem of distributional prediction with incomplete features: The goal is to estimate the distribution of target variables given feature vectors with some of the elements..."}}
{"id": "K2aTIMSZ7I", "cdate": 1640995200000, "mdate": 1682317654115, "content": {"title": "Cumulative Stay-time Representation for Electronic Health Records in Medical Event Time Prediction", "abstract": "We address the problem of predicting when a disease will develop, i.e., medical event time (MET), from a patient's electronic health record (EHR). The MET of non-communicable diseases like diabetes is highly correlated to cumulative health conditions, more specifically, how much time the patient spent with specific health conditions in the past. The common time-series representation is indirect in extracting such information from EHR because it focuses on detailed dependencies between values in successive observations, not cumulative information. We propose a novel data representation for EHR called cumulative stay-time representation (CTR), which directly models such cumulative health conditions. We derive a trainable construction of CTR based on neural networks that has the flexibility to fit the target data and scalability to handle high-dimensional EHR. Numerical experiments using synthetic and real-world datasets demonstrate that CTR alone achieves a high prediction performance, and it enhances the performance of existing models when combined with them."}}
{"id": "B4ZLI2qjBq9", "cdate": 1640995200000, "mdate": 1682317654179, "content": {"title": "Cumulative Stay-time Representation for Electronic Health Records in Medical Event Time Prediction", "abstract": "We address the problem of predicting when a disease will develop, i.e., medical event time (MET), from a patient's electronic health record (EHR). The MET of non-communicable diseases like diabetes is highly correlated to cumulative health conditions, more specifically, how much time the patient spent with specific health conditions in the past. The common time-series representation is indirect in extracting such information from EHR because it focuses on detailed dependencies between values in successive observations, not cumulative information. We propose a novel data representation for EHR called cumulative stay-time representation (CTR), which directly models such cumulative health conditions. We derive a trainable construction of CTR based on neural networks that has the flexibility to fit the target data and scalability to handle high-dimensional EHR. Numerical experiments using synthetic and real-world datasets demonstrate that CTR alone achieves a high prediction performance, and it enhances the performance of existing models when combined with them."}}
{"id": "qnQN4yr6FJz", "cdate": 1632875615131, "mdate": null, "content": {"title": "Variational Inference for Discriminative Learning with Generative Modeling of Feature Incompletion", "abstract": "We are concerned with the problem of distributional prediction with incomplete features: The goal is to estimate the distribution of target variables given feature vectors with some of the elements missing. A typical approach to this problem is to perform missing-value imputation and regression, simultaneously or sequentially, which we call the generative approach. Another approach is to perform regression after appropriately encoding missing values into the feature, which we call the discriminative approach. In comparison, the generative approach is more robust to the feature corruption while the discriminative approach is more favorable to maximize the performance of prediction. \nIn this study, we propose a hybrid method to take the best of both worlds. Our method utilizes the black-box variational inference framework so that it can be applied to a wide variety of modern machine learning models, including the variational autoencoders. We also confirmed the effectiveness of the proposed method empirically.\n"}}
{"id": "6c6KZUdm1Nq", "cdate": 1601308388857, "mdate": null, "content": {"title": "Regression from Upper One-side Labeled Data", "abstract": "We address a regression problem from weakly labeled data that are correctly labeled only above a regression line, i.e., upper one-side labeled data.\nThe label values of the data are the results of sensing the magnitude of some phenomenon.\nIn this case, the labels often contain missing or incomplete observations whose values are lower than those of correct observations and are also usually lower than the regression line. It follows that data labeled with lower values than the estimations of a regression function (lower-side data) are mixed with data that should originally be labeled above the regression line (upper-side data).\nWhen such missing label observations are observed in a non-negligible amount, we thus should assume our lower-side data to be unlabeled data that are a mix of original upper- and lower-side data.\nWe formulate a regression problem from these upper-side labeled and lower-side unlabeled data. We then derive a learning algorithm in an unbiased and consistent manner to ordinary regression that is learned from data labeled correctly in both upper- and lower-side cases. Our key idea is that we can derive a gradient that requires only upper-side data and unlabeled data as the equivalent expression of that for ordinary regression. We additionally found that a specific class of losses enables us to learn unbiased solutions practically. In numerical experiments on synthetic and real-world datasets, we demonstrate the advantages of our algorithm."}}
{"id": "kTigSfJ_W3Q", "cdate": 1577836800000, "mdate": null, "content": {"title": "Learning to Estimate Driver Drowsiness from Car Acceleration Sensors using Weakly Labeled Data", "abstract": "This paper addresses the learning task of estimating driver drowsiness from the signals of car acceleration sensors. Since even drivers themselves cannot perceive their own drowsiness in a timely manner unless they use burdensome invasive sensors, obtaining labeled training data for each timestamp is not a realistic goal. To deal with this difficulty, we formulate the task as a weakly supervised learning. We only need to add labels for each complete trip, not for every timestamp independently. By assuming that some aspects of driver drowsiness increase over time due to tiredness, we formulate an algorithm that can learn from such weakly labeled data. We derive a scalable stochastic optimization method as a way of implementing the algorithm. Numerical experiments on real driving datasets demonstrate the advantages of our algorithm against baseline methods."}}
{"id": "e1ItiP-I5_", "cdate": 1577836800000, "mdate": null, "content": {"title": "Interpretation Method for Continuous Glucose Monitoring with Subsequence Time-Series Clustering", "abstract": "We propose mini-batch top-n k-medoids to sequential pattern mining to improve CGM interpretation. Mecical workers can treat specific patient groups better by understanding the time series variation of blood glucose results. For 10 years, continuous glucose monitoring (CGM) has provided time-series data of blood glucose thanks to the invention of devices with low measurement errors. We conducted two experiments. In the first experiment, we evaluated the proposed method with a manually created dataset and confirmed that the method provides more accurate patterns than other clustering methods. In the second experiment, we applied the proposed method to a CGM dataset consisting of real data from 163 patients. We created two labels based on blood glucose (BG) statistics and found patterns that correlated with a specific label in each case."}}
{"id": "Yn4JbbaFsS", "cdate": 1577836800000, "mdate": null, "content": {"title": "Feature Set for a Prediction Model of Diabetic Kidney Disease Progression", "abstract": "In this paper, we propose feature extraction method for prediction model for at the early stage of diabetic kidney disease (DKD) progression. DKD needs continuous treatment; however, a hospital visit interval of a patient at the early stage of DKD is normally from one month to three months, and this is not a short time period. Therefore it makes difficult to apply sophisticated approaches such as using convolutional neural networks because of the data limitation. The propose method uses with hierarchical clustering that can estimate a suitable interval for grouping inputted sequences. We evaluate the proposed method with a real-EMR dataset that consists of 30,810 patient records and conclude that the proposed method outperforms the baseline methods derived from related work."}}
