{"id": "U0YJIcPHFF", "cdate": 1577836800000, "mdate": 1682318245771, "content": {"title": "Weak approximation of transformed stochastic gradient MCMC", "abstract": "Stochastic gradient Langevin dynamics (SGLD) is a computationally efficient sampler for Bayesian posterior inference given a large scale dataset and a complex model. Although SGLD is designed for unbounded random variables, practical models often incorporate variables within a bounded domain, such as non-negative or a finite interval. The use of variable transformation is a typical way to handle such a bounded variable. This paper reveals that several mapping approaches commonly used in the literature produce erroneous samples from theoretical and empirical perspectives. We show that the change of random variable in discretization using an invertible Lipschitz mapping function overcomes the pitfall as well as attains the weak convergence, while the other methods are numerically unstable or cannot be justified theoretically. Experiments demonstrate its efficacy for widely-used models with bounded latent variables, including Bayesian non-negative matrix factorization and binary neural networks."}}
{"id": "wQXXpmEvm8r", "cdate": 1546300800000, "mdate": 1682318246242, "content": {"title": "On Transformations in Stochastic Gradient MCMC", "abstract": "Stochastic gradient Langevin dynamics (SGLD) is a computationally efficient sampler for Bayesian posterior inference given a large scale dataset. Although SGLD is designed for unbounded random variables, many practical models incorporate variables with boundaries such as non-negative ones or those in a finite interval. To bridge this gap, we consider mapping unbounded samples into the target interval. This paper reveals that several mapping approaches commonly used in the literature produces erroneous samples from theoretical and empirical perspectives. We show that the change of random variable using an invertible Lipschitz mapping function overcomes the pitfall as well as attains the weak convergence. Experiments demonstrate its efficacy for widely-used models with bounded latent variables including Bayesian non-negative matrix factorization and binary neural networks."}}
{"id": "w-LjpTyYel-", "cdate": 1546300800000, "mdate": null, "content": {"title": "Efficient Transfer Bayesian Optimization with Auxiliary Information", "abstract": "We propose an efficient transfer Bayesian optimization method, which finds the maximum of an expensive-to-evaluate black-box function by using data on related optimization tasks. Our method uses auxiliary information that represents the task characteristics to effectively transfer knowledge for estimating a distribution over target functions. In particular, we use a Gaussian process, in which the mean and covariance functions are modeled with neural networks that simultaneously take both the auxiliary information and feature vectors as input. With a neural network mean function, we can estimate the target function even without evaluations. By using the neural network covariance function, we can extract nonlinear correlation among feature vectors that are shared across related tasks. Our Gaussian process-based formulation not only enables an analytic calculation of the posterior distribution but also swiftly adapts the target function to observations. Our method is also advantageous because the computational costs scale linearly with the number of source tasks. Through experiments using a synthetic dataset and datasets for finding the optimal pedestrian traffic regulations and optimal machine learning algorithms, we demonstrate that our method identifies the optimal points with fewer target function evaluations than existing methods."}}
{"id": "PXtbYsnEXg", "cdate": 1546300800000, "mdate": null, "content": {"title": "Bayesian Optimization for Crowd Traffic Control Using Multi-Agent Simulation", "abstract": "A concentration of people attracted to urban areas or large events raises demand for crowd traffic control systems. Such systems need to achieve a collective control for dealing with the crowd interacting with each other, as well as a flexible control for managing the traffic depending on application scenarios such as swift passage on streets or safety-guaranteed traffic. This paper presents a Bayesian optimization (BO) approach using a multi-agent simulation for efficiently finding a control of traffic: the multi-agent simulation considers the interaction of people changing their routes for a collective control, whereas the black-box nature of BO is capable of replacing the optimization metric for different scenarios without algorithmic modification to achieve flexible traffic management. Experiments use two maps: synthetic grid-like streets and the Enoshima Coast firework festival site in Japan. In both cases, the results demonstrate that our traffic control is effective for optimizing various metrics such as an efficiency-oriented arrival rate, a safety-oriented low traffic rate, and their combination."}}
{"id": "jIiNMRmWXpI", "cdate": 1514764800000, "mdate": null, "content": {"title": "Finding Appropriate Traffic Regulations via Graph Convolutional Networks", "abstract": "Appropriate traffic regulations, e.g. planned road closure, are important in congested events. Crowd simulators have been used to find appropriate regulations by simulating multiple scenarios with different regulations. However, this approach requires multiple simulation runs, which are time-consuming. In this paper, we propose a method to learn a function that outputs regulation effects given the current traffic situation as inputs. If the function is learned using the training data of many simulation runs in advance, we can obtain an appropriate regulation efficiently by bypassing simulations for the current situation. We use the graph convolutional networks for modeling the function, which enable us to find regulations even for unseen areas. With the proposed method, we construct a graph for each area, where a node represents a road, and an edge represents the road connection. By running crowd simulations with various regulations on various areas, we generate traffic situations and regulation effects. The graph convolutional networks are trained to output the regulation effects given the graph with the traffic situation information as inputs. With experiments using real-world road networks and a crowd simulator, we demonstrate that the proposed method can find a road to close that reduces the average time needed to reach the destination."}}
{"id": "-UeaTneSh6", "cdate": 1514764800000, "mdate": 1682318245853, "content": {"title": "Incremental Environmental Monitoring for Revealing the Ecology of Endangered Fish", "abstract": ""}}
{"id": "SyN6fK-u-B", "cdate": 1483228800000, "mdate": null, "content": {"title": "Multi-output Polynomial Networks and Factorization Machines", "abstract": "Factorization machines and polynomial networks are supervised polynomial models based on an efficient low-rank decomposition. We extend these models to the multi-output setting, i.e., for learning vector-valued functions, with application to multi-class or multi-task problems. We cast this as the problem of learning a 3-way tensor whose slices share a common basis and propose a convex formulation of that problem. We then develop an efficient conditional gradient algorithm and prove its global convergence, despite the fact that it involves a non-convex basis selection step. On classification tasks, we show that our algorithm achieves excellent accuracy with much sparser models than existing methods. On recommendation system tasks, we show how to combine our algorithm with a reduction from ordinal regression to multi-output classification and show that the resulting algorithm outperforms simple baselines in terms of ranking accuracy."}}
{"id": "JLm7qplv7_", "cdate": 1483228800000, "mdate": 1682318245783, "content": {"title": "Multi-output Polynomial Networks and Factorization Machines", "abstract": "Factorization machines and polynomial networks are supervised polynomial models based on an efficient low-rank decomposition. We extend these models to the multi-output setting, i.e., for learning vector-valued functions, with application to multi-class or multi-task problems. We cast this as the problem of learning a 3-way tensor whose slices share a common basis and propose a convex formulation of that problem. We then develop an efficient conditional gradient algorithm and prove its global convergence, despite the fact that it involves a non-convex basis selection step. On classification tasks, we show that our algorithm achieves excellent accuracy with much sparser models than existing methods. On recommendation system tasks, we show how to combine our algorithm with a reduction from ordinal regression to multi-output classification and show that the resulting algorithm outperforms simple baselines in terms of ranking accuracy."}}
{"id": "2g-z3liWjUX", "cdate": 1483228800000, "mdate": 1682318246058, "content": {"title": "Size Effect on Call Properties of Japanese Tree Frogs Revealed by Audio-Processing Technique", "abstract": ""}}
{"id": "0GTPR-caRU", "cdate": 1483228800000, "mdate": 1682318245302, "content": {"title": "Swarm of Sound-to-Light Conversion Devices to Monitor Acoustic Communication Among Small Nocturnal Animals", "abstract": ""}}
