{"id": "HI9bSr9A9DS", "cdate": 1672531200000, "mdate": 1694146240026, "content": {"title": "StyleDiff: Attribute Comparison Between Unlabeled Datasets in Latent Disentangled Space", "abstract": "One major challenge in machine learning applications is coping with mismatches between the datasets used in the development and those obtained in real-world applications. These mismatches may lead to inaccurate predictions and errors, resulting in poor product quality and unreliable systems. In this study, we propose StyleDiff to inform developers of the differences between the two datasets for the steady development of machine learning systems. Using disentangled image spaces obtained from recently proposed generative models, StyleDiff compares the two datasets by focusing on attributes in the images and provides an easy-to-understand analysis of the differences between the datasets. The proposed StyleDiff performs in $O (d N\\log N)$, where $N$ is the size of the datasets and $d$ is the number of attributes, enabling the application to large datasets. We demonstrate that StyleDiff accurately detects differences between datasets and presents them in an understandable format using, for example, driving scenes datasets."}}
{"id": "GJQjadJaE1W", "cdate": 1672531200000, "mdate": 1694146239869, "content": {"title": "Supervised Contrastive Learning with Heterogeneous Similarity for Distribution Shifts", "abstract": "Distribution shifts are problems where the distribution of data changes between training and testing, which can significantly degrade the performance of a model deployed in the real world. Recent studies suggest that one reason for the degradation is a type of overfitting, and that proper regularization can mitigate the degradation, especially when using highly representative models such as neural networks. In this paper, we propose a new regularization using the supervised contrastive learning to prevent such overfitting and to train models that do not degrade their performance under the distribution shifts. We extend the cosine similarity in contrastive loss to a more general similarity measure and propose to use different parameters in the measure when comparing a sample to a positive or negative example, which is analytically shown to act as a kind of margin in contrastive loss. Experiments on benchmark datasets that emulate distribution shifts, including subpopulation shift and domain generalization, demonstrate the advantage of the proposed method over existing regularization methods."}}
{"id": "pxUcgIQbUXN", "cdate": 1609459200000, "mdate": 1694146240025, "content": {"title": "Understanding the Reason for Misclassification by Generating Counterfactual Images", "abstract": "Explainable AI (XAI) methods contribute to understanding the behavior of deep neural networks (DNNs), and have attracted interest recently. For example, in image classification tasks, attribution maps have been used to indicate the pixels of an input image that are important to the output decision. Oftentimes, however, it is difficult to understand the reason for misclassification only from a single attribution map. In this paper, in order to enhance the information related to the reason for misclassification, we propose to generate several counterfactual images using generative adversarial networks (GANs). We empirically show that these counterfactual images and their attribution maps improve the interpretability of misclassified images. Furthermore, we additionally propose to generate transitional images by gradually changing the configurations of a GAN in order to understand clearly which part of the misclassified image cause the misclassification."}}
{"id": "peEM6wNeS0", "cdate": 1609459200000, "mdate": 1694146239870, "content": {"title": "Finding Misdetections in Unlabeled Image Database: Toward Reliable Object Detection", "abstract": "Object detection from images plays an important role in ITS applications, such as autonomous-driving systems. A concern for recent object detection models based on neural networks is the black box nature of the neural networks, which should be addressed in mission critical ITS applications. In this paper, we propose a framework of partial image retrieval to analyze and debug a target detection model. Given an image with incorrectly detected objects, our method discovers similar images that also contain incorrectly detected objects from a large unlabeled image database, which is relatively easier to collect than annotating all images. These similar images provide us with insights into the misdetection by object detection models, which will be useful in resolving the issue. We qualitatively and quantitatively demonstrate that the proposed framework effectively outputs similar doubtful images using real-world datasets. Specifically, we show that, by querying an image with a false positive detection, we can efficiently find images with false positives from a large unlabeled image database using the proposed framework."}}
{"id": "eZl3GtzgJI", "cdate": 1577836800000, "mdate": null, "content": {"title": "Neural Time Warping For Multiple Sequence Alignment", "abstract": "Multiple sequences alignment (MSA) is a traditional and challenging task for time-series analyses. The MSA problem is formulated as a discrete optimization problem and is typically solved by dynamic programming. However, the computational complexity increases exponentially with respect to the number of input sequences. In this paper, we propose neural time warping (NTW) that relaxes the original MSA to a continuous optimization and obtains the alignments using a neural network. The solution obtained by NTW is guaranteed to be a feasible solution for the original discrete optimization problem under mild conditions. Our experimental results show that NTW successfully aligns a hundred time-series and significantly outperforms existing methods for solving the MSA problem. In addition, we show a method for obtaining average time-series data as one of applications of NTW. Compared to the existing barycenters, the mean time series data retains the features of the input time-series data."}}
{"id": "S2NjkoVqMCw", "cdate": 1577836800000, "mdate": null, "content": {"title": "Learning Wasserstein Isometric Embedding for Point Clouds", "abstract": "The Wasserstein distance has been employed for determining the distance between point clouds, which have variable numbers of points and invariance of point order. However, the high computational cost associated with the Wasserstein distance hinders its practical applications for large-scale datasets. We propose a new embedding method for point clouds, which aims to embed point clouds into a Euclidean space, isometric to the Wasserstein space defined on the point clouds. In numerical experiments, we demonstrate that the point clouds decoded from the Euclidean averages and the interpolations in the embedding space accurately mimic the Wasserstein barycenters and interpolations of the point clouds. Furthermore, we show that the embedding vectors can be utilized as inputs for machine learning models (e.g., principal component analysis and neural networks)."}}
{"id": "JRQ6S0CUXRx", "cdate": 1577836800000, "mdate": null, "content": {"title": "Neural Time Warping for Multiple Sequence Alignment", "abstract": "Multiple sequence alignment (MSA) is a traditional and still challenging task for time-series analyses. The MSA problem is intrinsically a discrete optimization and, in principle, dynamic programming is available for solving MSA. However, the computation complexity of such algorithms increases exponentially with the number of sequences to be aligned. In this paper, we propose neural time warping (NTW) that relaxes the original MSA to a continuous optimization, in which a neural network is used to model the alignment. We show that the solution of NTW is guaranteed to be a feasible solution of the original discrete problem under mild conditions. Our experimental results suggest that NTW successfully aligns a hundred sequences and significantly outperforms existing methods for solving the MSA problem."}}
{"id": "wz2Ad7e-JO8", "cdate": 1546300800000, "mdate": null, "content": {"title": "Canonical Soft Time Warping", "abstract": "Alignment of two given sequences (i.e., computing correspondence between frames considering local time shifting) is a fundamental operation for various applications such as computer vision and bioi..."}}
{"id": "Xobpx5eDV8C", "cdate": 1546300800000, "mdate": null, "content": {"title": "Linearly Constrained Weights: Reducing Activation Shift for Faster Training of Neural Networks", "abstract": "In this paper, we first identify activation shift, a simple but remarkable phenomenon in a neural network in which the preactivation value of a neuron has non-zero mean that depends on the angle between the weight vector of the neuron and the mean of the activation vector in the previous layer. We then propose linearly constrained weights (LCW) to reduce the activation shift in both fully connected and convolutional layers. The impact of reducing the activation shift in a neural network is studied from the perspective of how the variance of variables in the network changes through layer operations in both forward and backward chains. We also discuss its relationship to the vanishing gradient problem. Experimental results show that LCW enables a deep feedforward network with sigmoid activation functions to be trained efficiently by resolving the vanishing gradient problem. Moreover, combined with batch normalization, LCW improves generalization performance of both feedforward and convolutional networks."}}
{"id": "J4ljDOhBB-", "cdate": 1546300800000, "mdate": null, "content": {"title": "Flow-based Image-to-Image Translation with Feature Disentanglement", "abstract": "Learning non-deterministic dynamics and intrinsic factors from images obtained through physical experiments is at the intersection of machine learning and material science. Disentangling the origins of uncertainties involved in microstructure growth, for example, is of great interest because future states vary due to thermal fluctuation and other environmental factors. To this end we propose a flow-based image-to-image model, called Flow U-Net with Squeeze modules (FUNS), that allows us to disentangle the features while retaining the ability to generate highquality diverse images from condition images. Our model successfully captures probabilistic phenomena by incorporating a U-Net-like architecture into the flowbased model. In addition, our model automatically separates the diversity of target images into condition-dependent/independent parts. We demonstrate that the quality and diversity of the images generated for microstructure growth and CelebA datasets outperform existing variational generative models."}}
