{"id": "zzHv0w-epzv", "cdate": 1640995200000, "mdate": 1681714762359, "content": {"title": "Variable Depth Bayesian Neural Networks Using Reversible Jumps", "abstract": "Bayesian approaches to Neural Architecture Search (NAS) offer several benefits when compared to typical grid-search methods. Marginalization of a joint posterior distribution of network parameters as well as network architecture specification allows for a principled analysis of predictive and model uncertainty. In this paper, we propose a method of applying Reversible Jump Markov Chain Monte Carlo (RJMCMC) as inference over a distribution of neural network depths. We refer to these models as Reversible Jump Bayesian Neural Networks (RJBNN), and show that a tenable acceptance probability for across-dimension proposals can be achieved through the use of a composite sampler featuring the Hamiltonian Monte Carlo (HMC) based No U-Turn Sampler (NUTS) algorithm. We compare the results of an RJBNN model with standard Bayesian Neural Networks (BNN) of comparable architecture sizes on a regression task for the Boston Housing dataset."}}
{"id": "3gPwKz5swm", "cdate": 1640995200000, "mdate": 1681714762366, "content": {"title": "Simpler is Better: Spectral Regularization and Up-Sampling Techniques for Variational Autoencoders", "abstract": "Full characterization of the spectral behavior of generative models based on neural networks remains an open issue. Recent research has focused heavily on generative adversarial networks and the high-frequency discrepancies between real and generated images. The current solution to avoid this is to either replace transposed convolutions with bilinear up-sampling or add a spectral regularization term in the generator. We propose a 2D Fourier transform-based spectral regularization loss and evaluate it on the variational autoencoder. We show that it can achieve results equal to, or better than, the current state-of-the-art in frequency-aware losses for generative models. In addition, we experiment with altering the up-sampling procedure in the generator network and investigate how it influences the spectral performance of the model. We include experiments on synthetic and real data sets to demonstrate our results."}}
{"id": "gkyN4pL5suz", "cdate": 1609459200000, "mdate": 1634043731874, "content": {"title": "Instance Segmentation of Microscopic Foraminifera", "abstract": "Foraminifera are single-celled marine organisms that construct shells that remain as fossils in the marine sediments. Classifying and counting these fossils are important in e.g. paleo-oceanographic and -climatological research. However, the identification and counting process has been performed manually since the 1800s and is laborious and time-consuming. In this work, we present a deep learning-based instance segmentation model for classifying, detecting, and segmenting microscopic foraminifera. Our model is based on the Mask R-CNN architecture, using model weight parameters that have learned on the COCO detection dataset. We use a fine-tuning approach to adapt the parameters on a novel object detection dataset of more than 7000 microscopic foraminifera and sediment grains. The model achieves a (COCO-style) average precision of $0.78 \\pm 0.00$ on the classification and detection task, and $0.80 \\pm 0.00$ on the segmentation task. When the model is evaluated without challenging sediment grain images, the average precision for both tasks increases to $0.84 \\pm 0.00$ and $0.86 \\pm 0.00$, respectively. Prediction results are analyzed both quantitatively and qualitatively and discussed. Based on our findings we propose several directions for future work, and conclude that our proposed model is an important step towards automating the identification and counting of microscopic foraminifera."}}
{"id": "azT72_mlXX", "cdate": 1577836800000, "mdate": 1634043731873, "content": {"title": "Towards detection and classification of microscopic foraminifera using transfer learning", "abstract": "Foraminifera are single-celled marine organisms, which may have a planktic or benthic lifestyle. During their life cycle they construct shells consisting of one or more chambers, and these shells remain as fossils in marine sediments. Classifying and counting these fossils have become an important tool in e.g. oceanography and climatology. Currently the process of identifying and counting microfossils is performed manually using a microscope and is very time consuming. Developing methods to automate this process is therefore considered important across a range of research fields. The first steps towards developing a deep learning model that can detect and classify microscopic foraminifera are proposed. The proposed model is based on a VGG16 model that has been pretrained on the ImageNet dataset, and adapted to the foraminifera task using transfer learning. Additionally, a novel image dataset consisting of microscopic foraminifera and sediments from the Barents Sea region is introduced."}}
