{"id": "ELeN3b1a7h", "cdate": 1580917895662, "mdate": null, "content": {"title": "Robust Synthesis of Adversarial Visual Examples Using a Deep Image Prior", "abstract": "We present a novel method for generating robust adversarial image examples building upon the recent ‘deep image prior’ (DIP) that exploits convolutional network architectures to enforce plausible texture in image synthesis. Adversarial images are commonly generated by perturbing images to introduce high frequency noise that induces image misclassification, but that is fragile to subsequent digital manipulation of the image. We show that using DIP to reconstruct an image under adversarial constraint induces perturbations that are more robust to affine deformation, whilst remaining visually imperceptible. Furthermore we show that our DIP approach can also be adapted to produce local adversarial patches (‘adversarial stickers’). We demonstrate robust adversarial examples over a broad gamut of images and object classes drawn from the ImageNet dataset."}}
{"id": "1XJwGrjCIL_", "cdate": 1577836800000, "mdate": 1633011897682, "content": {"title": "Vax-a-Net: Training-Time Defence Against Adversarial Patch Attacks", "abstract": "We present Vax-a-Net; a technique for immunizing convolutional neural networks (CNNs) against adversarial patch attacks (APAs). APAs insert visually overt, local regions (patches) into an image to induce misclassification. We introduce a conditional Generative Adversarial Network (GAN) architecture that simultaneously learns to synthesise patches for use in APAs, whilst exploiting those attacks to adapt a pre-trained target CNN to reduce its susceptibility to them. This approach enables resilience against APAs to be conferred to pre-trained models, which would be impractical with conventional adversarial training due to the slow convergence of APA methods. We demonstrate transferability of this protection to defend against existing APAs, and show its efficacy across several contemporary CNN architectures."}}
{"id": "_WZOrC07EfK", "cdate": 1546300800000, "mdate": 1633011897735, "content": {"title": "Robust Synthesis of Adversarial Visual Examples Using a Deep Image Prior", "abstract": ""}}
