{"id": "1F2wJE2zJWN", "cdate": 1680307200000, "mdate": 1683810200024, "content": {"title": "Efficient SAV Algorithms for Curvature Minimization Problems", "abstract": "The curvature regularization method is well-known for its good geometric interpretability and strong priors in the continuity of edges, which has been applied to various image processing tasks. However, due to the non-convex, non-smooth, and highly non-linear intrinsic limitations, most existing algorithms lack a convergence guarantee. This paper proposes an efficient yet accurate scalar auxiliary variable (SAV) scheme for solving both mean curvature and Gaussian curvature minimization problems. The SAV-based algorithms are shown unconditionally energy diminishing, fast convergent, and very easy to be implemented for different image applications. Numerical experiments on noise removal, image deblurring, and single image super-resolution are presented on both gray and color image datasets to demonstrate the robustness and efficiency of our method. Source codes are made publicly available at <uri xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">https://github.com/Duanlab123/SAV-curvature</uri> ."}}
{"id": "aKcCqmgqheV", "cdate": 1677628800000, "mdate": 1678435056312, "content": {"title": "Deep Generative Mixture Model for Robust Imbalance Classification", "abstract": ""}}
{"id": "vE4gYZ9ubba", "cdate": 1672531200000, "mdate": 1683810200025, "content": {"title": "Gradient Prior Dilated Convolution Network for Remote Sensing Image Super-Resolution", "abstract": "Super-resolution (SR) aims to recover a high-resolution image from a single or multiple low-resolution images, compensating for the limitations of satellite sensor imaging. Deep convolutional neural networks have made great achievement in remote sensing image SR. In this article, we propose a novel gradient prior dilated convolutional network (GPDCN) for remote sensing image SR, which obtains contextual spatial connections and alleviates structural distortions. The GPDCN comprises a multiscale feature extraction network and a feature reconstruction network. The former employs a double-path dilated residual block with dilation convolution to increase a receptive field, a global self-attention module to detect long-range reliance among image patches, and a gradient propagation network to extract high-level gradient information. The latter uses the mixed high-order attention module to reconstruct the feature by collecting the high-order characteristics of multiple frequency bands. Experiments with the Massachusetts_Roads and 3K VEHICLE_SR datasets demonstrate that the GPDCN outperforms recent techniques concerning both quantitative and qualitative measures."}}
{"id": "q8ZaMJR65Z9", "cdate": 1672531200000, "mdate": 1683810200251, "content": {"title": "Recognizable Information Bottleneck", "abstract": "Information Bottlenecks (IBs) learn representations that generalize to unseen data by information compression. However, existing IBs are practically unable to guarantee generalization in real-world scenarios due to the vacuous generalization bound. The recent PAC-Bayes IB uses information complexity instead of information compression to establish a connection with the mutual information generalization bound. However, it requires the computation of expensive second-order curvature, which hinders its practical application. In this paper, we establish the connection between the recognizability of representations and the recent functional conditional mutual information (f-CMI) generalization bound, which is significantly easier to estimate. On this basis we propose a Recognizable Information Bottleneck (RIB) which regularizes the recognizability of representations through a recognizability critic optimized by density ratio matching under the Bregman divergence. Extensive experiments on several commonly used datasets demonstrate the effectiveness of the proposed method in regularizing the model and estimating the generalization gap."}}
{"id": "oGkqMu6eQJv", "cdate": 1672531200000, "mdate": 1681650972487, "content": {"title": "Randomly Projected Convex Clustering Model: Motivation, Realization, and Cluster Recovery Guarantees", "abstract": ""}}
{"id": "bq43ihiPRK", "cdate": 1672531200000, "mdate": 1681650972182, "content": {"title": "Hierarchical Perception Adversarial Learning Framework for Compressed Sensing MRI", "abstract": ""}}
{"id": "bdHMmqEt_zq", "cdate": 1672531200000, "mdate": 1681650971979, "content": {"title": "Adaptive weighted curvature-based active contour for ultrasonic and 3T/5T MR image segmentation", "abstract": ""}}
{"id": "_Jq475NNrSx", "cdate": 1672531200000, "mdate": 1681650972132, "content": {"title": "Towards NeuroAI: Introducing Neuronal Diversity into Artificial Neural Networks", "abstract": ""}}
{"id": "OHo06bN0L-S", "cdate": 1672531200000, "mdate": 1681650972027, "content": {"title": "ACTIVE: A Deep Model for Sperm and Impurity Detection in Microscopic Videos", "abstract": ""}}
{"id": "EockDaLdJ_R", "cdate": 1672531200000, "mdate": 1683810200124, "content": {"title": "CTCNet: A CNN-Transformer Cooperation Network for Face Image Super-Resolution", "abstract": "Recently, deep convolution neural networks (CNNs) steered face super-resolution methods have achieved great progress in restoring degraded facial details by joint training with facial priors. However, these methods have some obvious limitations. On the one hand, multi-task joint learning requires additional marking on the dataset, and the introduced prior network will significantly increase the computational cost of the model. On the other hand, the limited receptive field of CNN will reduce the fidelity and naturalness of the reconstructed facial images, resulting in suboptimal reconstructed images. In this work, we propose an efficient CNN-Transformer Cooperation Network (CTCNet) for face super-resolution tasks, which uses the multi-scale connected encoder-decoder architecture as the backbone. Specifically, we first devise a novel Local-Global Feature Cooperation Module (LGCM), which is composed of a Facial Structure Attention Unit (FSAU) and a Transformer block, to promote the consistency of local facial detail and global facial structure restoration simultaneously. Then, we design an efficient Feature Refinement Module (FRM) to enhance the encoded features. Finally, to further improve the restoration of fine facial details, we present a Multi-scale Feature Fusion Unit (MFFU) to adaptively fuse the features from different stages in the encoder procedure. Extensive evaluations on various datasets have assessed that the proposed CTCNet can outperform other state-of-the-art methods significantly. Source code will be available at <uri xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">https://github.com/IVIPLab/CTCNet</uri> ."}}
