{"id": "gOp6ecbMCSQ", "cdate": 1685577600000, "mdate": 1700125681368, "content": {"title": "Trifocal Relative Pose From Lines at Points", "abstract": "We present a method for solving two minimal problems for relative camera pose estimation from three views, which are based on three view correspondences of ( <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">i</i> ) three points and one line and the novel case of ( <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">ii</i> ) three points and two lines through two of the points. These problems are too difficult to be efficiently solved by the state of the art Gröbner basis methods. Our method is based on a new efficient homotopy continuation (HC) solver framework MINUS, which dramatically speeds up previous <sc xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">HC</small> solving by specializing <sc xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">hc</small> methods to generic cases of our problems. We characterize their number of solutions and show with simulated experiments that our solvers are numerically robust and stable under image noise, a key contribution given the borderline intractable degree of nonlinearity of trinocular constraints. We show in real experiments that ( <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">i</i> ) <sc xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">sift</small> feature location and orientation provide good enough point-and-line correspondences for three-view reconstruction and ( <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">ii</i> ) that we can solve difficult cases with too few or too noisy tentative matches, where the state of the art structure from motion initialization fails."}}
{"id": "barcUepY-nH", "cdate": 1672531200000, "mdate": 1668616906580, "content": {"title": "Signatures of algebraic curves via numerical algebraic geometry", "abstract": ""}}
{"id": "9umrrqbjW-", "cdate": 1672531200000, "mdate": 1700125681427, "content": {"title": "Using monodromy to recover symmetries of polynomial systems", "abstract": "Galois/monodromy groups attached to parametric systems of polynomial equations provide a method for detecting the existence of symmetries in solution sets. Beyond the question of existence, one would like to compute formulas for these symmetries, towards the eventual goal of solving the systems more efficiently. We describe and implement one possible approach to this task using numerical homotopy continuation and multivariate rational function interpolation. We illustrate our methods on several examples, including two cases with nonlinear symmetries which appear in applications from computer vision and robotics."}}
{"id": "4C3xcBGMyE", "cdate": 1672531200000, "mdate": 1700125681391, "content": {"title": "SubalgebraBases in Macaulay2", "abstract": "We describe a recently revived version of the software package SubalgberaBases, which is distributed in the Macaulay2 computer algebra system. The package allows the user to compute and manipulate subagebra bases -- which are also known as SAGBI bases or canonical bases and form a special class of Khovanskii bases -- for polynomial rings and their quotients. We provide an overview of the design and functionality of SubalgberaBases and demonstrate how the package works on several motivating examples."}}
{"id": "0_NtGIDVIG", "cdate": 1672531200000, "mdate": 1700125681426, "content": {"title": "Algebra and Geometry of Camera Resectioning", "abstract": "We study algebraic varieties associated with the camera resectioning problem. We characterize these resectioning varieties' multigraded vanishing ideals using Gr\\\"obner basis techniques. As an application, we derive and re-interpret celebrated results in geometric computer vision related to camera-point duality. We also clarify some relationships between the classical problems of optimal resectioning and triangulation, state a conjectural formula for the Euclidean distance degree of the resectioning variety, and discuss how this conjecture relates to the recently-resolved multiview conjecture."}}
{"id": "Ioiu83odLjm", "cdate": 1646092800000, "mdate": 1700125681450, "content": {"title": "Galois/Monodromy Groups for Decomposing Minimal Problems in 3D Reconstruction", "abstract": "We consider Galois/monodromy groups arising in computer vision applications, with a view toward building more efficient polynomial solvers. The Galois/monodromy group allows us to decide when a given problem decomposes into algebraic subproblems, and whether or not it has any symmetries. Tools from numerical algebraic geometry and computational group theory allow us to apply this framework to classical and novel reconstruction problems. We consider three classical cases—three-point absolute pose, five-point relative pose, and four-point homography estimation for calibrated cameras—where the decomposition and symmetries may be naturally understood in terms of the Galois/monodromy group. We then show how our framework can be applied to novel problems from absolute and relative pose estimation. For instance, we discover new symmetries for absolute pose problems involving mixtures of point and line features. We also describe a problem of estimating a pair of calibrated homographies between three images. For this problem of degree 64, we can reduce the degree to 16, the latter better reflecting the intrinsic difficulty of algebraically solving the problem. As a byproduct, we obtain new constraints on compatible homographies, which may be of independent interest."}}
{"id": "v5vykMeGMu", "cdate": 1640995200000, "mdate": 1668616906645, "content": {"title": "An Atlas for the Pinhole Camera", "abstract": "We introduce an atlas of algebro-geometric objects associated with image formation in pinhole cameras. The nodes of the atlas are algebraic varieties or their vanishing ideals related to each other by projection or elimination and restriction or specialization respectively. This atlas offers a unifying framework for the study of problems in 3D computer vision. We initiate the study of the atlas by completely characterizing a part of the atlas stemming from the triangulation problem. We conclude with several open problems and generalizations of the atlas."}}
{"id": "tOGAh82E7nY", "cdate": 1640995200000, "mdate": 1668616906610, "content": {"title": "u-generation: solving systems of polynomials equation-by-equation", "abstract": "We develop a new method that improves the efficiency of equation-by-equation algorithms for solving polynomial systems. Our method is based on a novel geometric construction, and reduces the total number of homotopy paths that must be numerically continued. These improvements may be applied to the basic algorithms of numerical algebraic geometry in the settings of both projective and multiprojective varieties. Our computational experiments demonstrate significant savings obtained on several benchmark systems. We also present an extended case study on maximum likelihood estimation for rank-constrained symmetric $n\\times n$ matrices, in which multiprojective $u$-generation allows us to complete the list of ML degrees for $n\\le 6.$"}}
{"id": "kyc0dHaHRZ", "cdate": 1640995200000, "mdate": 1668616906669, "content": {"title": "Learning to Solve Hard Minimal Problems", "abstract": "We present an approach to solving hard geometric optimization problems in the RANSAC framework. The hard minimal problems arise from relaxing the original geometric optimization problem into a minimal problem with many spurious solutions. Our approach avoids computing large numbers of spurious solutions. We design a learning strategy for selecting a starting problem-solution pair that can be numerically continued to the problem and the solution of interest. We demonstrate our approach by developing a RANSAC solver for the problem of computing the relative pose of three calibrated cameras, via a minimal relaxation using four points in each view. On average, we can solve a single problem in under <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$70\\ \\mu s$</tex> . We also benchmark and study our engineering choices on the very familiar problem of computing the relative pose of two calibrated cameras, via the minimal case of five points in two views."}}
{"id": "RDZfupWVeCI", "cdate": 1640995200000, "mdate": 1668616906634, "content": {"title": "Certification for polynomial systems via square subsystems", "abstract": ""}}
