{"id": "VDFBdG-LyYV", "cdate": 1649254410387, "mdate": 1649254410387, "content": {"title": "Predicting Instance Type Assertions in Knowledge Graphs Using Stochastic Neural Networks", "abstract": "Instance type information is particularly relevant to perform reasoning and obtain further information about entities in knowledge graphs (KGs). However, during automated or pay-as-you-go KG construction processes, instance types might be incomplete or missing in some entities. Previous work focused mostly on representing entities and relations as embeddings based on the statements in the KG. While the computed embeddings encode semantic descriptions and preserve the relationship between the entities, the focus of these methods is often not on predicting schema knowledge, but on predicting missing statements between instances for completing the KG. To fill this gap, we propose an approach that first learns a KG representation suitable for predicting instance type assertions. Then, our solution implements a neural network architecture to predict instance types based on the learned representation. Results show that our representations of entities are much more separable with respect to their associations with classes in the KG, compared to existing methods. For this reason, the performance of predicting instance types on a large number of KGs, in particular on cross-domain KGs with a high variety of classes, is significantly better in terms of F1-score than previous work."}}
{"id": "w-_mupbia08", "cdate": 1649254337127, "mdate": 1649254337127, "content": {"title": "Evidential Relational-Graph Convolutional Networks for Entity Classification in Knowledge Graphs", "abstract": "Despite the vast amount of information encoded in knowledge graphs, they often remain incomplete. Neural networks, in particular Graph Convolutional Neural Networks, have been shown to be effective predictors to complete information about the class affiliation of entities in knowledge graphs. However, these models remain ignorant to their predictions confidence due to their used point estimate of a softmax output. In this paper, we combine Graph Convolutional Neural Networks with recent developments in the field of Evidential Learning by placing a Dirichlet distribution on the class probabilities to overcome this problem. We use the continuous output of a Graph Convolutional Neural Network as parameters for a Dirichlet distribution. In this way, the predictions of the model are represented as a distribution over possible softmax outputs, rather than a point estimate of a softmax output. The experiments show that a better performance in predicting class affiliations can be achieved compared to recent models. In addition, the experiments show that this approach overcomes the well-known problem of overconfident prediction of deterministic neural networks."}}
{"id": "ry-9RZ-dZH", "cdate": 1514764800000, "mdate": null, "content": {"title": "Compromised Account Detection Based on Clickstream Data", "abstract": "The number of users of the world wide web is constantly increasing. However, this also increases the risks. There is the possibility that other users illegally gain access to a users' account of social networks, web shops or other web services. Previous work use graph-based methods to identify hijacked or compromised accounts. Most often posts are used in social networks to detect fraudulences. However, not every compromised account is used to spread propaganda information or phishing attacks. Therefore, we restrict ourselves to the clickstreams from the accounts. In order to identify compromised accounts by means of clickstreams, we will also consider a temporal aspect, since the preferences of a user change over time. We choose a hybrid approach consisting of methods from subsymbolic and symbolic AI to detect fraudulences in clickstreams. We will also take into account the experience of domain experts. Our approach can also be used to identify not only compromised accounts but also shared accounts on instance streaming sites."}}
{"id": "rybS3eZuWH", "cdate": 1451606400000, "mdate": null, "content": {"title": "Capturing and Annotating Processes using a Collaborative Platform", "abstract": "Existing standards in capturing processes concentrate on client tools. Furthermore, semantic information are often available that cannot be captured in a structured way with the proposed standard formats. In addition, processes are usually used and maintained by multiple persons. Therefore, a collaborative platform to discuss and share information about processes is valuable. In order to address the challenge of maintaining and sharing knowledge about processes, we provide a tool to capture and annotate processes using Semantic MediaWiki as a collaborative platform. We demonstrate the practical applicability of our tool by presenting a demo available in the World Wide Web."}}
{"id": "r1W0xGbu-B", "cdate": 1451606400000, "mdate": null, "content": {"title": "Towards a Collaborative Process Platform: Publishing Processes according to the Linked Data Principles", "abstract": ""}}
