{"id": "yTXtUSV-gk4", "cdate": 1621630135934, "mdate": null, "content": {"title": "Ising Model Selection Using $\\ell_{1}$-Regularized Linear Regression: A Statistical Mechanics Analysis", "abstract": "We theoretically analyze the typical learning performance of $\\ell_{1}$-regularized linear regression ($\\ell_1$-LinR) for Ising model selection using the replica method from statistical mechanics. For typical random regular graphs in the paramagnetic phase, an accurate estimate of the typical sample complexity of $\\ell_1$-LinR is obtained.   Remarkably, despite the model misspecification, $\\ell_1$-LinR is model selection consistent with the same order of sample complexity as $\\ell_{1}$-regularized logistic regression ($\\ell_1$-LogR), i.e., $M=\\mathcal{O}\\left(\\log N\\right)$,  where $N$ is the number of variables of the Ising model. Moreover, we provide an efficient method to accurately predict the non-asymptotic behavior of $\\ell_1$-LinR for moderate $M, N$, such as precision and recall. Simulations show a fairly good agreement between theoretical predictions and experimental results, even for graphs with many loops, which supports our findings. Although this paper mainly focuses on $\\ell_1$-LinR, our method is readily applicable for precisely characterizing the typical learning performances of a wide class of  $\\ell_{1}$-regularized $M$-estimators including $\\ell_1$-LogR and interaction screening. "}}
{"id": "SkEeo_W_-B", "cdate": 1514764800000, "mdate": null, "content": {"title": "Objective and efficient inference for couplings in neuronal networks", "abstract": "Inferring directional couplings from the spike data of networks is desired in various scientific fields such as neuroscience. Here, we apply a recently proposed objective procedure to the spike data obtained from the Hodgkin-Huxley type models and in vitro neuronal networks cultured in a circular structure. As a result, we succeed in reconstructing synaptic connections accurately from the evoked activity as well as the spontaneous one. To obtain the results, we invent an analytic formula approximately implementing a method of screening relevant couplings. This significantly reduces the computational cost of the screening method employed in the proposed objective procedure, making it possible to treat large-size systems as in this study."}}
{"id": "H1-aRUZ_-H", "cdate": 1514764800000, "mdate": null, "content": {"title": "Mean-field theory of graph neural networks in graph partitioning", "abstract": "A theoretical performance analysis of the graph neural network (GNN) is presented. For classification tasks, the neural network approach has the advantage in terms of flexibility that it can be employed in a data-driven manner, whereas Bayesian inference requires the assumption of a specific model. A fundamental question is then whether GNN has a high accuracy in addition to this flexibility. Moreover, whether the achieved performance is predominately a result of the backpropagation or the architecture itself is a matter of considerable interest. To gain a better insight into these questions, a mean-field theory of a minimal GNN architecture is developed for the graph partitioning problem. This demonstrates a good agreement with numerical experiments."}}
