{"id": "PPcilSk8PE", "cdate": 1680307200000, "mdate": 1696539005944, "content": {"title": "Deep Reinforcement Learning-Based Approach for Efficient and Reliable Droplet Routing on MEDA Biochips", "abstract": "The micro-electrode-dot-array (MEDA) architecture provides precise droplet control and real-time sensing in digital microfluidic biochips. Previous work has shown that trapped charge under microelectrodes (MCs) leads to droplets being stuck and failures in fluidic operations. A recent approach utilizes real-time sensing of MC health status, and attempts to avoid degraded electrodes during droplet routing. However, the problem with this solution is that the computational complexity is unacceptable for MEDA biochips of realistic size. Consequently, in this work, we introduce a deep reinforcement learning (DRL)-based approach to bypass degraded electrodes and enhance the reliability of routing. The DRL model utilizes the information of health sensing in real time to proactively reduce the likelihood of charge trapping and avoid using degraded MCs. Simulation results show that our approach provides effective routing strategies for COVID-19 testing protocols. We also validate our DRL-based approach using fabricated prototype biochips. Experimental results show that the developed DRL model completed the routing tasks using a fewer number of clock cycles and shorter total execution time, compared with a baseline routing method. Moreover, our DRL-based approach provides reliable routing strategies even in the presence of degraded electrodes. Our experimental results show that the proposed DRL-based routing is robust to occurrences of electrode faults, as well as increases the lifetime and usability of microfluidic biochips compared to existing strategies."}}
{"id": "Q_PSfHMECU", "cdate": 1640995200000, "mdate": 1696539005934, "content": {"title": "Adaptive Droplet Routing for MEDA Biochips via Deep Reinforcement Learning", "abstract": "Digital microfluidic biochips (DMFBs) based on a micro-electrode-dot-array (MEDA) architecture provide fine-grained control and sensing of droplets in real-time. However, excessive actuation of microelectrodes in MEDA biochips can lead to charge trapping during bioassay execution, causing the failure of microelectrodes and erroneous bioassay outcomes. A recently proposed enhancement to MEDA allows run-time measurement of microelectrode health information, thereby enabling synthesis of adaptive routing strategies for droplets. However, existing synthesis solutions are computationally infeasible for large MEDA biochips that have been commercialized. In this paper, we propose a synthesis framework for adaptive droplet routing in MEDA biochips via deep reinforcement learning (DRL). The framework utilizes the real-time microelectrode health feedback to synthesize droplet routes that proactively minimize the likelihood of charge trapping. We show how the adaptive routing strategies can be synthesized using DRL. We implement the DRL agent, the MEDA simulation environment, and the bioassay scheduler using the OpenAI Gym environment. Our framework obtains adaptive routing policies efficiently for COVID-19 testing protocols on large arrays that reflect the sizes of commercial MEDA biochips available in the marketplace, significantly increasing probabilities of successful bioassay completion compared to existing methods."}}
{"id": "5USF3g3fsff", "cdate": 1640995200000, "mdate": 1696539023617, "content": {"title": "Observation Point Insertion Using Deep Learning", "abstract": "Silent Data Corruption (SDC) is one of the critical problems in the field of testing, where errors or corruption do not manifest externally. As a result, there is increased focus on improving the outgoing quality of dies by striving for better correlation between structural and functional patterns to achieve a low DPPM. This is very important for NVIDIA's chips due to the various markets we target; for example, automotive and data center markets have stringent in-field testing requirements. One aspect of these efforts is to also target better testability while incurring lower test cost. Since structural testing is faster than functional tests, it is important to make these structural test patterns as effective as possible and free of test escapes. However, with the rising cell count in today's digital circuits, it is becoming increasingly difficult to sensitize faults and propagate the fault effects to scan-flops or primary outputs. Hence, methods to insert observation points to facilitate the detection of hard-to-detect (HtD) faults are being increasingly explored. In this work, we propose an Observation Point Insertion (OPI) scheme using deep learning with the motivation of achieving - 1) better quality test points than commercial EDA tools leading to a potential lower pattern count 2) faster turnaround time to generate the test points. In order to achieve better pattern compaction than commercial EDA tools, we employ Graph Convolutional Networks (GCNs) to learn the topology of logic circuits along with the features that influence its testability. The graph structures are subsequently used to train two GCN-type deep learning models - the first model predicts signal probabilities at different nets and the second model uses these signal probabilities along with other features to predict the reduction in test-pattern count when OPs are inserted at different locations in the design. The features we consider include structural features like gate type, gate logic, reconvergent-fanouts and testability features like SCOAP. Our simulation results indicate that the proposed machine learning models can predict the probabilistic testability metrics with reasonable accuracy and can identify observation points that reduce pattern count."}}
{"id": "3gXaFDXE8Vo", "cdate": 1640995200000, "mdate": 1696539005933, "content": {"title": "Formal Synthesis of Adaptive Droplet Routing for MEDA Biochips", "abstract": "A digital microfluidic biochip (DMFB) enables the miniaturization of immunoassays, point-of-care clinical diagnostics, and DNA sequencing. A recent generation of DMFBs uses a microelectrode-dot-array (MEDA) architecture, which provides fine-grained control of droplets and real-time droplet sensing using CMOS technology. However, microelectrodes in a MEDA biochip can degrade due to charge trapping when they are repeatedly charged and discharged during bioassay execution; such degradation leads to the failure of microelectrodes and erroneous bioassay outcomes. To address this problem, we first introduce a new microelectrode-cell design such that we can obtain the health status of all the microelectrodes in a MEDA biochip by employing the inherent sensing mechanism. Next, we present a stochastic game-based model for droplet manipulation, and a formal synthesis method for droplet routing that can dynamically change droplet transportation routes. This adaptation is based on the real-time health information obtained from microelectrodes. Comprehensive simulation results for four real-life bioassays show that our method increases the likelihood of successful bioassay completion with negligible impact on time-to-results."}}
{"id": "EAoqGHlqw3", "cdate": 1609459200000, "mdate": 1696539005925, "content": {"title": "Parallel Droplet Control in MEDA Biochips using Multi-Agent Reinforcement Learning", "abstract": "Microfluidic biochips are being utilized for clinical diagnostics, including COVID-19 testing, because of they provide sample-to-result turnaround at low cost. Recently, microelectrode-dot-array (M..."}}
{"id": "D-QRuT1ivd", "cdate": 1609459200000, "mdate": 1696539023536, "content": {"title": "Securing Biochemical Samples Using Molecular Barcoding on Digital Microfluidic Biochips", "abstract": "Microfluidic biochips are being adopted today in point-of-care diagnostics, e.g., COVID-19 testing; therefore, it is critical to ensure integrity of bio-sample before bioassays are run on-chip. A security technique called molecular barcoding was recently proposed to thwart sample-forgery attacks in DNA forensics. Molecular barcoding refers to addition of unique DNA molecules in bio-samples, and the sequence of the added DNA sample serves as a distinct “barcode” for the sample. The existence of the added molecule can be validated using polymerase chain reaction (PCR) and gel electrophoresis. However, this security solution has several limitations: (1) the lack of robustness of the barcode molecules when they are added to other genomic DNA (e.g., samples collected for diagnostics); (2) the need for special bulk instrumentation for validation; (3) the need for human intervention during the overall process. To overcome the limitations, we design a set of robust molecular barcodes that can be validated using both traditional polymerase chain reaction and loop mediated isothermal amplification (LAMP). The validation using LAMP can be executed on a small-in-size and portable digital microfluidic biochip (DMFB). Our LAMP workflow includes a color-changing visual indicator for simple, rapid identification of the barcode existence in solutions. We first demonstrate the proposed security workflow using benchtop techniques. Next, we fabricate a printed circuit board (PCB)-based DMFB with heaters and demonstrate, for the first time, the LAMP assay on a DMFB."}}
{"id": "4WkYqySqOt", "cdate": 1609459200000, "mdate": 1696539023475, "content": {"title": "Enhancing the Reliability of MEDA Biochips Using IJTAG and Wear Leveling", "abstract": "A digital microfluidic biochip (DMFB) enables the miniaturization of immunoassays, point-of-care clinical diagnostics, DNA sequencing, and other laboratory procedures in biochemistry. A recent generation of biochips uses a micro-electrode-dot-array (MEDA) architecture, which provides fine-grained control of droplets and seamlessly integrates microelectronics and microfluidics using CMOS technology and a TSMC fabrication process. To ensure that bioassays are carried out on MEDA biochips efficiently, high-level synthesis algorithms have recently been proposed. However, as in the case of conventional DMFBs, microelectrodes are likely to fail when they are heavily utilized, and previous methods fail to consider reliability issues. In this article, we first present a new microelectrode cell (MC) design such that the droplet-sensing operation can be enabled/disabled for individual MCs. Next, “partial update” and “partial sensing” operations are presented based on an IEEE Std. 1687 IJTAG network design. Finally, wear-leveling synthesis method is proposed to ensure uniform utilization of MCs on MEDA. A comprehensive set of simulation results demonstrate the effectiveness of the proposed hardware design and design automation methods."}}
{"id": "4FMcrP5yDM", "cdate": 1609459200000, "mdate": 1696539005927, "content": {"title": "Formal Synthesis of Adaptive Droplet Routing for MEDA Biochips", "abstract": "A digital microfluidic biochip (DMFB) enables the miniaturization of immunoassays, point-of-care clinical diagnostics, and DNA sequencing. A recent generation of DMFBs uses a micro-electrode-dot-array (MEDA) architecture, which provides fine-grained control of droplets and real-time droplet sensing using CMOS technology. However, microelectrodes in a MEDA biochip can degrade due to charge trapping when they are repeatedly charged and discharged during bioassay execution; such degradation leads to the failure of microelectrodes and erroneous bioassay outcomes. To address this problem, we first introduce a new microelectrode-cell design such that we can obtain the health status of all the microelectrodes in a MEDA biochip by employing the inherent sensing mechanism. Next, we present a stochastic game-based model for droplet manipulation, and a formal synthesis method for droplet routing that can dynamically change droplet transportation routes. This adaptation is based on the real-time health information obtained from microelectrodes. Comprehensive simulation results for four real-life bioassays show that our method increases the likelihood of successful bioassay completion with negligible impact on time-to-results."}}
{"id": "vFsyHVU6Ice", "cdate": 1577836800000, "mdate": null, "content": {"title": "Adaptive Droplet Routing in Digital Microfluidic Biochips Using Deep Reinforcement Learning", "abstract": "We present and investigate a novel application domain for deep reinforcement learning (RL): droplet routing on digital microfluidic biochips (DMFBs). A DMFB, composed of a two-dimensional electrode..."}}
{"id": "mOGfLkx53ud", "cdate": 1577836800000, "mdate": null, "content": {"title": "Programmable Daisychaining of Microelectrodes to Secure Bioassay IP in MEDA Biochips", "abstract": "As digital microfluidic biochips (DMFBs) make the transition to the marketplace for commercial exploitation, security and intellectual property (IP) protection are emerging as important design considerations. Recent studies have shown that DMFBs are vulnerable to reverse engineering aimed at stealing biomolecular protocols (IP theft). The IP piracy of proprietary protocols may lead to significant losses for pharmaceutical and biotech companies. The microelectrode dot array (MEDA) is a next-generation DMFB platform that supports real-time sensing of droplets and has the added advantage of important security protection. However, real-time sensing offers opportunities to an attacker to steal the biochemical IP. We show that the daisychaining of microelectrodes and the use of one-time programmability in MEDA biochips provides effective bitstream scrambling of biochemical protocols. To examine the strength of this solution, we develop a Satisfiability (SAT)-based attack that can unscramble the bitstreams through repeated observations of bioassays executed on the MEDA platform. Based on insights gained from the SAT attack, we propose an advanced defense against IP theft. Simulation results using real-life biomolecular protocols confirm that while the SAT attack is effective for simple instances, our advanced defense can thwart it for realistic MEDA biochips and real-life protocols."}}
