{"id": "q3UxEvOAQj-", "cdate": 1640995200000, "mdate": 1667622370857, "content": {"title": "Intrinsic Image Decomposition by Pursuing Reflectance Image", "abstract": "Intrinsic image decomposition is a fundamental problem for many computer vision applications. While recent deep learning based methods have achieved very promising results on the synthetic densely labeled datasets, the results on the real-world dataset are still far from human level performance. This is mostly because collecting dense supervision on a real-world dataset is impossible. Only a sparse set of pairwise judgement from human is often used. It's very difficult for models to learn in such settings. In this paper, we investigate the possibilities of only using reflectance images for supervision during training. In this way, the demand for labeled data is greatly reduced. In order to achieve this goal, we take a deep investigation into the reflectance images. We find that reflectance images are actually comprised of two components: the flat surfaces with low frequency information, and the boundaries with high frequency details. Then, we propose to disentangle the learning process of the two components of the reflectance images. We argue that through this procedure, the reflectance images can be better modeled, and in the meantime, the shading images, though not supervised, can also achieve decent result. Extensive experiments show that our proposed network outperforms current state-of-the-art results by a large margin on the most challenging real-world IIW dataset. We also surprisingly find that on the densely labeled datasets (MIT and MPI-Sintel), our network can also achieve state-of-the-art results on both reflectance and shading images, when we only apply supervision on the reflectance images during training."}}
{"id": "WmzTVp0Fxz", "cdate": 1640995200000, "mdate": 1667622370855, "content": {"title": "Social Recommendation With Characterized Regularization", "abstract": "Social recommendation, which utilizes social relations to enhance recommender systems, has been gaining increasing attention recently with the rapid development of online social networks. Existing social recommendation methods are based on the assumption, so-called <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">social-trust</i> , that users’ preference or decision is influenced by their social-connected friends’ purchase behaviors. However, they assume that the influences of social relationships are always the same, which violates the fact that users are likely to share preference on different products with different friends. More precisely, friends’ behaviors do not necessarily affect a user’s preferences, and the influence is diverse among different items. In this paper, we contribute a new solution, CSR (short for <bold xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">C</b> haracterized <bold xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">S</b> ocial <bold xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">R</b> egularization) model by designing a universal regularization term for modeling variable social influence. This regularization term captures the finely grained similarity of social-connected friends. We further introduce two variants of our model with different optimization manners. Our proposed model can be applied to both explicit and implicit interaction due to its high generality. Extensive experiments on three real-world datasets demonstrate that our CSR can outperform state-of-the-art social recommendation methods. Further experiments show that CSR can improve recommendation performance for those users with sparse social relations or behavioral interactions."}}
{"id": "rtbbsyhsGy5", "cdate": 1609459200000, "mdate": 1644506083091, "content": {"title": "Session-aware Item-combination Recommendation with Transformer Network", "abstract": "In this paper, we detailedly describe our solution for the IEEE BigData Cup 2021: RL-based RecSys (Track 1: Item Combination Prediction). We first conduct an exploratory data analysis on the dataset and then utilize the findings to design our framework. Specifically, we use a two-headed transformer-based network to predict user feedback and unlocked sessions, along with the proposed session-aware reweighted loss, multi-tasking with click behavior prediction, and randomness-in-session augmentation. In the final private leaderboard on Kaggle, our method ranked 2nd with a categorization accuracy of 0.39224."}}
{"id": "rGG-ok2ofy5", "cdate": 1609459200000, "mdate": 1644506083191, "content": {"title": "Session-aware Item-combination Recommendation with Transformer Network", "abstract": "In this paper, we detailedly describe our solution for the IEEE BigData Cup 2021: RL-based RecSys (Track 1: Item Combination Prediction) <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup> . We first conduct an exploratory data analysis on the dataset and then utilize the findings to design our framework. Specifically, we use a two-headed transformer-based network to predict user feedback and unlocked sessions, along with the proposed session-aware reweighted loss, multitasking with click behavior prediction, and randomness-in-session augmentation. In the final private leaderboard on Kaggle, our method ranked 2nd with a categorization accuracy of 0.39224. <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</sup>"}}
{"id": "HVg-hk2sf19", "cdate": 1609459200000, "mdate": 1644506084024, "content": {"title": "On Migratory Behavior in Video Consumption", "abstract": "Today’s video streaming market is crowded with various content providers (CPs). For individual CPs, understanding user behavior, in particular how users migrate among different CPs, is crucial for improving users’ on-site experience and the CP’s chance of success. In this article, we take a data-driven approach to analyze and model user migration behavior in video streaming, i.e., users switching content provider during active sessions. Based on a large ISP dataset over two months (6 major content providers, 3.8 million users, and 315 million video requests), we study common migration patterns and reasons of migration. We find that migratory behavior is prevalent: 66% of users switch CPs with an average switching frequency of 13%. In addition, migration behaviors are highly diverse: regardless large or small CPs, they all have dedicated groups of users who like to switch to them for certain types of videos. Regarding reasons of migration, we find CP service quality rarely causes migration, while a few popular videos play a bigger role. Nearly 60% of cross-site migrations are landed to 0.14% top videos. Finally, we validate our findings by building an accurate regression model to predict user migration frequency as well as user survey, and discuss the implications of our results to CPs."}}
{"id": "BCfWj12jfyq", "cdate": 1609459200000, "mdate": 1644506083475, "content": {"title": "Discovering Usage Patterns of Mobile Video Service in the Cellular Networks", "abstract": "With the rapid growth of mobile networks and smart devices, a large number of people prefer to visiting video services via mobile devices. This generates massive data traffic, and thus increases the load of cellular networks. To deal with it, we need to investigate the usage patterns in the video consumption. In this article, we take a data-driven analysis of mobile video services by classifying them into three major types: traditional video portals, user-generated video services and personalized livestreaming. We collect a large dataset of 25,937,758 logs from 455 thousand users, and we find that 1) for the same kind of video services, users exhibit high loyalty; 2) in consecutive days, the traffic peaks have differences among different service types; 3) more video traffic is generated from personalized livestreaming services, and it keeps increasing after midnight at weekdays in the downtown; 4) traffic consumption of user-generated service exhibits great differences under different functional regions; 5) individual users are prone to click within the same service type but possible different time gaps during the consecutive views. Lastly, we utilize these findings to discuss the potential applications in the improvements of cellular networks and video services."}}
{"id": "Z7pwkpV6kf", "cdate": 1577836800000, "mdate": 1623572292586, "content": {"title": "Aggregation and Finetuning for Clothes Landmark Detection", "abstract": "Landmark detection for clothes is a fundamental problem for many applications. In this paper, a new training scheme for clothes landmark detection: $\\textit{Aggregation and Finetuning}$, is proposed. We investigate the homogeneity among landmarks of different categories of clothes, and utilize it to design the procedure of training. Extensive experiments show that our method outperforms current state-of-the-art methods by a large margin. Our method also won the 1st place in the DeepFashion2 Challenge 2020 - Clothes Landmark Estimation Track with an AP of 0.590 on the test set, and 0.615 on the validation set. Code will be publicly available at https://github.com/lzhbrian/deepfashion2-kps-agg-finetune ."}}
{"id": "HFLlsRmpySv", "cdate": 1546300800000, "mdate": null, "content": {"title": "CROSS: Cross-platform Recommendation for Social E-Commerce", "abstract": "Social e-commerce, as a new concept of e-commerce, uses social media as a new prevalent platform for online shopping. Users are now able to view, add to cart, and buy products within a single social media app. In this paper, we address the problem of cross-platform recommendation for social e-commerce, i.e., recommending products to users when they are shopping through social media. To the best of our knowledge, this is a new and important problem for all e-commerce companies (e.g. Amazon, Alibaba), but has never been studied before. Existing cross-platform and social related recommendation methods cannot be applied directly for this problem since they do not co-consider the social information and the cross-platform characteristics together. To study this problem, we first investigate the heterogeneous shopping behaviors between traditional e-commerce app and social media. Based on these observations from data, we propose CROSS (Cross-platform Recommendation for Online Shopping in Social Media), a recommendation model utilizing not only user-item interaction data on both platforms, but also social relation data on social media. Extensive experiments on real-world online shopping dataset demonstrate that our proposed CROSS significantly outperforms existing state-of-the-art methods."}}
{"id": "vvx3k5Ba_G", "cdate": 1514764800000, "mdate": 1623572292678, "content": {"title": "Temporal-Spatial Mobile Application Usage Understanding and Popularity Prediction for Edge Caching", "abstract": "The explosive growth of smart devices and expansion of network services drives the flourish of mobile applications. Caching popular application services at the edge, BSs, or APs, which are closer to end users, could significantly improve the user experience and network capacity. To exploit this potential, it is critical to understand the traffic consumption and app usage pattern under BSs in the metropolitan area. Mobile big data collected from network interfaces facilitates the data-driven approach in characterizing these features. This article aims to design an edge caching strategy for app services based on the observed characteristics of BSs in terms of points of interest (POIs), logs, and traffic generated by various categories of apps. We first analyze the temporal characteristics of different categories of apps, and then further investigate the logs and traffic generated by app types under different BSs clustered by POIs. The top N popular app types in a given period of time under different BS clusters are predicted, which is helpful for network operators to know the traffic distribution of different app services over all BSs and design the edge caching scheme."}}
{"id": "ii11g4PKTle", "cdate": 1514764800000, "mdate": 1623572292677, "content": {"title": "On the Understanding of Video Streaming Viewing Behaviors Across Different Content Providers", "abstract": "Watching videos online has become prevalent in our daily activities. While there are extensive measurements studying about video on demand, IPTV, live streaming, etc., most of them focus their analysis on a single content provider (CP). Various user behaviors over multiple different CPs are yet to be explored. In this paper, we collect about ten million viewing records of the six most popular video CPs through a major Internet service provider (ISP) in Shanghai, China, and examine the user behaviors and access patterns with an emphasis on comparing them among different CPs in the same environments. Our analysis reveals the day-scale temporal patterns, the diversified device-wise preferences, and the city-scale geographical features of the different CPs, and identifies the high relevance between the user behaviors and the contents of the videos. Moreover, we find that user migration across multiple CPs is prevalent and highly influenced by different features of CPs. We believe that our observations and findings can provide valuable insights for CPs to enhance their user experience as well as ISPs to optimize the network architecture."}}
