{"id": "SkEsYezObH", "cdate": 1483228800000, "mdate": null, "content": {"title": "Region-Based Correspondence Between 3D Shapes via Spatially Smooth Biclustering", "abstract": "Region-based correspondence (RBC) is a highly relevant and non-trivial computer vision problem. Given two 3D shapes, RBC seeks segments/regions on these shapes that can be reliably put in correspondence. The problem thus consists both in finding the regions and determining the correspondences between them. This problem statement is similar to that of “biclustering ”, implying that RBC can be cast as a biclustering problem. Here, we exploit this implication by tackling RBC via a novel biclustering approach, called S4B (spatially smooth spike and slab biclustering), which: (i) casts the problem in a probabilistic low-rank matrix factorization perspective; (ii) uses a spike and slab prior to induce sparsity; (iii) is enriched with a spatial smoothness prior, based on geodesic distances, encouraging nearby vertices to belong to the same bicluster. This type of spatial prior cannot be used in classical biclustering techniques. We test the proposed approach on the FAUST dataset, outperforming both state-of-the-art RBC techniques and classical biclustering methods."}}
{"id": "BJNMagf_-B", "cdate": 1483228800000, "mdate": null, "content": {"title": "Infinite Latent Feature Selection: A Probabilistic Latent Graph-Based Ranking Approach", "abstract": "Feature selection is playing an increasingly significant role with respect to many computer vision applications spanning from object recognition to visual object tracking. However, most of the recent solutions in feature selection are not robust across different and heterogeneous set of data. In this paper, we address this issue proposing a robust probabilistic latent graph-based feature selection algorithm that performs the ranking step while considering all the possible subsets of features, as paths on a graph, bypassing the combinatorial problem analytically. An appealing characteristic of the approach is that it aims to discover an abstraction behind low-level sensory data, that is, relevancy. Relevancy is modelled as a latent variable in a PLSA-inspired generative process that allows the investigation of the importance of a feature when injected into an arbitrary set of cues. The proposed method has been tested on ten diverse benchmarks, and compared against eleven state of the art feature selection methods. Results show that the proposed approach attains the highest performance levels across many different scenarios and difficulties, thereby confirming its strong robustness while setting a new state of the art in feature selection domain."}}
{"id": "SXVNxePgO6B", "cdate": 1451606400000, "mdate": null, "content": {"title": "Shape Retrieval of Non-rigid 3D Human Models.", "abstract": "3D models of humans are commonly used within computer graphics and vision, and so the ability to distinguish between body shapes is an important shape retrieval problem. We extend our recent paper which provided a benchmark for testing non-rigid 3D shape retrieval algorithms on 3D human models. This benchmark provided a far stricter challenge than previous shape benchmarks. We have added 145 new models for use as a separate training set, in order to standardise the training data used and provide a fairer comparison. We have also included experiments with the FAUST dataset of human scans. All participants of the previous benchmark study have taken part in the new tests reported here, many providing updated results using the new data. In addition, further participants have also taken part, and we provide extra analysis of the retrieval results. A total of 25 different shape retrieval methods are compared."}}
{"id": "Hy-65Kb_bS", "cdate": 1388534400000, "mdate": null, "content": {"title": "A Bioinformatics Approach to 3D Shape Matching", "abstract": "In this paper we exploit the effectiveness of bioinformatics tools to deal with 3D shape matching. The key idea is to transform the shape into a biological sequence and take advantage of bioinformatics tools for sequence alignment to improve shape matching. In order to extract a reliable ordering of mesh vertices we employ the spectral-based sequencing method derived from the well known Fiedler Vector. Local geometric features are then collected and quantized into a finite set of discrete values in analogy with nucleotide or aminoacid sequence. Two standard biological sequence matching strategies are employed aiming at evaluating both local and global alignment methods. Preliminary experiments are performed on standard non-rigid shape datasets by showing promising results in comparison with other methods."}}
{"id": "rjsWI_NgOpB", "cdate": 1325376000000, "mdate": null, "content": {"title": "Free Energy Score Spaces: Using Generative Information in Discriminative Classifiers.", "abstract": "A score function induced by a generative model of the data can provide a feature vector of a fixed dimension for each data sample. Data samples themselves may be of differing lengths (e.g., speech segments or other sequential data), but as a score function is based on the properties of the data generation process, it produces a fixed-length vector in a highly informative space, typically referred to as “score space.” Discriminative classifiers have been shown to achieve higher performances in appropriately chosen score spaces with respect to what is achievable by either the corresponding generative likelihood-based classifiers or the discriminative classifiers using standard feature extractors. In this paper, we present a novel score space that exploits the free energy associated with a generative model. The resulting free energy score space (FESS) takes into account the latent structure of the data at various levels and can be shown to lead to classification performance that at least matches the performance of the free energy classifier based on the same generative model and the same factorization of the posterior. We also show that in several typical computer vision and computational biology applications the classifiers optimized in FESS outperform the corresponding pure generative approaches, as well as a number of previous approaches combining discriminating and generative models."}}
{"id": "BQbuDNluTH", "cdate": 1293840000000, "mdate": null, "content": {"title": "Statistical 3D Shape Analysis by Local Generative Descriptors.", "abstract": "In this paper, we propose a new approach for surface representation. Generative models are exploited for encoding the variations of local geometric properties of 3D shapes. Surfaces are locally modeled as a stochastic process which spans a neighborhood area through a set of circular geodesic pathways, captured by a modified version of a Hidden Markov Model (HMM) named multicircular HMM (MC-HMM). The approach proposed consists of two main phases: 1) local geometric feature collection and 2) MC-HMM parameter estimation. The effectiveness of our proposal is demonstrated by several applicative scenarios, all using well-known benchmark data sets, such as multiple view registration, matching of deformable shapes, and object recognition on cluttered scenes. The results achieved are very promising and open up the use of generative models as geometric descriptors in an extensive range of applications."}}
{"id": "BkEjCK-dWH", "cdate": 1262304000000, "mdate": null, "content": {"title": "Object Recognition with Hierarchical Stel Models", "abstract": "We propose a new generative model, and a new image similarity kernel based on a linked hierarchy of probabilistic segmentations. The model is used to efficiently segment multiple images into a consistent set of image regions. The segmentations are provided at several levels of granularity and links among them are automatically provided. Model training and inference in it is faster than most local feature extraction algorithms, and yet the provided image segmentation, and the segment matching among images provide a rich backdrop for image recognition, segmentation and registration tasks."}}
{"id": "HJWaUwbOZr", "cdate": 1230768000000, "mdate": null, "content": {"title": "Free energy score space", "abstract": "Score functions induced by generative models extract fixed-dimension feature vectors from different-length data observations by subsuming the process of data generation, projecting them in highly informative spaces called score spaces. In this way, standard discriminative classifiers are proved to achieve higher performances than a solely generative or discriminative approach. In this paper, we present a novel score space that exploits the free energy associated to a generative model through a score function. This function aims at capturing both the uncertainty of the model learning and ``local compliance of data observations with respect to the generative process. Theoretical justifications and convincing comparative classification results on various generative models prove the goodness of the proposed strategy."}}
{"id": "BkVO0lfubr", "cdate": 1230768000000, "mdate": null, "content": {"title": "A hybrid generative/discriminative classification framework based on free-energy terms", "abstract": "Hybrid, generative-discriminative, techniques have proven to be valuable approaches in tackling difficult object or scene recognition problems. In general, a generative model over the available data for each image class is first learned providing a relatively comprehensive statistical multi-level representation. In this way, new meaningful image features become available, which encode the degree of fitness of the data with respect to the model at different representation levels. Such features are then fed into a discriminative classifier which can exploit the intrinsic data separability. In this paper, we propose the use of variational free energy terms as feature vectors, so that the degree of fitness of the data and the uncertainty over the generative process are explicitly included in the data description. The proposed method is automatically superior to a pure generative classification, and we also experimentally validate it on a wide selection of generative models applied to challenging benchmarks in hard computer vision tasks such as scene, object, and shape recognition. In several instances, the proposed approach outperforms the current state-of-the-art techniques as for classification results, while also showing to be computationally inexpensive."}}
{"id": "rJ-PRh-_-H", "cdate": 1199145600000, "mdate": null, "content": {"title": "HMM-based geometric signatures for compact 3D face representation and matching", "abstract": "3D face recognition(s) systems improve current 2D image-based approaches, but in general they are required to deal with larger amounts of data. Therefore, a compact representation of 3D faces is often crucial for a better manipulation of data, in the context of 3D face applications such as smart card identity verification systems. We propose a new compact 3D representation by focusing on the most significant parts of the face. We introduce a generative learning approach by adapting Hidden Markov Models (HMM) to work on 3D meshes. The geometry of local area around face fiducial points is modeled by training HMMs which provide a robust pose invariant point signature. Such description allows the matching by comparing the signature of corresponding points in a maximum-likelihood principle. We show that our descriptor is robust for recognizing expressions and performs faster than the current ICP-based 3D face recognition systems by maintaining a satisfactory recognition rate. Preliminary results on a subset of the FRGC 2.0 dataset are reported by considering subjects under different expressions."}}
