{"id": "EwoBTLCY-Y", "cdate": 1663849922147, "mdate": null, "content": {"title": "Neural Optimal Transport with General Cost Functionals", "abstract": "We present a novel neural-networks-based algorithm to compute optimal transport (OT) plans and maps for general cost functionals. The algorithm is based on a saddle point reformulation of the OT problem and generalizes prior OT methods for weak and strong cost functionals. As an application, we construct a functional to map data distributions with preserving the class-wise structure of data."}}
{"id": "GiEnzxTnaMN", "cdate": 1652737510101, "mdate": null, "content": {"title": "Wasserstein Iterative Networks for Barycenter Estimation", "abstract": "Wasserstein barycenters have become popular due to their ability to represent the average of probability measures in a geometrically meaningful way. In this paper, we present an algorithm to approximate the Wasserstein-2 barycenters of continuous measures via a generative model. Previous approaches rely on regularization (entropic/quadratic) which introduces bias or on input convex neural networks which are not expressive enough for large-scale tasks. In contrast, our algorithm does not introduce bias and allows using arbitrary neural networks. In addition, based on the celebrity faces dataset, we construct Ave, celeba! dataset which can be used for quantitative evaluation of barycenter algorithms by using standard metrics of generative models such as FID. "}}
{"id": "wzBbjMQbfJzZ", "cdate": 1640995200000, "mdate": 1668715842304, "content": {"title": "Wasserstein Iterative Networks for Barycenter Estimation", "abstract": "Wasserstein barycenters have become popular due to their ability to represent the average of probability measures in a geometrically meaningful way. In this paper, we present an algorithm to approximate the Wasserstein-2 barycenters of continuous measures via a generative model. Previous approaches rely on regularization (entropic/quadratic) which introduces bias or on input convex neural networks which are not expressive enough for large-scale tasks. In contrast, our algorithm does not introduce bias and allows using arbitrary neural networks. In addition, based on the celebrity faces dataset, we construct Ave, celeba! dataset which can be used for quantitative evaluation of barycenter algorithms by using standard metrics of generative models such as FID."}}
{"id": "p7mBqVnBJh-", "cdate": 1640995200000, "mdate": 1668715842283, "content": {"title": "Neural Optimal Transport with General Cost Functionals", "abstract": "Neural optimal transport techniques mostly use Euclidean cost functions, such as $\\ell^1$ or $\\ell^2$. These costs are suitable for translation tasks between related domains, but they are hardly applicable to problems where a specific non-Euclidean optimality of the mapping is required such as dataset transfer. To tackle this issue, we introduce a novel neural network-based algorithm to compute optimal transport plans and maps for general cost functionals. Such functionals provide more flexibility and allow using auxiliary information, such as class labels, to construct the required transport map. Our method is based on a saddle point reformulation of the optimal transport problem and generalizes prior methods for weak and strong transport cost functionals. As an application, we construct a functional to map data distributions with preserving the class-wise structure of data."}}
{"id": "XYDYj7AjxB", "cdate": 1640995200000, "mdate": 1668715842109, "content": {"title": "DEF: deep estimation of sharp geometric features in 3D shapes", "abstract": "We propose Deep Estimators of Features (DEFs), a learning-based framework for predicting sharp geometric features in sampled 3D shapes. Differently from existing data-driven methods, which reduce this problem to feature classification, we propose to regress a scalar field representing the distance from point samples to the closest feature line on local patches. Our approach is the first that scales to massive point clouds by fusing distance-to-feature estimates obtained on individual patches. We extensively evaluate our approach against related state-of-the-art methods on newly proposed synthetic and real-world 3D CAD model benchmarks. Our approach not only outperforms these (with improvements in Recall and False Positives Rates), but generalizes to real-world scans after training our model on synthetic data and fine-tuning it on a small dataset of scanned data. We demonstrate a downstream application, where we reconstruct an explicit representation of straight and curved sharp feature lines from range scan data. We make code, pre-trained models, and our training and evaluation datasets available at https://github.com/artonson/def."}}
{"id": "A_203gwYEN-", "cdate": 1640995200000, "mdate": 1683916630573, "content": {"title": "Wasserstein Iterative Networks for Barycenter Estimation", "abstract": "Wasserstein barycenters have become popular due to their ability to represent the average of probability measures in a geometrically meaningful way. In this paper, we present an algorithm to approximate the Wasserstein-2 barycenters of continuous measures via a generative model. Previous approaches rely on regularization (entropic/quadratic) which introduces bias or on input convex neural networks which are not expressive enough for large-scale tasks. In contrast, our algorithm does not introduce bias and allows using arbitrary neural networks. In addition, based on the celebrity faces dataset, we construct Ave, celeba! dataset which can be used for quantitative evaluation of barycenter algorithms by using standard metrics of generative models such as FID."}}
{"id": "vxRFqPuGk_t", "cdate": 1609459200000, "mdate": 1668715849539, "content": {"title": "Wasserstein-2 Generative Networks", "abstract": "We propose a novel end-to-end non-minimax algorithm for training optimal transport mappings for the quadratic cost (Wasserstein-2 distance). The algorithm uses input convex neural networks and a cycle-consistency regularization to approximate Wasserstein-2 distance. In contrast to popular entropic and quadratic regularizers, cycle-consistency does not introduce bias and scales well to high dimensions. From the theoretical side, we estimate the properties of the generative mapping fitted by our algorithm. From the practical side, we evaluate our algorithm on a wide range of tasks: image-to-image color transfer, latent space optimal transport, image-to-image style transfer, and domain adaptation."}}
{"id": "bEoxzW_EXsa", "cdate": 1601308331113, "mdate": null, "content": {"title": "Wasserstein-2 Generative Networks", "abstract": "We propose a novel end-to-end non-minimax algorithm for training optimal transport mappings for the quadratic cost (Wasserstein-2 distance). The algorithm uses input convex neural networks and a cycle-consistency regularization to approximate Wasserstein-2 distance. In contrast to popular entropic and quadratic regularizers, cycle-consistency does not introduce bias and scales well to high dimensions. From the theoretical side, we estimate the properties of the generative mapping fitted by our algorithm. From the practical side, we evaluate our algorithm on a wide range of tasks: image-to-image color transfer, latent space optimal transport, image-to-image style transfer, and domain adaptation."}}
{"id": "z7_sn6rHTcN", "cdate": 1577836800000, "mdate": null, "content": {"title": "Latent-space Laplacian Pyramids for Adversarial Representation Learning with 3D Point Clouds", "abstract": ""}}
{"id": "l_niSr4FaCC", "cdate": 1577836800000, "mdate": 1668715847762, "content": {"title": "Deep Vectorization of Technical Drawings", "abstract": "We present a new method for vectorization of technical line drawings, such as floor plans, architectural drawings, and 2D CAD images. Our method includes (1) a deep learning-based cleaning stage to eliminate the background and imperfections in the image and fill in missing parts, (2) a transformer-based network to estimate vector primitives, and (3) optimization procedure to obtain the final primitive configurations. We train the networks on synthetic data, renderings of vector line drawings, and manually vectorized scans of line drawings. Our method quantitatively and qualitatively outperforms a number of existing techniques on a collection of representative technical drawings."}}
