{"id": "eeBilhJuLk", "cdate": 1690848000000, "mdate": 1694441802819, "content": {"title": "A Community-Aware Framework for Social Influence Maximization", "abstract": "We consider the problem of <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Influence Maximization</i> (IM), the task of selecting <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><tex-math notation=\"LaTeX\">$k$</tex-math></inline-formula> seed nodes in a social network such that the expected number of nodes influenced is maximized. We propose a community-aware divide-and-conquer framework that involves (i) learning the inherent community structure of the social network, (ii) generating candidate solutions by solving the influence maximization problem for each community, and (iii) selecting the final set of seed nodes using a novel progressive budgeting scheme. <p xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Our experiments on real-world social networks show that the proposed framework outperforms the standard methods in terms of run-time and the heuristic methods in terms of influence. We also study the effect of the community structure on the performance of the proposed framework. Our experiments show that the community structures with higher modularity lead the proposed framework to perform better in terms of run-time and influence.</p>"}}
{"id": "Qhhl_W2G_zc", "cdate": 1690848000000, "mdate": 1694441803048, "content": {"title": "Adaptive Video Streaming With Automatic Quality-of-Experience Optimization", "abstract": "Video streaming has grown tremendously in recent years and it is now one of the main applications on the Internet. Due to the networks’ inherent bandwidth fluctuations, various rate-adaptive streaming algorithms have been developed to compensate for such fluctuations to improve Quality-of-Experience (QoE). However, in practice, the preference for QoE typically differs significantly across different viewers and there is no systematic way so far to comprehensively incorporate different sets of conflicting QoE objectives into the algorithm design. Thus, it is not surprising that the QoE performance achieved by the existing algorithms is in fact far from optimal. This work aims at attacking the heart of the problem by developing a novel framework called Post Streaming Quality Analysis (PSQA) that can maximize the QoE under <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">any</i> preference through automatically tuning the adaptation logic of the streaming algorithms. Evaluation results show that the QoE achieved by PSQA is substantially better than the existing approaches and in some scenarios even close to optimal. Moreover, PSQA can be readily implemented into real streaming platforms, offering a practical and reliable solution for high-performance streaming services."}}
{"id": "KQAySoK-RQv", "cdate": 1690848000000, "mdate": 1694441803128, "content": {"title": "An Optimization Framework Based on Deep Reinforcement Learning Approaches for Prism Blockchain", "abstract": "Blockchains have proven to provide a high level of performance in terms of security and reliability for various applications like cryptocurrencies and Internet-of-Things (IoT). Prism is a recent blockchain algorithm that achieves the physical limit on throughput and latency without compromising security. In recent days, reinforcement learning approaches are investigated in traditional blockchains, to improve performance. In this work, we apply Deep Reinforcement Learning (DRL) to one of the promising blockchain protocols, Prism, to optimize its performance. We propose a Deep Reinforcement Learning-based Prism Blockchain (DRLPB) scheme which dynamically optimizes the parameters of the Prism blockchain and helps in achieving a better performance. In DRLPB, we apply two widely used DRL algorithms, Dueling Deep Q Networks (DDQN) and Proximal Policy Optimization (PPO). This work presents a novel approach to applying DDQN and PPO to a blockchain protocol and comparing the performance. The DRLPB scheme adapts the Prism blockchain parameters to enhance the number of votes upto 84% more than Prism, while still preserving the security and latency performance guarantees of Prism."}}
{"id": "H0gVCUNyTG", "cdate": 1688169600000, "mdate": 1694441802743, "content": {"title": "Classical simulation of variational quantum classifiers using tensor rings", "abstract": ""}}
{"id": "BMAX1DBoKCQ", "cdate": 1686250301729, "mdate": null, "content": {"title": "Combinatorial Stochastic-Greedy Bandit", "abstract": "We propose a novel combinatorial stochastic-greedy bandit (SGB) algorithm for combinatorial multi-armed bandit problems when no extra information other than the joint reward of the selected set of $n$ arms at each time step $t\\in [T]$ is observed. SGB adopts an optimized stochastic-explore-then-commit approach and is specifically designed for scenarios with a large set of base arms. Unlike existing methods that explore the entire set of unselected base arms during each selection step, our SGB algorithm samples only an optimized proportion of unselected arms and selects actions from this subset. We prove that our algorithm achieves a $(1-1/e)$-regret bound of $\\mathcal{O}(n^{\\frac{1}{3}} k^{\\frac{2}{3}} T^{\\frac{2}{3}} \\log(T)^{\\frac{2}{3}})$ for monotone stochastic submodular rewards, which outperforms the state-of-the-art in terms of the cardinality constraint $k$. Furthermore, we empirically evaluate the performance of our algorithm in the context of online constrained social influence maximization. Our results demonstrate that our proposed approach consistently outperforms the other algorithms, increasing the performance gap as $k$ grows."}}
{"id": "8deJbjZf-RR", "cdate": 1682899200000, "mdate": 1694441803078, "content": {"title": "A Reinforcement Learning Framework for Vehicular Network Routing Under Peak and Average Constraints", "abstract": "Providing provable performance guarantees in vehicular network routing problems is crucial to ensure safely and timely delivery of information in an environment characterized by high mobility, dynamic network conditions, and frequent topology changes. While Reinforcement Learning (RL) has shown great promise in network routing, existing RL-based solutions typically support decision-making with either peak constraints or average constraints, but not both. For network routing in intelligent transportation, such as advanced vehicle control and safety, both peak constraints (e.g., maximum latency or minimum bandwidth guarantees) and average constraints (e.g., average transmit power or data rate constraints) must be satisfied. In this paper, we propose a holistic framework for RL-based vehicular network routing, which maximizes routing decisions under both average and peak constraints. The routing problem is modeled as a Constrained Markov Decision Process and recast into an optimization based on Constraint Satisfaction Problems (CSPs). We prove that the optimal policy of a given CSP can be learned by an extended Q-learning algorithm while satisfying both peak and average latency constraints. To improve the scalability of our framework, we further turn it into a decentralized implementation through a cluster-based learning structure. Applying the proposed RL algorithm to vehicular network routing problems under both peak and average latency constraints, simulation results show that our algorithm achieves much higher rewards than heuristic baselines with over 40% improvement in average transmission rate, while resulting in zero violation in terms of both peak and average constraints."}}
{"id": "yRxMPLMs8TY", "cdate": 1680307200000, "mdate": 1694441802999, "content": {"title": "Leveraging the Community Structure of a Social Network for Maximizing the Spread of Influence", "abstract": "We consider the problem of Influence Maximization (IM), the task of selecting k seed nodes in a social network such that the expected number of nodes influenced is maximized. We propose a community-aware divide-and-conquer framework that involves (i) learning the inherent community structure of the social network, (ii) generating candidate solutions by solving the influence maximization problem for each community, and (iii) selecting the final set of seed nodes using a novel progressive budgeting scheme. Our experiments on a real-world social network show that the proposed framework outperforms the standard methods in terms of run-time and the heuristic methods in terms of influence."}}
{"id": "tAyKQvTmyUD", "cdate": 1680307200000, "mdate": 1694441802832, "content": {"title": "Asymptotic Analysis of Probabilistic Scheduling for Erasure-Coded Heterogeneous Systems", "abstract": "We consider (k, k) fork-join scheduling on a large number (say, N) of parallel servers with two sets of heterogeneous rates. An incoming task is split into k sub-tasks and dispatched to k servers according to a probabilistic selection policy, with parameter ps being the selection probability of slower servers. Mean task completion time admits an integral form, and thus it is analytically intractable to compute ps that minimizes it. In this work, we provide an upper bound on the mean task completion time, and determine ps that minimizes this upper bound. Numerically, this choice has been shown to be near-optimal."}}
{"id": "amU8LeM09Wp", "cdate": 1680307200000, "mdate": 1694441802781, "content": {"title": "An finite element analysis surrogate model with boundary oriented graph embedding approach for rapid design", "abstract": "In this work, we present a boundary oriented graph embedding (BOGE) approach for the graph neural network to assist in rapid design and digital prototyping. The cantilever beam problem has been solved as an example to validate its potential of providing physical field results and optimized designs using only 10 ms. Providing shortcuts for both boundary elements and local neighbor elements, the BOGE approach can embed unstructured mesh elements into the graph and performs an efficient regression on large-scale triangular-mesh-based finite element analysis (FEA) results, which cannot be realized by other machine-learning-based surrogate methods. It has the potential to serve as a surrogate model for other boundary value problems. Focusing on the cantilever beam problem, the BOGE approach with 3-layer DeepGCN model achieves the regression with mean square error (MSE) of 0.011 706 (2.41% mean absolute percentage error) for stress field prediction and 0.002 735 MSE (with 1.58% elements having error larger than 0.01) for topological optimization. The overall concept of the BOGE approach paves the way for a general and efficient deep-learning-based FEA simulator that will benefit both industry and Computer Aided Design (CAD) design-related areas."}}
{"id": "TJlI1k6smS", "cdate": 1680307200000, "mdate": 1694441802857, "content": {"title": "Latency Minimization for Mobile Edge Computing Networks", "abstract": "The proliferation of data-intensive mobile applications is causing latency to become an issue in mobile edge computing (MEC) systems. In this work, we propose a novel methodology that optimizes communication, computation, and caching configurations in MEC to minimize the mean latency experienced by mobile devices. Transmission and computation processes are modeled using M/G/1 queues to account for service rates and warm-up times. Our caching scheme includes time variables for each file at each edge server in determining when to discard files from storage. We theoretically analyze the latency experienced by mobile devices due to communication, computation, and caching, showing how MEC system latency depends on the offloading decisions of mobile devices, bandwidth and CPU resources, and expiration times of files in the storage of edge servers. Our method for solving the latency minimization problem consists of two main components: iNner cOnVex Approximation (NOVA) to deal with non-convexity in the optimization, and an online algorithm for preventing cache storage violations as new tasks arrive and are serviced by the MEC system. Simulation results show that our algorithm outperforms several baselines in minimizing latency, and verify the benefit of including different resource allocation variables in our optimization."}}
