{"id": "Bk9nkMa4G", "cdate": 1516212146295, "mdate": null, "content": {"title": "Bayesian Embeddings for Long-Tailed Datasets", "abstract": "The statistics of the real visual world presents a long-tailed distribution: a few classes have significantly more training instances than the remaining classes in a dataset. This is because the real visual world has a few classes that are common while others are rare. Unfortunately, the performance of a convolutional neural network is typically unsatisfactory when trained using a long-tailed dataset. To alleviate this issue, we propose a method that discriminatively learns an embedding in which a simple Bayesian classifier can balance the class-priors to generalize well for rare classes. To this end, the proposed approach uses a Gaussian mixture model to factor out class-likelihoods and class-priors in a long-tailed dataset. The proposed method is simple and easy-to-implement in existing deep learning frameworks. Experiments on publicly available datasets show that the proposed approach improves the performance on classes with few training instances, while maintaining a comparable performance to the state-of-the-art on classes with abundant training examples."}}
{"id": "SkEccJMObr", "cdate": 1388534400000, "mdate": null, "content": {"title": "Cascade of Box (CABOX) Filters for Optimal Scale Space Approximation", "abstract": "Local image features, such as blobs and corners, have proven to be very useful for several computer vision applications. However, for enabling applications such as visual search and augmented reality with near-realtime latency, blob detection can be quite computationally expensive due to numerous convolution operations. In this paper, we present a sparse convex formulation to determine a minimal set of box filters for fast yet robust approximation to the Gaussian kernels used for blob detection. We call our feature detector as CABOX (CAscade of BOX) detector. Although box approximations to a filter have been studied in the literature, previous approaches suffer from one or more of the following problems: 1) ad hoc box filter design, 2) non-elegant trade-off between filter reconstruction quality and speed and, 3) limited experimental evaluation considering very small datasets. This paper, on the other hand, contributes: 1) an elegant optimization approach to determine an optimal sparse set of box filters, and 2) a comprehensive experimental evaluation including a large scale image matching experiment with about 16 K matching and 170 K non-matching image pairs. Our experimental results show a substantial overlap (89%) between the features detected with our proposed method and the popular Difference-of-Gaussian (DoG) approach. And yet CABOX is 44% faster. Moreover, the large scale experiment shows that CABOX closely reproduces DoG's performance in an end-to-end feature detection and matching pipeline."}}
{"id": "By4CjFZ_bB", "cdate": 1388534400000, "mdate": null, "content": {"title": "gDLS: A Scalable Solution to the Generalized Pose and Scale Problem", "abstract": "In this work, we present a scalable least-squares solution for computing a seven degree-of-freedom similarity transform. Our method utilizes the generalized camera model to compute relative rotation, translation, and scale from four or more 2D-3D correspondences. In particular, structure and motion estimations from monocular cameras lack scale without specific calibration. As such, our methods have applications in loop closure in visual odometry and registering multiple structure from motion reconstructions where scale must be recovered. We formulate the generalized pose and scale problem as a minimization of a least squares cost function and solve this minimization without iterations or initialization. Additionally, we obtain all minima of the cost function. The order of the polynomial system that we solve is independent of the number of points, allowing our overall approach to scale favorably. We evaluate our method experimentally on synthetic and real datasets and demonstrate that our methods produce higher accuracy similarity transform solutions than existing methods."}}
{"id": "r1-QVAbObB", "cdate": 1356998400000, "mdate": null, "content": {"title": "SWIGS: A Swift Guided Sampling Method", "abstract": "We present SWIGS, a Swift and efficient Guided Sampling method for robust model estimation from image feature correspondences. Our method leverages the accuracy of our new confidence measure (MR-Rayleigh), which assigns a correctness-confidence to a putative correspondence in an online fashion. MR-Rayleigh is inspired by Meta-Recognition (MR), an algorithm that aims to predict when a classifier's outcome is correct. We demonstrate that by using a Rayleigh distribution, the prediction accuracy of MR can be improved considerably. Our experiments show that MR-Rayleigh tends to predict better than the often-used Lowe's ratio, Brown's ratio, and the standard MR under a range of imaging conditions. Furthermore, our homography estimation experiment demonstrates that SWIGS performs similarly or better than other guided sampling methods while requiring fewer iterations, leading to fast and accurate model estimates."}}
{"id": "S1bnBWzdWS", "cdate": 1356998400000, "mdate": null, "content": {"title": "EVSAC: Accelerating Hypotheses Generation by Modeling Matching Scores with Extreme Value Theory", "abstract": "Algorithms based on RANSAC that estimate models using feature correspondences between images can slow down tremendously when the percentage of correct correspondences (inliers) is small. In this paper, we present a probabilistic parametric model that allows us to assign confidence values for each matching correspondence and therefore accelerates the generation of hypothesis models for RANSAC under these conditions. Our framework leverages Extreme Value Theory to accurately model the statistics of matching scores produced by a nearest-neighbor feature matcher. Using a new algorithm based on this model, we are able to estimate accurate hypotheses with RANSAC at low inlier ratios significantly faster than previous state-of-the-art approaches, while still performing comparably when the number of inliers is large. We present results of homography and fundamental matrix estimation experiments for both SIFT and SURF matches that demonstrate that our method leads to accurate and fast model estimations."}}
