{"id": "f5fpOEZhN-n", "cdate": 1661412688185, "mdate": 1661412688185, "content": {"title": "Estimation and Quantization of Expected Persistence Diagrams", "abstract": "Persistence diagrams (PDs) are the most com-\nmon descriptors used to encode the topology of\nstructured data appearing in challenging learn-\ning tasks; think e.g. of graphs, time series or\npoint clouds sampled close to a manifold. Given\nrandom objects and the corresponding distribu-\ntion of PDs, one may want to build a statisti-\ncal summary—such as a mean—of these random\nPDs, which is however not a trivial task as the\nnatural geometry of the space of PDs is not lin-\near. In this article, we study two such summaries,\nthe Expected Persistence Diagram (EPD), and its\nquantization. The EPD is a measure supported\non R2, which may be approximated by its em-\npirical counterpart. We prove that this estimator\nis optimal from a minimax standpoint on a large\nclass of models with a parametric rate of conver-\ngence. The empirical EPD is simple and efficient\nto compute, but possibly has a very large sup-\nport, hindering its use in practice. To overcome\nthis issue, we propose an algorithm to compute\na quantization of the empirical EPD, a measure\nwith small support which is shown to approxi-\nmate with near-optimal rates a quantization of the\ntheoretical EPD."}}
{"id": "hc9-SBCppyn", "cdate": 1622445497652, "mdate": null, "content": {"title": "Density estimation on manifolds: an optimal transport approach", "abstract": "Assume that we observe i.i.d. points lying close to some unknown d-dimensional Ck submanifold M in a possibly high-dimensional space. We study the problem of reconstruct- ing the probability distribution generating the sample. After remarking that this problem is degenerate for a large class of standard losses (Lp, Hellinger, total variation, etc.), we focus on the Wasserstein loss, for which we build an estimator, based on kernel density estimation, whose rate of convergence depends on d and the regularity s <= k-1 of the underlying density, but not on the ambient dimension. In particular, we show that the estimator is minimax and matches previous rates in the literature in the case where the manifold M is a d-dimensional cube. The related problem of the estimation of the volume measure of M for the Wasserstein loss is also considered, for which a minimax estimator is exhibited."}}
{"id": "mydTv0-YSC8", "cdate": 1622445463555, "mdate": null, "content": {"title": "The density of expected persistence diagrams and its kernel based estimation", "abstract": "Persistence diagrams play a fundamental role in Topological Data Analysis where they are used as topological descriptors of filtrations built on top of data. They consist in discrete multisets of points in the plane R^2 that can equivalently be seen as discrete measures in R^2. When the data come as a random point cloud, these discrete measures become random measures whose expectation is studied in this paper. First, we show that for a wide class of filtrations, including the Čech and Rips-Vietoris filtrations, the expected persistence diagram, that is a deterministic measure on R^2, has a density with respect to the Lebesgue measure. Second, building on the previous result we show that the persistence surface recently introduced in [Adams & al., Persistence images: a stable vector representation of persistent homology] can be seen as a kernel estimator of this density. We propose a cross-validation scheme for selecting an optimal bandwidth, which is proven to be a consistent procedure to estimate the density."}}
{"id": "VAavmuiylZ", "cdate": 1622445402320, "mdate": null, "content": {"title": "Understanding the topology and the geometry of the persistence diagram space via optimal partial transport.", "abstract": "Despite the obvious similarities between the metrics used in topological data analysis and those of optimal transport, an optimal-transport based formalism to study persistence diagrams and similar topological descriptors has yet to come. In this article, by considering the space of persistence diagrams as a measure space, and by observing that its metrics can be expressed as solutions of optimal partial transport problems, we introduce a generalization of persistence diagrams, namely Radon measures supported on the upper half plane. Such measures naturally appear in topological data analysis when considering continuous representations of persistence diagrams (e.g. persistence surfaces) but also as limits for laws of large numbers on persistence diagrams or as expectations of probability distributions on the persistence diagrams space. We study the topological properties of this new space, which will also hold for the closed subspace of persistence diagrams. New results include a characterization of convergence with respect to transport metrics, the existence of Fréchet means for any distribution of diagrams, and an exhaustive description of continuous linear representations of persistence diagrams. We also showcase the usefulness of this framework to study random persistence diagrams by providing several statistical results made meaningful thanks to this new formalism."}}
{"id": "63s5oHKxQu6", "cdate": 1622445338928, "mdate": null, "content": {"title": "Minimax adaptive estimation in manifold inference", "abstract": "We focus on the problem of manifold estimation: given a set of observations sampled close to some unknown submanifold M, one wants to recover information about the geometry of M. Minimax estimators which have been proposed so far all depend crucially on the a priori knowledge of some parameters quantifying the regularity of M (such as its reach), whereas those quantities will be unknown in practice. Our contribution to the matter is twofold: first, we introduce a one-parameter family of manifold estimators (M̂ t)t≥0, and show that for some choice of t (depending on the regularity parameters), the corresponding estimator is minimax on the class of models of C2 manifolds introduced in [Genovese et al., Manifold estimation and singular deconvolution under Hausdorff loss]. Second, we propose a completely data-driven selection procedure for the parameter t, leading to a minimax adaptive manifold estimator on this class of models. This selection procedure actually allows to recover the sample rate of the set of observations, and can therefore be used as an hyperparameter in other settings, such as tangent space estimation."}}
