{"id": "yCRDEd7Kynj", "cdate": 1688169600000, "mdate": 1692188465923, "content": {"title": "Improving Diagnostics with Deep Forest Applied to Electronic Health Records", "abstract": "An electronic health record (EHR) is a vital high-dimensional part of medical concepts. Discovering implicit correlations in the information of this data set and the research and informative aspects can improve the treatment and management process. The challenge of concern is the data sources’ limitations in finding a stable model to relate medical concepts and use these existing connections. This paper presents Patient Forest, a novel end-to-end approach for learning patient representations from tree-structured data for readmission and mortality prediction tasks. By leveraging statistical features, the proposed model is able to provide an accurate and reliable classifier for predicting readmission and mortality. Experiments on MIMIC-III and eICU datasets demonstrate Patient Forest outperforms existing machine learning models, especially when the training data are limited. Additionally, a qualitative evaluation of Patient Forest is conducted by visualising the learnt representations in 2D space using the t-SNE, which further confirms the effectiveness of the proposed model in learning EHR representations."}}
{"id": "KKOtPG1Dwx", "cdate": 1675209600000, "mdate": 1680512217655, "content": {"title": "Real-time large-scale supplier order assignments across two-tiers of a supply chain with penalty and dual-sourcing", "abstract": ""}}
{"id": "s8dynRKTlV", "cdate": 1672531200000, "mdate": 1687354390625, "content": {"title": "Adversarial De-confounding in Individualised Treatment Effects Estimation", "abstract": "Observational studies have recently received significant attention from the machine learning community due to the increasingly available non-experimental observational data and the limitations of t..."}}
{"id": "k3vN3QvTTAH", "cdate": 1672531200000, "mdate": 1687354390493, "content": {"title": "Dynamic Inter-treatment Information Sharing for Heterogeneous Treatment Effects Estimation", "abstract": "Existing heterogeneous treatment effects learners, also known as conditional average treatment effects (CATE) learners, lack a general mechanism for end-to-end inter-treatment information sharing, and data have to be split among potential outcome functions to train CATE learners which can lead to biased estimates with limited observational datasets. To address this issue, we propose a novel deep learning-based framework to train CATE learners that facilitates dynamic end-to-end information sharing among treatment groups. The framework is based on \\textit{soft weight sharing} of \\textit{hypernetworks}, which offers advantages such as parameter efficiency, faster training, and improved results. The proposed framework complements existing CATE learners and introduces a new class of uncertainty-aware CATE learners that we refer to as \\textit{HyperCATE}. We develop HyperCATE versions of commonly used CATE learners and evaluate them on IHDP, ACIC-2016, and Twins benchmarks. Our experimental results show that the proposed framework improves the CATE estimation error via counterfactual inference, with increasing effectiveness for smaller datasets."}}
{"id": "Uvm6Js2Z50", "cdate": 1672531200000, "mdate": 1687354390545, "content": {"title": "A Brief Review of Hypernetworks in Deep Learning", "abstract": "Hypernetworks, or hypernets in short, are neural networks that generate weights for another neural network, known as the target network. They have emerged as a powerful deep learning technique that allows for greater flexibility, adaptability, dynamism, faster training, information sharing, and model compression etc. Hypernets have shown promising results in a variety of deep learning problems, including continual learning, causal inference, transfer learning, weight pruning, uncertainty quantification, zero-shot learning, natural language processing, and reinforcement learning etc. Despite their success across different problem settings, currently, there is no review available to inform the researchers about the developments and to help in utilizing hypernets. To fill this gap, we review the progress in hypernets. We present an illustrative example to train deep neural networks using hypernets and propose categorizing hypernets based on five design criteria as inputs, outputs, variability of inputs and outputs, and architecture of hypernets. We also review applications of hypernets across different deep learning problem settings, followed by a discussion of general scenarios where hypernets can be effectively employed. Finally, we discuss the challenges and future directions that remain under-explored in the field of hypernets. We believe that hypernetworks have the potential to revolutionize the field of deep learning. They offer a new way to design and train neural networks, and they have the potential to improve the performance of deep learning models on a variety of tasks. Through this review, we aim to inspire further advancements in deep learning through hypernetworks."}}
{"id": "9c3ysZEU8md", "cdate": 1672531200000, "mdate": 1680512217718, "content": {"title": "Synthesizing Mixed-type Electronic Health Records using Diffusion Models", "abstract": ""}}
{"id": "yf4XGg7owUA", "cdate": 1640995200000, "mdate": 1680512217720, "content": {"title": "Real-time large-scale supplier order assignments across two-tiers of a supply chain with penalty and dual-sourcing", "abstract": ""}}
{"id": "vOL6O4rJpK8", "cdate": 1640995200000, "mdate": 1680512217719, "content": {"title": "Exploitation of material consolidation trade-offs in a multi-tier complex supply networks", "abstract": ""}}
{"id": "rU2tSyuWCw", "cdate": 1640995200000, "mdate": 1680512217650, "content": {"title": "Adversarial De-confounding in Individualised Treatment Effects Estimation", "abstract": ""}}
{"id": "W8IJmSNrt45", "cdate": 1640995200000, "mdate": 1680512217718, "content": {"title": "COPER: Continuous Patient State Perceiver", "abstract": ""}}
