{"id": "brL4rOcT3-u", "cdate": 1640995200000, "mdate": 1680605959473, "content": {"title": "Accelerating container-based deep learning hyperparameter optimization workloads", "abstract": ""}}
{"id": "kt2BDkhNjv", "cdate": 1546300800000, "mdate": 1680606069386, "content": {"title": "On weighted uncertainty sampling in active learning", "abstract": ""}}
{"id": "kmCL5bt9ib", "cdate": 1483228800000, "mdate": null, "content": {"title": "GANs for LIFE: Generative Adversarial Networks for Likelihood Free Inference", "abstract": "We introduce a framework using Generative Adversarial Networks (GANs) for likelihood--free inference (LFI) and Approximate Bayesian Computation (ABC) where we replace the black-box simulator model with an approximator network and generate a rich set of summary features in a data driven fashion. On benchmark data sets, our approach improves on others with respect to scalability, ability to handle high dimensional data and complex probability distributions."}}
{"id": "ZAt16oZXGg", "cdate": 1420070400000, "mdate": null, "content": {"title": "Finding Dense Subgraphs in Relational Graphs", "abstract": "This paper considers the problem of finding large dense subgraphs in relational graphs, i.e., a set of graphs which share a common vertex set. We present an approximation algorithm for finding the densest common subgraph in a relational graph set based on an extension of Charikar’s method for finding the densest subgraph in a single graph. We also present a simple greedy heuristic which can be implemented efficiently for analysis of larger graphs. We give graph dependent bounds on the quality of the solutions returned by our methods. Lastly, we show by empirical evaluation on several benchmark datasets that our method out-performs existing approaches."}}
{"id": "B1xPmjWdZB", "cdate": 1388534400000, "mdate": null, "content": {"title": "Global graph kernels using geometric embeddings", "abstract": "Applications of machine learning methods increasingly deal with graph structured data through kernels. Most existing graph kernels compare graphs in terms of features defined on small subgraphs suc..."}}
{"id": "fWLY0h9EAxv", "cdate": 1356998400000, "mdate": null, "content": {"title": "DLOREAN: Dynamic Location-Aware Reconstruction of Multiway Networks", "abstract": "This paper presents a method for learning time-varying higher-order interactions based on node observations, with application to short-term traffic forecasting based on traffic flow sensor measurements. We incorporate domain knowledge into the design of a new damped periodic kernel which leverages traffic flow patterns towards better structure learning. We introduce location-based regularization for learning models with desirable geographical properties (short-range or long-range interactions). We show using experiments on synthetic and real data, that our approach performs better than static methods for reconstruction of multiway interactions, as well as time-varying methods which recover only pair-wise interactions. Further, we show on real traffic data that our model is useful for short-term traffic forecasting, improving over state-of-the-art."}}
{"id": "Icinzh_8TjO", "cdate": 1356998400000, "mdate": null, "content": {"title": "Entity disambiguation in anonymized graphs using graph kernels", "abstract": "This paper presents a novel method for entity disambiguation in anonymized graphs using local neighborhood structure. Most existing approaches leverage node information, which might not be available in several contexts due to privacy concerns, or information about the sources of the data. We consider this problem in the supervised setting where we are provided only with a base graph and a set of nodes labelled as ambiguous or unambiguous. We characterize the similarity between two nodes based on their local neighborhood structure using graph kernels; and solve the resulting classification task using SVMs. We give empirical evidence on two real-world datasets, comparing our approach to a state-of-the-art method, highlighting the advantages of our approach. We show that using less information, our method is significantly better in terms of either speed or accuracy or both. We also present extensions of two existing graphs kernels, namely, the direct product kernel and the shortest-path kernel, with significant improvements in accuracy. For the direct product kernel, our extension also provides significant computational benefits. Moreover, we design and implement the algorithms of our method to work in a distributed fashion using the GraphLab framework, ensuring high scalability."}}
{"id": "4NFovVxmLNa", "cdate": 1356998400000, "mdate": null, "content": {"title": "Lovász ϑ function, SVMs and finding dense subgraphs", "abstract": "In this paper we establish that the Lovász ϑ function on a graph can be restated as a kernel learning problem. We introduce the notion of SVM-ϑ graphs, on which Lovász ϑ function can be approximated well by a Support vector machine (SVM). We show that Erdös-Rényi random G(n, p) graphs are SVM-ϑ graphs for log4 n/n ≤ p < 1. Even if we embed a large clique of size Θ(√np/1-p) in a G(n, p) graph the resultant graph still remains a SVM-ϑ graph. This immediately suggests an SVM based algorithm for recovering a large planted clique in random graphs. Associated with the ϑ function is the notion of orthogonal labellings. We introduce common orthogonal labellings which extends the idea of orthogonal labellings to multiple graphs. This allows us to propose a Multiple Kernel learning (MKL) based solution which is capable of identifying a large common dense subgraph in multiple graphs. Both in the planted clique case and common subgraph detection problem the proposed solutions beat the state of the art by an order of magnitude."}}
{"id": "RklFwvf6D_1", "cdate": 1325376000000, "mdate": null, "content": {"title": "Intent-aware temporal query modeling for keyword suggestion", "abstract": "This paper presents a data-driven approach for capturing the temporal variations in user search behaviour by modeling the dynamic query relationships using query-log data. The dependence between different queries (in terms of the query words and latent user intent) is represented using hypergraphs which allows us to explore more complex relationships compared to graph-based approaches. This time-varying dependence is modeled using the framework of probabilistic graphical models. The inferred interactions are used for query keyword suggestion - a key task in web information retrieval. Preliminary experiments using query logs collected from internal search engine of a large health care organization yield promising results. In particular, our model is able to capture temporal variations between queries relationships that reflect known trends in disease occurrence. Further, hypergraph-based modeling captures relationships significantly better compared to graph-based approaches."}}
{"id": "HJETk_-_Zr", "cdate": 1325376000000, "mdate": null, "content": {"title": "\"The Lovasz $\\theta$ function, SVMs and finding large dense subgraphs\"", "abstract": "The Lovasz $\\theta$ function of a graph, is a fundamental tool in combinatorial optimization and approximation algorithms. Computing $\\theta$ involves solving a SDP and is extremely expensive even for moderately sized graphs. In this paper we establish that the Lovasz $\\theta$ function is equivalent to a kernel learning problem related to one class SVM. This interesting connection opens up many opportunities bridging graph theoretic algorithms and machine learning. We show that there exist graphs, which we call $SVM-\\theta$ graphs, on which the Lovasz $\\theta$ function can be approximated well by a one-class SVM. This leads to a novel use of SVM techniques to solve algorithmic problems in large graphs e.g. identifying a planted clique of size $\\Theta({\\sqrt{n}})$ in a random graph $G(n,\\frac{1}{2})$. A classic approach for this problem involves computing the $\\theta$ function, however it is not scalable due to SDP computation. We show that the random graph with a planted clique is an example of $SVM-\\theta$ graph, and as a consequence a SVM based approach easily identifies the clique in large graphs and is competitive with the state-of-the-art. Further, we introduce the notion of a ''common orthogonal labeling'' which extends the notion of a ''orthogonal labelling of a single graph (used in defining the $\\theta$ function) to multiple graphs. The problem of finding the optimal common orthogonal labelling is cast as a Multiple Kernel Learning problem and is used to identify a large common dense region in multiple graphs. The proposed algorithm achieves an order of magnitude scalability compared to the state of the art."}}
