{"id": "r9ehuzgG75", "cdate": 1648652916091, "mdate": 1648652916091, "content": {"title": "Model-based identification of conditionally-essential genes from transposon-insertion sequencing data", "abstract": "The understanding of bacterial gene function has been greatly enhanced by recent\nadvancements in the deep sequencing of microbial genomes. Transposon insertion\nsequencing methods combines next-generation sequencing techniques with transposon\nmutagenesis for the exploration of the essentiality of genes under different environmental\nconditions. We propose a model-based method that uses regularized negative binomial\nregression to estimate the change in transposon insertions attributable to gene-environment\nchanges in this genetic interaction study without transformations or uniform normalization.\nAn empirical Bayes model for estimating the local false discovery rate combines unique and\ntotal count information to test for genes that show a statistically significant change in transposon\ncounts. When applied to RB-TnSeq (randomized barcode transposon sequencing)\nand Tn-seq (transposon sequencing) libraries made in strains of Caulobacter crescentus\nusing both total and unique count data the model was able to identify a set of conditionally\nbeneficial or conditionally detrimental genes for each target condition that shed light on their\nfunctions and roles during various stress conditions."}}
{"id": "alHSwFfyaVf", "cdate": 1640995200000, "mdate": 1681657117322, "content": {"title": "Model-based identification of conditionally-essential genes from transposon-insertion sequencing data", "abstract": "Author summary Transposon insertion sequencing allows the study of bacterial gene function by combining next-generation sequencing techniques with transposon mutagenesis under different genetic and environmental perturbations. Our proposed regularized negative binomial regression method improves the quality of analysis of this data."}}
{"id": "Czcq959g5m", "cdate": 1577836800000, "mdate": 1681657117351, "content": {"title": "SCSIM: Jointly simulating correlated single-cell and bulk next-generation DNA sequencing data", "abstract": "Background Recently, it has become possible to collect next-generation DNA sequencing data sets that are composed of multiple samples from multiple biological units where each of these samples may be from a single cell or bulk tissue. Yet, there does not yet exist a tool for simulating DNA sequencing data from such a nested sampling arrangement with single-cell and bulk samples so that developers of analysis methods can assess accuracy and precision. Results We have developed a tool that simulates DNA sequencing data from hierarchically grouped (correlated) samples where each sample is designated bulk or single-cell. Our tool uses a simple configuration file to define the experimental arrangement and can be integrated into software pipelines for testing of variant callers or other genomic tools. Conclusions The DNA sequencing data generated by our simulator is representative of real data and integrates seamlessly with standard downstream analysis tools."}}
{"id": "DreN8UHcEPD", "cdate": 1546300800000, "mdate": 1681657117325, "content": {"title": "Genome Informatics", "abstract": ""}}
