{"id": "_yyerOe4mP", "cdate": 1698580507944, "mdate": 1698580507944, "content": {"title": "Polynomial-time algorithms for continuous metrics on atomic clouds of unordered points", "abstract": "The most fundamental model of a molecule is a cloud of unordered atoms, even without chemical bonds that can depend on thresholds for distances and angles. The strongest equivalence between clouds of atoms is rigid motion, which is a composition of translations and rotations. The existing datasets of experimental and simulated molecules require a continuous quantification of similarity in terms of a distance metric. While clouds of m ordered points were continuously classified by Lagrange’s quadratic forms (distance matrices or Gram matrices), their extensions to m unordered points are impractical due to the exponential number of m! permutations. We propose new metrics that are continuous in general position and are computable in a polynomial time in the number m of unordered points in any Euclidean space of a fixed dimension n."}}
{"id": "kCrzhDQzAX", "cdate": 1698580410106, "mdate": 1698580410106, "content": {"title": "Mathematics of 2-dimensional lattices", "abstract": "A periodic lattice in Euclidean space is the infinite set of all integer linear combinations of basis vectors. Any lattice can be generated by infinitely many different bases. This ambiguity was only partially resolved but standard reductions remain discontinuous under perturbations modelling crystal vibrations. This paper completes a continuous classification of 2-dimensional lattices up to Euclidean isometry (or congruence), rigid motion (without reflections), and similarity (with uniform scaling). The new homogeneous invariants allow easily computable metrics on lattices considered up to the equivalences above. The metrics up to rigid motion are especially non-trivial and settle all remaining questions on (dis)continuity of lattice bases. These metrics lead to real-valued chiral distances that continuously measure lattice deviations from higher-symmetry neighbours. The geometric methods extend the work of Delone, Conway, and Sloane."}}
{"id": "K_qxrquSyDR", "cdate": 1693930169331, "mdate": 1693930169331, "content": {"title": "Recognizing rigid patterns of unlabeled point clouds by complete and continuous isometry invariants with no false negatives and no false positives", "abstract": "Rigid structures such as cars or any other solid objects are often represented by finite clouds of unlabeled points. The most natural equivalence on these point clouds is rigid motion or isometry maintaining all inter-point distances. Rigid patterns of point clouds can be reliably compared only by complete isometry invariants that can also be called equivariant descriptors without false negatives (isometric clouds having different descriptions) and without false positives (non-isometric clouds with the same description). Noise and motion in data motivate a search for invariants that are continuous under perturbations of points in a suitable metric. We propose the first continuous and complete invariant of unlabeled clouds in any Euclidean space. For a fixed dimension, the new metric for this invariant is computable in a polynomial time in the number of points."}}
{"id": "4wrB7Mo9_OQ", "cdate": 1652737839627, "mdate": null, "content": {"title": "Resolving the data ambiguity for periodic crystals", "abstract": "The fundamental model of all solid crystalline materials is a periodic set of atomic centers considered up to rigid motion in Euclidean space. The major obstacle to materials discovery was highly ambiguous representations of periodic crystals that didn't allow fast and reliable comparisons and led to numerous (near-) duplicates in many databases of experimental and simulated crystals. This paper exemplarily resolves the ambiguity by invariants, which are descriptors without false negatives.\n\nThe new Pointwise Distance Distributions (PDD) is a numerical matrix with a near-linear time complexity and an exactly computable metric. The strongest theoretical result is generic completeness (absence of false positives) for all finite and periodic sets of points in any dimension. The strength of PDD is shown by 200B+ pairwise comparisons of all periodic structures in the world's largest collection (Cambridge Structural Database) of existing materials over two days on a modest desktop.\n"}}
{"id": "H1Eb8lfOZB", "cdate": 1388534400000, "mdate": null, "content": {"title": "A Fast and Robust Algorithm to Count Topologically Persistent Holes in Noisy Clouds", "abstract": "Preprocessing a 2D image often produces a noisy cloud of interest points. We study the problem of counting holes in noisy clouds in the plane. The holes in a given cloud are quantified by the topological persistence of their boundary contours when the cloud is analyzed at all possible scales. We design the algorithm to count holes that are most persistent in the filtration of offsets (neighborhoods) around given points. The input is a cloud of n points in the plane without any user-defined parameters. The algorithm has a near linear time and a linear space O(n). The output is the array (number of holes, relative persistence in the filtration). We prove theoretical guarantees when the algorithm finds the correct number of holes (components in the complement) of an unknown shape approximated by a cloud."}}
