{"id": "RU7fr0-M8N", "cdate": 1673287848353, "mdate": null, "content": {"title": "Know Your Space: Inlier and Outlier Construction for Calibrating Medical OOD Detectors", "abstract": "We focus on the problem of producing well-calibrated out-of-distribution (OOD) detectors, in order to enable safe deployment of medical image classifiers. Motivated by the difficulty of curating suitable calibration datasets, synthetic augmentations have become highly prevalent for inlier/outlier specification. While there have been rapid advances in data augmentation techniques, this paper makes a striking finding that the space in which the inliers and outliers are synthesized, in addition to the type of augmentation, plays a critical role in calibrating OOD detectors. Using the popular energy-based OOD detection framework, we find that the optimal protocol is to synthesize latent-space inliers along with diverse pixel-space outliers. Based on empirical studies with multiple medical imaging benchmarks, we demonstrate that our approach consistently leads to superior OOD detection ($15\\% - 35\\%$ in AUROC) over the state-of-the-art in a variety of open-set recognition settings."}}
{"id": "vTXHVAIPfS", "cdate": 1672531200000, "mdate": 1682318292195, "content": {"title": "Optimizing Solar Power Using Array Topology Reconfiguration With Regularized Deep Neural Networks", "abstract": "Reconfiguring photovoltaic (PV) array connections among different topologies such as series-parallel, bridge-link, honeycomb, or total-cross-tied is a popular strategy to mitigate impediments in power production caused by partial shading. Conventional approaches rely on either by-passing or replacing shaded modules with auxiliary panels through complex control mechanisms, optimization strategies, or simulator driven approaches to obtain the best topology. However, these solutions are not scalable and incur significant installation costs and computational overhead, motivating the need to develop ‘smart’ methods for topology reconfiguration. To this end, we propose a regularized neural network based algorithm that leverages panel-level sensor data to reconfigure the array to the topology that maximizes power output under arbitrary shading conditions. Based on our simulations that include wiring losses in different configurations, we observe power improvement of up to 11% through reconfiguration. The proposed algorithm can be easily integrated in any cyber-physical PV system with reconfiguration capabilities and is scalable."}}
{"id": "j0J9upqN5va", "cdate": 1652737802849, "mdate": null, "content": {"title": "Single Model Uncertainty Estimation via Stochastic Data Centering", "abstract": "  We are interested in estimating the uncertainties of deep neural networks, which play an important role in many scientific and engineering problems. In this paper, we present a striking new finding that an ensemble of neural networks with the same weight initialization, trained on datasets that are shifted by a constant bias gives rise to slightly inconsistent trained models, where the differences in predictions are a strong indicator of epistemic uncertainties. Using the neural tangent kernel (NTK), we demonstrate that this phenomena occurs in part because the NTK is not shift-invariant. Since this is achieved via a trivial input transformation, we show that this behavior can therefore be approximated by training a single neural network -- using a technique that we call $\\Delta-$UQ -- that estimates uncertainty around prediction by marginalizing out the effect of the biases during inference. We show that $\\Delta-$UQ's uncertainty estimates are superior to many of the current methods on a variety of benchmarks-- outlier rejection, calibration under distribution shift, and sequential design optimization of black box functions. Code for $\\Delta-$UQ can be accessed at github.com/LLNL/DeltaUQ\n"}}
{"id": "ziFHzd5sra", "cdate": 1640995200000, "mdate": 1682318292085, "content": {"title": "Predicting the Generalization Gap in Deep Models using Anchoring", "abstract": "We address the problem of predicting the generalization gap of deep neural networks under large, natural, and synthetic distribution shifts between source and target domains. This is crucial in understanding how models behave in uncontrollable ‘in-the-wild’ scenarios, but existing techniques fail when target domain becomes very different from the source. Accurately capturing the relationship and distance between the source and target domains is critical for a reliable post-hoc estimation of generalization. In this paper, we propose a novel strategy for directly predicting accuracy on unseen target data with the help of anchoring and pre-text encoding in predictive models. Anchoring has been shown previously to perform effectively in characterizing domain shifts, which we exploit for predicting the generalization gap. Our experiments on the PACS dataset along with synthetic ablations indicate that our approach produces well calibrated accuracy estimates outperforming existing baselines."}}
{"id": "uXPltl7bmB", "cdate": 1640995200000, "mdate": 1682318291845, "content": {"title": "The ASU-DCU International Research and Workforce Development Program on Sensors and Machine Learning", "abstract": "The Arizona State University (ASU) - Dublin City University (DCU) International Research Experiences for Students (IRES) project is a summer workforce development program that embeds students in machine learning and sensor research. This collaborative IRES program, funded by the National Science Foundation (NSF), engages faculty mentors from the Sensor, Signal, Information Processing (SenSIP) Center at ASU, and the Insight SFI Research Centre for Data Analytics and Biodesign Europe at DCU to train students in sensor design, analytics, and machine learning algorithm development. Sensor and machine learning research addresses engineering and computing problems in health care and other related applications. IRES participants are tasked with studying hardware, algorithms and software for various tasks including activity detection, gait modeling, imaging, hemochromatosis prediction, and health care analytics. Crosscutting efforts include training in international research presentations, research documentation and building awareness of international policies and standards. The program includes weekly research updates by the students, participation in workshops and continued engagement after the summer experience. This paper describes the various components of IRES sensor and machine learning research through ongoing center projects at ASU and DCU."}}
{"id": "NY0i8ZXkOr", "cdate": 1640995200000, "mdate": 1682318291834, "content": {"title": "Improved StyleGAN-v2 based Inversion for Out-of-Distribution Images", "abstract": "Inverting an image onto the latent space of pre-trained generators, e.g., StyleGAN-v2, has emerged as a popular strategy to leverage strong image priors for ill-posed restoration. Several studies h..."}}
{"id": "EzIxwtiZTv", "cdate": 1640995200000, "mdate": 1682318291554, "content": {"title": "Instruction Tools for Signal Processing and Machine Learning for Ion-Channel Sensors", "abstract": "Ion Channel sensors have several applications including DNA sequencing, biothreat detection, and medical applications. Ion-channel sensors mimic the selective transport mechanism of cell membranes and can detect a wide range of analytes at the molecule level. Analytes are sensed through changes in s..."}}
{"id": "DE0fWmH2hZ8", "cdate": 1640995200000, "mdate": 1668694885104, "content": {"title": "Single Model Uncertainty Estimation via Stochastic Data Centering", "abstract": "We are interested in estimating the uncertainties of deep neural networks, which play an important role in many scientific and engineering problems. In this paper, we present a striking new finding that an ensemble of neural networks with the same weight initialization, trained on datasets that are shifted by a constant bias gives rise to slightly inconsistent trained models, where the differences in predictions are a strong indicator of epistemic uncertainties. Using the neural tangent kernel (NTK), we demonstrate that this phenomena occurs in part because the NTK is not shift-invariant. Since this is achieved via a trivial input transformation, we show that this behavior can therefore be approximated by training a single neural network -- using a technique that we call $\\Delta-$UQ -- that estimates uncertainty around prediction by marginalizing out the effect of the biases during inference. We show that $\\Delta-$UQ's uncertainty estimates are superior to many of the current methods on a variety of benchmarks -- outlier rejection, calibration under distribution shift, and sequential design optimization of black box functions. Code for $\\Delta-$UQ can be accessed at https://github.com/LLNL/DeltaUQ"}}
{"id": "Cj6UZuOrmr", "cdate": 1640995200000, "mdate": 1682318291628, "content": {"title": "Quantum Machine Learning for Photovoltaic Topology Optimization", "abstract": "Photovoltaic array topology optimization was shown to improve efficiency in renewable energy plants. Previous studies demonstrated improvements via simulation at the level of 7-12% or more. In this paper, we describe solar array topology optimization systems based on quantum machine learning algorithms. The idea of using quantum machine learning can be useful in cases where the objective is to optimize power output in large sites with several thousands of panels. We specifically propose and assess a quantum circuit for a neural network implementation for photovoltaic topology optimization. Results and comparisons are presented using classical and quantum neural network implementations. In addition, solar array topology optimization simulations and comparisons using a quantum neural network are described for different numbers of qubits."}}
{"id": "7_sbpfL2Lv", "cdate": 1640995200000, "mdate": 1682318291570, "content": {"title": "Revisiting Inlier and Outlier Specification for Improved Out-of-Distribution Detection", "abstract": "We focus on the problem of producing well-calibrated out-of-distribution (OOD) detectors, in order to enable safe deployment of medical image classifiers. Motivated by the difficulty of curating suitable calibration datasets, synthetic augmentations have become highly prevalent for inlier/outlier specification. While there have been rapid advances in data augmentation techniques, this paper makes a striking finding that the space in which the inliers and outliers are synthesized, in addition to the type of augmentation, plays a critical role in calibrating OOD detectors. Using the popular energy-based OOD detection framework, we find that the optimal protocol is to synthesize latent-space inliers along with diverse pixel-space outliers. Based on empirical studies with multiple medical imaging benchmarks, we demonstrate that our approach consistently leads to superior OOD detection ($15\\% - 35\\%$ in AUROC) over the state-of-the-art in a variety of open-set recognition settings."}}
