{"id": "NVU4z3fpXd-", "cdate": 1672531200000, "mdate": 1680081871563, "content": {"title": "Koopman Operator Learning: Sharp Spectral Rates and Spurious Eigenvalues", "abstract": ""}}
{"id": "Tz1lknIPVfp", "cdate": 1652737747751, "mdate": null, "content": {"title": "Learning Dynamical Systems via Koopman Operator Regression in Reproducing Kernel Hilbert Spaces", "abstract": "We study a class of dynamical systems modelled as stationary Markov chains that admit an invariant distribution via the corresponding transfer or Koopman operator. While data-driven algorithms to reconstruct such operators are well known, their relationship with statistical learning is largely unexplored. We formalize a framework to learn the Koopman operator from finite data trajectories of the dynamical system. We consider the restriction of this operator to a reproducing kernel Hilbert space and introduce a notion of risk, from which different estimators naturally arise. We link the risk with the estimation of the spectral decomposition of the Koopman operator. These observations motivate a reduced-rank operator regression (RRR) estimator. We derive learning bounds for the proposed estimator, holding both in i.i.d and non i.i.d. settings, the latter in terms of mixing coefficients. Our results suggest RRR might be beneficial over  other  widely used estimators as confirmed in numerical experiments  both for  forecasting and mode decomposition."}}
{"id": "vwCBRDhIA0c", "cdate": 1640995200000, "mdate": 1680081871566, "content": {"title": "Batch Greenkhorn Algorithm for Entropic-Regularized Multimarginal Optimal Transport: Linear Rate of Convergence and Iteration Complexity", "abstract": ""}}
{"id": "Rafo6rBdep", "cdate": 1640995200000, "mdate": 1680081871577, "content": {"title": "Learning Dynamical Systems via Koopman Operator Regression in Reproducing Kernel Hilbert Spaces", "abstract": ""}}
{"id": "lR-LF5VyKmY", "cdate": 1609459200000, "mdate": 1680081871567, "content": {"title": "From pseudospectra of diagonal blocks to pseudospectrum of a full matrix", "abstract": ""}}
{"id": "2LJpJ2SHd4", "cdate": 1609459200000, "mdate": 1680081871568, "content": {"title": "Convergence of Batch Greenkhorn for Regularized Multimarginal Optimal Transport", "abstract": ""}}
{"id": "JiJ1uoWY3qG", "cdate": 1546300800000, "mdate": 1680081871570, "content": {"title": "New pseudospectra localizations with application in ecology and vibration analysis", "abstract": ""}}
{"id": "_1XtUSq0Qe", "cdate": 1514764800000, "mdate": 1680081871568, "content": {"title": "On the Geršgorin-type localizations for nonlinear eigenvalue problems", "abstract": ""}}
{"id": "B1tsSDmvIm", "cdate": 1483228800000, "mdate": 1680081871580, "content": {"title": "On the inertia of the block H-matrices", "abstract": ""}}
{"id": "ieKhGM7Crkl", "cdate": 1451606400000, "mdate": 1680081871741, "content": {"title": "A wider convergence area for the MSTMAOR iteration methods for LCP", "abstract": ""}}
