{"id": "IilnB8jfoP9", "cdate": 1675970198416, "mdate": null, "content": {"title": "Learning protein family manifolds with smoothed energy-based models", "abstract": "We resolve difficulties in training and sampling from discrete energy-based models (EBMs) by learning a smoothed energy landscape, sampling the smoothed data manifold with Langevin Markov chain Monte Carlo, and projecting back to the true data manifold with one-step denoising. Our formalism combines the attractive properties of EBMs and improved sample quality of score-based models, while simplifying training and sampling by requiring only a single noise scale. We demonstrate the robustness of our approach on generative modeling of antibody proteins."}}
{"id": "fQbB0tr3-f0", "cdate": 1675965657349, "mdate": null, "content": {"title": "LEARNING PROTEIN FAMILY MANIFOLDS WITH SMOOTHED ENERGY-BASED MODELS", "abstract": "We resolve difficulties in training and sampling from discrete energy-based models (EBMs) by learning a smoothed energy landscape, sampling the smoothed data manifold with Langevin Markov chain Monte Carlo, and projecting back to the true data manifold with one-step denoising. Our Smoothed Discrete Sampling formalism combines the attractive properties of EBMs and improved sample quality of score-based models, while simplifying training and sampling by requiring only a single noise scale. We demonstrate the robustness of our approach on generative modeling of antibody proteins and successfully express and purify 97% of generated designs in a single round of laboratory experiments."}}
{"id": "KewjiQwka68", "cdate": 1664248842586, "mdate": null, "content": {"title": "Automated Protein Function Description for Novel Class Discovery", "abstract": "Knowledge of protein function is necessary for understanding biological systems, but the discovery of new sequences from high-throughput sequencing technologies far outpaces their functional characterization. Beyond the problem of assigning newly sequenced proteins to known functions, a more challenging issue is discovering novel protein functions. The space of possible functions becomes unlimited when considering designed proteins. Protein function prediction, as it is framed in the case of Gene Ontology term prediction, is a multilabel classification problem with a hierarchical label space. However, this framing does not provide guiding principles for discovering completely novel functions.\nHere we propose a neural machine translation model in order to generate descriptions of protein functions in natural language. In this way, instead of making predictions in the limited label space, our model generates descriptions in the language space, and thus is capable of generating novel functional descriptions. Given the novelty of our approach, we design metrics to evaluate the performance of our model: correctness, specificity and robustness. We provide results of our model in the zero-shot classification setting, scoring functional descriptions that the model has not seen before for proteins that have limited homology to those in the training set. Finally, we show generated function descriptions compared to ground truth descriptions for qualitative evaluation."}}
{"id": "U2rNXaTTXPQ", "cdate": 1664248840948, "mdate": null, "content": {"title": "A Pareto-optimal compositional energy-based model for sampling and optimization of protein sequences", "abstract": "Deep generative models have emerged as a popular machine learning-based approach for inverse design problems in the life sciences. However, these problems often require sampling new designs that satisfy multiple properties of interest in addition to learning the data distribution. This multi-objective optimization becomes more challenging when properties are independent or orthogonal to each other.\nIn this work, we propose a Pareto-compositional energy-based model (pcEBM), a framework that uses multiple gradient descent for sampling new designs that adhere to various constraints in optimizing distinct properties. We demonstrate its ability to learn non-convex Pareto fronts and generate sequences that simultaneously satisfy multiple desired properties across a series of real-world antibody design tasks."}}
{"id": "GN2jsoQFLhi", "cdate": 1664248839193, "mdate": null, "content": {"title": "PropertyDAG: Multi-objective Bayesian optimization of partially ordered, mixed-variable properties for biological sequence design", "abstract": "Bayesian optimization offers a sample-efficient framework for navigating the exploration-exploitation trade-off in the vast design space of biological sequences. Whereas it is possible to optimize the various properties of interest jointly using a multi-objective acquisition function, such as the expected hypervolume improvement (EHVI), this approach does not account for objectives with a hierarchical dependency structure. We consider a common use case where some regions of the Pareto frontier are prioritized over others according to a specified $\\textit{partial ordering}$ in the objectives. For instance, when designing antibodies, we maximize the binding affinity to a target antigen only if it can be expressed in live cell culture---modeling the experimental dependency in which affinity can only be measured for antibodies that can be expressed and thus produced in viable quantities. In general, we may want to confer a partial ordering to the properties such that each property is optimized conditioned on its parent properties satisfying some feasibility condition. To this end, we present PropertyDAG, a framework that operates on top of the traditional multi-objective BO to impose a desired partial ordering on the objectives, e.g. expression $\\rightarrow$ affinity. We demonstrate its performance over multiple simulated active learning iterations on a penicillin production task, toy numerical problem, and a real-world antibody design task."}}
{"id": "1ole6zX6USA", "cdate": 1648731966261, "mdate": null, "content": {"title": "Multi-Segment Preserving Sampling for Deep Manifold Sampler", "abstract": "Deep generative modeling for biological sequences presents a unique challenge in reconciling the bias-variance trade-off between explicit biological insight and model flexibility.\nThe deep manifold sampler was recently proposed as a means to iteratively sample variable-length protein sequences. \nSampling was done by exploiting the gradients from a function predictor trained on top of the manifold sampler.\nIn this work, we introduce an alternative approach to guided sampling that enables the direct inclusion of domain-specific knowledge by designating preserved and non-preserved segments along the input sequence, thereby restricting variation to only select regions.\nWe call this method ``multi-segment preserving sampling\" and present its effectiveness in the context of antibody design.\nWe train two models: a deep manifold sampler and a GPT-2 language model on nearly six million heavy chain sequences annotated with the \\textit{IGHV1-18} gene.\nDuring sampling, we restrict variation to only the complementarity-determining region 3 (CDR3) of the input. We obtain log probability scores from a GPT-2 model for each sampled CDR3 and demonstrate that multi-segment preserving sampling generates reasonable designs while maintaining the desired, preserved regions."}}
{"id": "d7xXAsTlc-q", "cdate": 1640995200000, "mdate": 1680275488897, "content": {"title": "A Pareto-optimal compositional energy-based model for sampling and optimization of protein sequences", "abstract": ""}}
{"id": "VP8Rh8498_", "cdate": 1640995200000, "mdate": 1680275488898, "content": {"title": "Multi-segment preserving sampling for deep manifold sampler", "abstract": ""}}
{"id": "CfvtTy8R7EB", "cdate": 1640995200000, "mdate": 1682341832860, "content": {"title": "PropertyDAG: Multi-objective Bayesian optimization of partially ordered, mixed-variable properties for biological sequence design", "abstract": "Bayesian optimization offers a sample-efficient framework for navigating the exploration-exploitation trade-off in the vast design space of biological sequences. Whereas it is possible to optimize the various properties of interest jointly using a multi-objective acquisition function, such as the expected hypervolume improvement (EHVI), this approach does not account for objectives with a hierarchical dependency structure. We consider a common use case where some regions of the Pareto frontier are prioritized over others according to a specified $\\textit{partial ordering}$ in the objectives. For instance, when designing antibodies, we would like to maximize the binding affinity to a target antigen only if it can be expressed in live cell culture -- modeling the experimental dependency in which affinity can only be measured for antibodies that can be expressed and thus produced in viable quantities. In general, we may want to confer a partial ordering to the properties such that each property is optimized conditioned on its parent properties satisfying some feasibility condition. To this end, we present PropertyDAG, a framework that operates on top of the traditional multi-objective BO to impose this desired ordering on the objectives, e.g. expression $\\rightarrow$ affinity. We demonstrate its performance over multiple simulated active learning iterations on a penicillin production task, toy numerical problem, and a real-world antibody design task."}}
{"id": "Hq8ZRT4B6Jc", "cdate": 1609459200000, "mdate": 1645200582295, "content": {"title": "NetQuilt: deep multispecies network-based protein function prediction using homology-informed network similarity", "abstract": "Transferring knowledge between species is challenging: different species contain distinct proteomes and cellular architectures, which cause their proteins to carry out different functions via different interaction networks. Many approaches to protein functional annotation use sequence similarity to transfer knowledge between species. These approaches cannot produce accurate predictions for proteins without homologues of known function, as many functions require cellular context for meaningful prediction. To supply this context, network-based methods use protein-protein interaction (PPI) networks as a source of information for inferring protein function and have demonstrated promising results in function prediction. However, most of these methods are tied to a network for a single species, and many species lack biological networks."}}
