{"id": "qk1qpCN-k6", "cdate": 1652737736165, "mdate": null, "content": {"title": "Information bottleneck theory of high-dimensional regression: relevancy, efficiency and optimality", "abstract": "Avoiding overfitting is a central challenge in machine learning, yet many large neural networks readily achieve zero training loss. This puzzling contradiction necessitates new approaches to the study of overfitting. Here we quantify overfitting via residual information, defined as the bits in fitted models that encode noise in training data. Information efficient learning algorithms minimize residual information while maximizing the relevant bits, which are predictive of the unknown generative models. We solve this optimization to obtain the information content of optimal algorithms for a linear regression problem and compare it to that of randomized ridge regression. Our results demonstrate the fundamental trade-off between residual and relevant information and characterize the relative information efficiency of randomized regression with respect to optimal algorithms. Finally, using results from random matrix theory, we reveal the information complexity of learning a linear map in high dimensions and unveil information-theoretic analogs of double and multiple descent phenomena."}}
{"id": "A2HvBPoSBMs", "cdate": 1621629889024, "mdate": null, "content": {"title": "Perturbation Theory for the Information Bottleneck", "abstract": "Extracting relevant information from data is crucial for all forms of learning. The information bottleneck (IB) method formalizes this, offering a mathematically precise and conceptually appealing framework for understanding learning phenomena. However the nonlinearity of the IB problem makes it computationally expensive and analytically intractable in general. Here we derive a perturbation theory for the IB method and report the first complete characterization of the learning onset, the limit of maximum relevant information per bit extracted from data. We test our results on synthetic probability distributions, finding good agreement with the exact numerical solution near the onset of learning. We explore the difference and subtleties in our derivation and previous attempts at deriving a perturbation theory for the learning onset and attribute the discrepancy to a flawed assumption. Our work also provides a fresh perspective on the intimate relationship between the IB method and the strong data processing inequality."}}
{"id": "0p3zmb_HDQ", "cdate": 1483228800000, "mdate": 1681651385377, "content": {"title": "Exploiting ecology in drug pulse sequences in favour of population reduction", "abstract": ""}}
{"id": "kHdCWd_Y_u", "cdate": 1420070400000, "mdate": 1681651385644, "content": {"title": "Bias, Belief and Consensus: Collective opinion formation on fluctuating networks", "abstract": ""}}
