{"id": "0vaRJQwjnO", "cdate": 1682899200000, "mdate": 1684139404479, "content": {"title": "Independence tests with random subspace of two random vectors in high dimension", "abstract": ""}}
{"id": "wqE9OpU1i_", "cdate": 1640995200000, "mdate": 1684138434617, "content": {"title": "A rank-based high-dimensional test for equality of mean vectors", "abstract": ""}}
{"id": "ks3uEyhDCw", "cdate": 1640995200000, "mdate": 1684139404628, "content": {"title": "On a Connection Between Fast and Sparse Oblivious Subspace Embeddings", "abstract": "Fast Johnson-Lindenstrauss Transform (FJLT) and Sparse Johnson-Lindenstrauss Transform (SJLT) are two important oblivious subspace embeddings. So far, the developments of these two methods are almost orthogonal. In this work, we propose an iterative algorithm for oblivious subspace embedding which makes a connection between these two methods. The proposed method is built upon an iterative implementation of FJLT and is equipped with several theoretically motivated modifications. One important strategy we adopt is the early stopping strategy. On the one hand, the early stopping strategy makes our algorithm fast. On the other hand, it results in a sparse embedding matrix. As a result, the proposed algorithm is not only faster than the FJLT, but also faster than the SJLT with the same degree of sparsity. We present a general theoretical framework to analyze the embedding property of sparse embedding methods, which is used to prove the embedding property of the proposed method. This framework is also of independent interest. Lastly, we conduct numerical experiments to verify the good performance of the proposed algorithm."}}
{"id": "R1uF9YxIw3K", "cdate": 1640995200000, "mdate": 1684139404488, "content": {"title": "A generalized Wilcoxon-Mann-Whitney type test for multivariate data through pairwise distance", "abstract": ""}}
{"id": "6HOF0kDP7R", "cdate": 1640995200000, "mdate": 1684139404615, "content": {"title": "Distributed estimation in heterogeneous reduced rank regression: With application to order determination in sufficient dimension reduction", "abstract": ""}}
{"id": "67aYLnvYLtc", "cdate": 1640995200000, "mdate": 1684138434621, "content": {"title": "Iterative Double Sketching for Faster Least-Squares Optimization", "abstract": "This work is concerned with the overdetermined linear least-squares problem for large scale data. We generalize the iterative Hessian sketching (IHS) algorithm and propose a new sketching framework..."}}
{"id": "trUsE8-kLDS", "cdate": 1609459200000, "mdate": 1684139404440, "content": {"title": "Risk and return prediction for pricing portfolios of non-performing consumer credit", "abstract": "We design a system for risk-analyzing and pricing portfolios of non-performing consumer credit loans. The rapid development of credit lending business for consumers heightens the need for trading portfolios formed by overdue loans as a manner of risk transferring. However, the problem is nontrivial technically and related research is absent. We tackle the challenge by building a bottom-up architecture, in which we model the distribution of every single loan's repayment rate, followed by modeling the distribution of the portfolio's overall repayment rate. To address the technical issues encountered, we adopt the approaches of simultaneous quantile regression, R-copula, and Gaussian one-factor copula model. To our best knowledge, this is the first study that successfully adopts a bottom-up system for analyzing credit portfolio risks of consumer loans. We conduct experiments on a vast amount of data and prove that our methodology can be applied successfully in real business tasks."}}
{"id": "ld-hORXer-", "cdate": 1609459200000, "mdate": 1684139404413, "content": {"title": "Two-sample test in high dimensions through random selection", "abstract": ""}}
{"id": "sjbu_sI5H6", "cdate": 1546300800000, "mdate": 1684139404490, "content": {"title": "A modified mean-variance feature-screening procedure for ultrahigh-dimensional discriminant analysis", "abstract": ""}}
{"id": "PReameGg_nU", "cdate": 1546300800000, "mdate": 1684139404440, "content": {"title": "Session persistence for dynamic web applications in Named Data Networking", "abstract": ""}}
