{"id": "p84J-SO5CQd", "cdate": 1677628800000, "mdate": 1681510503108, "content": {"title": "Computation of the Distance-Based Bound on Strong Structural Controllability in Networks", "abstract": ""}}
{"id": "eULyWuXnUIW", "cdate": 1677628800000, "mdate": 1681510502962, "content": {"title": "Robustness of Learning in Games With Heterogeneous Players", "abstract": ""}}
{"id": "UeEMAXE_rQR", "cdate": 1672531200000, "mdate": 1681510503010, "content": {"title": "Distributed Design of Controllable and Robust Networks using Zero Forcing and Graph Grammars", "abstract": ""}}
{"id": "Bwl6yxw6Ga", "cdate": 1672531200000, "mdate": 1681510502893, "content": {"title": "Resilient Strong Structural Controllability in Networks using Leaky Forcing in Graphs", "abstract": ""}}
{"id": "N6iz-EQkuar", "cdate": 1663850231824, "mdate": null, "content": {"title": "Network Controllability Perspectives on Graph Representation", "abstract": "Graph representations in fixed dimensional feature space are vital in applying learning tools and data mining algorithms to perform graph analytics. Such representations must encode the graph's topological and structural information at the local and global scales without posing significant computation overhead. This paper employs a unique approach grounded in networked control system theory to obtain expressive graph representations with desired properties. We consider graphs as networked dynamical systems and study their controllability properties to explore the underlying graph structure. The controllability of a networked dynamical system profoundly depends on the underlying network topology, and we exploit this relationship to design novel graph representations using controllability Gramian and related metrics. We discuss the merits of this new approach in terms of the desired properties (for instance, permutation and scale invariance) of the proposed representations. Our evaluation of various benchmark datasets in the graph classification framework demonstrates that the proposed representations either outperform (sometimes by more than 6%), or give similar results to the state-of-the-art embeddings. "}}
{"id": "laIXGzyJw3", "cdate": 1640995200000, "mdate": 1681510502811, "content": {"title": "Resilient distributed vector consensus using centerpoint", "abstract": ""}}
{"id": "XYmzQVs5Iv", "cdate": 1640995200000, "mdate": 1681510502987, "content": {"title": "Strong structural controllability of networks: Comparison of bounds using distances and zero forcing", "abstract": ""}}
{"id": "JoOwyRpZ2d", "cdate": 1640995200000, "mdate": 1681510503052, "content": {"title": "Resilient Multi-agent Reinforcement Learning Using Medoid and Soft-medoid Based Aggregation", "abstract": ""}}
{"id": "JN1ZLt-Z8ky", "cdate": 1640995200000, "mdate": 1681510503091, "content": {"title": "Resilient distributed vector consensus using centerpoint", "abstract": ""}}
{"id": "GRyLfnk_HA", "cdate": 1640995200000, "mdate": 1681510502824, "content": {"title": "Byzantine Resilient Distributed Learning in Multirobot Systems", "abstract": ""}}
