{"id": "zdC4STY_jJ", "cdate": 1672531200000, "mdate": 1695955644283, "content": {"title": "Leveraging Label Non-Uniformity for Node Classification in Graph Neural Networks", "abstract": "In node classification using graph neural networks (GNNs), a typical model generates logits for different class labels at each node. A softmax layer often outputs a label prediction based on the largest logit. We demonstrate that it is possible to infer hidden graph structural information from the dataset using these logits. We introduce the key notion of label non-uniformity, which is derived from the Wasserstein distance between the softmax distribution of the logits and the uniform distribution. We demonstrate that nodes with small label non-uniformity are harder to classify correctly. We theoretically analyze how the label non-uniformity varies across the graph, which provides insights into boosting the model performance: increasing training samples with high non-uniformity or dropping edges to reduce the maximal cut size of the node set of small non-uniformity. These mechanisms can be easily added to a base GNN model. Experimental results demonstrate that our approach improves the performance of many benchmark base models."}}
{"id": "yeMUPLps03V", "cdate": 1672531200000, "mdate": 1695955644245, "content": {"title": "Image Patch-Matching With Graph-Based Learning in Street Scenes", "abstract": "Matching landmark patches from a real-time image captured by an on-vehicle camera with landmark patches in an image database plays an important role in various computer perception tasks for autonomous driving. Current methods focus on local matching for regions of interest and do not take into account spatial neighborhood relationships among the image patches, which typically correspond to objects in the environment. In this paper, we construct a spatial graph with the graph vertices corresponding to patches and edges capturing the spatial neighborhood information. We propose a joint feature and metric learning model with graph-based learning. We provide a theoretical basis for the graph-based loss by showing that the information distance between the distributions conditioned on matched and unmatched pairs is maximized under our framework. We evaluate our model using several street-scene datasets and demonstrate that our approach achieves state-of-the-art matching results."}}
{"id": "weTwnW1bkb", "cdate": 1672531200000, "mdate": 1695955644215, "content": {"title": "Graph Signal Processing Over a Probability Space of Shift Operators", "abstract": "Graph signal processing (GSP) uses a shift operator to define a Fourier basis for the set of graph signals. The shift operator is often chosen to capture the graph topology. However, in many applications, the graph topology may be unknown a priori, its structure uncertain, or generated randomly from a predefined set for each observation. Each graph topology gives rise to a different shift operator. In this paper, we develop a GSP framework over a probability space of shift operators. We develop the corresponding notions of Fourier transform, MFC filters, and band-pass filters, which subsumes classical GSP theory as the special case where the probability space consists of a single shift operator. We show that an MFC filter under this framework is the expectation of random convolution filters in classical GSP, while the notion of bandlimitedness requires additional wiggle room from being simply a fixed point of a band-pass filter. We develop a mechanism that facilitates mapping from one space of shift operators to another, which allows our framework to be applied to a rich set of scenarios. We demonstrate how the theory can be applied by using both synthetic and real datasets."}}
{"id": "wI2V_7LbIu", "cdate": 1672531200000, "mdate": 1695955644267, "content": {"title": "Architectural Exploration of Neuromorphic Compression based Neural Sensing for Next-Gen Wireless implantable-BMI", "abstract": "This work explores the architectural trade-offs and implications of a neuromorphic compression based neural sensing architecture with address-event representation inspired readout protocol for massively parallel, next-gen wireless iBMI. We use quantitative metrics such as root-mean-square error and correlation coefficient between the original and recovered signal to assess the effect of neuromorphic compression on spike shape, and spike detection accuracy, sensitivity, and false detection rate to understand the effect of compression on downstream iBMI tasks. We demonstrate that a data compression ratio of <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$&gt; 50$</tex> can be achieved by selective transmission of event pulses generated in different modes for large electrode arrays with a correlation coefficient of <tex xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">$\\approx 0.9$</tex> and a spike detection accuracy of over 90%."}}
{"id": "uwCIUS6-a2", "cdate": 1672531200000, "mdate": 1695955644296, "content": {"title": "Node Embedding from Neural Hamiltonian Orbits in Graph Neural Networks", "abstract": "In the graph node embedding problem, embedding spaces can vary significantly for different data types, leading to the need for different GNN model types. In this paper, we model the embedding update of a node feature as a Hamiltonian orbit over time. Since the Hamiltonian orbits generalize the exponential maps, this approach allows us to learn the underlying manifold of the graph in training, in contrast to most of the existing literature that assumes a fixed graph embedding manifold with a closed exponential map solution. Our proposed node embedding strategy can automatically learn, without extensive tuning, the underlying geometry of any given graph dataset even if it has diverse geometries. We test Hamiltonian functions of different forms and verify the performance of our approach on two graph node embedding downstream tasks: node classification and link prediction. Numerical experiments demonstrate that our approach adapts better to different types of graph datasets than popular state-of-the-art graph node embedding GNNs. The code is available at \\url{https://github.com/zknus/Hamiltonian-GNN}."}}
{"id": "pmW34FTsZeb", "cdate": 1672531200000, "mdate": 1695955644244, "content": {"title": "A Sub-meter Accurate Positioning using 5G Double-difference Carrier Phase Measurements", "abstract": "Apart from communications, the Fifth Generation (5G) technology is also motivated by positioning requirements down to the sub-meter level across industry verticals. In this work, we utilize Universal Software Radio Peripheral to transmit and receive the 5G New Radio signals. The obtained samples are then processed by the proposed 5G code and carrier phase software defined receiver. In this process, the dedicated 5G Positioning Reference Signal (PRS) is adopted to obtain time of arrival estimates using more accurate carrier phase measure-ments instead of code phase measurements. The continuously transmitted 5G PRSs over time enable accurate carrier phase tracking and avoid ambiguity problems during the tracking stage in line-of-sight environments. Furthermore, a roadside unit is set up to observe the same signals and cancel out the measurement error introduced by the clock offset between two transmitters. Finally, some field experiments are carried out, and the experimental results indicate that using 5G double-difference carrier phase measurements from only four transmitters, a position root mean square error of 0.790m is achievable."}}
{"id": "pLEevtoFMZ", "cdate": 1672531200000, "mdate": 1695955644289, "content": {"title": "Graph Neural Convection-Diffusion with Heterophily", "abstract": "Graph neural networks (GNNs) have shown promising results across various graph learning tasks, but they often assume homophily, which can result in poor performance on heterophilic graphs. The connected nodes are likely to be from different classes or have dissimilar features on heterophilic graphs. In this paper, we propose a novel GNN that incorporates the principle of heterophily by modeling the flow of information on nodes using the convection-diffusion equation (CDE). This allows the CDE to take into account both the diffusion of information due to homophily and the ``convection'' of information due to heterophily. We conduct extensive experiments, which suggest that our framework can achieve competitive performance on node classification tasks for heterophilic graphs, compared to the state-of-the-art methods. The code is available at \\url{https://github.com/zknus/Graph-Diffusion-CDE}."}}
{"id": "o3aP7bqo4zB", "cdate": 1672531200000, "mdate": 1681650111207, "content": {"title": "Node-Specific Space Selection via Localized Geometric Hyperbolicity in Graph Neural Networks", "abstract": ""}}
{"id": "no5rZ5SwHmd", "cdate": 1672531200000, "mdate": 1681650111028, "content": {"title": "Node Embedding from Hamiltonian Information Propagation in Graph Neural Networks", "abstract": ""}}
{"id": "lumqxt29u0", "cdate": 1672531200000, "mdate": 1695955644295, "content": {"title": "Generalized signals on simplicial complexes", "abstract": "Topological signal processing (TSP) over simplicial complexes typically assumes observations associated with the simplicial complexes are real scalars. In this paper, we develop TSP theories for the case where observations belong to abelian groups more general than real numbers, including function spaces that are commonly used to represent time-varying signals. Our approach generalizes the Hodge decomposition and allows for signal processing tasks to be performed on these more complex observations. We propose a unified and flexible framework for TSP that expands its applicability to a wider range of signal processing applications. Numerical results demonstrate the effectiveness of this approach and provide a foundation for future research in this area."}}
