{"id": "T6NIgvKRb7b", "cdate": 1663850547851, "mdate": null, "content": {"title": "Denoising Differential Privacy in Split Learning", "abstract": "Differential Privacy (DP) is applied in split learning to address privacy concerns about data leakage. Previous work combines split neural network (SplitNN) training with DP by adding noise to the intermediate results during the forward pass. Unfortunately, DP noise injection significantly degrades the training accuracy of SplitNN. This paper focuses on improving the training accuracy of DP-protected SplitNNs without sacrificing the privacy guarantee. We propose two denoising techniques, namely scaling and random masking. Our theoretical investigation shows that both of our techniques achieve accurate estimation of the intermediate variables during the forward pass of SplitNN training. Our experiments with real networks demonstrate that our denoising approach allows SplitNN training that can tolerate high levels of DP noise while achieving almost the same accuracy as the non-private (i.e., non-DP protected) baseline. Interestingly, we show that after applying our techniques, the resultant network is more resilient against a state-of-the-art attack, compared to the plain DP-protected baseline."}}
{"id": "q-xYL3_W64", "cdate": 1640995200000, "mdate": 1682329432179, "content": {"title": "Strengthening Order Preserving Encryption with Differential Privacy", "abstract": "Ciphertexts of an order-preserving encryption (OPE) scheme preserve the order of their corresponding plaintexts. However, OPEs are vulnerable to inference attacks that exploit this preserved order. Differential privacy (DP) has become the de-facto standard for data privacy. One of the most attractive properties of DP is that any post-processing computation, such as inference attacks, performed on the noisy output of a DP algorithm does not degrade its privacy guarantee. In this work, we propose a novel differentially private order preserving encryption scheme, OP ε. Under OP ε, the leakage of order from the ciphertexts is differentially private. Consequently, in the least, OP ε ensures a formal guarantee (a relaxed DP guarantee) even in the face of inference attacks. To the best of our knowledge, this is the first work to combine DP with a OPE. OP ε is based on a novel differentially private order preserving encoding scheme, OPεc, that can be of independent interest in the local DP setting. We demonstrate OP ε's utility in answering range queries via empirical evaluation on four real-world datasets. For instance, OP ε misses only around 4 in every 10K correct records on average for a dataset of size ~732K with an attribute of domain size ~18K and ε= 1."}}
{"id": "i16y2Q6gbP-", "cdate": 1640995200000, "mdate": 1682329431710, "content": {"title": "OpBoost: A Vertical Federated Tree Boosting Framework Based on Order-Preserving Desensitization", "abstract": ""}}
{"id": "0heosUPKob", "cdate": 1640995200000, "mdate": 1682329431755, "content": {"title": "Scape: Scalable Collaborative Analytics System on Private Database with Malicious Security", "abstract": "Many data applications can be facilitated or even spawned by joint analysis on databases held by different owners, but privacy concerns are currently the biggest hindrance. Though a practical privacy-preserving collaborative database analytics system is strongly desired, existing approaches do not support efficient queries for several essential SQL operators such as the general join, especially on large databases. In this paper, we propose, analyze, and implement Scape, a Scalable Collaborative Analytics system on Private databasE with malicious security. In Scape, databases from different parties are secretly shared to three non-colluding computing parties. Users can perform various SQL queries (including fully functional Join, Group by, Aggregation, etc.) on shared databases, and all entities learn nothing beyond their priori knowledge during the whole execution even when they deviate from protocols. At the heart of Scape lies several asymptotically efficient SQL protocols. Particularly, our general join protocol has O (n log <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</sup> n + m) communication/computation cost when joining two tables with o (n) rows to a table with 0 (m) rows, significantly outperforming the state-of-the-art approach with O(n <sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</sup> ) cost. The benchmark results confirm the advantages of Scape, which is up to 25 x faster than the baseline."}}
{"id": "mumV4di0R45", "cdate": 1609459200000, "mdate": 1682329431573, "content": {"title": "Correlated Randomness Teleportation via Semi-trusted Hardware - Enabling Silent Multi-party Computation", "abstract": "With the advancement of the trusted execution environment (TEE) technologies, hardware-supported secure computing becomes increasingly popular due to its efficiency. During the protocol execution, typically, the players need to contact a third-party server for remote attestation, ensuring the validity of the involved trusted hardware component, such as Intel SGX, as well as the integrity of the computation result. When the hardware manufacturer is not fully trusted, sensitive information may be leaked to the third-party server through backdoors, steganography, and kleptography, etc. In this work, we introduce a new security notion called semi-trusted hardware model, where the adversary is allowed to passively or maliciously corrupt the hardware. Therefore, she can learn the input of the hardware component and might also tamper its output. We then show how to utilize such semi-trusted hardwares for correlated randomness teleportation. When the semi-trusted hardware is instantiated by Intel SGX, to generate 10k random OT’s, our protocol is 24X and 450X faster than the EMP-IKNP-ROT in the LAN and WAN setting, respectively. When SGX is used to teleport Garbled circuits, the resulting two-party computation protocol is 5.3-5.7X and 43-47X faster than the EMP-SH2PC in the LAN and WAN setting, respectively, for the AES-128, SHA-256, and SHA-512 evaluation. We also show how to achieve malicious security with little overhead."}}
{"id": "tfOZGtRdXR", "cdate": 1577836800000, "mdate": 1682329431655, "content": {"title": "FDCO: attribute-based fast data cloud-outsourcing scheme for mobile devices", "abstract": ""}}
{"id": "2dElKNuiv3w", "cdate": 1514764800000, "mdate": 1682329431705, "content": {"title": "Efficient subtree-based encryption for fuzzy-entity data sharing", "abstract": ""}}
{"id": "ovl9KiSrSen", "cdate": 1483228800000, "mdate": 1682329432126, "content": {"title": "Provably Secure Self-Extractable Encryption", "abstract": ""}}
{"id": "lG5JICFtoZ", "cdate": 1483228800000, "mdate": 1682329432356, "content": {"title": "Efficient CCA2 Secure Revocable Multi-authority Large-Universe Attribute-Based Encryption", "abstract": ""}}
{"id": "d1alw6_c8xi", "cdate": 1483228800000, "mdate": 1682329432301, "content": {"title": "Energy Efficiency Optimization for Communication of Air-Based Information Network with Guaranteed Timing Constraints", "abstract": ""}}
