{"id": "kr69sCZ-62S", "cdate": 1675209600000, "mdate": 1681688954263, "content": {"title": "Robust federated learning under statistical heterogeneity via hessian-weighted aggregation", "abstract": "In federated learning, client models are often trained on local training sets that vary in size and distribution. Such statistical heterogeneity in training data leads to performance variations across local models. Even within a model, some parameter estimates can be more reliable than others. Most existing FL approaches (such as FedAvg), however, do not explicitly address such variations in client parameter estimates and treat all local parameters with equal importance in the model aggregation. This disregard of varying evidential credence among client models often leads to slow convergence and a sensitive global model. We address this gap by proposing an aggregation mechanism based upon the Hessian matrix. Further, by making use of the first-order information of the loss function, we can use the Hessian as a scaling matrix in a manner akin to that employed in Quasi-Newton methods. This treatment captures the impact of data quality variations across local models. Experiments show that our method is superior to the baselines of Federated Average (FedAvg), FedProx, Federated Curvature (FedCurv) and Federated Newton Learn (FedNL) for image classification on MNIST, Fashion-MNIST, and CIFAR-10 datasets when the client models are trained using statistically heterogeneous data."}}
{"id": "b6Qw7iaaBCY", "cdate": 1672531200000, "mdate": 1681688954258, "content": {"title": "Cyber Code Intelligence for Android Malware Detection", "abstract": "Evolving Android malware poses a severe security threat to mobile users, and machine-learning (ML)-based defense techniques attract active research. Due to the lack of knowledge, many zero-day families’ malware may remain undetected until the classifier gains specialized knowledge. The most existing ML-based methods will take a long time to learn new malware families in the latest malware family landscape. Existing ML-based Android malware detection and classification methods struggle with the fast evolution of the malware landscape, particularly in terms of the emergence of zero-day malware families and limited representation of single-view features. In this article, a new multiview feature intelligence (MFI) framework is developed to learn the representation of a targeted capability from known malware families for recognizing unknown and evolving malware with the same capability. The new framework performs reverse engineering to extract multiview heterogeneous features, including semantic string features, API call graph features, and smali opcode sequential features. It can learn the representation of a targeted capability from known malware families through a series of processes of feature analysis, selection, aggregation, and encoding, to detect unknown Android malware with shared target capability. We create a new dataset with ground-truth information regarding capability. Many experiments are conducted on the new dataset to evaluate the performance and effectiveness of the new method. The results demonstrate that the new method outperforms three state-of-the-art methods, including: 1) Drebin; 2) MaMaDroid; and 3) <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$N$ </tex-math></inline-formula> -opcode, when detecting unknown Android malware with targeted capabilities."}}
{"id": "sEBrx45O69U", "cdate": 1640995200000, "mdate": 1681688954256, "content": {"title": "Attention-based Feature Fusion for Reconstructing Gene-Regulatory Interactions", "abstract": "Reconstructing gene regulatory networks (GRNs) from expression data is vital for understanding gene transcrip- tion. Although increasingly advanced algorithms, particularly deep learning models, are proposed to mine potential gene regulatory interactions, insufficient effort has been invested in improving the reliability of features in the presence of biological variability between expression samples. In this research, we propose a robust feature fusion method inspired by emerging attention-based techniques in computer vision. Our method can capture the functional asymmetry between transcription factors (TF) and target genes with an important adaptation using differentiated attention heads. Based on three different gene expression datasets: in silico, E.coli, and S.cerevisiae, we demonstrate that our method is superior to other state-of-the- art competitors. The overall GRN reconstruction performance of our method yields a gain of 3%-14% in the AUC score over the competing models."}}
{"id": "XeiKeWRlIo", "cdate": 1640995200000, "mdate": 1681688954260, "content": {"title": "Novel-domain Object Segmentation via Reliability-aware Teacher Ensemble", "abstract": "Object segmentation in a novel domain is challenging due to the scarcity of high-quality label data. A common practice is to leverage pseudolabels generated from a teacher model pretrained on benchmark datasets. However, such a teacher model may produce unreliable pseudolabels due to semantic shift from a standard domain to a novel domain. Blindly trusting pseudolabels may actually harm the target model's performance. To address this challenge, we propose a method to optimally adapt pseudolabels to work on a novel domain. At the center of our approach is a reliability score for pseudolabels that allows for an optimal mix of true labels and pseudolabels in training. Mirroring the standard practise of creating a benchmark dataset (such as ImageNet or GoEmotions), we use an ensemble of teacher models, instead of a single teacher model. Our reliability score captures both self-confidence of each teacher model and inter-model consistency among teacher models. This reliability score provides a disciplined way to balance the additional information in pseudolabels and the risk of overfitting incorrect labels. To test our approach for novel-domain object segmentation, we created an oil-leak surveillance dataset, which we have made publicly available. The experimental results show that our method achieves higher segmentation IoU over some strong baselines."}}
{"id": "7H2VuvVCLs", "cdate": 1640995200000, "mdate": 1681688954259, "content": {"title": "A multiple feature fusion framework for video emotion recognition in the wild", "abstract": "Human emotions can be recognized from facial expressions captured in videos. It is a growing research area in which many have attempted to improve video emotion detection in both lab-controlled and u..."}}
{"id": "qDnWYCpsJKG", "cdate": 1609459200000, "mdate": null, "content": {"title": "A Survey of Android Malware Detection with Deep Neural Models", "abstract": "Deep Learning (DL) is a disruptive technology that has changed the landscape of cyber security research. Deep learning models have many advantages over traditional Machine Learning (ML) models, particularly when there is a large amount of data available. Android malware detection or classification qualifies as a big data problem because of the fast booming number of Android malware, the obfuscation of Android malware, and the potential protection of huge values of data assets stored on the Android devices. It seems a natural choice to apply DL on Android malware detection. However, there exist challenges for researchers and practitioners, such as choice of DL architecture, feature extraction and processing, performance evaluation, and even gathering adequate data of high quality. In this survey, we aim to address the challenges by systematically reviewing the latest progress in DL-based Android malware detection and classification. We organize the literature according to the DL architecture, including FCN, CNN, RNN, DBN, AE, and hybrid models. The goal is to reveal the research frontier, with the focus on representing code semantics for Android malware detection. We also discuss the challenges in this emerging field and provide our view of future research opportunities and directions."}}
{"id": "qBBU2t90zVW", "cdate": 1609459200000, "mdate": 1681688954262, "content": {"title": "Software Vulnerability Discovery via Learning Multi-Domain Knowledge Bases", "abstract": "Machine learning (ML) has great potential in automated code vulnerability discovery. However, automated discovery application driven by off-the-shelf machine learning tools often performs poorly due to the shortage of high-quality training data. The scarceness of vulnerability data is almost always a problem for any developing software project during its early stages, which is referred to as the cold-start problem. This article proposes a framework that utilizes transferable knowledge from pre-existing data sources. In order to improve the detection performance, multiple vulnerability-relevant data sources were selected to form a broader base for learning transferable knowledge. The selected vulnerability-relevant data sources are cross-domain, including historical vulnerability data from different software projects and data from the Software Assurance Reference Database (SARD) consisting of synthetic vulnerability examples and proof-of-concept test cases. To extract the information applicable in vulnerability detection from the cross-domain data sets, we designed a deep-learning-based framework with Long-short Term Memory (LSTM) cells. Our framework combines the heterogeneous data sources to learn unified representations of the patterns of the vulnerable source codes. Empirical studies showed that the unified representations generated by the proposed deep learning networks are feasible and effective, and are transferable for real-world vulnerability detection. Our experiments demonstrated that by leveraging two heterogeneous data sources, the performance of our vulnerability detection outperformed the static vulnerability discovery tool <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Flawfinder</i> . The findings of this article may stimulate further research in ML-based vulnerability detection using heterogeneous data sources."}}
{"id": "mbBBjNvyth0", "cdate": 1609459200000, "mdate": 1667535733060, "content": {"title": "Robust Neural Regression via Uncertainty Learning", "abstract": "Deep neural networks tend to underestimate uncertainty and produce overly confident predictions. Recently proposed solutions, such as MC Dropout and SDENet, require complex training and/or auxiliary out-of-distribution data. We propose a simple solution by extending the time-tested iterative reweighted least square (IRLS) in generalised linear regression. We use two sub-networks to parametrise the prediction and uncertainty estimation, enabling easy handling of complex inputs and nonlinear response. The two sub-networks have shared representations and are trained via two complementary loss functions for the prediction and the uncertainty estimates, with interleaving steps as in a cooperative game. Compared with more complex models such as MC-Dropout or SDE-Net, our proposed network is simpler to implement and more robust (insensitive to varying aleatoric and epistemic uncertainty)."}}
{"id": "bAzRKLW464", "cdate": 1609459200000, "mdate": 1681688954457, "content": {"title": "Con2Vec: Learning embedding representations for contrast sets", "abstract": ""}}
{"id": "QfSt3hnDtP", "cdate": 1609459200000, "mdate": 1667535733077, "content": {"title": "Robust Neural Regression via Uncertainty Learning", "abstract": "Deep neural networks tend to underestimate uncertainty and produce overly confident predictions. Recently proposed solutions, such as MC Dropout and SDENet, require complex training and/or auxiliary out-of-distribution data. We propose a simple solution by extending the time-tested iterative reweighted least square (IRLS) in generalised linear regression. We use two sub-networks to parametrise the prediction and uncertainty estimation, enabling easy handling of complex inputs and nonlinear response. The two sub-networks have shared representations and are trained via two complementary loss functions for the prediction and the uncertainty estimates, with interleaving steps as in a cooperative game. Compared with more complex models such as MC-Dropout or SDE-Net, our proposed network is simpler to implement and more robust (insensitive to varying aleatoric and epistemic uncertainty)."}}
