{"id": "L0OKHqYe_FU", "cdate": 1652737441366, "mdate": null, "content": {"title": "Online Neural Sequence Detection with Hierarchical Dirichlet Point Process", "abstract": "Neural sequence detection plays a vital role in neuroscience research. Recent impressive works utilize convolutive nonnegative matrix factorization and Neyman-Scott process to solve this problem. However, they still face two limitations. Firstly, they accommodate the entire dataset into memory and perform iterative updates of multiple passes, which can be inefficient when the dataset is large or grows frequently. Secondly, they rely on the prior knowledge of the number of sequence types, which can be impractical with data when the future situation is unknown. To tackle these limitations, we propose a hierarchical Dirichlet point process model for efficient neural sequence detection. Instead of computing the entire data, our model can sequentially detect sequences in an online unsupervised manner with Particle filters. Besides, the Dirichlet prior enables our model to automatically introduce new sequence types on the fly as needed, thus avoiding specifying the number of types in advance. We manifest these advantages on synthetic data and neural recordings from songbird higher vocal center and rodent hippocampus."}}
{"id": "6D9OOJaG6K-", "cdate": 1609459200000, "mdate": 1668596491989, "content": {"title": "Efficient Point-Process Modeling of Spiking Neurons for Neuroprosthesis", "abstract": "Neuroprosthesis refers to implantable medical devices which can replace injured biological functions in the brain. One of the core problems in neuroprosthesis study is to construct a neural signal transformation model from one cortical area to another. Since the brain encodes and transmits information in spike trains, spiking neural network (SNN) can be an ideal choice for neuroprosthesis modeling. This paper proposes a spiking neuron point-process model (SNPM), which receives spike times as input, and is capable of modeling nonlinear interactions between cortical areas. The proposed SNPM can be implemented on neuromorphic chips for low-energy computing, thus has potential for clinical applications. Experiments show that SNPM can accurately reconstruct functional relationships from PMd (dorsal premotor cortex) to M1 (primary motor cortex) areas."}}
