{"id": "MGHfqpcl2dq", "cdate": 1621177797673, "mdate": null, "content": {"title": "Fixed-domain inference for Gausian processes with Matérn covariogram on compact Riemannian manifolds", "abstract": "Gaussian processes are widely employed as versatile modeling and predictive tools in spatial statistics, functional data analysis, computer modeling and in diverse applications of machine learning. Such processes have been widely studied over Euclidean spaces, where they are constructed using specified covariance functions or covariograms. These functions specify valid stochastic processes that can be used to model complex dependencies in spatial statistics and other machine learning contexts. Valid (positive\ndefinite) covariance functions have been extensively studied for Gaussian processes on Euclidean spaces. Such investigations have focused, among other aspects, on the identifiability and consistency of covariance parameters as well as the problem of spatial interpolation and prediction within the fixed-domain or infill paradigm of asymptotic inference. This manuscript undertakes analogous theoretical developments for Gaussian processes constructed over Riemannian manifolds. We begin by establishing formal notions and conditions for the equivalence of two Gaussian random measures on compact manifolds. We build upon recently introduced Mat´ern covariograms on compact Riemannian manifold, derive the microergodic parameter and formally establish the consistency of maximum likelihood estimators and the asymptotic optimality of the best linear unbiased predictor (BLUP). The circle and sphere are studied as two specific examples of compact Riemannian manifolds with numerical experiments that illustrate the theory."}}
{"id": "pnRLfQU5wKA", "cdate": 1621177652277, "mdate": null, "content": {"title": "Fixed-domain asymptotics under Vecchia's approximation of spatial process likelihoods", "abstract": "Statistical modeling for massive spatial data sets has generated a substantial literature on scalable spatial processes based upon a likelihood approximation due to Vecchia. Vecchia’s approximation for Gaussian process models enables fast evaluation of the likelihood by restricting dependencies at a location to its neighbors. We establish inferential properties of microergodic spatial\ncovariance parameters within the paradigm of fixed-domain asymptotics when they are estimated using Vecchia’s approximation. The conditions required to formally establish these properties are explored, theoretically and empirically, and the effectiveness of Vecchia’s approximation is further corroborated from the standpoint of fixed-domain asymptotics. These explorations suggest some\npractical diagnostics for evaluating the quality of the approximation."}}
{"id": "uVPKiFj5sWD", "cdate": 1621177515046, "mdate": null, "content": {"title": "On identifiability and consistency of the nugget in Gaussian spatial process models", "abstract": "Spatial process models popular in geostatistics often represent the observed data as the sum of a smooth underlying process and white noise. The variation in the white noise is attributed to measurement error, or micro-scale variability, and is called the “nugget”. We formally establish results on the identifiability and consistency of the nugget in spatial models based upon the Gaussian process within the framework of in-fill asymptotics, i.e. the sample size increases within a sampling domain that is bounded. Our work extends results in fixed domain asymptotics for spatial models without the nugget. More specifically, we establish the identifiability of parameters in the Matern covariogram and ´the consistency of their maximum likelihood estimators in the presence of discontinuities due to the nugget. We also present simulation studies to demonstrate the role of the identifiable quantities in spatial interpolation."}}
{"id": "F8F4UMUHSWJ", "cdate": 1621177306777, "mdate": null, "content": {"title": "The existence of maximum likelihood estimate in high-dimensional generalized linear models with binary responses", "abstract": "Motivated by recent works on the high-dimensional logistic regression, we establish that the existence of the maximum likelihood estimate exhibits a phase transition for a wide range of generalized linear models with binary outcome and elliptical covariates. This extends a previous result of Cand`es and Sur who proved the phase transition for the logistic regression with Gaussian covariates. Our result reveals a rich structure in the phase transition phenomenon, which is simply overlooked by Gaussianity. The main tools for deriving the result are data separation, convex geometry and stochastic approximation. We also conduct simulation studies to corroborate our theoretical findings, and explore other features of the problem"}}
{"id": "jRPPxE6TvrG", "cdate": 1621177013880, "mdate": null, "content": {"title": "The Buckley-Osthus model and the block preferential attachment model: statistical analysis and application ", "abstract": "This paper is concerned with statistical estimation of two preferential attachment models: the Buckley-Osthus model and the block preferential attachment model. We prove that the maximum likelihood estimates for both models are consistent. We perform simulation studies to corroborate our theoretical findings. We also apply both models to study the evolution of a real-world network. A list of open problems are presented.\n"}}
{"id": "BJ-psoWdWr", "cdate": 1546300800000, "mdate": null, "content": {"title": "Mallows ranking models: maximum likelihood estimate and regeneration", "abstract": "This paper is concerned with various Mallows ranking models. We study the statistical properties of the MLE of Mallows’ $\\phi$ model. We also make connections of various Mallows ranking models, enc..."}}
