{"id": "sgyr-eZo10", "cdate": 1704067200000, "mdate": 1707807715352, "content": {"title": "True Knowledge Comes from Practice: Aligning LLMs with Embodied Environments via Reinforcement Learning", "abstract": "Despite the impressive performance across numerous tasks, large language models (LLMs) often fail in solving simple decision-making tasks due to the misalignment of the knowledge in LLMs with environments. On the contrary, reinforcement learning (RL) agents learn policies from scratch, which makes them always align with environments but difficult to incorporate prior knowledge for efficient explorations. To narrow the gap, we propose TWOSOME, a novel general online framework that deploys LLMs as decision-making agents to efficiently interact and align with embodied environments via RL without requiring any prepared datasets or prior knowledge of the environments. Firstly, we query the joint probabilities of each valid action with LLMs to form behavior policies. Then, to enhance the stability and robustness of the policies, we propose two normalization methods and summarize four prompt design principles. Finally, we design a novel parameter-efficient training architecture where the actor and critic share one frozen LLM equipped with low-rank adapters (LoRA) updated by PPO. We conduct extensive experiments to evaluate TWOSOME. i) TWOSOME exhibits significantly better sample efficiency and performance compared to the conventional RL method, PPO, and prompt tuning method, SayCan, in both classical decision-making environment, Overcooked, and simulated household environment, VirtualHome. ii) Benefiting from LLMs' open-vocabulary feature, TWOSOME shows superior generalization ability to unseen tasks. iii) Under our framework, there is no significant loss of the LLMs' original ability during online PPO finetuning."}}
{"id": "PpsyZEYniyr", "cdate": 1672531200000, "mdate": 1707807715352, "content": {"title": "Reinforcement Learning with Maskable Stock Representation for Portfolio Management in Customizable Stock Pools", "abstract": "Portfolio management (PM) is a fundamental financial trading task, which explores the optimal periodical reallocation of capitals into different stocks to pursue long-term profits. Reinforcement learning (RL) has recently shown its potential to train profitable agents for PM through interacting with financial markets. However, existing work mostly focuses on fixed stock pools, which is inconsistent with investors' practical demand. Specifically, the target stock pool of different investors varies dramatically due to their discrepancy on market states and individual investors may temporally adjust stocks they desire to trade (e.g., adding one popular stocks), which lead to customizable stock pools (CSPs). Existing RL methods require to retrain RL agents even with a tiny change of the stock pool, which leads to high computational cost and unstable performance. To tackle this challenge, we propose EarnMore, a rEinforcement leARNing framework with Maskable stOck REpresentation to handle PM with CSPs through one-shot training in a global stock pool (GSP). Specifically, we first introduce a mechanism to mask out the representation of the stocks outside the target pool. Second, we learn meaningful stock representations through a self-supervised masking and reconstruction process. Third, a re-weighting mechanism is designed to make the portfolio concentrate on favorable stocks and neglect the stocks outside the target pool. Through extensive experiments on 8 subset stock pools of the US stock market, we demonstrate that EarnMore significantly outperforms 14 state-of-the-art baselines in terms of 6 popular financial metrics with over 40% improvement on profit."}}
{"id": "xqNgoSdO65C", "cdate": 1577836800000, "mdate": 1707806571322, "content": {"title": "MUNet: A Multi-scale U-Net Framework for Medical Image Segmentation", "abstract": "Artificial intelligence has once again become the focus of attention in all fields, of which deep learning has brought a series of changes in the field of computer vision. In this paper, we propose the MUNet model, which is a more general convolutional neural network framework for medical image segmentation. The framework proposed in this paper is essentially a fully convolutional encoder-decoder network based on feature pyramids, in which the encoder and decoder are connected by skip connections. Not only is it suitable for image segmentation, but it can also identify categories of regions of interest. The full convolutional neural network architecture can implement multi-scale image input and prediction. We compared the MUNet and UNet models in cervical lymph node localization and benign and malignant diagnosis in ultrasound images. Experiments show that on our dataset, MUNet with multi-scale segmentation has achieved a Dice score improvement of 4.1% and an AUC score improvement of 8.1% compared to U-Net."}}
{"id": "k-6nS7ILlhJ", "cdate": 1577836800000, "mdate": 1707806571324, "content": {"title": "Fast core pricing algorithms for path auction", "abstract": "Path auction is held in a graph, where each edge stands for a commodity and the weight of this edge represents the prime cost. Bidders own some edges and make bids for their edges. The auctioneer needs to purchase a sequence of edges to form a path between two specific vertices. Path auction can be considered as a kind of combinatorial reverse auctions. Core-selecting mechanism is a prevalent mechanism for combinatorial auction. However, pricing in core-selecting combinatorial auction is computationally expensive, one important reason is the exponential core constraints. The same is true of path auction. To solve this computation problem, we simplify the constraint set and get the optimal set with only polynomial constraints in this paper. Based on our constraint set, we put forward two fast core pricing algorithms for the computation of bidder-Pareto-optimal core outcome. Among all the algorithms, our new algorithms have remarkable runtime performance. Finally, we validate our algorithms on real-world datasets and obtain excellent results."}}
