{"id": "MNuCW-WpM8", "cdate": 1680307200000, "mdate": 1682319207519, "content": {"title": "Multi-Fidelity Simulation Modeling for Discrete Event Simulation: An Optimization Perspective", "abstract": "Multi-fidelity simulation is an effective approach to balancing speed and accuracy in expensive simulation, and its performance is affected by the quality of multi-fidelity simulation models. Building high-quality simulation models is non-trivial, especially for complex systems, because current manual modeling methods require sufficient domain knowledge and experience, increasing the labor and time costs. Motivated by the issues, this paper focuses on one of the most crucial simulation types, discrete event simulation, and develops a computer-aid multi-fidelity simulation modeling method called Optimization-based Multi-fidelity Simulation Modeling (OMFSM). OMFSM formulates multi-fidelity simulation modeling as a bi-objective simulation optimization problem to optimize speed and accuracy. An efficient optimization algorithm called Multi-objective Simulation Optimization based on Hypervolume (MOSO-HV) is tailored to select a set of high-quality models. Experimental results in a digital twin emergency department demonstrate that the computer-aid modeling method builds more and better multi-fidelity simulation models than manual modeling and reveal the effectiveness of MOSO-HV for OMFSM. The utility of OMFSM in multi-fidelity simulation is also justified by a real-world optimization problem. Note to Practitioners—Multi-fidelity simulation is an essential technique to fulfill the demand for accuracy analysis and quick decision-making in Industrial 4.0, such as digital twins and virtual reality. The quality of multi-fidelity simulation models significantly influences the performance of multi-fidelity simulation. Developers currently build multi-fidelity simulation models manually, and their experience determines the model’s quality. To reduce the labor and time costs in constructing high-quality multi-fidelity simulation models, we propose a computer-aid method named OMFSM from optimization for the first time. Experiments on a real case prove that OMFSM lightens the burden of manual modeling and provides more and better models for multi-fidelity simulation."}}
{"id": "5KoWU7BHTW", "cdate": 1672531200000, "mdate": 1695971463168, "content": {"title": "RM-SAEA: Regularity Model Based Surrogate-Assisted Evolutionary Algorithms for Expensive Multi-Objective Optimization", "abstract": "Due to computationally and/or financially costly evaluation, tackling expensive multi-objective optimization problems is quite challenging for evolutionary algorithms. One popular approach to these problems is building cheap surrogate models to replace the expensive real function evaluations. To this end, various kinds of surrogate-assisted evolutionary algorithms (SAEAs) have been proposed, building surrogate models which predict the fitness values, classifications, or relation of the candidate solutions. However, off-spring generation, despite its important role in evolutionary optimization, has not received enough attention in these SAEAs. In this paper, a regularity model based framework, namely RM-SAEA, is proposed for better offspring generation in expensive multi-objective optimization. To be specific, RM-SAEA is featured with a heterogeneous offspring generation module, which is composed of a regularity model and a general genetic operator. Moreover, in order to alleviate the data deficiency issue in the expensive optimization scenario, a data augmentation strategy is employed while training the regularity model. Finally, two representative SAEAs are embedded into RM-SAEA in order to instantiate the proposed framework. Experimental results on benchmark multi-objective problems with up to 10 objectives demonstrate that RM-SAEA achieves the best overall performance compared with 6 state-of-the-art algorithms."}}
{"id": "32L6gB0gKy", "cdate": 1672531200000, "mdate": 1695971463106, "content": {"title": "Noise-Tolerant Hardware-Aware Pruning for Deep Neural Networks", "abstract": "Existing hardware-aware pruning methods for deep neural networks do not take the uncertain execution environment of low-end hardware into consideration. That makes those methods unreliable, since the hardware environments they used for evaluating the pruned models contain uncertainty and thus the performance values contain noise. To deal with this problem, this paper proposes noise-tolerant hardware-aware pruning, i.e., NT-HP. It uses a population-based idea to iteratively generate pruned models. Each pruned model is sent to realistic low-end hardware for performance evaluations. For the noisy values of performance indicators collected from hardware, a threshold for comparison is set, where only the pruned models with significantly better performances are kept in the next generation. Our experimental results show that with the noise-tolerant technique involved, NT-HP can get better pruned models in the uncertain execution environment of low-end hardware."}}
{"id": "z2i8axpSYK", "cdate": 1640995200000, "mdate": 1679906069593, "content": {"title": "Multi-objective Evolutionary Instance Selection for Multi-label Classification", "abstract": ""}}
{"id": "yoBQYxrbMX", "cdate": 1640995200000, "mdate": 1679906069556, "content": {"title": "Multi-objective approaches to portfolio optimization with market impact costs", "abstract": ""}}
{"id": "rzVLgteZac", "cdate": 1640995200000, "mdate": 1679906069568, "content": {"title": "Robust Neural Network Pruning by Cooperative Coevolution", "abstract": ""}}
{"id": "ag8Zd6jLUW", "cdate": 1640995200000, "mdate": 1679906069659, "content": {"title": "Indicator-Aware Talking Face Generation Based on Evolutionary Multi-objective Optimization", "abstract": ""}}
{"id": "XR-Jp-7XfQx", "cdate": 1640995200000, "mdate": 1679906069602, "content": {"title": "Neural Network Pruning by Cooperative Coevolution", "abstract": ""}}
{"id": "WMyiZGXXQB", "cdate": 1640995200000, "mdate": 1695971463168, "content": {"title": "Automatic Construction of Parallel Algorithm Portfolios for Multi-objective Optimization", "abstract": "It has been widely observed that there exists no universal best Multi-objective Evolutionary Algorithm (MOEA) dominating all other MOEAs on all possible Multi-objective Optimization Problems (MOPs). In this work, we advocate using the Parallel Algorithm Portfolio (PAP), which runs multiple MOEAs independently in parallel and gets the best out of them, to combine the advantages of different MOEAs. Since the manual construction of PAPs is non-trivial and tedious, we propose to automatically construct high-performance PAPs for solving MOPs. Specifically, we first propose a variant of PAPs, namely MOEAs/PAP, which can better determine the output solution set for MOPs than conventional PAPs. Then, we present an automatic construction approach for MOEAs/PAP with a novel performance metric for evaluating the performance of MOEAs across multiple MOPs. Finally, we use the proposed approach to construct a MOEAs/PAP based on a training set of MOPs and an algorithm configuration space defined by several variants of NSGA-II. Experimental results show that the automatically constructed MOEAs/PAP can even rival the state-of-the-art ensemble MOEAs designed by human experts, demonstrating the huge potential of automatic construction of PAPs in multi-objective optimization."}}
{"id": "RKDotB2Yfd", "cdate": 1640995200000, "mdate": 1681652378186, "content": {"title": "Neural Network Pruning by Cooperative Coevolution", "abstract": ""}}
