{"id": "MLStcoDEhqi", "cdate": 1663849931545, "mdate": null, "content": {"title": "DREAM: Domain-free Reverse Engineering Attributes of Black-box Model", "abstract": "Deep learning models are usually black boxes when deployed on machine learning platforms. Prior works have shown that the attributes (e.g., the number of convolutional layers) of a target black-box neural network can be exposed through a sequence of queries. There is a crucial limitation that these works assume the dataset used for training the target model to be known beforehand, and leverage this dataset for model attribute attack. However, it is difficult to access the training dataset of the target black-box model in reality. Therefore, whether the attributes of a target black-box model could be still revealed in this case is doubtful. In this paper, we investigate a new problem of Domain-free Reverse Engineering the Attributes of a black-box target Model, called DREAM, without requiring the model's training dataset available, and  put forward a general and principled framework by casting this problem as an out of distribution (OOD) generalization problem. At the heart of our framework, we devise a multi-discriminator generative adversarial network (MDGAN) to learn domain invariant features. Based on these features, we can learn a domain-free model to inversely infer the attributes of a target black-box model with unknown training data. This makes our method one of the kinds that can gracefully apply to an arbitrary domain for model attribute reverse engineering with good generalization ability.  Extensive experimental studies are conducted and the results validate the superiority of our proposed method over the baselines."}}
{"id": "yKn8JBRHlp", "cdate": 1640995200000, "mdate": 1668159352012, "content": {"title": "APPTracker: Improving Tracking Multiple Objects in Low-Frame-Rate Videos", "abstract": ""}}
{"id": "vHXhbZVtOh", "cdate": 1640995200000, "mdate": 1668159352012, "content": {"title": "Multidimensional Local Binary Pattern for Hyperspectral Image Classification", "abstract": ""}}
{"id": "u3wcDdqJUa_", "cdate": 1640995200000, "mdate": 1668159352009, "content": {"title": "Four-player GroupGAN for weak expression recognition via latent expression magnification", "abstract": ""}}
{"id": "slPg993pRW", "cdate": 1640995200000, "mdate": 1668159352194, "content": {"title": "Multi-Prior Learning via Neural Architecture Search for Blind Face Restoration", "abstract": ""}}
{"id": "q-BRPPbVTI", "cdate": 1640995200000, "mdate": 1668159352232, "content": {"title": "A Survey of Deep Face Restoration: Denoise, Super-Resolution, Deblur, Artifact Removal", "abstract": ""}}
{"id": "nKTezD7pmE5", "cdate": 1640995200000, "mdate": 1668159352011, "content": {"title": "LAGA-Net: Local-and-Global Attention Network for Skeleton Based Action Recognition", "abstract": ""}}
{"id": "m-vNhh6ghUm", "cdate": 1640995200000, "mdate": 1668159352184, "content": {"title": "Disentangled Feature Networks for Facial Portrait and Caricature Generation", "abstract": ""}}
{"id": "ieSneGAV2Jg", "cdate": 1640995200000, "mdate": 1668159352012, "content": {"title": "Iterative Correlation-based Feature Refinement for Few-shot Counting", "abstract": ""}}
{"id": "ha2iHUdSUzo", "cdate": 1640995200000, "mdate": 1668159352010, "content": {"title": "ADTR: Anomaly Detection Transformer with Feature Reconstruction", "abstract": ""}}
