{"id": "chBFkc8sEe1", "cdate": 1682899200000, "mdate": 1683948281898, "content": {"title": "Bimodal segmentation and classification of endoscopic ultrasonography images for solid pancreatic tumor", "abstract": ""}}
{"id": "rVvQzC9JhQ-", "cdate": 1640995200000, "mdate": 1683948282519, "content": {"title": "Transferability and interpretability of the sepsis prediction models in the intensive care unit", "abstract": "Background We aimed to develop an early warning system for real-time sepsis prediction in the ICU by machine learning methods, with tools for interpretative analysis of the predictions. In particular, we focus on the deployment of the system in a target medical center with small historical samples. Methods Light Gradient Boosting Machine (LightGBM) and multilayer perceptron (MLP) were trained on Medical Information Mart for Intensive Care (MIMIC-III) dataset and then finetuned on the private Historical Database of local Ruijin Hospital (HDRJH) using transfer learning technique. The Shapley Additive Explanations (SHAP) analysis was employed to characterize the feature importance in the prediction inference. Ultimately, the performance of the sepsis prediction system was further evaluated in the real-world study in the ICU of the target Ruijin Hospital. Results The datasets comprised 6891 patients from MIMIC-III, 453 from HDRJH, and 67 from Ruijin real-world data. The area under the receiver operating characteristic curves (AUCs) for LightGBM and MLP models derived from MIMIC-III were 0.98 − 0.98 and 0.95 − 0.96 respectively on MIMIC-III dataset, and, in comparison, 0.82 − 0.86 and 0.84 − 0.87 respectively on HDRJH, from 1 to  5 h preceding. After transfer learning and ensemble learning, the AUCs of the final ensemble model were enhanced to 0.94 − 0.94 on HDRJH and to 0.86 − 0.9 in the real-world study in the ICU of the target Ruijin Hospital. In addition, the SHAP analysis illustrated the importance of age, antibiotics, net balance, and ventilation for sepsis prediction, making the model interpretable. Conclusions Our machine learning model allows accurate real-time prediction of sepsis within 5-h preceding. Transfer learning can effectively improve the feasibility to deploy the prediction model in the target cohort, and ameliorate the model performance for external validation. SHAP analysis indicates that the role of antibiotic usage and fluid management needs further investigation. We argue that our system and methodology have the potential to improve ICU management by helping medical practitioners identify at-sepsis-risk patients and prepare for timely diagnosis and intervention. Trial registration: NCT05088850 (retrospectively registered)."}}
{"id": "f6TWNKaeGAZ", "cdate": 1640995200000, "mdate": 1683948286739, "content": {"title": "Analytic Investigation for Synchronous Firing Patterns Propagation in Spiking Neural Networks", "abstract": "Based on the moment closure method and mean field theory, a Gaussian random field is constructed to quantitatively and analytically characterize the dynamics of a random point field. The approach provides a theoretical tool to investigate synchronized spike propagation in a feedforward or recurrent spiking neural network. We show that the balance between the excitation and inhibition postsynaptic potentials is required for the occurrence of synfire chains. In particular, with a balanced network, the critical packet size of invasion and annihilation is observed. We also derive a sufficient analytic condition for the synchronization propagation in an asynchronous environment, which further allows us to disclose the possibility of spatial synaptic structure to sustain a stable synfire chain. Our findings are in good agreement with simulations and help us understand the propagation of spatio-temporal patterns in a random point field."}}
{"id": "dPwZq-VdApe", "cdate": 1640995200000, "mdate": 1683948286784, "content": {"title": "Fully Distributed Synchronization of Complex Networks With Adaptive Coupling Strengths", "abstract": "This article considers the fully distributed leaderless synchronization in a complex network by only utilizing local neighboring information to design and tune the coupling strength of each node such that the synchronization problem can be solved without involving any global information of the network. For an undirected network, a fully distributed synchronization algorithm is presented to adjust the coupling strength of each node based on a simple adaptive law. When the topology of a network is directed, two different types of adaptive algorithms are developed to achieve synchronization in a fully distributed manner, where the coupling strength of each node is designed to be either the sum or product of two non-negative scalar functions. The fully distributed leaderless synchronization of a directed network is investigated in a leader–follower framework, where the leader subnetwork is analyzed by using the techniques from constrained Rayleigh quotients and the follower subnetwork is addressed by employing the properties of nonsingular <inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$M$ </tex-math></inline-formula> -matrices. Simulations are given to illustrate the theoretical results."}}
{"id": "YRsv-5K6zhx", "cdate": 1640995200000, "mdate": 1683948281885, "content": {"title": "Transition of Chimera States and Synchronization in Two-Layer Networks of Coupled Hindmarsh-Rose Neurons", "abstract": "The present work focuses on the existence of chimera states in two-layer networks of locally, nonlocally, and globally coupled Hindmarsh–Rose neurons. We show that chimera states occur in all three..."}}
{"id": "UANRGxoWhSi", "cdate": 1640995200000, "mdate": 1683880175792, "content": {"title": "Asynchronous optimization of part logistics routing problem", "abstract": "The solution to the capacitated vehicle routing problem (CVRP) is vital for optimizing logistics. However, the transformation of real-world logistics problems into the CVRP involves diverse constraints, interactions between various routes, and a balance between optimization performance and computation load. In this study, we propose a systematic model originating from the part logistic routing problem (PLRP), which is a two-dimensional loading capacitated pickup-and-delivery problem that considers time windows, multiple uses of vehicles, queuing, transit, and heterogeneous vehicles. The newly introduced queuing and transit complicate the problem, and to the best of our knowledge, it cannot be solved using existing methods or the standard commercial optimizer. Hence, this problem has caused the existing research to develop, generalize, and extend into the two-dimensional CVRP (2L-CVRP). To solve this problem, we provide a framework that decouples the combination of 2L-CVRP and global optimization engineering and derives an efficient and realistic solver that integrates diverse types of intelligent algorithms. These algorithms include: (1) a heuristic algorithm for initializing feasible solutions by imitating manual planning, (2) asynchronous simulated annealing (SA) and Tabu search (TS) algorithms to accelerate the optimization of global routes based on novel bundling mechanics, (3) dynamic programming for routing, (4) heuristic algorithms for packing, (5) simulators to review associated time-related constraints, and (6) truck-saving processes to promote the optimal solution and reduce the number of trucks. Moreover, the performances of the SA and TS solver algorithms are compared in terms of various size scales of data to obtain an empirical recommendation for selection. The proposed model successfully established an intelligent management system that can provide systematic solutions for logistics planning, resulting in higher performance and lower costs compared to that of manual planning."}}
{"id": "FVpolVFLS2", "cdate": 1640995200000, "mdate": 1683948286739, "content": {"title": "Solving Partial Differential Equations Using Point-Based Neural Networks", "abstract": "Recently, solving partial differential equations (PDEs) using neural networks (NNs) has been attracting increasing interests with promising potential to be applied in wide areas. In this paper, we propose a theoretical model that approximates the operator from a parametric function space to a solution function space and prove its universal approximation theorem in the operator space. For practical application, by regarding the domain of a parametric (or solution) function as a discrete point cloud, we propose a novel idea that implements the theoretical model by introducing the point-based NN as the backbone. We show that the present model can approximate the solution operator of static PDEs using the training data generated on unstructured meshes while most existing methods work for the data generated on lattice grid meshes. We conduct experiments to demonstrate the performance of our model on different types of PDEs. The numerical results verify that our model possesses a higher precision and a faster inference speed compared with the existing models for data of unstructured meshes; in addition, our model has competitive performance compared with the existing works dealing with data of lattice grid meshes."}}
{"id": "3mAvnnONtYK", "cdate": 1640995200000, "mdate": 1683880175624, "content": {"title": "FedDKD: Federated Learning with Decentralized Knowledge Distillation", "abstract": "The performance of federated learning in neural networks is generally influenced by the heterogeneity of the data distribution. For a well-performing global model, taking a weighted average of the local models, as done by most existing federated learning algorithms, may not guarantee consistency with local models in the space of neural network maps. In this paper, we propose a novel framework of federated learning equipped with the process of decentralized knowledge distillation (FedDKD) (i.e., without data on the server). The FedDKD introduces a module of decentralized knowledge distillation (DKD) to distill the knowledge of the local models to train the global model by approaching the neural network map average based on the metric of divergence defined in the loss function, other than only averaging parameters as done in literature. Numeric experiments on various heterogeneous datasets reveal that FedDKD outperforms the state-of-the-art methods with more efficient communication and training in a few DKD steps, especially on some extremely heterogeneous datasets."}}
{"id": "uDsdzFum_hF", "cdate": 1609459200000, "mdate": 1683948287217, "content": {"title": "Video Summarization by DiffPointer-GAN", "abstract": "Recent years have witnessed the explosive growth of video and clips with the popularization of mobile devices that are deeply shaping people’s life. Video summarization is an important approach to highlight and label the videos. Since the requirement of video summarization in practice is diverse due to the consumer majority and videos themselves, it is difficult for a neural network that extracts specific features to be adapted according to the changing requirements. In this paper, we propose a novel method of video summarization that employs the characteristics of the bullet-screen comments as a reference and train a novel neural network to generate a short clip as the video summary. First, we propose a method to select candidate clips for video summarization based on the distribution of the bullet-screen comments and these candidates are annotated manually to construct our labelled dataset from the Bilibili video library. Second, we propose and train a novel network combined with the pointer network and the General Adversarial Networks, named by diffPointer-GAN, to directly identify the start and end of the summary clip, other than the previous process composed of scoring, segmentation and selecting. Finally, we demonstrate that the proposed method has a definite priority to two baseline methods that are implemented on our dataset."}}
{"id": "qdTvrOGuK68", "cdate": 1609459200000, "mdate": 1683948287221, "content": {"title": "Simulations of Event-Based Cyber Dynamics via Adversarial Machine Learning", "abstract": "In this paper, we apply cybersecurity dynamics theory into practical scenarios. We use machine learning models as detection tools of intrusion detection systems and consider cyber attacks against node computers as well as adversarial attacks against machine learning models. We pay our attention to two problems. The first problem is when the network is attacked, how we can observe the states of the network and estimate its equilibrium with a lower cost. We apply an event-based observation and estimation method combined with machine learning-based intrusion detection systems. The second problem is to control the cost and the convergence speed of cybersecurity dynamics when it is under attack. An event-based control method and machine learning-based intrusion detection systems are put into use in this scenario. We simulate both scenarios and analyze the dynamics’ behaviors under an adversarial attack against the machine learning models on intrusion detection systems."}}
