{"id": "gvjC1FaCgZm", "cdate": 1672531200000, "mdate": 1709232408186, "content": {"title": "Diverse Shape Completion via Style Modulated Generative Adversarial Networks", "abstract": "Shape completion aims to recover the full 3D geometry of an object from a partial observation. This problem is inherently multi-modal since there can be many ways to plausibly complete the missing regions of a shape. Such diversity would be indicative of the underlying uncertainty of the shape and could be preferable for downstream tasks such as planning. In this paper, we propose a novel conditional generative adversarial network that can produce many diverse plausible completions of a partially observed point cloud. To enable our network to produce multiple completions for the same partial input, we introduce stochasticity into our network via style modulation. By extracting style codes from complete shapes during training, and learning a distribution over them, our style codes can explicitly carry shape category information leading to better completions. We further introduce diversity penalties and discriminators at multiple scales to prevent conditional mode collapse and to train without the need for multiple ground truth completions for each partial input. Evaluations across several synthetic and real datasets demonstrate that our method achieves significant improvements in respecting the partial observations while obtaining greater diversity in completions."}}
{"id": "kD8THXb-yp", "cdate": 1609459200000, "mdate": 1667593153548, "content": {"title": "Self-Supervised Poisson-Gaussian Denoising", "abstract": "We extend the blindspot model for self-supervised de-noising to handle Poisson-Gaussian noise and introduce an improved training scheme that avoids hyperparameters and adapts the denoiser to the test data. Self-supervised models for denoising learn to denoise from only noisy data and do not require corresponding clean images, which are difficult or impossible to acquire in some application areas of interest such as low-light microscopy. We introduce a new training strategy to handle Poisson-Gaussian noise which is the standard noise model for microscope images. Our new strategy eliminates hyperparameters from the loss function, which is important in a self-supervised regime where no ground truth data is available to guide hyperparameter tuning. We show how our denoiser can be adapted to the test data to improve performance. Our evaluations on microscope image denoising benchmarks validate our approach."}}
{"id": "FLpk9gnslz9", "cdate": 1609459200000, "mdate": 1667593153548, "content": {"title": "View Synthesis In Casually Captured Scenes Using a Cylindrical Neural Radiance Field With Exposure Compensation", "abstract": ""}}
