{"id": "mhqcNgj_STP", "cdate": 1684171041163, "mdate": 1684171041163, "content": {"title": "A Hidden Markov Forest Model for Terrain-Aware Flood Inundation Mapping from Earth Imagery", "abstract": "Flood inundation mapping from Earth imagery plays a vital role in rapid disaster response and national water forecasting. However, the problem is non-trivial due to significant imagery noise and obstacles, complex spatial dependency on 3D terrains, spatial non-stationarity, and high computational cost. Existing machine learning approaches are mostly terrain-unaware and are prone to produce spurious results due to imagery noise and obstacles, requiring significant efforts in post-processing. Recently, several terrain-aware methods were proposed that incorporate complex spatial dependency (e.g., water flow directions on 3D terrains) but they assume that the inferred flood surface level is spatially stationary, making them insufficient for a large heterogeneous geographic area. To address these limitations, this paper proposes a novel spatial learning framework called hidden Markov forest, which decomposes a large heterogeneous area into local stationary zones, represents spatial dependency on 3D terrains via zonal trees (forest), and jointly infers the class map in different zonal trees with spatial regularization. We design efficient inference algorithms based on dynamic programming and multi-resolution filtering. Evaluations on real-world datasets show that our method outperforms baselines and our proposed computational refinement significantly reduces the time cost."}}
{"id": "S98VJL8jcxq", "cdate": 1646077510822, "mdate": null, "content": {"title": "Physics Guided Neural Networks for Spatio-temporal Super-resolution of Turbulent Flows", "abstract": "Direct numerical simulation (DNS) of turbulent flows is computationally expensive and cannot be applied to flows with large Reynolds numbers.  Low-resolution large eddy simulation (LES) is a popular alternative, but it is unable to capture all of the scales of turbulent transport accurately. Reconstructing DNS from low-resolution LES is critical for large-scale simulation in many scientific and engineering disciplines, but it poses many challenges to existing super-resolution methods due to the complexity of turbulent flows and computational cost of generating frequent LES data. \nWe propose a physics-guided neural network for reconstructing frequent DNS from sparse LES data by enhancing its spatial resolution and temporal frequency. Our proposed method consists of a partial differential equation (PDE)-based recurrent unit for capturing underlying temporal processes and a physics-guided super-resolution model that incorporates additional physical constraints. \nWe demonstrate the effectiveness of both components in reconstructing the Taylor-Green Vortex using sparse LES data. Moreover, we show that the proposed recurrent unit can preserve the physical characteristics of turbulent flows by leveraging the physical relationships in the Navier-Stokes equation."}}
{"id": "tjEQBmFQXX", "cdate": 1577836800000, "mdate": null, "content": {"title": "Integrating Physics-Based Modeling with Machine Learning: A Survey", "abstract": "There is a growing consensus that solutions to complex science and engineering problems require novel methodologies that are able to integrate traditional physics-based modeling approaches with state-of-the-art machine learning (ML) techniques. This paper provides a structured overview of such techniques. Application-centric objective areas for which these approaches have been applied are summarized, and then classes of methodologies used to construct physics-guided ML models and hybrid physics-ML frameworks are described. We then provide a taxonomy of these existing techniques, which uncovers knowledge gaps and potential crossovers of methods between disciplines that can serve as ideas for future research."}}
{"id": "hSoco5qRhAg", "cdate": 1577836800000, "mdate": null, "content": {"title": "Semi-supervised Classification using Attention-based Regularization on Coarse-resolution Data", "abstract": "Many real-world phenomena are observed at multiple resolutions. Predictive models designed to predict these phenomena typically consider different resolutions separately. This approach might be limiting in applications where predictions are desired at fine resolutions but available training data is scarce. In this paper, we propose classification algorithms that leverage supervision from coarser resolutions to help train models on finer resolutions. The different resolutions are modeled as different views of the data in a multi-view framework that exploits the complementarity of features across different views to improve models on both views. Unlike traditional multi-view learning problems, the key challenge in our case is that there is no one-to-one correspondence between instances across different views in our case, which requires explicit modeling of the correspondence of instances across resolutions. We propose to use the features of instances at different resolutions to learn the correspondence between instances across resolutions using attention mechanism. Experiments on the real-world application of mapping urban areas using satellite observations and sentiment classification on text data show the effectiveness of the proposed methods."}}
{"id": "hEKuPZEnOzj", "cdate": 1577836800000, "mdate": null, "content": {"title": "Physics-Guided Machine Learning for Scientific Discovery: An Application in Simulating Lake Temperature Profiles", "abstract": "Physics-based models of dynamical systems are often used to study engineering and environmental systems. Despite their extensive use, these models have several well-known limitations due to simplified representations of the physical processes being modeled or challenges in selecting appropriate parameters. While-state-of-the-art machine learning models can sometimes outperform physics-based models given ample amount of training data, they can produce results that are physically inconsistent. This paper proposes a physics-guided recurrent neural network model (PGRNN) that combines RNNs and physics-based models to leverage their complementary strengths and improves the modeling of physical processes. Specifically, we show that a PGRNN can improve prediction accuracy over that of physics-based models, while generating outputs consistent with physical laws. An important aspect of our PGRNN approach lies in its ability to incorporate the knowledge encoded in physics-based models. This allows training the PGRNN model using very few true observed data while also ensuring high prediction accuracy. Although we present and evaluate this methodology in the context of modeling the dynamics of temperature in lakes, it is applicable more widely to a range of scientific and engineering disciplines where physics-based (also known as mechanistic) models are used, e.g., climate science, materials science, computational chemistry, and biomedicine."}}
{"id": "Wc3mPiAuj_2", "cdate": 1577836800000, "mdate": null, "content": {"title": "Automated Plantation Mapping in Southeast Asia Using MODIS Data and Imperfect Visual Annotations", "abstract": "Expansion of large-scale tree plantations for commodity crop and timber production is a leading cause of tropical deforestation. While automated detection of plantations across large spatial scales and with high temporal resolution is critical to inform policies to reduce deforestation, such mapping is technically challenging. Thus, most available plantation maps rely on visual inspection of imagery, and many of them are limited to small areas for specific years. Here, we present an automated approach, which we call Plantation Analysis by Learning from Multiple Classes (PALM), for mapping plantations on an annual basis using satellite remote sensing data. Due to the heterogeneity of land cover classes, PALM utilizes ensemble learning to simultaneously incorporate training samples from multiple land cover classes over different years. After the ensemble learning, we further improve the performance by post-processing using a Hidden Markov Model. We implement the proposed automated approach using MODIS data in Sumatra and Indonesian Borneo (Kalimantan). To validate the classification, we compare plantations detected using our approach with existing datasets developed through visual interpretation. Based on random sampling and comparison with high-resolution images, the user&rsquo;s accuracy and producer&rsquo;s accuracy of our generated map are around 85% and 80% in our study region."}}
{"id": "RYHj3oxQJgi", "cdate": 1577836800000, "mdate": null, "content": {"title": "Semi-supervised Classification using Attention-based Regularization on Coarse-resolution Data", "abstract": "Many real-world phenomena are observed at multiple resolutions. Predictive models designed to predict these phenomena typically consider different resolutions separately. This approach might be limiting in applications where predictions are desired at fine resolutions but available training data is scarce. In this paper, we propose classification algorithms that leverage supervision from coarser resolutions to help train models on finer resolutions. The different resolutions are modeled as different views of the data in a multi-view framework that exploits the complementarity of features across different views to improve models on both views. Unlike traditional multi-view learning problems, the key challenge in our case is that there is no one-to-one correspondence between instances across different views in our case, which requires explicit modeling of the correspondence of instances across resolutions. We propose to use the features of instances at different resolutions to learn the correspondence between instances across resolutions using an attention mechanism.Experiments on the real-world application of mapping urban areas using satellite observations and sentiment classification on text data show the effectiveness of the proposed methods."}}
{"id": "zfOfmvL-KrV", "cdate": 1546300800000, "mdate": null, "content": {"title": "Operator-based preconditioning for the 2-D 3-T energy equations in radiation hydrodynamics simulations", "abstract": "Two-dimensional three-temperature (2-D 3-T) energy equations are a type of strongly nonlinear system that describe the energy diffusion and exchange between an electron and a photon or ion. In multi-physics simulations, the process of energy diffusion and exchange is coupled with some other physical processes, such as fluid dynamics. Typically, the Lagrangian method is employed in radiation hydrodynamics simulations. Consequently, the 3-T energy equations should be discretized on deforming meshes, which are moved with dynamics. In 2-D deforming meshes, a nine-point scheme must be employed to discretize the 3-T energy equations. Because the energy diffusion and swapping coefficients are strongly nonlinearly dependent on the temperature, and some physical parameters are discontinuous across the material interfaces, it is a challenge to solve the discretized nonlinear algebraic equations in multi-physics and multi-material applications. A Newton-Krylov method is used to solve the discretized 2-D 3-T energy equations. Based on the physical properties and the characteristics of the equations, four types of operator-based preconditioners are constructed. Numerical results show that all the preconditioning methods considered in this study are very effective."}}
{"id": "vhpZKr91seV", "cdate": 1546300800000, "mdate": null, "content": {"title": "Towards Robust and Discriminative Sequential Data Learning: When and How to Perform Adversarial Training?", "abstract": "The last decade has witnessed a surge of interest in applying deep learning models for discovering sequential patterns from a large volume of data. Recent works show that deep learning models can be further improved by enforcing models to learn a smooth output distribution around each data point. This can be achieved by augmenting training data with slight perturbations that are designed to alter model outputs. Such adversarial training approaches have shown much success in improving the generalization performance of deep learning models on static data, e.g., transaction data or image data captured on a single snapshot. However, when applied to sequential data, the standard adversarial training approaches cannot fully capture the discriminative structure of a sequence. This is because real-world sequential data are often collected over a long period of time and may include much irrelevant information to the classification task. To this end, we develop a novel adversarial training approach for sequential data classification by investigating when and how to perturb a sequence for an effective data augmentation. Finally, we demonstrate the superiority of the proposed method over baselines in a diversity of real-world sequential datasets."}}
{"id": "nodNKY13nZL", "cdate": 1546300800000, "mdate": null, "content": {"title": "Spatial Context-Aware Networks for Mining Temporal Discriminative Period in Land Cover Detection", "abstract": "Detecting land use and land cover changes is critical to monitor natural resources and analyze global environmental changes. In this paper, we investigate the land cover detection using the remote sensing data from earth-observing satellites. Due to the natural disturbances, e.g., clouds and aerosoles, and the data acquisition errors by devices, remote sensing data frequently contain much noise. Also, many land covers cannot be easily identified in most dates of a year. Instead, they show distinctive temporal patterns only during certain period of a year, which is also referred to as the discriminative period. To address these challenges, we propose a novel framework which combines the spatial context knowledge with the LSTM-based temporal modeling for land cover detection. Specifically, the framework learns the spatial context knowledge selectively from its neighboring locations. Then we propose two approaches for discriminative period detection based on multi-instance learning and local attention mechanism, respectively. Our evaluations in two real-world applications demonstrate the effectiveness of the proposed method in identifying land covers and detecting discriminative periods."}}
