{"id": "-IHPcl1ZhF5", "cdate": 1652737762856, "mdate": null, "content": {"title": "RISE: Robust Individualized Decision Learning with Sensitive Variables", "abstract": "This paper introduces RISE, a robust individualized decision learning framework with sensitive variables, where sensitive variables are collectible data and important to the intervention decision, but their inclusion in decision making is prohibited due to reasons such as delayed availability or fairness concerns. A naive baseline is to ignore these sensitive variables in learning decision rules, leading to significant uncertainty and bias. To address this, we propose a decision learning framework to incorporate sensitive variables during offline training but not include them in the input of the learned decision rule during model deployment. Specifically, from a causal perspective, the proposed framework intends to improve the worst-case outcomes of individuals caused by sensitive variables that are unavailable at the time of decision. Unlike most existing literature that uses mean-optimal objectives, we propose a robust learning framework by finding a newly defined quantile- or infimum-optimal decision rule. The reliable performance of the proposed method is demonstrated through synthetic experiments and three real-world applications. "}}
{"id": "RdaXjTdoKRy", "cdate": 1640995200000, "mdate": 1681790588065, "content": {"title": "A Tree-based Model Averaging Approach for Personalized Treatment Effect Estimation from Heterogeneous Data Sources", "abstract": "Accurately estimating personalized treatment effects within a study site (e.g., a hospital) has been challenging due to limited sample size. Furthermore, privacy considerations and lack of resource..."}}
{"id": "bmQfuKN8g19", "cdate": 1635261625091, "mdate": null, "content": {"title": "Identifying Principal Stratum Causal Effects Conditional on a Post-treatment Intermediate Response", "abstract": "In neoadjuvant trials on early-stage breast cancer, patients are usually randomized into a control group and a treatment group with an additional target therapy. Early efficacy of the new regimen is assessed via the binary pathological complete response (pCR) and the eventual efficacy is assessed via long-term clinical outcomes such as survival. Although pCR is strongly associated with survival, it has not been confirmed as a surrogate endpoint. To fully understand its clinical implication, it is important to establish causal estimands such as the causal effect in survival for patients who would achieve pCR under the new regimen. Under the principal stratification framework, previous studies focus on sensitivity analyses by varying model parameters in an imposed model on counterfactual outcomes. Under mild assumptions, we propose an approach to estimate those model parameters using empirical data and subsequently the causal estimand of interest. We also extend our approach to address censored outcome data. The proposed method is applied to a recent clinical trial and its performance is evaluated via simulation studies. "}}
{"id": "B8Q6ueB-6L4", "cdate": 1609459200000, "mdate": 1668073330083, "content": {"title": "Point3D: tracking actions as moving points with 3D CNNs", "abstract": ""}}
{"id": "KB_d6k9WHpo", "cdate": 1577836800000, "mdate": 1668073330091, "content": {"title": "Towards Improving Spatiotemporal Action Recognition in Videos", "abstract": "Spatiotemporal action recognition deals with locating and classifying actions in videos. Motivated by the latest state-of-the-art real-time object detector You Only Watch Once (YOWO), we aim to modify its structure to increase action detection precision and reduce computational time. Specifically, we propose four novel approaches in attempts to improve YOWO and address the imbalanced class issue in videos by modifying the loss function. We consider two moderate-sized datasets to apply our modification of YOWO - the popular Joint-annotated Human Motion Data Base (J-HMDB-21) and a private dataset of restaurant video footage provided by a Carnegie Mellon University-based startup, Agot.AI. The latter involves fast-moving actions with small objects as well as unbalanced data classes, making the task of action localization more challenging. We implement our proposed methods in the GitHub repository https://github.com/stoneMo/YOWOv2."}}
{"id": "5i1xZ4SR9Fr", "cdate": 1514764800000, "mdate": 1681790588047, "content": {"title": "Changepoint analysis of putamen and thalamus subregions in premanifest huntington's disease", "abstract": "Huntington's disease (HD) is a progressive inherited brain disorder that affects cognition, personality and physical abilities. Advanced statistical shape analysis pipelines have shown that region-specific shape abnormalities of the putamen and thalamus begin earlier than clinical onset (\"premanifest\" period), but the order and pattern of different subregions' abnormalities of those two structures are still unclear. In this paper, we applied a multivariate linear mixed-effects model, in combination with a novel shape diffeomorphometry technique, to identify the changepoints at which the shape morphometry abnormalities of different putamen and thalamus sub-regions start. Our experimental results revealed that the putamen was affected severely by HD whereas the thalamus was affected in a milder way. The putaminal subregion connected to the executive cortex and the thalamic subregion connected to the prefrontal cortex were found to be affected the earliest by HD. This study contributes to a better understanding of the temporal ordering of the putaminal and thalamic abnormalities of different functionally-distinct subregions."}}
