{"id": "zXwaPv3KT8-", "cdate": 1672531200000, "mdate": 1702740224478, "content": {"title": "Commonsense Knowledge Enhanced Sentiment Dependency Graph for Sarcasm Detection", "abstract": "Sarcasm is widely utilized on social media platforms such as Twitter and Reddit. Sarcasm detection is required for analyzing people's true feelings since sarcasm is commonly used to portray a reversed emotion opposing the literal meaning. The syntactic structure is the key to make better use of commonsense when detecting sarcasm. However, it is extremely challenging to effectively and explicitly explore the information implied in syntactic structure and commonsense simultaneously. In this paper, we apply the pre-trained COMET model to generate relevant commonsense knowledge, and explore a novel scenario of constructing a commonsense-augmented sentiment graph and a commonsense-replaced dependency graph for each text. Based on this, a Commonsense Sentiment Dependency Graph Convolutional Network (CSDGCN) framework is proposed to explicitly depict the role of external commonsense and inconsistent expressions over the context for sarcasm detection by interactively modeling the sentiment and dependency information. Experimental results on several benchmark datasets reveal that our proposed method beats the state-of-the-art methods in sarcasm detection, and has a stronger interpretability."}}
{"id": "lH7XrkgjWE", "cdate": 1672531200000, "mdate": 1702740224478, "content": {"title": "Local-Global Defense against Unsupervised Adversarial Attacks on Graphs", "abstract": "Unsupervised pre-training algorithms for graph representation learning are vulnerable to adversarial attacks, such as first-order perturbations on graphs, which will have an impact on particular downstream applications. Designing an effective representation learning strategy against white-box attacks remains a crucial open topic. Prior research attempts to improve representation robustness by maximizing mutual information between the representation and the perturbed graph, which is sub-optimal because it does not adapt its defense techniques to the severity of the attack. To address this issue, we propose an unsupervised defense method that combines local and global defense to improve the robustness of representation. Note that we put forward the Perturbed Edges Harmfulness (PEH) metric to determine the riskiness of the attack. Thus, when the edges are attacked, the model can automatically identify the risk of attack. We present a method of attention-based protection against high-risk attacks that penalizes attention coefficients of perturbed edges to encoders. Extensive experiments demonstrate that our strategies can enhance the robustness of representation against various adversarial attacks on three benchmark graphs."}}
{"id": "iVYRveOBSP", "cdate": 1672531200000, "mdate": 1702740224476, "content": {"title": "Augmenting Affective Dependency Graph via Iterative Incongruity Graph Learning for Sarcasm Detection", "abstract": "Recently, progress has been made towards improving automatic sarcasm detection in computer science. Among existing models, manually constructing static graphs for texts and then using graph neural networks (GNNs) is one of the most effective approaches for drawing long-range incongruity patterns. However, the manually constructed graph structure might be prone to errors (e.g., noisy or incomplete) and not optimal for the sarcasm detection task. Errors produced during the graph construction step cannot be remedied and may accrue to the following stages, resulting in poor performance. To surmount the above limitations, we explore a novel Iterative Augmenting Affective Graph and Dependency Graph (IAAD) framework to jointly and iteratively learn the incongruity graph structure. IAAD can alternatively update the incongruity graph structure and node representation until the learning graph structure is optimal for the metrics of sarcasm detection. More concretely, we begin with deriving an affective and a dependency graph for each instance, then an iterative incongruity graph learning module is employed to augment affective and dependency graphs for obtaining the optimal inconsistent semantic graph with the goal of optimizing the graph for the sarcasm detection task. Extensive experiments on three datasets demonstrate that the proposed model outperforms state-of-the-art baselines for sarcasm detection with significant margins."}}
{"id": "0J9qWhJ4y6T", "cdate": 1672531200000, "mdate": 1702740224479, "content": {"title": "A Generalized Deep Markov Random Fields Framework for Fake News Detection", "abstract": "Recently, the wanton dissemination of fake news on social media has adversely affected our lives, rendering automatic fake news detection a pressing issue. Current methods are often fully supervised and typically employ deep neural networks (DNN) to learn implicit relevance from labeled data, ignoring explicitly shared properties (e.g., inflammatory expressions) across fake news. To address this limitation, we propose a graph-theoretic framework, called Generalized Deep Markov Random Fields Framework (GDMRFF), that inherits the capability of deep learning while at the same time exploiting the correlations among the news articles (including labeled and unlabeled data). Specifically, we first leverage a DNN-based module to learn implicit relations, which we then reveal as the unary function of MRF. Pairwise functions with refining effects to encapsulate human insights are designed to capture the explicit association among all samples. Meanwhile, an event removal module is introduced to remove event impact on pairwise functions. Note that we train GDMRFF with the semi-supervised setting, which decreases the reliance on labeled data while maximizing the potential of unlabeled data. We further develop an Ambiguity Learning Guided MRF (ALGM) model as a concretization of GDMRFF. Experiments show that ALGM outperforms the compared methods significantly on two datasets, especially when labeled data is limited."}}
{"id": "S5ri9Q7XOT", "cdate": 1640995200000, "mdate": 1681654591548, "content": {"title": "Inflation Improves Graph Neural Networks", "abstract": ""}}
{"id": "9i313rgCfZ", "cdate": 1640995200000, "mdate": 1668694936654, "content": {"title": "Identification of Communities With Multi-Semantics via Bayesian Generative Model", "abstract": "Discovering communities is an essential step in the analysis of complex systems, and it has two purposes: to identify functional modules and to interpret semantics. However, most of the existing community detection methods only focused on identify communities, while learning the semantics interpretation of communities has not been fully studied. In this paper, we focused on the problem of identifying communities and learning the semantics interpretation of modules jointly in an end-to-end model. We designed a novel generative model which combines two closely related parts, one for community discovery and the other for content clustering and semantics interpretation. By extracting the potential correlation between these two parts, our new method is not only robust to discovering communities, but also able to provide a community with more than one semantic topic. As for model inference, we developed a variational algorithm from a Bayesian point of view. Experimental results on the artificial benchmark and real networks showed the superior performance of the proposed approach over existing methods in terms of effectiveness and efficiency. We also analyzed semantic interpretability of community detection results through a case study over a large-scale music platform dataset."}}
{"id": "4BVCLqHsQq2", "cdate": 1640995200000, "mdate": 1668694936665, "content": {"title": "A Joint Community Detection Model: Integrating Directed and Undirected Probabilistic Graphical Models via Factor Graph With Attention Mechanism", "abstract": "Directed and undirected probabilistic graphical models have been successfully used in community detection in recent years, but existing graphical model based methods usually only use one type of probabilistic graphical model to discover communities. However, directed and undirected graphical models have their own advantages for characterizing different network information (attribute information and network topology). Intuitively, we can make use of the merit of both kinds of models by combining them into a unified model. However, combining directed and undirected graphical models is difficult, as they have different properties which prevent parameter sharing and joint training. In this article, we propose a unified model which integrates directed and undirected graphical models by transforming both them into factor graph. In addition, as network topology and attribute information may contain different degrees of noises, we add a selective attention layer to learn the reliable weight of each type of information source in node granularity. For training the model, we derive an iterative belief propagation algorithm to train all the parameters simultaneously. Extensive experiments on real networks and artificial benchmarks show the superiority of our approach over existing methods."}}
{"id": "0AUj-Sr_sz", "cdate": 1609459200000, "mdate": 1681654591520, "content": {"title": "Robust Detection of Link Communities With Summary Description in Social Networks", "abstract": ""}}
{"id": "v0W4gDH1rR", "cdate": 1577836800000, "mdate": 1681654591168, "content": {"title": "Identification of Generalized Semantic Communities in Large Social Networks", "abstract": ""}}
{"id": "gmL8muHaxRq", "cdate": 1577836800000, "mdate": 1681654591547, "content": {"title": "Topic Enhanced Sentiment Spreading Model in Social Networks Considering User Interest", "abstract": ""}}
