{"id": "UwzrP-B38jK", "cdate": 1652737442011, "mdate": null, "content": {"title": "Learning Robust Rule Representations for Abstract Reasoning via Internal Inferences", "abstract": "Abstract reasoning, as one of the hallmarks of human intelligence, involves collecting information, identifying abstract rules, and applying the rules to solve new problems. Although neural networks have achieved human-level performances in several tasks, the abstract reasoning techniques still far lag behind due to the complexity of learning and applying the logic rules, especially in an unsupervised manner. In this work, we propose a novel framework, ARII, that learns rule representations for Abstract Reasoning via Internal Inferences. The key idea is to repeatedly apply a rule to different instances in hope of having a comprehensive understanding (i.e., representations) of the rule. Specifically, ARII consists of a rule encoder, a reasoner, and an internal referrer. Based on the representations produced by the rule encoder, the reasoner draws the conclusion while the referrer performs internal inferences to regularize rule representations to be robust and generalizable. We evaluate ARII on two benchmark datasets, including PGM and I-RAVEN. We observe that ARII achieves new state-of-the-art records on the majority of the reasoning tasks, including most of the generalization tests in PGM. Our codes are available at https://github.com/Zhangwenbo0324/ARII."}}
{"id": "BCP_poLFmJT", "cdate": 1620357665679, "mdate": null, "content": {"title": "Rationalizing Translation Elongation by Reinforcement Learning", "abstract": "Translation elongation plays a crucial role in multiple aspects of protein biogenesis. In this study, we develop a novel deep reinforcement learning based framework, named RiboRL, to model the distributions of ribosomes on transcripts. In particular, RiboRL employs a policy network (PolicyNet) to perform a context-dependent feature selection to facilitate the prediction of ribosome density. Extensive tests demonstrate that RiboRL can outperform other state-of-the-art methods in predicting ribosome densities. We also show that the reinforcement learning based strategy can generate more informative features for the prediction task when compared to other commonly used attribution methods in deep learning. Moreover, the in-depth analyses and a case study also indicate the potential applications of the RiboRL framework in generating meaningful biological insights regarding translation elongation dynamics. These results have established RiboRL as a useful computational tool to facilitate the studies of the underlying mechanisms of translational regulation."}}
{"id": "ubZaoQaa2_5", "cdate": 1577836800000, "mdate": null, "content": {"title": "Unsupervised Paraphrasing by Simulated Annealing", "abstract": "We propose UPSA, a novel approach that accomplishes Unsupervised Paraphrasing by Simulated Annealing. We model paraphrase generation as an optimization problem and propose a sophisticated objective function, involving semantic similarity, expression diversity, and language fluency of paraphrases. UPSA searches the sentence space towards this objective by performing a sequence of local editing. We evaluate our approach on various datasets, namely, Quora, Wikianswers, MSCOCO, and Twitter. Extensive results show that UPSA achieves the state-of-the-art performance compared with previous unsupervised methods in terms of both automatic and human evaluations. Further, our approach outperforms most existing domain-adapted supervised models, showing the generalizability of UPSA."}}
{"id": "uR23c25ZWrj", "cdate": 1577836800000, "mdate": null, "content": {"title": "A Chance-Constrained Generative Framework for Sequence Optimization", "abstract": "Deep generative modeling has achieved many successes for continuous data generation, such as producing realistic images and controlling their properties (e.g., styles). However, the development of ..."}}
{"id": "rCvjJAdPjFs", "cdate": 1577836800000, "mdate": null, "content": {"title": "Finding decision jumps in text classification", "abstract": "Highlights • We propose Jumper, a novel framework that models text classification as a sequential decision process. • Experiments show that Jumper makes decisions whenever the evidence is enough, therefore reducing total text reading by 30-40% and often finding the key rationale of prediction. • Jumper achieves classification accuracy better than or comparable to state-of-the-art models in several benchmarks and industrial datasets. • Jumper is able to make a decision at the theoretically optimal decision position. Abstract Text classification is one of the key problems in natural language processing (NLP), and in early years, it was usually accomplished by feature-based machine learning models. Recently, the deep neural network has become a powerful learning machine, making it possible to work with text itself as raw input for the classification problems. However, existing neural networks are typically end-to-end and lack explicit interpretation of the prediction. In this paper, we propose Jumper , a novel framework that models text classification as a sequential decision process. Generally, Jumper is a neural system that scans a piece of text sequentially and makes classification decisions at the time it wishes, which is inspired by the cognitive process of human text reading. In our framework, both the classification result and when to make the classification are part of the decision process, controlled by a policy network and trained with reinforcement learning. Experimental results of real-world applications demonstrate the following properties of a properly trained Jumper : (1) it tends to make decisions whenever the evidence is enough, therefore reducing total text reading by 30–40% and often finding the key rationale of the prediction; and (2) it achieves classification accuracy better than or comparable to state-of-the-art models in several benchmark and industrial datasets. We further conduct a simulation experiment with mock data, which confirms that Jumper is able to make a decision at the theoretically optimal decision position."}}
{"id": "ejU6xo3JdP9", "cdate": 1577836800000, "mdate": null, "content": {"title": "Pre-training of Graph Neural Network for Modeling Effects of Mutations on Protein-Protein Binding Affinity", "abstract": "Modeling the effects of mutations on the binding affinity plays a crucial role in protein engineering and drug design. In this study, we develop a novel deep learning based framework, named GraphPPI, to predict the binding affinity changes upon mutations based on the features provided by a graph neural network (GNN). In particular, GraphPPI first employs a well-designed pre-training scheme to enforce the GNN to capture the features that are predictive of the effects of mutations on binding affinity in an unsupervised manner and then integrates these graphical features with gradient-boosting trees to perform the prediction. Experiments showed that, without any annotated signals, GraphPPI can capture meaningful patterns of the protein structures. Also, GraphPPI achieved new state-of-the-art performance in predicting the binding affinity changes upon both single- and multi-point mutations on five benchmark datasets. In-depth analyses also showed GraphPPI can accurately estimate the effects of mutations on the binding affinity between SARS-CoV-2 and its neutralizing antibodies. These results have established GraphPPI as a powerful and useful computational tool in the studies of protein design."}}
{"id": "r1W9dHG_br", "cdate": 1514764800000, "mdate": null, "content": {"title": "Jumper: Learning When to Make Classification Decision in Reading", "abstract": "In early years, text classification is typically accomplished by feature-based classifiers; recently, neural networks, as powerful classifiers, make it possible to work with raw input as the text stands. In this paper, we propose a novel framework, Jumper, inspired by the cognitive process of text reading, that models text classification as a sequential decision process. Basically, Jumper is a neural system that can scan a piece of text sequentially and make classification decision at the time it chooses. Both the classification and when to make the classification are part of the decision process which are controlled by the policy net and trained with reinforcement learning to maximize the overall classification accuracy. Experimental results show that a properly trained Jumper has the following properties: (1) It can make decisions whenever the evidence is enough, therefore reducing the total text reading by 30~40% and often finding the key rationale of prediction. (2) It can achieve classification accuracy better or comparable to state-of-the-art model in several benchmark and industrial datasets."}}
{"id": "SkWpy6g_bB", "cdate": 1514764800000, "mdate": null, "content": {"title": "Object-oriented Neural Programming (OONP) for Document Understanding", "abstract": "We propose Object-oriented Neural Programming (OONP), a framework for semantically parsing documents in specific domains. Basically, OONP reads a document and parses it into a predesigned object-oriented data structure (referred to as ontology in this paper) that reflects the domain-specific semantics of the document. An OONP parser models semantic parsing as a decision process: a neural net-based Reader sequentially goes through the document, and during the process it builds and updates an intermediate ontology to summarize its partial understanding of the text it covers. OONP supports a rich family of operations (both symbolic and differentiable) for composing the ontology, and a big variety of forms (both symbolic and differentiable) for representing the state and the document. An OONP parser can be trained with supervision of different forms and strength, including supervised learning (SL) , reinforcement learning (RL) and hybrid of the two. Our experiments on both synthetic and real-world document parsing tasks have shown that OONP can learn to handle fairly complicated ontology with training data of modest sizes."}}
{"id": "EKLRG2PRkpl", "cdate": 1514764800000, "mdate": null, "content": {"title": "Shift-based Primitives for Efficient Convolutional Neural Networks", "abstract": "We propose a collection of three shift-based primitives for building efficient compact CNN-based networks. These three primitives (channel shift, address shift, shortcut shift) can reduce the inference time on GPU while maintains the prediction accuracy. These shift-based primitives only moves the pointer but avoids memory copy, thus very fast. For example, the channel shift operation is 12.7x faster compared to channel shuffle in ShuffleNet but achieves the same accuracy. The address shift and channel shift can be merged into the point-wise group convolution and invokes only a single kernel call, taking little time to perform spatial convolution and channel shift. Shortcut shift requires no time to realize residual connection through allocating space in advance. We blend these shift-based primitives with point-wise group convolution and built two inference-efficient CNN architectures named AddressNet and Enhanced AddressNet. Experiments on CIFAR100 and ImageNet datasets show that our models are faster and achieve comparable or better accuracy."}}
{"id": "DdcmWF1m2uZ", "cdate": 1388534400000, "mdate": null, "content": {"title": "Semantical Information Graph Model toward Fast Information Valuation in Large Teamwork", "abstract": "Sharing information is critical to large teamwork for cooperative decision making in dynamic and partially observable environments. To be effective, other than building a full information coverage, agents should valuate how a potential receiver could be benefited with a piece of given information. In this paper, we propose a fast valuation model with complex network based graph modeling and analysis, which help to indicate the information importance to a given information base. Similar to vague information valuation by humans, the key is that important information always significantly changes their complex information graph with its incorporation. Therefore, we calculate the semantic based value of this new information in a graph model and build a local graph evaluation algorithm to estimate information graph evolution, instead of performing expensive complete graph search. Although the decision may be not precise, similar to human communication, it is good enough to disseminate valuable information around the team."}}
