{"id": "S245nLUsqlc", "cdate": 1646077524303, "mdate": null, "content": {"title": "Knowledge Representation Combining Quaternion Path Integration and Depth-wise Atrous Circular Convolution", "abstract": "Knowledge models endeavor to improve representation and feature extraction capabilities while keeping low computational cost. Firstly, existing embedding models in hypercomplex spaces of non-Abelian group are optimized. Then a method for fast quaternion multiplication is proposed with proof, with which path semantics are computed and further integrated with the attention mechanism based on the idea semantic extraction of relation sequences could be regarded as a multiple rotational blending problem. A depth-wise atrous circular convolution framework is set up for better feature extraction. Experiments including Link Prediction and Path Query are conducted on benchmark datasets verifying our model holds advantages over state-of-the-art models like Rotate3D. Moreover, the model is tested on a biomedical dataset simulating real-world applications. An ablation study is also performed to explore the effectiveness of different components. "}}
{"id": "QTR8EJWYAb", "cdate": 1609459200000, "mdate": 1637046528282, "content": {"title": "SUKE: Embedding Model for Prediction in Uncertain Knowledge Graph", "abstract": "Graph embedding models are widely used in knowledge graph completion (KGC) task. However, most models are based on the assumption that knowledge is completely certain, and this is inconsistent with real-world situations. Although there are multiple studies on uncertain knowledge embedding tasks, they often use knowledge confidence to learn embedding and cannot make full use the structural and uncertain information of knowledge. This paper presents a new embedding model named Structural and Uncertain Knowledge Embedding (SUKE), which comprises two components: an evaluator and a confidence generator. For unknown triples, the evaluator learns the structural and uncertain information to evaluate its rationality and obtain a candidate set. The confidence generator then determines the confidence of the candidate set to achieve KGC. To verify the effectiveness of the proposed model, confidence prediction, triple evaluation, and fact classification tasks are performed on three data sets. Experimental results show that SUKE performs better than mainstream embedding methods. The model proposed in this paper can help advance the research on the embedding of uncertain knowledge graphs."}}
