{"id": "NqQrUP87am", "cdate": 1675209600000, "mdate": 1684205360225, "content": {"title": "Long-term traffic forecasting based on adaptive graph cross strided convolution network", "abstract": "Traffic forecasting aims to use historical information to predict future traffic values, to achieve the purpose of easing traffic pressure. However, most existing methods can not extract spatial-temporal features from historical data comprehensively and maintain high-accuracy forecasting in long-term forecasting continuously. In this paper, we design a adaptive graph cross strided convolution network (AGCSCN) for long-term traffic forecasting, which mainly includes two deep learning components: crossd stride convolution network (CSCN) for temporal features extraction and adaptive graph convolution network (AGCN) for spatial features extraction. CSCN component ensures that all the historical information can be perceived, and uses parallel cross convolution kernels to enhance long-term forecasting ability by reflecting the difference over forecasting horizons. AGCN component further learns the spatial correlation of period and trend segments respectively on the basis of global adaptive spatial features perception. The experimental results on four real-world traffic datasets show that the proposed AGCSCN model outperforms the state-of-art baselines and achieves optimal forecasting accuracy over all forecasting horizons."}}
{"id": "BWgAtjjdX8", "cdate": 1672531200000, "mdate": 1683905538671, "content": {"title": "Adaptive Hybrid Spatial-Temporal Graph Neural Network for Cellular Traffic Prediction", "abstract": "Cellular traffic prediction is an indispensable part for intelligent telecommunication networks. Nevertheless, due to the frequent user mobility and complex network scheduling mechanisms, cellular traffic often inherits complicated spatial-temporal patterns, making the prediction incredibly challenging. Although recent advanced algorithms such as graph-based prediction approaches have been proposed, they frequently model spatial dependencies based on static or dynamic graphs and neglect the coexisting multiple spatial correlations induced by traffic generation. Meanwhile, some works lack the consideration of the diverse cellular traffic patterns, result in suboptimal prediction results. In this paper, we propose a novel deep learning network architecture, Adaptive Hybrid Spatial-Temporal Graph Neural Network (AHSTGNN), to tackle the cellular traffic prediction problem. First, we apply adaptive hybrid graph learning to learn the compound spatial correlations among cell towers. Second, we implement a Temporal Convolution Module with multi-periodic temporal data input to capture the nonlinear temporal dependencies. In addition, we introduce an extra Spatial-Temporal Adaptive Module to conquer the heterogeneity lying in cell towers. Our experiments on two real-world cellular traffic datasets show AHSTGNN outperforms the state-of-the-art by a significant margin, illustrating the superior scalability of our method for spatial-temporal cellular traffic prediction."}}
{"id": "ygj79i51Js", "cdate": 1640995200000, "mdate": 1684205360178, "content": {"title": "A Multi-scale Ensemble Learning Model for Cellular Traffic Prediction", "abstract": "With the widespread use of mobile devices in recent years, accurate prediction of base station traffic is vital for maintaining a good quality of mobile network services. In this paper, we propose an ensemble learning framework to predict the cellular traffic of base stations. Specifically, we introduce the Granger causality test to find the causal relationship in the base stations and model the spatial relationship between them simultaneously. We also employ a temporal convolutional network (TCN) to extract the sequential temporal features of base station traffic. Aiming at modelling the long-tail characteristics of the traffic distribution of base stations, we use the technique of redundant encoding to refine the prediction task to learn the base station traffic of different scales combined with ensemble learning. Extensive experimental results demonstrate that our method can predict base station traffic precisely and outperforms the best baseline by nearly 13% on average in terms of NMSE and NRMSE."}}
{"id": "oIhZ-YgiXv", "cdate": 1640995200000, "mdate": 1684205360196, "content": {"title": "Large-scale cellular traffic prediction based on graph convolutional networks with transfer learning", "abstract": "Intelligent cellular traffic prediction is very important for mobile operators to achieve resource scheduling and allocation. In reality, people often need to predict very large scale of cellular traffic involving thousands of cells. This paper proposes a transfer learning strategy based on graph convolution neural network to achieve the task of large-scale traffic prediction. In this paper, we design a novel spatial-temporal graph convolutional network based on attention mechanism (STA-GCN). In order to achieve large-scale traffic prediction, this paper proposes a regional transfer learning strategy based on STA-GCN to improve knowledge reuse. The effectiveness of STA-GCN is validated through two real-world traffic datasets. The results show that STA-GCN outperforms the state-of-art baselines, and the transfer learning strategy can effectively reduce the number of epochs while training."}}
{"id": "Vrb2TaiJYM", "cdate": 1640995200000, "mdate": 1684205360188, "content": {"title": "Network Traffic Overload Prediction with Temporal Graph Attention Convolutional Networks", "abstract": "With the rapid explosion of network traffic volume, the prediction of traffic overload in the cellular network, which is defined as whether the traffic of a base station exceeds a predefined threshold, has become a crucial research problem regarding energy utilization and resource allocation. Most existing methods primarily model the dynamic patterns of traffic time series and compare the results with the predefined thresholds to predict traffic overload, taking into account a large amount of small-scale redundant data. To focus on the changes near the thresholds, i.e., the traffic burst circumstances, this paper adopts the soft-attention mechanism to fuse the threshold-based discrete and continuous time series characteristics to predict traffic overload. In addition, to capture the spatial correlations of the most related neighbors, we employ a Dual-KNN mechanism to select neighboring base stations and leverage the Graph Attention Network (GAT) to capture the spatial dependencies. Furthermore, we deploy a gated Temporal Convolutional Network (TCN) to model the temporal dependencies of the network traffic. Extensive experiments demonstrate that our proposed method effectively forecasts the traffic overload and outperforms the state-of-the-art algorithms by 4.07%."}}
{"id": "K3-pu_Ezc3", "cdate": 1640995200000, "mdate": 1682344600312, "content": {"title": "Network Topology Optimization via Deep Reinforcement Learning", "abstract": "Topology impacts important network performance metrics, including link utilization, throughput and latency, and is of central importance to network operators. However, due to the combinatorial nature of network topology, it is extremely difficult to obtain an optimal solution, especially since topology planning in networks also often comes with management-specific constraints. As a result, local optimization with hand-tuned heuristic methods from human experts are often adopted in practice. Yet, heuristic methods cannot cover the global topology design space while taking into account constraints, and cannot guarantee to find good solutions. In this paper, we propose a novel deep reinforcement learning (DRL) algorithm, called Advantage Actor Critic-Graph Searching (A2C-GS), for network topology optimization. A2C-GS consists of three novel components, including a verifier to validate the correctness of a generated network topology, a graph neural network (GNN) to efficiently approximate topology rating, and a DRL actor layer to conduct a topology search. A2C-GS can efficiently search over large topology space and output topology with satisfying performance. We conduct a case study based on a real network scenario, and our experimental results demonstrate the superior performance of A2C-GS in terms of both efficiency and performance."}}
{"id": "4It6VKoDhx", "cdate": 1640995200000, "mdate": 1684205360197, "content": {"title": "Adaptive Spatial-Temporal Convolution Network for Traffic Forecasting", "abstract": "As a vital part of intelligent transportation system (ITS), traffic forecasting is crucial for traffic management and travel planning. However, accurate traffic forecasting is challenging due to complex spatial-temporal correlations among traffic series and heterogeneities among prediction hirizons. Most existing works focus on extracting spatial features by graph convolution network and ignore the heterogeneities of timestamps in long-term forecasting. Moreover, the fixed spatial-temporal correlations extraction pattern is not sensitive to the changes of traffic environments. In this paper, we propose a general and effective framework called adaptive spatial-temporal convolution network (ASTCN) for traffic flow forecasting. ASTCN can capture inherent spatial-temporal correlations adaptively according to specific prediction task without any prior knowledge, and has strong adaptability to different traffic environments. Moreover, each timestamp over prediction horizon can learn its own unique features aggregation pattern, so as to improve the accuracy of long-term and short-term forecasting concurrently. The experimental results on four public highway datasets show that ASTCN outperforms state-of-the-art baselines and achieves optimal accuracy in all prediction horizons for the first time."}}
{"id": "VxC6fLX7bp", "cdate": 1609459200000, "mdate": 1684205360226, "content": {"title": "Adaptive Multi-receptive Field Spatial-Temporal Graph Convolutional Network for Traffic Forecasting", "abstract": "Mobile network traffic forecasting is one of the key functions in daily network operation. A commercial mobile network is large, heterogeneous, complex and dynamic. These intrinsic features make mobile network traffic forecasting far from being solved even with recent advanced algorithms such as graph convolutional network-based prediction approaches and various attention mechanisms, which have been proved successful in vehicle traffic forecasting. In this paper, we cast the problem as a spatial-temporal sequence prediction task. We propose a novel deep learning network architecture, Adaptive Multi-receptive Field Spatial-Temporal Graph Convolutional Networks (AMF-STGCN), to model the traffic dynamics of mobile base stations. AMF-STGCN extends GCN by (1) jointly modeling the complex spatial-temporal dependencies in mobile networks, (2) applying attention mechanisms to capture various Receptive Fields of heterogeneous base stations, and (3) introducing an extra decoder based on a fully connected deep network to conquer the error propagation challenge with multi-step forecasting. Experiments on four real-world datasets from two different domains consistently show AMF-STGCN outperforms the state-of-the-art methods."}}
{"id": "3zuybflGnO", "cdate": 1609459200000, "mdate": 1684205360201, "content": {"title": "Adaptive Multi-receptive Field Spatial-Temporal Graph Convolutional Network for Traffic Forecasting", "abstract": "Mobile network traffic forecasting is one of the key functions in daily network operation. A commercial mobile network is large, heterogeneous, complex and dynamic. These intrinsic features make mobile network traffic forecasting far from being solved even with recent advanced algorithms such as graph convolutional network-based prediction approaches and various attention mechanisms, which have been proved successful in vehicle traffic forecasting. In this paper, we cast the problem as a spatial-temporal sequence prediction task. We propose a novel deep learning network architecture, Adaptive Multi-receptive Field Spatial-Temporal Graph Convolutional Networks (AMF-STGCN), to model the traffic dynamics of mobile base stations. AMF-STGCN extends GCN by (1) jointly modeling the complex spatial-temporal dependencies in mobile networks, (2) applying attention mechanisms to capture various Receptive Fields of heterogeneous base stations, and (3) introducing an extra decoder based on a fully connected deep network to conquer the error propagation challenge with multi-step forecasting. Experiments on four real-world datasets from two different domains consistently show AMF-STGCN outperforms the state-of-the-art methods."}}
{"id": "mzfqkPOhVI4", "cdate": 1601308271486, "mdate": null, "content": {"title": "Adaptive Spatial-Temporal Inception Graph Convolutional Networks for Multi-step Spatial-Temporal Network Data Forecasting", "abstract": "Spatial-temporal data forecasting is of great importance for industries such as telecom network operation and transportation management. However, spatial-temporal data is inherent with complex spatial-temporal correlations and behaves heterogeneities among the spatial and temporal aspects, which makes the forecasting remain as a very challenging task though recently great work has been done. In this paper, we propose a novel model, Adaptive Spatial-Temporal Inception Graph Convolution Networks (ASTI-GCN), to solve the multi-step spatial-temporal data forecasting problem. The model proposes multi-scale spatial-temporal joint graph convolution block to directly model the spatial-temporal joint correlations without introducing elaborately constructed mechanisms. Moreover inception mechanism combined with the graph node-level attention is introduced to make the model capture the heterogeneous nature of the graph adaptively. Our experiments on three real-world datasets from two different fields consistently show ASTI-GCN outperforms the state-of-the-art performance. In addition, ASTI-GCN is proved to generalize well. "}}
