{"id": "Dslv6ZglRf", "cdate": 1683878938226, "mdate": 1683878938226, "content": {"title": "Cross-Network Skip-Gram Embedding for Joint Network Alignment and Link Prediction", "abstract": "Link prediction and network alignment are two fundamental and interleaved tasks in network analysis. In this paper, we propose a novel cross-network embedding model under the Skip-gram framework, which alternately performs link prediction and network alignment by joint optimization. Vertex sequences, obtained via a biased random walk based on empirical mixture distributions, are used to train a Skip-gram based node embedding model. On one hand, based on the similarity in embedding space, network alignment can be effectively performed either with the initial ground truth alignments as seeds or from scratch. On the other hand, the proposed link prediction model involves training a supervised classifier by sampling a set of positive and negative edges. We also modify and incorporate the Collective Link Fusion (CLF) method under a Skip-gram framework and show that the new method can achieve better results in both tasks. Extensive experimental results show the state-of-the-art performance of our methods. "}}
{"id": "vVbUB9oWUup", "cdate": 1663849837838, "mdate": null, "content": {"title": "Decoupling Concept Bottleneck Model", "abstract": "Concept Bottleneck Model (CBM) is a kind of powerful interpretable neural network, which utilizes high-level concepts to explain model decisions and interact with humans. However, CBM cannot always work as expected due to the troublesome collection and commonplace insufficiency of high-level concepts in real-world scenarios. In this paper, we theoretically reveal that insufficient concept information will induce the mixture of explicit and implicit information, which further leads to the inherent dilemma of concept and label distortions in CBM. Motivated by the proposed theorem, we present Decoupling Concept Bottleneck Model (DCBM), a novel concept-based model decoupling heterogeneous information into explicit and implicit concepts, while still retaining high prediction performance and interpretability. Extensive experiments expose the success in the alleviation of concept/label distortions, where DCBM achieves state-of-the-art performances in both concept and label learning tasks. Especially for situations where concepts are insufficient, DCBM significantly outperforms other models based on concept bottleneck and respectively achieves error rates 24.95% and 20.09% lower than other CBMs on concept/label prediction. Moreover, to express effective human-machine interactions for DCBM, we devise two algorithms based on mutual information (MI) estimation, including forward intervention and backward rectification, which can automatically correct labels and trace back to wrong concepts. The construction of the interaction regime can be formulated as a light min-max optimization problem achieved within minutes. Multiple experiments show that such interactions can effectively promote concept/label accuracy.\n"}}
{"id": "R4DFH3wh9Rs", "cdate": 1640995200000, "mdate": 1660666732519, "content": {"title": "Real-Trading-Oriented Price Prediction With Explainable Multiobjective Optimization in Quantitative Trading", "abstract": "Price prediction using machine learning is a heated topic and an effective task in quantitative trading. However, the objectives that existing researches focus on are typically naive and can hardly express the diverse properties in real trading, by using which the results of price prediction cannot precisely reflect the returns in real trading. To alleviate this problem, we first formulate the characteristics of transactions and then propose a multi-objective method under a real-trading-oriented perspective, where a tree model inducing explainable trading characteristics is proposed. With lots of considerations of real trading characteristics, the results of price prediction can better obtain the properties in trading, and especially perform quite well in real trading. Multiple experiments on the Chinese Index Future Market display the effectiveness of the proposed model, where the performance of real trading has reached the industry-leading level. In particular, the difference between model prediction and returns in real trading can be diminished."}}
{"id": "NAejD8dzod0", "cdate": 1640995200000, "mdate": 1660666732515, "content": {"title": "Cross-Network Skip-Gram Embedding for Joint Network Alignment and Link Prediction", "abstract": "Link prediction and network alignment are two fundamental and interleaved tasks in network analysis. In this paper, we propose a novel cross-network embedding model under the Skip-gram framework, which alternately performs link prediction and network alignment by joint optimization. Vertex sequences, obtained via a biased random walk based on empirical mixture distributions, are used to train a Skip-gram based node embedding model. On one hand, based on the similarity in embedding space, network alignment can be effectively performed either with the initial ground truth alignments as seeds or from scratch. On the other hand, the proposed link prediction model involves training a supervised classifier by sampling a set of positive and negative edges. We also modify and incorporate the Collective Link Fusion (CLF) method under a Skip-gram framework and show that the new method can achieve better results in both tasks. Extensive experimental results show the state-of-the-art performance of our methods."}}
{"id": "AiGgtNPDQfG", "cdate": 1546300800000, "mdate": 1660666732294, "content": {"title": "Joint Link Prediction and Network Alignment via Cross-graph Embedding", "abstract": "Link prediction and network alignment are two important problems in social network analysis and other network related applications. Considerable efforts have been devoted to these two problems while often in an independent way to each other. In this paper we argue that these two tasks are relevant and present a joint link prediction and network alignment framework, whereby a novel cross-graph node embedding technique is devised to allow for information propagation. Our approach can either work with a few initial vertex correspondence as seeds, or from scratch. By extensive experiments on public benchmark, we show that link prediction and network alignment can benefit to each other especially for improving the recall for both tasks."}}
