{"id": "9DcpputKofY", "cdate": 1667505970500, "mdate": null, "content": {"title": "Deep learning algorithm reveals probabilities of stage-specific time to conversion in individuals with neurodegenerative disease LATE", "abstract": "Introduction: Limbic-predominant age-related TAR DNA-binding protein 43 (TDP-43) encephalopathy (LATE) is a recently defined neurodegenerative disease. Currently, there is no effective way to make a prognosis of time to stage-specific future conversions at an individual level.\n\nMethods: After using the Kaplan–Meier estimation and log-rank test to confirm the heterogeneity of LATE progression, we developed a deep learning–based approach to assess the stage-specific probabilities of time to LATE conversions for different subjects.\n\nResults: Our approach could accurately estimate the disease incidence and transition to next stages: the concordance index was at least 82% and the integrated Brier score was less than 0.14. Moreover, we identified the top 10 important predictors for each disease conversion scenario to help explain the estimation results, which were clinicopathologically meaningful and most were also statistically significant.\n\nDiscussion: Our study has the potential to provide individualized assessment for future time courses of LATE conversions years before their actual occurrence."}}
{"id": "qYSBIQiyEF", "cdate": 1667484052495, "mdate": 1667484052495, "content": {"title": "\t [HTML] from plos.org Random forest-integrated analysis in AD and LATE brain transcriptome-wide data to identify disease-specific gene expression", "abstract": "Alzheimer’s disease (AD) is a complex neurodegenerative disorder that affects thinking, memory, and behavior. Limbic-predominant age-related TDP-43 encephalopathy (LATE) is a recently identified common neurodegenerative disease that mimics the clinical symptoms of AD. The development of drugs to prevent or treat these neurodegenerative diseases has been slow, partly because the genes associated with these diseases are incompletely understood. A notable hindrance from data analysis perspective is that, usually, the clinical samples for patients and controls are highly imbalanced, thus rendering it challenging to apply most existing machine learning algorithms to directly analyze such datasets. Meeting this data analysis challenge is critical, as more specific disease-associated gene identification may enable new insights into underlying disease-driving mechanisms and help find biomarkers and, in turn, improve prospects for effective treatment strategies. In order to detect disease-associated genes based on imbalanced transcriptome-wide data, we proposed an integrated multiple random forests (IMRF) algorithm. IMRF is effective in differentiating putative genes associated with subjects having LATE and/or AD from controls based on transcriptome-wide data, thereby enabling effective discrimination between these samples. Various forms of validations, such as cross-domain verification of our method over other datasets, improved and competitive classification performance by using identified genes, effectiveness of testing data with a classifier that is completely independent from decision trees and random forests, and relationships with prior AD and LATE studies on the genes linked to neurodegeneration, all testify to the effectiveness of IMRF in identifying genes with altered expression in LATE and/or AD. We conclude that IMRF, as an effective feature selection algorithm for imbalanced data, is promising to facilitate the development of new gene biomarkers as well as targets for effective strategies of disease prevention and treatment."}}
{"id": "05xjCnqvTb4", "cdate": 1667483954499, "mdate": 1667483954499, "content": {"title": "Machine learning approach predicts probability of time to stage-specific conversion of Alzheimer’s disease", "abstract": "Background:The progression of Alzheimer’s disease (AD) varies in different patients at different stages, which makes predicting the time of disease conversions challenging. Objective:We established an algorithm by leveraging machine learning techniques to predict the probability of the conversion time to next stage for different subjects during a given period. Methods:Firstly, we used Kaplan-Meier (KM) estimation to get the transition curves of different AD stages, and calculated Log-rank statistics to test whether the progression rate between different stages was identical. This quantitatively confirmed the progression rates known in the literature. Then, we developed an approach based on deep learning model, DeepSurv, to predict the probabilities of time-to-conversion. Finally, to help interpret the deep learning model in our approach, we identified important variables contributing the most to the DeepSurv prediction, whose significance were validated with the analysis of variance (ANOVA). Results:Our machine learning approach predicted the time to conversion with a high accuracy. For each of the different stages, the concordance index (CI) of our approach was at least 86%, and the integrated Brier score (IBS) was less than 0.1. To facilitate interpretability of the prediction results, our approach identified the top 10 variables for each disease conversion scenario, which were clinicopathologically meaningful, and most of them were also statistically significant. Conclusion:Our study has the potential to provide individualized prediction for future time course of AD conversions years before their actual occurrence, thus facilitating personalized prevention and intervention strategies to slow down the progression of AD."}}
{"id": "_GRVSxMfY7", "cdate": 1667483906082, "mdate": 1667483906082, "content": {"title": "Explainable Censored Learning: Finding Critical Features with Long Term Prognostic Values for Survival Prediction", "abstract": "Interpreting critical variables involved in complex biological processes related to survival time can help understand prediction from survival models, evaluate treatment efficacy, and develop new therapies for patients. Currently, the predictive results of deep learning (DL)-based models are better than or as good as standard survival methods, they are often disregarded because of their lack of transparency and little interpretability, which is crucial to their adoption in clinical applications. In this paper, we introduce a novel, easily deployable approach, called EXplainable CEnsored Learning (EXCEL), to iteratively exploit critical variables and simultaneously implement (DL) model training based on these variables. First, on a toy dataset, we illustrate the principle of EXCEL; then, we mathematically analyze our proposed method, and we derive and prove tight generalization error bounds; next, on two semi-synthetic datasets, we show that EXCEL has good anti-noise ability and stability; finally, we apply EXCEL to a variety of real-world survival datasets including clinical data and genetic data, demonstrating that EXCEL can effectively identify critical features and achieve performance on par with or better than the original models. It is worth pointing out that EXCEL is flexibly deployed in existing or emerging models for explainable survival data in the presence of right censoring."}}
{"id": "UJQS35NZ49", "cdate": 1640995200000, "mdate": 1667609226440, "content": {"title": "Explainable Censored Learning: Finding Critical Features with Long Term Prognostic Values for Survival Prediction", "abstract": "Interpreting critical variables involved in complex biological processes related to survival time can help understand prediction from survival models, evaluate treatment efficacy, and develop new therapies for patients. Currently, the predictive results of deep learning (DL)-based models are better than or as good as standard survival methods, they are often disregarded because of their lack of transparency and little interpretability, which is crucial to their adoption in clinical applications. In this paper, we introduce a novel, easily deployable approach, called EXplainable CEnsored Learning (EXCEL), to iteratively exploit critical variables and simultaneously implement (DL) model training based on these variables. First, on a toy dataset, we illustrate the principle of EXCEL; then, we mathematically analyze our proposed method, and we derive and prove tight generalization error bounds; next, on two semi-synthetic datasets, we show that EXCEL has good anti-noise ability and stability; finally, we apply EXCEL to a variety of real-world survival datasets including clinical data and genetic data, demonstrating that EXCEL can effectively identify critical features and achieve performance on par with or better than the original models. It is worth pointing out that EXCEL is flexibly deployed in existing or emerging models for explainable survival data in the presence of right censoring."}}
{"id": "UIrHpCMGesd", "cdate": 1640995200000, "mdate": 1667609226516, "content": {"title": "PRIME: Uncovering Circadian Oscillation Patterns and Associations with AD in Untimed Genome-wide Gene Expression across Multiple Brain Regions", "abstract": "The disruption of circadian rhythm is a cardinal symptom for Alzheimer's disease (AD) patients. The full circadian rhythm orchestration of gene expression in the human brain and its inherent associations with AD remain largely unknown. We present a novel comprehensive approach, PRIME, to detect and analyze rhythmic oscillation patterns in untimed high-dimensional gene expression data across multiple datasets. To demonstrate the utility of PRIME, firstly, we validate it by a time course expression dataset from mouse liver as a cross-species and cross-organ validation. Then, we apply it to study oscillation patterns in untimed genome-wide gene expression from 19 human brain regions of controls and AD patients. Our findings reveal clear, synchronized oscillation patterns in 15 pairs of brain regions of control, while these oscillation patterns either disappear or dim for AD. It is worth noting that PRIME discovers the circadian rhythmic patterns without requiring the sample's timestamps. The codes for PRIME, along with codes to reproduce the figures in this paper, are available at https://github.com/xinxingwu-uk/PRIME."}}
{"id": "Fk0aM-o0Yb", "cdate": 1640995200000, "mdate": 1667609226449, "content": {"title": "Stabilizing and Enhancing Link Prediction through Deepened Graph Auto-Encoders", "abstract": "Graph neural networks have been widely used for a variety of learning tasks. Link prediction is a relatively under-studied graph learning task, with current state-of-the-art models based on one- or two-layer shallow graph auto-encoder (GAE) architectures. In this paper, we overcome the limitation of current methods for link prediction of non-Euclidean network data, which can only use shallow GAEs and variational GAEs. Our proposed methods innovatively incorporate standard auto-encoders (AEs) into the architectures of GAEs to capitalize on the intimate coupling of node and edge information in complex network data. Empirically, extensive experiments on various datasets demonstrate the competitive performance of our proposed approach. Theoretically, we prove that our deep extensions can inclusively express multiple polynomial filters with different orders. The codes of this paper are available at https://github.com/xinxingwu-uk/DGAE."}}
{"id": "-h7Vk7CnnG", "cdate": 1640995200000, "mdate": 1667609226458, "content": {"title": "Alcohol Intake Differentiates AD and LATE: A Telltale Lifestyle from Two Large-Scale Datasets", "abstract": "Alzheimer's disease (AD), as a progressive brain disease, affects cognition, memory, and behavior. Similarly, limbic-predominant age-related TDP-43 encephalopathy (LATE) is a recently defined common neurodegenerative disease that mimics the clinical symptoms of AD. At present, the risk factors implicated in LATE and those distinguishing LATE from AD are largely unknown. We leveraged an integrated feature selection-based algorithmic approach, to identify important factors differentiating subjects with LATE and/or AD from Control on significantly imbalanced data. We analyzed two datasets ROSMAP and NACC and discovered that alcohol consumption was a top lifestyle and environmental factor linked with LATE and AD and their associations were differential. In particular, we identified a specific subpopulation consisting of APOE e4 carriers. We found that, for this subpopulation, light-to-moderate alcohol intake was a protective factor against both AD and LATE, but its protective role against AD appeared stronger than LATE. The codes for our algorithms are available at https://github.com/xinxingwu-uk/PFV."}}
{"id": "huxo_Mqh76", "cdate": 1621629912320, "mdate": null, "content": {"title": "Algorithmic stability and generalization of an unsupervised feature selection algorithm", "abstract": "Feature selection, as a vital dimension reduction technique, reduces data dimension by identifying an essential subset of input features, which can facilitate interpretable insights into learning and inference processes. Algorithmic stability is a key characteristic of an algorithm regarding its sensitivity to perturbations of input samples. In this paper, we propose an innovative unsupervised feature selection algorithm attaining this stability with provable guarantees. The architecture of our algorithm consists of a feature scorer and a feature selector. The scorer trains a neural network (NN) to globally score all the features, and the selector adopts a dependent sub-NN to locally evaluate the representation abilities for selecting features. Further, we present algorithmic stability analysis and show that our algorithm has a performance guarantee via a generalization error bound. Extensive experimental results on real-world datasets demonstrate superior generalization performance of our proposed algorithm to strong baseline methods. Also, the properties revealed by our theoretical analysis and the stability of our algorithm-selected features are empirically confirmed."}}
{"id": "rrrWdvfQBgc", "cdate": 1609459200000, "mdate": 1645716064241, "content": {"title": "Deepened Graph Auto-Encoders Help Stabilize and Enhance Link Prediction", "abstract": "Graph neural networks have been used for a variety of learning tasks, such as link prediction, node classification, and node clustering. Among them, link prediction is a relatively under-studied graph learning task, with current state-of-the-art models based on one- or two-layer of shallow graph auto-encoder (GAE) architectures. In this paper, we focus on addressing a limitation of current methods for link prediction, which can only use shallow GAEs and variational GAEs, and creating effective methods to deepen (variational) GAE architectures to achieve stable and competitive performance. Our proposed methods innovatively incorporate standard auto-encoders (AEs) into the architectures of GAEs, where standard AEs are leveraged to learn essential, low-dimensional representations via seamlessly integrating the adjacency information and node features, while GAEs further build multi-scaled low-dimensional representations via residual connections to learn a compact overall embedding for link prediction. Empirically, extensive experiments on various benchmarking datasets verify the effectiveness of our methods and demonstrate the competitive performance of our deepened graph models for link prediction. Theoretically, we prove that our deep extensions inclusively express multiple polynomial filters with different orders."}}
