{"id": "z9FyE7jHXkN", "cdate": 1663849980281, "mdate": null, "content": {"title": "Environment Partitioning For Invariant Learning By Decorrelation", "abstract": "Invariant learning methods try to find an invariant predictor across several environments and have become popular in OOD generalization. However, in situations where environments do not naturally exist in the data, they have to be decided by practitioners manually. Environment partitioning, which splits the whole training dataset into environments by algorithms, will significantly influence the performance of invariant learning and has been left undiscussed. A good environment partitioning method can bring invariant learning to applications with more general settings and improve its performance. We propose to split the dataset into several environments by finding low-correlated data subsets. Theoretical interpretations and algorithm details are both introduced in the paper. Through experiments on both synthetic and real data, we show that our Decorr method can achieve outstanding performance, while some other partitioning methods may lead to bad, even below-ERM results using the same training scheme of IRM."}}
{"id": "fDxtc5f00VR", "cdate": 1598851597345, "mdate": null, "content": {"title": "Capturing Deep Tail Risk via Sequential Learning of Quantile Dynamics", "abstract": "This paper develops a conditional quantile model that can learn long term and short term memories of sequential data. It builds on sequential neural networks and yet outputs interpretable dynamics. We apply the model to asset return time series across eleven asset classes using historical data from the 1960s to 2018. Our results reveal that it extracts not only the serial dependence structure in conditional volatility but also the memories buried deep in the tails of historical prices. We further evaluate its Value-at-Risk forecasts against a wide range of prevailing models. Our model outperforms the GARCH family as well as models using filtered historical simulation, conditional extreme value theory, and dynamic quantile regression. These studies indicate that conditional quantiles of asset return have persistent sources of risk that are not coming from those responsible for volatility clustering. These findings could have important implications for risk management in general and tail risk forecasts in particular."}}
{"id": "5FvWU1xd79L", "cdate": 1598851479324, "mdate": null, "content": {"title": "Cross-sectional Learning of Extremal Dependence among Financial Assets", "abstract": "We propose a novel probabilistic model to facilitate the learning of multivariate tail dependence of multiple financial assets. Our method allows one to construct from known random vectors, e.g., standard normal, sophisticated joint heavy-tailed random vectors featuring not only distinct marginal tail heaviness, but also flexible tail dependence structure. The novelty lies in that pairwise tail dependence between any two dimensions is modeled separately from their correlation, and can vary respectively according to its own parameter rather than the correlation parameter, which is an essential advantage over many commonly used methods such as multivariate t or elliptical distribution. It is also intuitive to interpret, easy to track, and simple to sample comparing to the copula approach. We show its flexible tail dependence structure through simulation. Coupled with a GARCH model to eliminate serial dependence of each individual asset return series, we use this novel method to model and forecast multivariate conditional distribution of stock returns, and obtain notable performance improvements in multi-dimensional coverage tests. Besides, our empirical finding about the asymmetry of tails of the idiosyncratic component as well as the market component is interesting and worth to be well studied in the future."}}
{"id": "BJZ0HdW_ZS", "cdate": 1514764800000, "mdate": null, "content": {"title": "Parsimonious Quantile Regression of Financial Asset Tail Dynamics via Sequential Learning", "abstract": "We propose a parsimonious quantile regression framework to learn the dynamic tail behaviors of financial asset returns. Our model captures well both the time-varying characteristic and the asymmetrical heavy-tail property of financial time series. It combines the merits of a popular sequential neural network model, i.e., LSTM, with a novel parametric quantile function that we construct to represent the conditional distribution of asset returns. Our model also captures individually the serial dependences of higher moments, rather than just the volatility. Across a wide range of asset classes, the out-of-sample forecasts of conditional quantiles or VaR of our model outperform the GARCH family. Further, the proposed approach does not suffer from the issue of quantile crossing, nor does it expose to the ill-posedness comparing to the parametric probability density function approach."}}
{"id": "SJErQq-ubB", "cdate": 1388534400000, "mdate": null, "content": {"title": "Modeling Video Dynamics with Deep Dynencoder", "abstract": "Videos always exhibit various pattern motions, which can be modeled according to dynamics between adjacent frames. Previous methods based on linear dynamic system can model dynamic textures but have limited capacity of representing sophisticated nonlinear dynamics. Inspired by the nonlinear expression power of deep autoencoders, we propose a novel model named dynencoder which has an autoencoder at the bottom and a variant of it at the top (named as dynpredictor). It generates hidden states from raw pixel inputs via the autoencoder and then encodes the dynamic of state transition over time via the dynpredictor. Deep dynencoder can be constructed by proper stacking strategy and trained by layer-wise pre-training and joint fine-tuning. Experiments verify that our model can describe sophisticated video dynamics and synthesize endless video texture sequences with high visual quality. We also design classification and clustering methods based on our model and demonstrate the efficacy of them on traffic scene classification and motion segmentation."}}
