{"id": "eLd__Zp9Pw", "cdate": 1640995200000, "mdate": 1681657745509, "content": {"title": "Pipeline-Invariant Representation Learning for Neuroimaging", "abstract": "Deep learning has been widely applied in neuroimaging, including predicting brain-phenotype relationships from magnetic resonance imaging (MRI) volumes. MRI data usually requires extensive preprocessing prior to modeling, but variation introduced by different MRI preprocessing pipelines may lead to different scientific findings, even when using the identical data. Motivated by the data-centric perspective, we first evaluate how preprocessing pipeline selection can impact the downstream performance of a supervised learning model. We next propose two pipeline-invariant representation learning methodologies, MPSL and PXL, to improve consistency in classification performance and to capture similar neural network representations. Using 2000 human subjects from the UK Biobank dataset, we demonstrate that both models present unique advantages, in particular that MPSL can be used to improve out-of-sample generalization to new pipelines, while PXL can be used to improve predictive performance consistency and representational similarity. These results suggest that our proposed models can be applied to overcome pipeline-related biases, and to improve prediction consistency and robustness in brain-phenotype modeling."}}
{"id": "BAkMOitIz7", "cdate": 1640995200000, "mdate": 1681657745503, "content": {"title": "Mind the gap: functional network connectivity interpolation between schizophrenia patients and controls using a variational autoencoder", "abstract": "Mental disorders such as schizophrenia have been challenging to characterize due in part to their heterogeneous presentation in individuals. Most studies have focused on identifying groups differences and have typically ignored the heterogeneous patterns within groups. Here we propose a novel approach based on a variational autoencoder (VAE) to interpolate static functional network connectivity (sFNC) across individuals, with group-specific patterns between schizophrenia patients and controls captured simultaneously. We then visualize the original sFNC in a 2D grid according to the samples in the VAE latent space. We observe a high correspondence between the generated and the original sFNC. The proposed framework facilitates data visualization and can potentially be applied to predict the stage that a subject falls within a disorder continuum as well as characterize individual heterogeneity within and between groups."}}
{"id": "olPh7cswAY", "cdate": 1546300800000, "mdate": 1681657745461, "content": {"title": "Enhancing the Accuracy of Glaucoma Detection from OCT Probability Maps using Convolutional Neural Networks", "abstract": "We describe and assess convolutional neural network (CNN) models for detection of glaucoma based upon optical coherence tomography (OCT) retinal nerve fiber layer (RNFL) probability maps. CNNs pretrained on natural images performed comparably to CNNs trained solely on OCT data, and all models showed high accuracy in detecting glaucoma, with receiver operating characteristic area under the curve (AUC) scores ranging from 0.930 to 0.989. Attention-based heat maps of CNN regions of interest suggest that these models could be improved by incorporation of blood vessel location information. Such CNN models have the potential to work in tandem with human experts to maintain overall eye health and expedite detection of blindness-causing eye disease."}}
