{"id": "SOTkd0wbIL", "cdate": 1696514111718, "mdate": 1696514111718, "content": {"title": "Sequential Attention Source Identification Based on Feature Representation", "abstract": "Snapshot observation based source localization has been widely studied due to its accessibility and low cost. However, the interaction of users in existing methods does not be addressed in time-varying infection scenarios. So these methods have a decreased accuracy in heterogeneous interaction scenarios. To solve this critical issue, this paper proposes a sequence-to-sequence based localization framework called Temporal-sequence based Graph Attention Source Identification (TGASI) based on an inductive learning idea. More specifically, the encoder focuses on generating multiple features by estimating the influence probability between two users, and the decoder distinguishes the importance of prediction sources in different timestamps by a designed temporal attention mechanism. It's worth mentioning that the inductive learning idea ensures that TGASI can detect the sources in new scenarios without knowing other prior knowledge, which proves the scalability of TGASI. Comprehensive experiments with the SOTA methods demonstrate the higher detection performance and scalability in different scenarios of TGASI."}}
{"id": "IAHlkBA-tTv", "cdate": 1696513973919, "mdate": 1696513973919, "content": {"title": "Lightweight source localization for large-scale social networks", "abstract": "The rapid diffusion of hazardous information in large-flow-based social media causes great economic losses and potential threats to society. It is crucial to infer the inner information source as early as possible to prevent further losses. However, existing localization methods wait until all deployed sensors obtain propagation information before starting source inference within a network, and hence the best opportunity to control propagation is missed. In this paper, we propose a new localization strategy based on finite deployed sensors, named Greedy-coverage-based Rapid Source Localization (GRSL), to rapidly, flexibly and accurately infer the source in the early propagation stage of large-scale networks. There are two phases in GRSL. In the first phase, the Greedy-based Strategy (GS) greedily deploys sensors to rapidly achieve wide area coverage at a low cost. In the second phase, when a propagation event within a network is observed by a part of the sensors, the Inference Strategy (IS) with an earlier response mechanism begins executing the source inference task in an earlier small infected area. Comprehensive experiments with the SOTA methods demonstrate the superior performance and robustness of GRSL in various application scenarios."}}
{"id": "JuYYwq4YXoW", "cdate": 1688169600000, "mdate": 1683950903235, "content": {"title": "Sparse feature selection via fast embedding spectral analysis", "abstract": ""}}
{"id": "2MQA99Gkr9", "cdate": 1688169600000, "mdate": 1683950902944, "content": {"title": "Elaborate multi-task subspace learning with discrete group constraint", "abstract": ""}}
{"id": "IeKC9khX5jD", "cdate": 1686324857100, "mdate": null, "content": {"title": "Affordance-Driven Next-Best-View Planning for Robotic Grasping", "abstract": "Grasping occluded objects in cluttered environments is an essential component in complex robotic manipulation tasks. In this paper, we introduce an AffordanCE-driven Next-Best-View planning policy (ACE-NBV) that tries to find a feasible grasp for target object via continuously observing scenes from new viewpoints. This policy is motivated by the observation that the grasp affordances of an occluded object can be better-measured under the view when the view-direction are the same as the grasp view. Specifically, our method leverages the paradigm of novel view imagery to predict the grasps affordances under previously unobserved view, and select next observation view based on the highest imagined grasp quality of the target object. The experimental results in simulation and on a real robot demonstrate the effectiveness of the proposed affordance-driven next-best-view planning policy. Project page: https://sszxc.net/ace-nbv/."}}
{"id": "CVGKC-fJBNE", "cdate": 1685577600000, "mdate": 1683950903023, "content": {"title": "Sparse and Flexible Projections for Unsupervised Feature Selection", "abstract": "In recent decades, unsupervised feature selection methods have become increasingly popular. Nevertheless, most of the existing unsupervised feature selection methods suffer from two major problems that lead to suboptimal solutions. Many methods impose a hard linear projection constraint on original data, which is overly strict in nature and not suitable for dealing with data sampled from nonlinear manifolds. Second, most existing methods use <inline-formula><tex-math notation=\"LaTeX\">$\\ell _{2,p}$</tex-math></inline-formula> -norm ( <inline-formula><tex-math notation=\"LaTeX\">$0&lt; p\\leq 1$</tex-math></inline-formula> ) regularization on projection matrix to obtain row sparse matrix and then calculate scores of each feature, which would introduce extra parameter with a slight possibility to directly obtain indexes of discriminative features. To solve the above problems, we propose two novel unsupervised feature selection methods called SF <inline-formula><tex-math notation=\"LaTeX\">$^{2}$</tex-math></inline-formula> S and SF <inline-formula><tex-math notation=\"LaTeX\">$^{2}$</tex-math></inline-formula> SOG, which can simultaneously learn optimal flexible projections and obtain an orthogonal sparse projection to directly select discriminative features by applying <inline-formula><tex-math notation=\"LaTeX\">$\\ell _{2,0}$</tex-math></inline-formula> -norm constraint. Moreover, we propose to explore the local structure of flexible embedding through preserving the manifold structure of original data and adaptively constructing an optimal graph in subspace. Third, the novel iterative optimization algorithms are presented to solve objective functions guaranteeing convergence theoretically. Various evaluation experiments on synthetic and real-world datasets demonstrate the effectiveness and superiority of our proposed methods."}}
{"id": "mqI1JZ9Hgm", "cdate": 1682899200000, "mdate": 1683950903687, "content": {"title": "Multilayer Network Community Detection: A Novel Multi-Objective Evolutionary Algorithm Based on Consensus Prior Information [Feature]", "abstract": "In recent years, multilayer networks have served as effective models for addressing and analyzing real-world systems with multiple relationships. Among these scenarios, the community detection (CD) problem is one of the most prominent research hotspots. Although some research on multilayer network CD (MCD) has been proposed to address this problem, most studies focus only on topological structures. Therefore, their algorithms cannot extract the most out of complementary network information, such as node similarities and low-rank features, which may lead to unsatisfactory accuracy. To tackle this problem, this paper proposes a novel multi-objective evolutionary algorithm based on consensus prior information (MOEA-CPI). The proposed algorithm takes full advantage of prior information to guide the MOEA with respect to topological structures, initializations, and the optimization process. More specifically, this paper first extracts two kinds of prior information, i.e., graph-level and node-level information, based on Node2vec and Jaccard similarity, respectively. Then, the prior layer and a high-quality initial population are constructed on the basis of the graph-level information. During the optimization process, the genetic operator, which integrates the weighting strategy and node-level information, is applied to guide the algorithm to distribute similar nodes into the same community. Extensive experiments are implemented to prove the superior performance of MOEA-CPI over the state-of-the-art methods."}}
{"id": "mofo3IsQGY", "cdate": 1682899200000, "mdate": 1683950902945, "content": {"title": "Fast Unsupervised Feature Selection With Bipartite Graph and $\\ell _{2,0}$ℓ2,0-Norm Constraint", "abstract": "Since obtaining data labels is a time-consuming and laborious task, unsupervised feature selection has become a popular feature selection technique. However, the current unsupervised feature selection methods are facing three challenges: (1) they rely on a fixed similarity matrix derived from the original data, which will affect their performance; (2) due to the limitation of sparsity, they can only obtain sub-optimal solutions; (3) they have high computational complexity and cannot handle large-scale data. To solve this dilemma, we propose a fast unsupervised feature selection algorithm with bipartite graph and  <inline-formula><tex-math notation=\"LaTeX\">$\\ell _{2,0}$</tex-math></inline-formula> -norm constraint (BGCFS). We use the original data and the selected anchors to construct an adaptive bipartite graph in the subspace, and apply the  <inline-formula><tex-math notation=\"LaTeX\">$\\ell _{2,0}$</tex-math></inline-formula> -norm constraint to the projection matrix for feature selection. In this way, we can update the adaptive bipartite graph and the projection matrix simultaneously, and we can get the feature subset directly, without sorting the features. In addition, we propose an iterative algorithm that can solve the proposed problem globally to obtain a closed-form solution, and we provide a strict proof of convergence for it. Experiments on eight real data sets with different scales show that our method can select more valuable feature subsets more quickly."}}
{"id": "XW04XlAhoNG", "cdate": 1682899200000, "mdate": 1683950902893, "content": {"title": "Semi-Supervised Learning via Bipartite Graph Construction With Adaptive Neighbors", "abstract": "Graph-based semi-supervised learning, which further utilizes graph structure behind samples for boosting semi-supervised learning, gains convincing results in several machine learning tasks. Nevertheless, existing graph-based methods have shortcomings from two aspects. On the one hand, many of them concentrate on improving label propagation over the constructed graph through time-saving methods, e.g., path searching, without giving insights on constructing a proper graph accommodated to samples. On the other hand, some models are only devoted to constructing the appropriate graph resulting in a two-stage procedure, which may incur a suboptimal scenario. In this paper, we develop a joint learning method that considers both bipartite graph construction and label propagation simultaneously. With this configuration, the constructed graph is constantly adjusted by the smoothness term in the objective as the algorithm proceeds. The time complexity of our method gets significant improvement compared with traditional graph-based methods, and the experimental results on one synthetic dataset and several real-world benchmarks demonstrate the effectiveness and scalability of our proposed method."}}
{"id": "5PHiVNbO1G", "cdate": 1682899200000, "mdate": 1683889681556, "content": {"title": "Parameterized Hamiltonian Learning With Quantum Circuit", "abstract": "Hamiltonian learning, as an important quantum machine learning technique, provides a significant approach for determining an accurate quantum system. This paper establishes parameterized Hamiltonian learning (PHL) and explores its application and implementation on quantum computers. A parameterized quantum circuit for Hamiltonian learning is first created by decomposing unitary operators to excite the system evolution. Then, a PHL algorithm is developed to prepare a specific Hamiltonian system by iteratively updating the gradient of the loss function about circuit parameters. Finally, the experiments are conducted on Origin Pilot, and it demonstrates that the PHL algorithm can deal with the image segmentation problem and provide a segmentation solution accurately. Compared with the classical Grabcut algorithm, the PHL algorithm eliminates the requirement of early manual intervention. It provides a new possibility for solving practical application problems with quantum devices, which also assists in solving increasingly complicated problems and supports a much wider range of application possibilities in the future."}}
