{"id": "k-M1G_lllf8", "cdate": 1681837111652, "mdate": 1681837111652, "content": {"title": "STM-GAIL: Spatial-Temporal Meta-GAIL for Learning Diverse Human Driving Strategies", "abstract": "With  large  amounts  of  human-generated  spatial-temporalurban  data  (e.g.,  GPS  trajectories  of  vehicles,  passengers’trip data on buses and trains,etc.), human urban strategyanalysis has become an important problem in many urbanscenarios.   This  problem  is  hard  to  solve  due  to  two  ma-jor  challenges:   (1)  data  scarcity  (i.e.,  each  human  agentcan only provide limited observations) and (2) data hetero-geneity (i.e., having mixed observations from many differenthuman  agents).   Most  of  the  existing  works  on  this  prob-lem usually require a large amount of historical observationsaiming to correctly infer a human agent’s urban strategy andthus  fail  to  properly  address  both  challenges  at  the  sametime.   To  solve  the  human  urban  strategy  analysis  prob-lem in case of data scarcity and data heterogeneity, we de-sign a novel learning paradigm — Spatial-Temporal Meta-GAIL(STM-GAIL), which can successfully learn diverse hu-man urban strategies from heterogeneous human-generatedspatial-temporal  urban  data.   STM-GAIL  models  the  hu-man  decision  processes  as  variable  length  Markov  decisionprocesses (VLMDPs) and incorporates the surrounding spa-tial feature patterns (e.g., traffic volume patterns,etc.)  intostates to better capture the spatial-temporal dependencies ofhuman decisions.  Besides, STM-GAIL learns diverse humanurban  strategies  from  the  meta-learning  perspective,  andcan  distinguish  various  human  urban  strategies  by  addingan  inference  network  on  top  of  the  standard  GAIL.  STM-GAIL can be quickly adapted to a new human expert’s ur-ban strategy with a single trajectory.  Extensive experimentson real-world human-generated spatial-temporal dataset areperformed."}}
{"id": "nyBJcnhjAoy", "cdate": 1652737485685, "mdate": null, "content": {"title": "ProtoX: Explaining a Reinforcement Learning Agent via Prototyping", "abstract": "While deep reinforcement learning has proven to be successful in solving control tasks, the ``black-box'' nature of an agent has received increasing concerns. We propose a prototype-based post-hoc \\emph{policy explainer}, ProtoX, that explains a black-box agent by prototyping the agent's behaviors into scenarios, each represented by a prototypical state. When learning prototypes, ProtoX considers both visual similarity and scenario similarity. The latter is unique to the reinforcement learning context since it explains why the same action is taken in visually different states. To teach ProtoX about visual similarity, we pre-train an encoder using contrastive learning via self-supervised learning to recognize states as similar if they occur close together in time and receive the same action from the black-box agent. We then add an isometry layer to allow ProtoX to adapt scenario similarity to the downstream task. ProtoX is trained via imitation learning using behavior cloning, and thus requires no access to the environment or agent. In addition to explanation fidelity, we  design different prototype shaping terms in the objective function to encourage better interpretability. We conduct various experiments to test ProtoX. Results show that ProtoX achieved high fidelity to the original black-box agent while providing meaningful and understandable explanations."}}
{"id": "Dq0ML3d9Z7i", "cdate": 1631070122989, "mdate": 1631070122989, "content": {"title": "Curb-GAN: Conditional Urban Traffic Estimation through Spatio-Temporal Generative Adversarial Networks", "abstract": "Given an urban development plan and the historical traffic observations over the road network, the Conditional Urban Traffic Estimation problem aims to estimate the resulting traffic status prior to the deployment of the plan. This problem is of great importance to urban development and transportation management, yet is very challenging because the plan would change the local travel demands drastically and the new travel demand pattern might be unprecedented in the historical data. To tackle these challenges, we propose a novel Conditional Urban Traffic Generative Adversarial Network (Curb-GAN), which provides traffic estimations in consecutive time slots based on different (unprecedented) travel demands, thus enables urban planners to accurately evaluate urban plans before deploying them. The proposed Curb-GAN adopts and advances the conditional GAN structure through a few novel ideas: (1) dealing with various travel demands as the “conditions” and generating corresponding traffic estimations, (2) integrating dynamic convolutional layers to capture the local spatial auto-correlations along the underlying road networks, (3) employing self-attention mechanism to capture the temporal dependencies of the traffic across different time slots. Extensive experiments on two real-world spatio-temporal datasets demonstrate that our Curb-GAN outperforms major baseline methods in estimation accuracy under various conditions and can produce more meaningful estimations."}}
{"id": "56bCy9Ms_Y", "cdate": 1631069875937, "mdate": 1631069875937, "content": {"title": "Dissecting the Learning Curve of Taxi Drivers: A Data-Driven Approach", "abstract": "Many real world human behaviors can be modeled and characterized as sequential decision making processes, such as taxi driver’s choices of working regions and times. Each driver possesses unique preferences on the sequential choices over time and improves their working efficiency. Understanding the dynamics of such preferences helps accelerate the learning process of taxi drivers. Prior works on taxi operation management mostly focus on finding optimal driving strategies or routes, lacking in-depth analysis on what the drivers learned during the process and how they affect the performance of the driver. In this work, we make the first attempt to inversely learn the taxi drivers’ preferences from data and characterize the dynamics of such preferences over time. We extract two types of features, i.e., profile features and habit features, to model the decision space of drivers. Then through inverse reinforcement learning we learn the preferences of drivers with respect to these features. The results illustrate that self-improving drivers tend to keep adjusting their preferences to habit features to increase their earning efficiency, while keeping the preferences to profile features invariant. On the other hand, experienced drivers have stable preferences over time."}}
{"id": "Boiblmfe_6S", "cdate": 1546300800000, "mdate": null, "content": {"title": "Predicting Urban Dispersal Events: A Two-Stage Framework through Deep Survival Analysis on Mobility Data.", "abstract": "Urban dispersal events are processes where an unusually large number of people leave the same area in a short period. Early prediction of dispersal events is important in mitigating congestion and safety risks and making better dispatching decisions for taxi and ride-sharing fleets. Existing work mostly focuses on predicting taxi demand in the near future by learning patterns from historical data. However, they fail in case of abnormality because dispersal events with abnormally high demand are non-repetitive and violate common assumptions such as smoothness in demand change over time. Instead, in this paper we argue that dispersal events follow a complex pattern of trips and other related features in the past, which can be used to predict such events. Therefore, we formulate the dispersal event prediction problem as a survival analysis problem. We propose a two-stage framework (DILSA), where a deep learning model combined with survival analysis is developed to predict the probability of a dispersal event and its demand volume. We conduct extensive case studies and experiments on the NYC Yellow taxi dataset from 20142016. Results show that DILSA can predict events in the next 5 hours with F1-score of 0:7 and with average time error of 18 minutes. It is orders of magnitude better than the state-of-the-art deep learning approaches for taxi demand prediction."}}
{"id": "SJZzM4ZdZH", "cdate": 1514764800000, "mdate": null, "content": {"title": "Hetero-ConvLSTM: A Deep Learning Approach to Traffic Accident Prediction on Heterogeneous Spatio-Temporal Data", "abstract": "Predicting traffic accidents is a crucial problem to improving transportation and public safety as well as safe routing. The problem is also challenging due to the rareness of accidents in space and time and spatial heterogeneity of the environment (e.g., urban vs. rural). Most previous research on traffic accident prediction conducted by domain researchers simply applied classical prediction models on limited data without addressing the above challenges properly, thus leading to unsatisfactory performance. A small number of recent works have attempted to use deep learning for traffic accident prediction. However, they either ignore time information or use only data from a small and homogeneous study area (a city), without handling spatial heterogeneity and temporal auto-correlation properly at the same time. In this paper we perform a comprehensive study on the traffic accident prediction problem using the Convolutional Long Short-Term Memory (ConvLSTM) neural network model. A number of detailed features such as weather, environment, road condition, and traffic volume are extracted from big datasets over the state of Iowa across 8 years. To address the spatial heterogeneity challenge in the data, we propose a Hetero-ConvLSTM framework, where a few novel ideas are implemented on top of the basic ConvLSTM model, such as incorporating spatial graph features and spatial model ensemble. Extensive experiments on the 8-year data over the entire state of Iowa show that the proposed framework makes reasonably accurate predictions and significantly improves the prediction accuracy over baseline approaches."}}
{"id": "B14lUwWdbr", "cdate": 1514764800000, "mdate": null, "content": {"title": "Faster Online Learning of Optimal Threshold for Consistent F-measure Optimization", "abstract": "In this paper, we consider online F-measure optimization (OFO). Unlike traditional performance metrics (e.g., classification error rate), F-measure is non-decomposable over training examples and is a non-convex function of model parameters, making it much more difficult to be optimized in an online fashion. Most existing results of OFO usually suffer from high memory/computational costs and/or lack statistical consistency guarantee for optimizing F-measure at the population level. To advance OFO, we propose an efficient online algorithm based on simultaneously learning a posterior probability of class and learning an optimal threshold by minimizing a stochastic strongly convex function with unknown strong convexity parameter. A key component of the proposed method is a novel stochastic algorithm with low memory and computational costs, which can enjoy a convergence rate of $\\widetilde O(1/\\sqrt{n})$ for learning the optimal threshold under a mild condition on the convergence of the posterior probability, where $n$ is the number of processed examples. It is provably faster than its predecessor based on a heuristic for updating the threshold. The experiments verify the efficiency of the proposed algorithm in comparison with state-of-the-art OFO algorithms."}}
