{"id": "bb205lXo9Dk", "cdate": 1701913646292, "mdate": 1701913646292, "content": {"title": "Realistic Image-to-Image Translation with Enhanced Texture", "abstract": "In the image-to-image translation field, most researchers tend to achieve the overall translation of images without paying too much attention to the texture details of images. However, it is also of great importance to have enhanced and more realistic textures for synthesized images, which could bring better impressions. Therefore, in this work, we propose a method based on CycleGAN and the texture of output images is highly improved. The presented generator involves dilated convolutions which are conducive to processing image texture details. Furthermore, an improved cycle consistency loss is proposed for stable and effective training. The experiments demonstrate that our proposed method is able to generate images that contain more details and better meet the visual perception of humans. Our code will be publicly available at GitHub soon."}}
{"id": "aSJI5j4SzbY", "cdate": 1701913515801, "mdate": 1701913515801, "content": {"title": "Enhancing Feature Fusion Using Attention for Small Object Detection", "abstract": "At present, object detection performance can meet some routine tasks' requirements. However, the detection performance for small-sized objects is far from satisfactory. Therefore, we propose the feature layer attention module and nonlinear positioning loss penalty based on size to improve small object detection performance. Our work proposes the feature layer attention module, which introduces an attention mechanism in the feature layer to enhance the model's attention to small objects. Through the feature fusion scheme proposed in this paper, we solve the problem of insufficient features of small objects to a certain extent and reduce the difficulty of model training. Besides, we introduce a size-based nonlinear penalty in the loss function, which can enhance the penalty for small object positioning errors. The effectiveness of our method has been demonstrated on small object data sets. On VisDrone2019 dataset, the proposed method improves the detection's AP by 2.2%. On TT100k dataset, the proposed method improves the detection's AP by 1.0%."}}
{"id": "EqwdAtB0oE", "cdate": 1701913287756, "mdate": 1701913287756, "content": {"title": "Lightweight semantic image synthesis with mutable framework", "abstract": "Image synthesis is a critical task in various computer vision technologies, and lots of methods tried to translate semantic images into realistic ones for controllable synthesis. With the increasing image resolution, networks are becoming larger, and applications of related methods are restricted. To alleviate the problem, we propose a lightweight mutable network for semantic image synthesis. The network is based on generative adversarial networks. We introduce the feature pyramid architecture to the generator and reduce the hidden node numbers. We also design a mutable scheme where the pyramid will involve fewer layers for smaller images. To improve the performance of the lightweight generator, we further propose a weighted discriminator and a refined loss. The experiments on several public datasets show that our method is effective and achieves competitive performance, proving that a small network can also achieve high-quality semantic image synthesis."}}
{"id": "XKBZhrTj0_", "cdate": 1701913236069, "mdate": 1701913236069, "content": {"title": "Distribution constraining for combating mode collapse in generative adversarial networks", "abstract": "Image synthesis is a critical technique in the image processing field. Recently, generative adversarial networks (GANs) have played a significant role in synthesis tasks. However, the issue of mode collapse remains a major challenge in GANs, which limits their potential applications. We propose a method to address the mode collapse problem. Our approach focuses on minimizing the divergence between the distributions of real and generated features, thereby reducing the learning pressure on the discriminator. An advantage of our method is that it does not require prior knowledge or manual design. Additionally, it can be easily incorporated into state-of-the-art frameworks across various domains. Experimental results demonstrate the effectiveness and competitive performance of our proposed method."}}
{"id": "I7t4u-ZRjru", "cdate": 1701913030939, "mdate": 1701913030939, "content": {"title": "Distribution Fitting for Combating Mode Collapse in Generative Adversarial Networks", "abstract": "Mode collapse is a significant unsolved issue of generative adversarial networks (GANs). In this work, we examine the causes of mode collapse from a novel perspective. Due to the nonuniform sampling in the training process, some subdistributions may be missed when sampling data. As a result, even when the generated distribution differs from the real one, the GAN objective can still achieve the minimum. To address the issue, we propose a global distribution fitting (GDF) method with a penalty term to confine the generated data distribution. When the generated distribution differs from the real one, GDF will make the objective harder to reach the minimal value, while the original global minimum is not changed. To deal with the circumstance when the overall real data is unreachable, we also propose a local distribution fitting (LDF) method. Experiments on several benchmarks demonstrate the effectiveness and competitive performance of GDF and LDF."}}
{"id": "c0ug5M6-F8R", "cdate": 1672531200000, "mdate": 1681711981899, "content": {"title": "AccNet: occluded scene text enhancing network with accretion blocks", "abstract": "Scene text with occlusions is common in the real world, and occluded text recognition is important for many machine vision applications. However, corresponding techniques are not well explored as public datasets cannot represent the situation well, and methods designed for occluded text are still scarce. In this work, we discuss different kinds of occlusions and propose an occluded scene text enhancing network to improve recognition performance. The network is based on generative adversarial networks, and we design accretion blocks to help the network generate the occluded image regions. The model is independent of the recognition networks, so it can be readily used in different frameworks and can be easily trained without the annotations of text content. We also refine the training objective to improve the framework. Experiments on several public benchmarks demonstrate that the proposed method effectively enhances occluded text images, improving recognition accuracy by over 10% on several state-of-the-art frameworks. Meanwhile, the network has no severe impact on the text images without occlusions."}}
{"id": "l2cZs7iKsEq", "cdate": 1640995200000, "mdate": 1681711982276, "content": {"title": "Distribution Fitting for Combating Mode Collapse in GANs", "abstract": "Mode collapse is still a major unsolved problem in generative adversarial networks. In this work, we analyze the causes of mode collapse from a new perspective. Due to the nonuniform sampling in the training process, some sub-distributions can be missed while sampling data. Therefore, the GAN objective can reach the minimum when the generated distribution is not the same as the real one. To alleviate the problem, we propose a global distribution fitting (GDF) method by a penalty term to constrain generated data distribution. On the basis of not changing the global minimum of the GAN objective, GDF will make it harder to reach the minimum value when the generated distribution is not the same as the real one. Furthermore, we also propose a local distribution fitting (LDF) method to cope with the situation that the real distribution is unknown. Experiments on several benchmarks demonstrate the effectiveness and competitive performance of GDF and LDF."}}
{"id": "4bGs7PnKD1X", "cdate": 1640995200000, "mdate": 1681711981898, "content": {"title": "Unified Chinese License Plate detection and recognition with high efficiency", "abstract": ""}}
{"id": "wkt0SVom_w-", "cdate": 1609459200000, "mdate": 1681711982594, "content": {"title": "Unsupervised domain adaptation via coarse-to-fine feature alignment method using contrastive learning", "abstract": "Previous feature alignment methods in Unsupervised domain adaptation(UDA) mostly only align global features without considering the mismatch between class-wise features. In this work, we propose a new coarse-to-fine feature alignment method using contrastive learning called CFContra. It draws class-wise features closer than coarse feature alignment or class-wise feature alignment only, therefore improves the model's performance to a great extent. We build it upon one of the most effective methods of UDA called entropy minimization to further improve performance. In particular, to prevent excessive memory occupation when applying contrastive loss in semantic segmentation, we devise a new way to build and update the memory bank. In this way, we make the algorithm more efficient and viable with limited memory. Extensive experiments show the effectiveness of our method and model trained on the GTA5 to Cityscapes dataset has boost mIOU by 3.5 compared to the MinEnt algorithm. Our code will be publicly available."}}
{"id": "oX5Ed5XRpc", "cdate": 1609459200000, "mdate": 1681711982278, "content": {"title": "Unattached irregular scene text rectification with refined objective", "abstract": ""}}
