{"id": "zhVdmq_NoEY", "cdate": 1668219034235, "mdate": null, "content": {"title": "PB-GCN: Progressive binary graph convolutional networks for skeleton-based action recognition", "abstract": "Skeleton-based action recognition is an essential yet challenging visual task, whose accuracy has been remarkably improved due to the successful application of graph convolutional networks (GCNs). However, high computation cost and memory usage hinder their deployment on resource-constrained environment. To deal with the issue, in this paper, we introduce two novel progressive binary graph convolutional network for skeleton-based action recognition PB-GCN and PB-GCN, which can obtain significant speed-up and memory saving. In PB-GCN, the filters are binarized, and in PB-GCN, both filters and activations are binary. Specifically, we propose a progressive optimization, i.e., employing ternary models as the initialization of binary GCNs (BGCN) to improve the representational capability of binary models. Moreover, the center loss is exploited to improve the training procedure for better performance. Experimental results on two public benchmarks (i.e., Skeleton-Kinetics and NTU RGB + D) demonstrate that the accuracy of the proposed PB-GCN and PB-GCN are comparable to their full-precision counterparts and outperforms the state-of-the-art methods, such as BWN, XNOR-Net, and Bi-Real Net."}}
{"id": "kb_v0sVg71", "cdate": 1668218247944, "mdate": null, "content": {"title": "PIMNet: Physics-Infused Neural Network for Human Motion Prediction", "abstract": "Human motion prediction (HMP) predicts future human pose sequences given the past ones. HMP has recently attracted attention in computer vision and the robotics domain as it helps machines understand human behavior, plan target actions and optimize interaction strategies. Existing methods for HMP are based on either purely physics-based models or statistical models. However, each of these methods has its shortcomings. The physics-based techniques are complex and error-prone, while the statistical methods require a large amount of data and lack physical consistency. To overcome their limitations, we propose a physics-infused neural network (\\textbf{PIMNet}), which combines both physics-based and statistical methods. We first computed the contact forces and joint torques for each pose using the physics-based human dynamical model. Then they are fed into an Encoder-Decoder machine learning architecture to predict future ones. In this way, PIMNet simultaneously obtains computational efficiency and physical consistency. Extensive experimental results on Human 3.6M show that the proposed PIMNet could accurately predict human motion in both short-term and long-term scope. It achieves better or comparable prediction accuracy than the state-of-the-art, even using a basic LSTM as the machine learning model."}}
{"id": "CniFDGvqbUZ", "cdate": 1663849942414, "mdate": null, "content": {"title": "Make Memory Buffer Stronger in Continual Learning: A Continuous Neural Transformation Approach", "abstract": "Continual learning (CL) focuses on learning non-stationary data distribution without forgetting previous knowledge. However, the most widely used memory-replay approach often suffers from memory overfitting. To mitigate the memory overfitting, we propose a continuous and reversible memory transformation method so that the memory data is hard to overfit, thus improving generalization. The transformation is achieved by optimizing a bi-level optimization objective that jointly learns the CL model and memory transformer. Specifically, we propose a deterministic continuous memory transformer (DCMT) modeled by an ordinary differential equation, allowing for infinite memory transformation and generating diverse and hard memory data. Furthermore, we inject uncertainty into the transformation function and propose a stochastic continuous memory transformer (SCMT) modeled by a stochastic differential equation, which substantially enhances the diversity of the transformed memory buffer. The proposed neural transformation approaches have significant advantages over existing ones: (1) we can obtain infinite many transformed data, thus significantly increasing the memory buffer diversity; (2) the proposed continuous transformations are reversible, i.e., the original raw memory data could be restored from the transformed memory data without the need to make a replica of the memory data. Extensive experiments on both task-aware and task-free CL show significant improvement with our approach compared to strong baselines.  "}}
{"id": "taVJ9PhTGa", "cdate": 1640995200000, "mdate": 1682017400266, "content": {"title": "PIMNet: Physics-Infused Neural Network for Human Motion Prediction", "abstract": "Human motion prediction (HMP) predicts future human pose sequences given the past ones. HMP has recently attracted attention in computer vision and the robotics domain as it helps machines understand human behavior, plan target actions and optimize interaction strategies. Existing methods for HMP are based on either purely physics-based models or statistical models. However, each of these methods has its shortcomings. The physics-based techniques are complex and error-prone, while the statistical methods require a large amount of data and lack physical consistency. To overcome their limitations, we propose a physics-infused neural network ( <bold xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">PIMNet</b> ), which combines both physics-based and statistical methods. We first computed the contact forces and joint torques for each pose using the physics-based human dynamical model. Then they are fed into an Encoder-Decoder machine learning architecture to predict future ones. In this way, PIMNet simultaneously obtains computational efficiency and physical consistency. Extensive experimental results on Human 3.6M show that the proposed PIMNet could accurately predict human motion in both short-term and long-term scope. It achieves better or comparable prediction accuracy than the state-of-the-art, even using a basic LSTM as the machine learning model."}}
{"id": "Iibxb8HQen", "cdate": 1640995200000, "mdate": 1682017400264, "content": {"title": "PB-GCN: Progressive binary graph convolutional networks for skeleton-based action recognition", "abstract": ""}}
{"id": "37X5RCNi8L", "cdate": 1632172978087, "mdate": 1632172978087, "content": {"title": "In-field automatic observation of wheat heading stage using computer vision", "abstract": "Growth stage information is an important factor for precision agriculture. It provides accurate evidence for agricultural management as well as early evaluation of yield. However, the observation of critical growth stages mainly relies on manual labour at present. This has some limitations because it is time-consuming, discontinuous and non-objective. Computer vision technology can help to alleviate these difficulties when monitoring growth status. This paper describes a novel automatic observation system for wheat heading stage based on computer vision. Images compliant with statistical requirements are taken in natural conditions where illumination changes frequently. Wheat plants with low spatial resolution overlap substantially, which increases observational difficulties. To adapt to the complex environment, a two-step coarse-to-fine wheat ear detection mechanism is proposed. In the coarse-detection step, machine learning technology is used to emphasise the candidate ear regions. In the fine-detection step, non-ear areas are eliminated through higher-level features. For that purpose, scale-invariant feature transform (SIFT) is densely extracted as the low-level visual descriptor, then Fisher vector (FV) encoding is employed to generate the mid-level representation. Based on three consecutive year's data of seven image sequences, a series of experiments are conducted to demonstrate the effectiveness and robustness of our proposition. Experimental results show that the proposed method significantly outperforms other existing methods with an average value of absolute error of 1.14 days on the test dataset. The results indicate that automatic observation is quite acceptable compared to manual observations."}}
{"id": "v7ew4Ogninz", "cdate": 1609459200000, "mdate": 1696001727786, "content": {"title": "A review of deep learning used in the hyperspectral image analysis for agriculture", "abstract": "Hyperspectral imaging is a non-destructive, nonpolluting, and fast technology, which can capture up to several hundred images of different wavelengths and offer relevant spectral signatures. Hyperspectral imaging technology has achieved breakthroughs in the acquisition of agricultural information and the detection of external or internal quality attributes of the agricultural product. Deep learning techniques have boosted the performance of hyperspectral image analysis. Compared with traditional machine learning, deep learning architectures exploit both spatial and spectral information of hyperspectral image analysis. To scrutinize thoroughly the current efforts, provide insights, and identify potential research directions on deep learning for hyperspectral image analysis in agriculture, this paper presents a systematic and comprehensive review. Firstly, its applications in agriculture are summarized, include ripeness and component prediction, different classification themes, and plant disease detection. Then, the recent achievements are reviewed in hyperspectral image analysis from the aspects of the deep learning models and the feature networks. Finally, the existing challenges of hyperspectral image analysis based on deep learning are summarized and the prospects of future works are put forward."}}
{"id": "i_s6yOsH2KC", "cdate": 1609459200000, "mdate": 1632174137649, "content": {"title": "SonicASL: An Acoustic-based Sign Language Gesture Recognizer Using Earphones", "abstract": "We propose SonicASL, a real-time gesture recognition system that can recognize sign language gestures on the fly, leveraging front-facing microphones and speakers added to commodity earphones worn by someone facing the person making the gestures. In a user study (N=8), we evaluate the recognition performance of various sign language gestures at both the word and sentence levels. Given 42 frequently used individual words and 30 meaningful sentences, SonicASL can achieve an accuracy of 93.8% and 90.6% for word-level and sentence-level recognition, respectively. The proposed system is tested in two real-world scenarios: indoor (apartment, office, and corridor) and outdoor (sidewalk) environments with pedestrians walking nearby. The results show that our system can provide users with an effective gesture recognition tool with high reliability against environmental factors such as ambient noises and nearby pedestrians."}}
{"id": "cb4I7YQ-V42", "cdate": 1577836800000, "mdate": 1632172406104, "content": {"title": "CP-NAS: Child-Parent Neural Architecture Search for 1-bit CNNs", "abstract": "Neural architecture search (NAS) proves to be among the best approaches for many tasks by generating an application-adaptive neural architectures, which are still challenged by high computational cost and memory consumption. At the same time, 1-bit convolutional neural networks (CNNs) with binarized weights and activations show their potential for resource-limited embedded devices. One natural approach is to use 1-bit CNNs to reduce the computation and memory cost of NAS by taking advantage of the strengths of each in a uniﬁed framework. To this end, a Child-Parent model is introduced to a differentiable NAS to search the binarized architecture(Child) under the supervision of a full-precision model (Parent). In the search stage, the Child-Parent model uses an indicator generated by the parent and child model accuracy to evaluate the performance and abandon operations with less potential. In the training stage, a kernel level CP loss is introduced to optimize the binarized network. Extensive experiments demonstrate that the proposed CP-NAS achieves a comparable accuracy with traditional NAS on both the CIFAR and ImageNet databases. It achieves an accuracy of 95.27% on CIFAR-10, 64.3% on ImageNet with binarized weights and activations, and a 30% faster search than prior arts."}}
{"id": "YY6mUwnLpNw", "cdate": 1577836800000, "mdate": 1632172406235, "content": {"title": "CP-NAS: Child-Parent Neural Architecture Search for Binary Neural Networks", "abstract": "Neural architecture search (NAS) proves to be among the best approaches for many tasks by generating an application-adaptive neural architecture, which is still challenged by high computational cost and memory consumption. At the same time, 1-bit convolutional neural networks (CNNs) with binarized weights and activations show their potential for resource-limited embedded devices. One natural approach is to use 1-bit CNNs to reduce the computation and memory cost of NAS by taking advantage of the strengths of each in a unified framework. To this end, a Child-Parent (CP) model is introduced to a differentiable NAS to search the binarized architecture (Child) under the supervision of a full-precision model (Parent). In the search stage, the Child-Parent model uses an indicator generated by the child and parent model accuracy to evaluate the performance and abandon operations with less potential. In the training stage, a kernel-level CP loss is introduced to optimize the binarized network. Extensive experiments demonstrate that the proposed CP-NAS achieves a comparable accuracy with traditional NAS on both the CIFAR and ImageNet databases. It achieves the accuracy of $95.27\\%$ on CIFAR-10, $64.3\\%$ on ImageNet with binarized weights and activations, and a $30\\%$ faster search than prior arts."}}
