{"id": "_P-JAPKp8K", "cdate": 1667338634075, "mdate": 1667338634075, "content": {"title": "Vision-Based Real-Time Aerial Object Localization and Tracking for UAV Sensing System", "abstract": "This paper focuses on the problem of vision-based obstacle detection and tracking for\nunmanned aerial vehicle navigation. A real-time object localization and tracking strategy from monocular\nimage sequences is developed by effectively integrating the object detection and tracking into a dynamic\nKalman model. At the detection stage, the object of interest is automatically detected and localized from\na saliency map computed via the image background connectivity cue at each frame; at the tracking stage,\na Kalman filter is employed to provide a coarse prediction of the object state, which is further refined via a\nlocal detector incorporating the saliency map and the temporal information between two consecutive frames.\nCompared with existing methods, the proposed approach does not require any manual initialization for\ntracking, runs much faster than the state-of-the-art trackers of its kind, and achieves competitive tracking\nperformance on a large number of image sequences. Extensive experiments demonstrate the effectiveness\nand superior performance of the proposed approach."}}
{"id": "i0ZR5SdG8QZ", "cdate": 1577836800000, "mdate": 1632457012971, "content": {"title": "Learning a Gradient Guidance for Spatially Isotropic MRI Super-Resolution Reconstruction", "abstract": "In MRI practice, it is inevitable to appropriately balance between image resolution, signal-to-noise ratio (SNR), and scan time. It has been shown that super-resolution reconstruction (SRR) is effective to achieve such a balance, and has obtained better results than direct high-resolution (HR) acquisition, for certain contrasts and sequences. The focus of this work was on constructing images with spatial resolution higher than can be practically obtained by direct Fourier encoding. A novel learning approach was developed, which was able to provide an estimate of the spatial gradient prior from the low-resolution (LR) inputs for the HR reconstruction. By incorporating the anisotropic acquisition schemes, the learning model was trained over the LR images themselves only. The learned gradients were integrated as prior knowledge into a gradient-guided SRR model. A closed-form solution to the SRR model was developed to obtain the HR reconstruction. Our approach was assessed on the simulated data as well as the data acquired on a Siemens 3T MRI scanner containing 45 MRI scans from 15 subjects. The experimental results demonstrated that our approach led to superior SRR over state-of-the-art methods, and obtained better images at lower or the same cost in scan time than direct HR acquisition."}}
{"id": "SE-onFkwRjC", "cdate": 1577836800000, "mdate": 1632457012969, "content": {"title": "SLIMM: Slice localization integrated MRI monitoring", "abstract": "Highlights • The first real-time self-navigated slice-by-slice MRI motion monitoring system was developed and established, which is named Slice Localization Integrated MRI Monitoring (SLIMM). • A real-time slice-to-volume registration algorithm was developed for slicewise motion measurements. • Real-time feedback to the subject and operator can facilitate motion reduction. • An auto-calibration method was developed for acquiring a motion-free reference volume for the self-navigation. • It was demonstrated that our approach (SLIMM) improved the image quality and reduced scan times and associated costs, as compared to current motion monitoring methods. Abstract Functional MRI (fMRI) is extremely challenging to perform in subjects who move because subject motion disrupts blood oxygenation level dependent (BOLD) signal measurement. It has become common to use retrospective framewise motion detection and censoring in fMRI studies to eliminate artifacts arising from motion. Data censoring results in significant loss of data and statistical power unless the data acquisition is extended to acquire more data not corrupted by motion. Acquiring more data than is necessary leads to longer than necessary scan duration, which is more expensive and may lead to additional subject non-compliance. Therefore, it is well established that real-time prospective motion monitoring is crucial to ensure data quality and reduce imaging costs. In addition, real-time monitoring of motion allows for feedback to the operator and the subject during the acquisition, to enable intervention to reduce the subject motion. The most widely used form of motion monitoring for fMRI is based on volume-to-volume registration (VVR), which quantifies motion as the misalignment between subsequent volumes. However, motion is not constrained to occur only at the boundaries of volume acquisition, but instead may occur at any time. Consequently, each slice of an fMRI acquisition may be displaced by motion, and assessment of whole volume to volume motion may be insensitive to both intra-volume and inter-volume motion that is revealed by displacement of the slices. We developed the first slice-by-slice self-navigated motion monitoring system for fMRI by developing a real-time slice-to-volume registration (SVR) algorithm. Our real-time SVR algorithm, which is the core of the system, uses a local image patch-based matching criterion along with a Levenberg-Marquardt optimizer, all accelerated via symmetric multi-processing, with interleaved and simultaneous multi-slice acquisition schemes. Extensive experimental results on real motion data demonstrated that our fast motion monitoring system, named Slice Localization Integrated MRI Monitoring (SLIMM), provides more accurate motion measurements than a VVR based approach. Therefore, SLIMM offers improved online motion monitoring which is particularly important in fMRI for challenging patient populations. Real-time motion monitoring is crucial for online data quality control and assurance, for enabling feedback to the subject and the operator to act to mitigate motion, and in adaptive acquisition strategies that aim to ensure enough data of sufficient quality is acquired without acquiring excess data."}}
{"id": "5Iz6BHh9KIz", "cdate": 1577836800000, "mdate": 1632457012971, "content": {"title": "Toward Precise Osteotomies: A Coarse-to-Fine 3D Cut Plane Planning Method for Image-Guided Pelvis Tumor Resection Surgery", "abstract": "Surgical resection is the main clinical method for the treatment of bone tumors. A critical procedure for bone tumor resection is to plan a set of cut planes that enable resecting the bone tumor with a safe margin while preserving the maximum amount of healthy bone. Currently, the surgeons rely on manual methods to plan the cut planes, which highly depend on the surgeons' experiences and have been demonstrated to be error-prone, and in turn, increase the recurrence rate or resect much healthy bone. This study targets on improving the precision of cut plane planning for the image guided pelvis tumor resection surgeries. A semi-automatic approach to cut plane planning was proposed via a coarse-to-fine strategy. It can efficiently identify a dangerous region in the 3D space, which contains the bone tumor and its surrounding normal tissue with a safe margin. By projecting the dangerous region into an appropriate 2D space, a segmented boundary-constrained linear regression method was leveraged to plan a set of 3D cut planes that ensure the minimum area of the resected specimen in the 2D space while having the dangerous region cleared. Further, a coarse-to-fine 3D cut plane planning method was developed by incorporating a 3D cut plane refinement scheme with our 2D planning method. Extensive experiments, on the surgical data from nine previous pelvis tumor resection surgeries, demonstrated that our proposed approach substantially improved the localization precision of cut planes (p <; 0.001) and decreased the amount of resected specimen (p <; 0.05), as compared to the manual method."}}
{"id": "4OFHoocQ1U", "cdate": 1577836800000, "mdate": 1632457012973, "content": {"title": "Joint Correlation Filtering for Visual Tracking", "abstract": "Correlation filtering-based visual tracking has achieved impressive success in terms of both tracking accuracy and computational efficiency. In this paper, a novel correlation filtering approach is proposed by means of joint learning to bridge the gap between the circulant filtering and the classical filtering methods. The circulant structure of tracking and the information from successive frames are simultaneously exploited in the proposed work. A new formulation for the correlation filter learning is proposed to enhance the discrimination of the learned filter by integrating both the kernel and the image feature domains. The proposed approach is computationally efficient since a closed-form solution is derived for the new formulation. Extensive experiments are conducted on two popular tracking benchmarks, and the experimental results demonstrate that the proposed tracker outperforms most of the state-of-the-art trackers."}}
{"id": "n-u5cnOL1pQ", "cdate": 1546300800000, "mdate": 1632457012971, "content": {"title": "Exploiting the Anisotropy of Correlation Filter Learning for Visual Tracking", "abstract": "Correlation filtering based tracking model has received significant attention and achieved great success in terms of both tracking accuracy and computational complexity. However, due to the limitation of the loss function, current correlation filtering paradigm could not reliably respond to the abrupt appearance changes of the target object. This study focuses on improving the robustness of the correlation filter learning. An anisotropy of the filter response is observed and analyzed for the correlation filtering based tracking model, through which the overfitting issue of previous methods is alleviated. Three sparsity related loss functions are proposed to exploit the anisotropy, leading to three implementations of visual trackers, correspondingly resulting in improved overall tracking performance. A large number of experiments are conducted and these experimental results demonstrate that the proposed approach greatly improves the robustness of the learned correlation filter. The proposed trackers performs comparably against state-of-the-art tracking methods on four latest standard tracking benchmark datasets."}}
{"id": "UxU1457y4O", "cdate": 1546300800000, "mdate": 1632457012972, "content": {"title": "Sparse subspace clustering via Low-Rank structure propagation", "abstract": "Highlights • A novel data sample representation is proposed, where a low-rank structure is propagated in the sparse representation. Based on the representation, a self-expression is constructed for subspace clustering. Experimental results on synthesis datasets and several real datasets demonstrate that the proposed subspace clustering algorithm performs comparably against state-of-the-art methods. • A theoretical proof is provided to show the proposed approach can reveal the true membership of the data samples being clustered. • Discussions from both geometric and physical perspectives on the proposed approach are made as an explanation and an algorithm analysis. Abstract The paper formulates the subspace clustering as a problem of structured representation learning. It is proved that the sparsity of the data representation is significantly promoted by propagating a low-rank structure, leading to a more robust description of the clustering structure. Based on a theoretical proof to support this observation, a novel subspace clustering algorithm is proposed with the structured representation. Two cascade self-expressions are leveraged to implement the propagation. One leads to a low-rank representation of the data samples by exploiting the global structure; whereas the other generates a sparse representation of the former low-rank representation to capture the neighborhood structure. The proposed representation strategy is further investigated from both a geometric and a physical perspective. Extensive evaluations on both synthetic and real datasets demonstrate that the proposed approach outperforms most state-of-the-art methods."}}
{"id": "Sjiv8lwgdTB", "cdate": 1546300800000, "mdate": null, "content": {"title": "Exploiting the Anisotropy of Correlation Filter Learning for Visual Tracking.", "abstract": "Correlation filtering based tracking model has received significant attention and achieved great success in terms of both tracking accuracy and computational complexity. However, due to the limitation of the loss function, current correlation filtering paradigm could not reliably respond to the abrupt appearance changes of the target object. This study focuses on improving the robustness of the correlation filter learning. An anisotropy of the filter response is observed and analyzed for the correlation filtering based tracking model, through which the overfitting issue of previous methods is alleviated. Three sparsity related loss functions are proposed to exploit the anisotropy, leading to three implementations of visual trackers, correspondingly resulting in improved overall tracking performance. A large number of experiments are conducted and these experimental results demonstrate that the proposed approach greatly improves the robustness of the learned correlation filter. The proposed trackers performs comparably against state-of-the-art tracking methods on four latest standard tracking benchmark datasets."}}
{"id": "2Rm7klgVufD", "cdate": 1546300800000, "mdate": 1632457012971, "content": {"title": "Isotropic MRI Super-Resolution Reconstruction with Multi-scale Gradient Field Prior", "abstract": "In this work, we proposed a novel image-based MRI super-resolution reconstruction (SRR) approach based on anisotropic acquisition schemes. We achieved superior reconstruction to state-of-the-art work by introducing a new multi-scale gradient field prior that guides the reconstruction of the high-resolution (HR) image. The prior improves both spatial smoothness and edge preservation. The inverse of the forward model of image formation is used to propagate the gradient guidance from the low-resolution (LR) images to the HR image space. The gradient fields over multiple scales were exploited for more accurate edge localization in the reconstruction. The proposed SRR allows inter-volume motion during the MRI scans and can incorporate with the LR images with arbitrary orientations and displacements in the frequency space, such as orthogonal and origin-shifted scans. The proposed approach was evaluated on the synthetic data as well as the data acquired on a Siemens 3T MRI scanner containing 45 MRI scans from 14 subjects. The evaluation results demonstrate that our proposed prior leads to improved SRR as compared to state-of-the-art priors, and that the proposed SRR obtains better results at lower or the same cost in scan time than direct HR acquisition. In particular, the anatomical structures of hippocampus can be clearly shown in our reconstructed images. This is a significant improvement for the in vivo studies of the hippocampus."}}
{"id": "zw17KnnGaxm", "cdate": 1514764800000, "mdate": 1632457012972, "content": {"title": "Exploiting Spatial-Temporal Locality of Tracking via Structured Dictionary Learning", "abstract": "In this paper, a novel spatial-temporal locality is proposed and unified via a discriminative dictionary learning framework for visual tracking. By exploring the strong local correlations between temporally obtained target and their spatially distributed nearby background neighbors, a spatial-temporal locality is obtained. The locality is formulated as a subspace model and exploited under a unified structure of discriminative dictionary learning with a subspace structure. Using the learned dictionary, the target and its background can be described and distinguished effectively through their sparse codes. As a result, the target is localized by integrating both the descriptive and the discriminative qualities. Extensive experiments on various challenging video sequences demonstrate the superior performance of proposed algorithm over the other state-of-the-art approaches."}}
