{"id": "QcySjEtiLIf", "cdate": 1668670086621, "mdate": 1668670086621, "content": {"title": "SkexGen: Autoregressive Generation of CAD Construction Sequences with Disentangled Codebooks", "abstract": "We present SkexGen, a novel autoregressive generative model for computer-aided design (CAD) construction sequences containing sketch-and-extrude modeling operations. Our model utilizes distinct Transformer architectures to encode topological, geometric, and extrusion variations of construction sequences into disentangled codebooks. Autoregressive Transformer decoders generate CAD construction sequences sharing certain properties specified by the codebook vectors. Extensive experiments demonstrate that our disentangled codebook representation generates diverse and high-quality CAD models, enhances user control, and enables efficient exploration of the design space. The code is available at https://samxuxiang.github.io/skexgen."}}
{"id": "9_LwcXc__3w", "cdate": 1668669321083, "mdate": 1668669321083, "content": {"title": "House-GAN++: Generative Adversarial Layout Refinement Network towards Intelligent Computational Agent for Professional Architects", "abstract": "This paper proposes a generative adversarial layout refinement network for automated floorplan generation. Our architecture is an integration of a graph-constrained relational GAN and a conditional GAN, where a previously generated layout becomes the next input constraint, enabling iterative refinement. A surprising discovery of our research is that a simple non-iterative training process, dubbed component-wise GT-conditioning, is effective in learning such a generator. The iterative generator further allows us to improve a metric of choice via meta-optimization techniques by controlling when to pass which input constraints during iterative refinement. Our qualitative and quantitative evaluation based on the three standard metrics demonstrate that the proposed system makes significant improvements over the current state-of-the-art, even competitive against the ground-truth floorplans, designed by professional architects. Code, model, and data are available at https://ennauata. github. io/houseganpp/page. html."}}
{"id": "TZ0vPR0fm9H", "cdate": 1667628327642, "mdate": 1667628327642, "content": {"title": "Learning Pairwise Inter-Plane Relations for Piecewise Planar Reconstruction", "abstract": "This paper proposes a novel single-image piecewise planar reconstruction technique that infers and enforces inter-plane relationships.\nOur approach takes a planar reconstruction result from an existing system, then utilizes convolutional neural network (CNN) to (1) classify\nif two planes are orthogonal or parallel; and 2) infer if two planes are\ntouching and, if so, where in the image. We formulate an optimization\nproblem to refine plane parameters and employ a message passing neural\nnetwork to refine plane segmentation masks by enforcing the inter-plane\nrelations. Our qualitative and quantitative evaluations demonstrate the\neffectiveness of the proposed approach in terms of plane parameters and\nsegmentation accuracy."}}
{"id": "RdIC-fHidCx", "cdate": 1667628153357, "mdate": 1667628153357, "content": {"title": "Roof-GAN: Learning to Generate Roof Geometry and Relations for Residential Houses", "abstract": "This paper presents Roof-GAN, a novel generative adversarial network that generates structured geometry of residential roof structures as a set of roof primitives and their\nrelationships. Given the number of primitives, the generator produces a structured roof model as a graph, which consists of 1) primitive geometry as raster images at each node,\nencoding facet segmentation and angles; 2) inter-primitive\ncolinear/coplanar relationships at each edge; and 3) primitive geometry in a vector format at each node, generated\nby a novel differentiable vectorizer while enforcing the relationships. The discriminator is trained to assess the primitive raster geometry, the primitive relationships, and the\nprimitive vector geometry in a fully end-to-end architecture. Qualitative and quantitative evaluations demonstrate\nthe effectiveness of our approach in generating diverse and\nrealistic roof models over the competing methods with a\nnovel metric proposed in this paper for the task of structured geometry generation. Code and data are available at\nhttps://github.com/yi-ming-qian/roofgan."}}
{"id": "uAhnyrrqhI", "cdate": 1640995200000, "mdate": 1663345434363, "content": {"title": "SkexGen: Autoregressive Generation of CAD Construction Sequences with Disentangled Codebooks", "abstract": "We present SkexGen, a novel autoregressive generative model for computer-aided design (CAD) construction sequences containing sketch-and-extrude modeling operations. Our model utilizes distinct Transformer architectures to encode topological, geometric, and extrusion variations of construction sequences into disentangled codebooks. Autoregressive Transformer decoders generate CAD construction sequences sharing certain properties specified by the codebook vectors. Extensive experiments demonstrate that our disentangled codebook representation generates diverse and high-quality CAD models, enhances user control, and enables efficient exploration of the design space. The code is available at https://samxuxiang.github.io/skexgen."}}
{"id": "i_cXhChj3tI", "cdate": 1640995200000, "mdate": 1668424513364, "content": {"title": "Neural Inertial Localization", "abstract": "This paper proposes the inertial localization problem, the task of estimating the absolute location from a sequence of inertial sensor measurements. This is an exciting and unexplored area of indoor localization research, where we present a rich dataset with 53 hours of inertial sensor data and the associated ground truth locations. We developed a solution, dubbed neural inertial localization (NILoc) which 1) uses a neural inertial navigation technique to turn inertial sensor history to a sequence of velocity vectors; then 2) employs a transformer-based neural architecture to find the device location from the sequence of velocities. We only use an IMU sensor, which is energy efficient and privacy preserving compared to WiFi, cameras, and other data sources. Our approach is significantly faster and achieves competitive results even compared with state-of-the-art methods that require a floorplan and run 20 to 30 times slower. We share our code, model and data at https://sachini.github.io/niloc."}}
{"id": "dX2Kdq7XimN", "cdate": 1640995200000, "mdate": 1680805946528, "content": {"title": "HouseDiffusion: Vector Floorplan Generation via a Diffusion Model with Discrete and Continuous Denoising", "abstract": ""}}
{"id": "dA75L653R-x", "cdate": 1640995200000, "mdate": 1663345434380, "content": {"title": "SkexGen: Autoregressive Generation of CAD Construction Sequences with Disentangled Codebooks", "abstract": "We present SkexGen, a novel autoregressive generative model for computer-aided design (CAD) construction sequences containing sketch-and-extrude modeling operations. Our model utilizes distinct Tra..."}}
{"id": "N9exSVNctLw", "cdate": 1640995200000, "mdate": 1663345434355, "content": {"title": "Single User WiFi Structure from Motion in the Wild", "abstract": "This paper proposes a novel motion estimation algorithm using WiFi networks and IMU sensor data in large uncontrolled environments, dubbed “WiFi Structure-from-Motion” (WiFi SfM). Given smartphone sensor data through day-to-day activities from a single user over a month, our WiFi SfM algorithm estimates smartphone motion tra-jectories and the structure of the environment represented as a WiFi radio map. The approach 1) establishes frame-to-frame correspondences based on WiFi fingerprints while exploiting our repetitive behavior patterns; 2) aligns trajectories via bundle adjustment; and 3) trains a self-supervised neural network to extract further motion constraints. We have col-lected 235 hours of smartphone data, spanning 38 days of daily activities in a university campus. Our experiments demonstrate the effectiveness of our approach over the competing methods with qualitative evaluations of the estimated motions and quantitative evaluations of indoor localization accuracy based on the reconstructed WiFi radio map. The WiFi SfM technology will potentially allow digital mapping companies to build better radio maps automatically by asking users to share WiFi/IMU sensor data in their daily activities."}}
{"id": "KN0shMLjwK", "cdate": 1640995200000, "mdate": 1680805946499, "content": {"title": "Vectorizing Building Blueprints", "abstract": ""}}
