{"id": "E4WUr4E86_S", "cdate": 1546300800000, "mdate": 1674695564040, "content": {"title": "TransCut2: Transparent Object Segmentation From a Light-Field Image", "abstract": "Transparent object segmentation can be very useful in computer vision applications. However, because the transparent objects borrow texture from their background and have a similar appearance to their surroundings, they are not handled well by regular image segmentation methods. In this paper, we propose a method that overcomes these problems using the consistency and distortion properties in a light-field image. The light-field linearity is used to estimate the likelihood of a pixel belonging to the transparent object or Lambertian background, and the occlusion detector is used to find the occlusion boundary. Graph-cut optimization is applied for the pixel labeling problem. We acquire light field datasets from both camera array and lenslet camera for the transparent object, and use these datasets to evaluate our method. The results demonstrate that the proposed method successfully segments transparent objects from the background under various conditions."}}
{"id": "rkVB5Zz_bB", "cdate": 1420070400000, "mdate": null, "content": {"title": "TransCut: Transparent Object Segmentation from a Light-Field Image", "abstract": "The segmentation of transparent objects can be very useful in computer vision applications. However, because they borrow texture from their background and have a similar appearance to their surroundings, transparent objects are not handled well by regular image segmentation methods. We propose a method that overcomes these problems using the consistency and distortion properties of a light-field image. Graph-cut optimization is applied for the pixel labeling problem. The light-field linearity is used to estimate the likelihood of a pixel belonging to the transparent object or Lambertian background, and the occlusion detector is used to find the occlusion boundary. We acquire a light field dataset for the transparent object, and use this dataset to evaluate our method. The results demonstrate that the proposed method successfully segments transparent objects from the background."}}
{"id": "ZuKRAdPO-OV", "cdate": 1420070400000, "mdate": 1674695564092, "content": {"title": "Light field distortion feature for transparent object classification", "abstract": ""}}
{"id": "S0I0YoPYz3", "cdate": 1420070400000, "mdate": 1674695564036, "content": {"title": "Camera array calibration for light field acquisition", "abstract": ""}}
