{"id": "x78Pi3cGQX", "cdate": 1672531200000, "mdate": 1696307411391, "content": {"title": "DEIR: Efficient and Robust Exploration through Discriminative-Model-Based Episodic Intrinsic Rewards", "abstract": "Exploration is a fundamental aspect of reinforcement learning (RL), and its effectiveness is a deciding factor in the performance of RL algorithms, especially when facing sparse extrinsic rewards. Recent studies have shown the effectiveness of encouraging exploration with intrinsic rewards estimated from novelties in observations. However, there is a gap between the novelty of an observation and an exploration, as both the stochasticity in the environment and the agent's behavior may affect the observation. To evaluate exploratory behaviors accurately, we propose DEIR, a novel method in which we theoretically derive an intrinsic reward with a conditional mutual information term that principally scales with the novelty contributed by agent explorations, and then implement the reward with a discriminative forward model. Extensive experiments on both standard and advanced exploration tasks in MiniGrid show that DEIR quickly learns a better policy than the baselines. Our evaluations on ProcGen demonstrate both the generalization capability and the general applicability of our intrinsic reward."}}
{"id": "8DrU-f2B44", "cdate": 1672531200000, "mdate": 1685363586494, "content": {"title": "Evolving Three Dimension (3D) Abstract Art: Fitting Concepts by Language", "abstract": "Computational creativity has contributed heavily to abstract art in modern era, allowing artists to create high quality, abstract two dimension (2D) arts with a high level of controllability and expressibility. However, even with computational approaches that have promising result in making concrete 3D art, computationally addressing abstract 3D art with high-quality and controllability remains an open question. To fill this gap, we propose to explore computational creativity in making abstract 3D art by bridging evolution strategies (ES) and 3D rendering through customizable parameterization of scenes. We demonstrate that our approach is capable of placing semi-transparent triangles in 3D scenes that, when viewed from specified angles, render into films that look like artists' specification expressed in natural language. This provides a new way for the artist to easily express creativity ideas for abstract 3D art. The supplementary material, which contains code, animation for all figures, and more examples, is here: https://es3dart.github.io/"}}
{"id": "24kKWqp9AbK", "cdate": 1672531200000, "mdate": 1685363586498, "content": {"title": "DEIR: Efficient and Robust Exploration through Discriminative-Model-Based Episodic Intrinsic Rewards", "abstract": "Exploration is a fundamental aspect of reinforcement learning (RL), and its effectiveness is a deciding factor in the performance of RL algorithms, especially when facing sparse extrinsic rewards. Recent studies have shown the effectiveness of encouraging exploration with intrinsic rewards estimated from novelties in observations. However, there is a gap between the novelty of an observation and an exploration, as both the stochasticity in the environment and the agent's behavior may affect the observation. To evaluate exploratory behaviors accurately, we propose DEIR, a novel method in which we theoretically derive an intrinsic reward with a conditional mutual information term that principally scales with the novelty contributed by agent explorations, and then implement the reward with a discriminative forward model. Extensive experiments on both standard and advanced exploration tasks in MiniGrid show that DEIR quickly learns a better policy than the baselines. Our evaluations on ProcGen demonstrate both the generalization capability and the general applicability of our intrinsic reward. Our source code is available at https://github.com/swan-utokyo/deir."}}
{"id": "wSbyYsSxnk1", "cdate": 1640995200000, "mdate": 1681716206572, "content": {"title": "EvoJAX: hardware-accelerated neuroevolution", "abstract": "Evolutionary computation has been shown to be a highly effective method for training neural networks, particularly when employed at scale on CPU clusters. Recent work have also showcased their effectiveness on hardware accelerators, such as GPUs, but so far such demonstrations are tailored for very specific tasks, limiting applicability to other domains. We present EvoJAX, a scalable, general purpose, hardware-accelerated neuroevolution toolkit. Building on top of the JAX library, our toolkit enables neuroevolution algorithms to work with neural networks running in parallel across multiple TPU/GPUs. EvoJAX achieves very high performance by implementing the evolution algorithm, neural network and task all in NumPy, which is compiled just-in-time to run on accelerators. We provide extensible examples of EvoJAX for a wide range of tasks, including supervised learning, reinforcement learning and generative art. Since EvoJAX can find solutions to most of these tasks within minutes on a single accelerator, compared to hours or days when using CPUs, our toolkit can significantly shorten the iteration cycle of evolutionary computation experiments. EvoJAX is available at https://github.com/google/evojax"}}
{"id": "mb0yRtI7I5o", "cdate": 1640995200000, "mdate": 1651643238702, "content": {"title": "EvoJAX: Hardware-Accelerated Neuroevolution", "abstract": "Evolutionary computation has been shown to be a highly effective method for training neural networks, particularly when employed at scale on CPU clusters. Recent work have also showcased their effectiveness on hardware accelerators, such as GPUs, but so far such demonstrations are tailored for very specific tasks, limiting applicability to other domains. We present EvoJAX, a scalable, general purpose, hardware-accelerated neuroevolution toolkit. Building on top of the JAX library, our toolkit enables neuroevolution algorithms to work with neural networks running in parallel across multiple TPU/GPUs. EvoJAX achieves very high performance by implementing the evolution algorithm, neural network and task all in NumPy, which is compiled just-in-time to run on accelerators. We provide extensible examples of EvoJAX for a wide range of tasks, including supervised learning, reinforcement learning and generative art. Since EvoJAX can find solutions to most of these tasks within minutes on a single accelerator, compared to hours or days when using CPUs, our toolkit can significantly shorten the iteration cycle of evolutionary computation experiments. EvoJAX is available at https://github.com/google/evojax"}}
{"id": "TSJAQPywCmx", "cdate": 1640995200000, "mdate": 1681716206604, "content": {"title": "Optimal Transport Tools (OTT): A JAX Toolbox for all things Wasserstein", "abstract": "Optimal transport tools (OTT-JAX) is a Python toolbox that can solve optimal transport problems between point clouds and histograms. The toolbox builds on various JAX features, such as automatic and custom reverse mode differentiation, vectorization, just-in-time compilation and accelerators support. The toolbox covers elementary computations, such as the resolution of the regularized OT problem, and more advanced extensions, such as barycenters, Gromov-Wasserstein, low-rank solvers, estimation of convex maps, differentiable generalizations of quantiles and ranks, and approximate OT between Gaussian mixtures. The toolbox code is available at \\texttt{https://github.com/ott-jax/ott}"}}
{"id": "QRkEswYPzmB", "cdate": 1640995200000, "mdate": 1651643238686, "content": {"title": "Modern Evolution Strategies for Creativity: Fitting Concrete Images and Abstract Concepts", "abstract": "Evolutionary algorithms (ES) have been used in the digital art scene since the 1970s. A popular application of genetic algorithms is to optimize the procedural placement of vector graphic primitives to resemble a given painting. In recent years, deep learning-based approaches have also been proposed to generate procedural drawings, which can be optimized using gradient descent. In this work, we revisit the use of evolutionary algorithms for computational creativity. We find that modern ES algorithms, when tasked with the placement of shapes, offer large improvements in both quality and efficiency compared to traditional genetic algorithms, and even comparable to gradient-based methods. We demonstrate that ES is also well suited at optimizing the placement of shapes to fit the CLIP model, and can produce diverse, distinct geometric abstractions that are aligned with human interpretation of language."}}
{"id": "8Uyc5LQS9v", "cdate": 1640995200000, "mdate": 1681716206596, "content": {"title": "Simultaneous Multiple-Prompt Guided Generation Using Differentiable Optimal Transport", "abstract": ""}}
{"id": "7a0EL4LeNZg", "cdate": 1640995200000, "mdate": 1651643238698, "content": {"title": "Simultaneous Multiple-Prompt Guided Generation Using Differentiable Optimal Transport", "abstract": "Recent advances in deep learning, such as powerful generative models and joint text-image embeddings, have provided the computational creativity community with new tools, opening new perspectives for artistic pursuits. Text-to-image synthesis approaches that operate by generating images from text cues provide a case in point. These images are generated with a latent vector that is progressively refined to agree with text cues. To do so, patches are sampled within the generated image, and compared with the text prompts in the common text-image embedding space; The latent vector is then updated, using gradient descent, to reduce the mean (average) distance between these patches and text cues. While this approach provides artists with ample freedom to customize the overall appearance of images, through their choice in generative models, the reliance on a simple criterion (mean of distances) often causes mode collapse: The entire image is drawn to the average of all text cues, thereby losing their diversity. To address this issue, we propose using matching techniques found in the optimal transport (OT) literature, resulting in images that are able to reflect faithfully a wide diversity of prompts. We provide numerous illustrations showing that OT avoids some of the pitfalls arising from estimating vectors with mean distances, and demonstrate the capacity of our proposed method to perform better in experiments, qualitatively and quantitatively."}}
{"id": "lHM0ATYK9d", "cdate": 1609459200000, "mdate": 1681716206661, "content": {"title": "Numerical Modelling of Electron Beam Welding of Pure Niobium with Beam Oscillation: Towards Industry 4.0", "abstract": "Electron beam welding (EBW) is a high-end manufacturing method often used in aerospace, defence and nuclear sectors. In order to explore the feasibility of upgrading the conventional EBW process to smarter and intelligent manufacturing towards Industry 4.0, this paper presents a computational fluid dynamics (CFD) model, where the e-beam characteristics are obtained through a state-of-the-art beam probing system, to simulate the electron beam welding of pure niobium plate with a circular beam deflection pattern. The effect of beam oscillation is studied based on the experiments and simulation results including weld bead shape, penetration, temperature distribution, keyhole generation, etc. It can be concluded that electron beam oscillation can reduce the maximum temperature of the molten pool and inhibit the generation of keyhole, therefore the weld seam quality is greatly improved compared with single path weld. The CFD model could be integrated into a digital toolbox for automating and better controlling the EBW process for a wider range of materials."}}
