{"id": "SFvCx280nQ", "cdate": 1672531200000, "mdate": 1685498736609, "content": {"title": "LightPainter: Interactive Portrait Relighting with Freehand Scribble", "abstract": "Recent portrait relighting methods have achieved realistic results of portrait lighting effects given a desired lighting representation such as an environment map. However, these methods are not intuitive for user interaction and lack precise lighting control. We introduce LightPainter, a scribble-based relighting system that allows users to interactively manipulate portrait lighting effect with ease. This is achieved by two conditional neural networks, a delighting module that recovers geometry and albedo optionally conditioned on skin tone, and a scribble-based module for relighting. To train the relighting module, we propose a novel scribble simulation procedure to mimic real user scribbles, which allows our pipeline to be trained without any human annotations. We demonstrate high-quality and flexible portrait lighting editing capability with both quantitative and qualitative experiments. User study comparisons with commercial lighting editing tools also demonstrate consistent user preference for our method."}}
{"id": "wfel7CjOYk", "cdate": 1652737296196, "mdate": null, "content": {"title": "Resource-Adaptive Federated Learning with All-In-One Neural Composition", "abstract": "Conventional Federated Learning (FL) systems inherently assume a uniform processing capacity among clients for deployed models.  However, diverse client hardware often leads to varying computation resources in practice. Such system heterogeneity results in an inevitable trade-off between model complexity and data accessibility as a bottleneck. To avoid such a dilemma and achieve resource-adaptive federated learning, we introduce a simple yet effective mechanism, termed All-In-One Neural Composition, to systematically support training complexity-adjustable models with flexible resource adaption. It is able to efficiently construct models at various complexities using one unified neural basis shared among clients, instead of pruning the global model into local ones. The proposed mechanism endows the system with unhindered access to the full range of knowledge scattered across clients and generalizes existing pruning-based solutions by allowing soft and learnable extraction of low footprint models. Extensive experiment results on popular FL benchmarks demonstrate the effectiveness of our approach. The resulting FL system empowered by our All-In-One Neural Composition, called FLANC, manifests consistent performance gains across diverse system/data heterogeneous setups while keeping high efficiency in computation and communication. "}}
{"id": "qLxuaDYxilO", "cdate": 1640995200000, "mdate": 1668183267801, "content": {"title": "Escaping Data Scarcity for High-Resolution Heterogeneous Face Hallucination", "abstract": ""}}
{"id": "mr0DjynxCJR", "cdate": 1640995200000, "mdate": 1668183267821, "content": {"title": "Escaping Data Scarcity for High-Resolution Heterogeneous Face Hallucination", "abstract": ""}}
{"id": "Xm-ZZj4t5g5", "cdate": 1640995200000, "mdate": 1668183267760, "content": {"title": "ReconFormer: Accelerated MRI Reconstruction Using Recurrent Transformer", "abstract": ""}}
{"id": "JN5i9rmaZuP", "cdate": 1640995200000, "mdate": 1668183267820, "content": {"title": "Thermal to Visible Image Synthesis under Atmospheric Turbulence", "abstract": ""}}
{"id": "fUQsqh3LKX", "cdate": 1609459200000, "mdate": 1668183267788, "content": {"title": "Image Super-Resolution With Non-Local Sparse Attention", "abstract": ""}}
{"id": "pO8M-6X_Hb", "cdate": 1577836800000, "mdate": 1668183267804, "content": {"title": "Image Super-Resolution with Cross-Scale Non-Local Attention and Exhaustive Self-Exemplars Mining", "abstract": ""}}
{"id": "k2WyE5mW787", "cdate": 1577836800000, "mdate": 1668183267761, "content": {"title": "Dsr: An Accurate Single Image Super Resolution Approach For Various Degradations", "abstract": ""}}
{"id": "UbyKOefWg8", "cdate": 1577836800000, "mdate": 1668183267803, "content": {"title": "Neural Sparse Representation for Image Restoration", "abstract": ""}}
