{"id": "dff4bi7zCjR", "cdate": 1621446608146, "mdate": null, "content": {"title": "Dynamic Graph Learning: A Structure-Driven Approach", "abstract": "The purpose of this paper is to infer a dynamic graph as a global (collective) model of time-varying measurements at a set of network nodes. This model captures both pairwise as well as higher order interactions (i.e., more than two nodes) among the nodes. The motivation of this work lies in the search for a connectome model which properly captures brain functionality across all regions of the brain, and possibly at individual neurons. We formulate it as an optimization problem, a quadratic objective functional and tensor information of observed node signals over short time intervals. The proper regularization constraints reflect the graph smoothness and other dynamics involving the underlying graph’s Laplacian, as well as the time evolution smoothness of the underlying graph. The resulting joint optimization is solved by a continuous relaxation of the weight parameters and an introduced novel gradient-projection scheme. While the work may be applicable to any time-evolving data set (e.g., fMRI), we apply our algorithm to a real-world dataset comprising recorded activities of individual brain cells. The resulting model is shown to be not only viable but also efficiently computable."}}
{"id": "EY4DOEcUqzTh", "cdate": 1621446495622, "mdate": null, "content": {"title": "Mesoscale correlation structure with single cell resolution during visual coding", "abstract": "Neural circuitry represents sensory input with patterns of spiking activity. Across brain regions, initial representations are transformed to ultimately drive adaptive behavior. In mammalian neocortex, visual information is processed by primary visual cortex (V1) and multiple higher visual areas (HVAs). The interconnections of these brain regions, over which transformations can occur, span millimeters or more. Shared variability in spiking responses between neurons, called “noise correlations” (NCs), can be due to shared input and/or direct or indirect connectivity. Thus, NCs provide insight into the functional connectivity of neuronal circuits. In this study, we used subcellular resolution, mesoscale field-of-view two-photon calcium imaging to systematically characterize the NCs for pairs of layer 2/3 neurons across V1 and four HVAs (areas LM, LI, AL and PM) of mice. The average NCs for pairs of neurons within or across cortical areas were orders of magnitude larger than trial-shuffled control values. Within-area NCs declined with distance between neurons, but for inter-area NCs the distance-dependence was mixed. NCs were higher for neuron pairs with similar tuning (i.e., signal correlations). To explore tuning-specific NCs in finer detail, we used an unbiased clustering approach to classify neurons based on their responses to orientated gratings. This analysis revealed biases in the coverage of spatiotemporal frequency space across HVAs, and relationships between orientation tuning biases and spatiotemporal frequency preferences. Using the resulting functional groupings, we found group-specific within-area and inter-area patterns of NCs, indicating functionally-specific subnetworks. Overall, these results reveal new principles for the functional organization and correlation structure across multiple cortical areas, which can inform and constrain computational theories of cortical networks."}}
{"id": "qRaox8xH1x", "cdate": 1577836800000, "mdate": null, "content": {"title": "Identifying signal and noise structure in neural population activity with Gaussian process factor models", "abstract": "Neural datasets often contain measurements of neural activity across multiple trials of a repeated stimulus or behavior. An important problem in the analysis of such datasets is to characterize systematic aspects of neural activity that carry information about the repeated stimulus or behavior of interest, which can be considered <code>signal'', and to separate them from the trial-to-trial fluctuations in activity that are not time-locked to the stimulus, which for purposes of such analyses can be considered</code>noise''. Gaussian Process factor models provide a powerful tool for identifying shared structure in high-dimensional neural data. However, they have not yet been adapted to the problem of characterizing signal and noise in multi-trial datasets. Here we address this shortcoming by proposing ``signal-noise'' Poisson-spiking Gaussian Process Factor Analysis (SNP-GPFA), a flexible latent variable model that resolves signal and noise latent structure in neural population spiking activity. To learn the parameters of our model, we introduce a Fourier-domain black box variational inference method that quickly identifies smooth latent structure. The resulting model reliably uncovers latent signal and trial-to-trial noise-related fluctuations in large-scale recordings. We use this model to show that in monkey V1, noise fluctuations perturb neural activity within a subspace orthogonal to signal activity, suggesting that trial-by-trial noise does not interfere with signal representations. Finally, we extend the model to capture statistical dependencies across brain regions in multi-region data. We show that in mouse visual cortex, models with shared noise across brain regions out-perform models with independent per-region noise."}}
{"id": "Kpc_oSLOOtQ", "cdate": 1577836800000, "mdate": null, "content": {"title": "Efficient Non-conjugate Gaussian Process Factor Models for Spike Count Data using Polynomial Approximations", "abstract": "Gaussian Process Factor Analysis (GPFA) has been broadly applied to the problem of identifying smooth, low-dimensional temporal structure underlying large-scale neural recordings. However, spike tr..."}}
{"id": "kXNqoFoF3tI", "cdate": 1546300800000, "mdate": null, "content": {"title": "Efficient non-conjugate Gaussian process factor models for spike count data using polynomial approximations", "abstract": "Gaussian Process Factor Analysis (GPFA) has been broadly applied to the problem of identifying smooth, low-dimensional temporal structure underlying large-scale neural recordings. However, spike trains are non-Gaussian, which motivates combining GPFA with discrete observation models for binned spike count data. The drawback to this approach is that GPFA priors are not conjugate to count model likelihoods, which makes inference challenging. Here we address this obstacle by introducing a fast, approximate inference method for non-conjugate GPFA models. Our approach uses orthogonal second-order polynomials to approximate the nonlinear terms in the non-conjugate log-likelihood, resulting in a method we refer to as \\textit{polynomial approximate log-likelihood} (PAL) estimators. This approximation allows for accurate closed-form evaluation of marginal likelihoods and fast numerical optimization for parameters and hyperparameters. We derive PAL estimators for GPFA models with binomial, Poisson, and negative binomial observations and find the PAL estimation is highly accurate, and achieves faster convergence times compared to existing state-of-the-art inference methods. We also find that PAL hyperparameters can provide sensible initialization for black box variational inference (BBVI), which improves BBVI accuracy. We demonstrate that PAL estimators achieve fast and accurate extraction of latent structure from multi-neuron spike train data."}}
{"id": "0Ao1AHy_T4-", "cdate": 1546300800000, "mdate": null, "content": {"title": "Deep Adversarial Belief Networks", "abstract": "We present a novel adversarial framework for training deep belief networks (DBNs), which includes replacing the generator network in the methodology of generative adversarial networks (GANs) with a DBN and developing a highly parallelizable numerical algorithm for training the resulting architecture in a stochastic manner. Unlike the existing techniques, this framework can be applied to the most general form of DBNs with no requirement for back propagation. As such, it lays a new foundation for developing DBNs on a par with GANs with various regularization units, such as pooling and normalization. Foregoing back-propagation, our framework also exhibits superior scalability as compared to other DBN and GAN learning techniques. We present a number of numerical experiments in computer vision as well as neurosciences to illustrate the main advantages of our approach."}}
{"id": "t4KipT0Sy-j", "cdate": 1420070400000, "mdate": null, "content": {"title": "A sliding-window data aggregation method for super-resolution imaging of live cells", "abstract": "Super resolution localization microscopy (SRLM) techniques such as STORM and PALM overcome the ~200nm diffraction limit of conventional light microscopy by randomly activating separate fluorophores over time and computationally aggregating their nanometer resolution detected locations for image reconstruction. However, a basic limitation of current SRLM approaches for live cell imaging is their low temporal resolution due to motion blur, which arises if image objects move during image acquisition of the substantial number of raw images required for constructing the super-resolution image for a given time point. To overcome this limitation, we propose a sliding-window data aggregation method, which exploits the temporal correlation between the collected fluorescence images to achieve significantly higher frame rate and therefore better temporal resolution than current approaches. Specifically, images within a sliding window are aligned so that locations of detected fluorophores within them are aggregated to accelerate image reconstruction for higher temporal resolution. We tested and validated our method using both simulated and real live cell STORM image data."}}
{"id": "lXpV5N0abD", "cdate": 1388534400000, "mdate": null, "content": {"title": "Cell penetrating peptide mediated quantum dot delivery and release in live mammalian cells", "abstract": "Quantum dots (QDs) are semiconductor nanocrystals whose unique fluorescence properties make them desirable biological imaging probes. However, reliable and efficient cellular delivery of QDs remains technically challenging. To address this problem, we developed a cell penetrating peptide (CPP) based approach that delivers QDs into mammalian cells with high reproducibility and efficiency and minimal cytotoxicity. To understand the delivery mechanism, we analyzed related cell uptake pathways. We followed internalization and endosomal release of CPP conjugated QDs (CPP-QDs) and found that although endocytosis (micropinocytosis) was the predominant pathway, some CPP-QDs were internalized through direct permeation of the plasma membrane. Internalized QDs could be released from endosomes to the cytoplasm if conjugated with an endosomolytic peptide (HA2), but most of released particles either were re-captured by lysosomes or aggregated in the cytoplasm. Together, our results provide insights into mechanisms of CPP mediated cellular delivery of quantum dots for intracellular imaging as well as therapeutic applications."}}
{"id": "V1sd5B06Zs8", "cdate": 1325376000000, "mdate": null, "content": {"title": "Adaptive active-mask image segmentation for quantitative characterization of mitochondrial morphology", "abstract": "We propose an automated algorithm for segmentation of mitochondria from widefield fluorescence microscopy images for quantitative morphology characterization. Mitochondria are membrane-bound organelles that are essential to cells of higher living organisms. Reliable and precise quantitative characterization of their shape is crucial to understanding related physiology and disease mechanisms. Building upon the active-mask framework developed for segmentation of confocal fluorescence microscope images, we propose a new adaptive region-based distributing function to effectively address the problem of halo artifacts that are common in widefield fluorescence images. Such artifacts prevent the segmentation of weak features of mitochondria using existing algorithms. We compare the algorithm to the original active-mask algorithm as well as the geodesic active contour algorithm based on hand-segmented ground truth, and find that it performs significantly better both qualitatively and quantitatively."}}
