{"id": "cCHpM3OlJc", "cdate": 1578796643754, "mdate": null, "content": {"title": "Real-Time 6D Object Pose Estimation on CPU", "abstract": "We propose a fast and accurate 6D object pose estimation from a RGB-D image. Our proposed method is template matching based and consists of three main technical components, PCOF-MOD (multimodal PCOF), balanced pose tree (BPT) and optimum memory rearrangement for a coarse-to-fine search. Our model templates on densely sampled viewpoints and PCOF-MOD which explicitly handles a certain range of 3D object pose improve the robustness against background clutters. BPT which is an efficient tree-based data structures for a large number of templates and template matching on rearranged feature maps where nearby features are linearly aligned accelerate the pose estimation. The experimental evaluation on tabletop and bin-picking dataset showed that our method achieved higher accuracy and faster speed in comparison with state-of-the-art techniques including recent CNN based approaches. Moreover, our model templates can be trained only from 3D CAD in a few minutes and the pose estimation run in near real-time (23 fps) on CPU. These features are suitable for any real applications."}}
{"id": "ot9ipmXETA", "cdate": 1578796351162, "mdate": null, "content": {"title": "Textureless object detection using cumulative orientation feature", "abstract": "We propose a novel image feature for textureless object detection. The feature is based on quantized gradient orientations those have been shown to be robust to cluttered backgrounds and illumination changes. We make this feature robust to the appearance changes of a targeted object itself induced by its transformations and small deformations. In our proposed method, we add small random values to the similarity transformation parameters and synthesize many model images. Then quantized orientations are extracted on these images and the orientations are cumulated at each pixel. The frequencies of selected features are utilized as weights when calculating scores. Our proposed feature is evaluated on publicly available dataset and achieve top-class performance both in speed and detection accuracy compared to state-of-the-art techniques."}}
{"id": "Sy4kN9Z_bH", "cdate": 1451606400000, "mdate": null, "content": {"title": "Fast 6D Pose Estimation from a Monocular Image Using Hierarchical Pose Trees", "abstract": "It has been shown that the template based approaches could quickly estimate 6D pose of texture-less objects from a monocular image. However, they tend to be slow when the number of templates amounts to tens of thousands for handling a wider range of 3D object pose. To alleviate this problem, we propose a novel image feature and a tree-structured model. Our proposed perspectively cumulated orientation feature (PCOF) is based on the orientation histograms extracted from randomly generated 2D projection images using 3D CAD data, and the template using PCOF explicitly handle a certain range of 3D object pose. The hierarchical pose trees (HPT) is built by clustering 3D object pose and reducing the resolutions of templates, and HPT accelerates 6D pose estimation based on a coarse-to-fine strategy with an image pyramid. In the experimental evaluation on our texture-less object dataset, the combination of PCOF and HPT showed higher accuracy and faster speed in comparison with state-of-the-art techniques."}}
{"id": "Sk-8zq-_bB", "cdate": 1325376000000, "mdate": null, "content": {"title": "Facial Model Fitting Based on Perturbation Learning and It's Evaluation on Challenging Real-World Diversities Images", "abstract": "We present a robust and efficient framework for facial shape model fitting. Traditional model fitting approaches are sensitive to noise resulting from scene variations due to lighting, facial expressions, poses, etc., and tend to spend substantial computational effort due to heuristic searching algorithms. Our work distinguishes itself from conventional approaches by employing (a) non-uniform sampling features unified by the shape model that affords robustness, and (b) regression analysis between observed features and underlying shape parameters that allow for efficient model update. We demonstrate the effectiveness of our framework by evaluating its performance on several new and existing datasets including challenging real-world diversities. Significantly higher localization accuracy and speedup factors of 15 have been observed comparing with the traditional approach."}}
{"id": "HJb9JcbdbB", "cdate": 1325376000000, "mdate": null, "content": {"title": "Fast and Precise Template Matching Based on Oriented Gradients", "abstract": "In this paper we propose a fast template matching method which can handle various types of objects. In our method the discretized orientations of image gradients which are robust to illumination changes and clutterd backgrounds are used as features. The features are binary represented and they can be matched very fast using bitwise operations. Furthermore, the rotated and resized templates those have similar feature vectors are clustered to one template and the total number of templates are greatly reduced, which boosts the detection speed. The experimental results show that our method can detect target objects (the search space includes translation, ±180 deg rotation, and ±50% scale change) with sub-pixel accracy in real-time."}}
