{"id": "y7g3hSGVqZc", "cdate": 1661990400000, "mdate": 1695949351308, "content": {"title": "Computational multiplex panel reduction to maximize information retention in breast cancer tissue microarrays", "abstract": "Author summary Multiplex tissue imaging techniques utilize large panels of markers that attempt to gather as much information as possible, but increasing the number of stains does come with the downsides of increased autofluorescence and tissue degradation. There exists a theoretical subsampling of markers that is able to recreate the same information as a full panel; therefore, removing the self-correlating information with such a subset would increase the efficiency of the imaging process and maximize the information collected. By selecting an idealized subsample of markers, a deep learning model can be trained to predict the same information as a full dataset with fewer rounds of staining. Here we evaluate several methods of subsample marker selection and demonstrate their ability to reconstruct the full panel’s information."}}
{"id": "rJPaMjlLJv", "cdate": 1640995200000, "mdate": 1681652018619, "content": {"title": "Optimal drug treatment for reducing long-term drug resistance", "abstract": ""}}
{"id": "XgcsO9kONb", "cdate": 1640995200000, "mdate": 1681652018563, "content": {"title": "Efficient Self-Ensemble for Semantic Segmentation", "abstract": ""}}
{"id": "7vnf8tazaK", "cdate": 1640995200000, "mdate": 1695949351290, "content": {"title": "Exploring approaches for predictive cancer patient digital twins: Opportunities for collaboration and innovation", "abstract": "We are rapidly approaching a future in which cancer patient digital twins will reach their potential to predict cancer prevention, diagnosis, and treatment in individual patients. This will be realized based on advances in high performance computing, computational modeling, and an expanding repertoire of observational data across multiple scales and modalities. In 2020, the US National Cancer Institute, and the US Department of Energy, through a trans-disciplinary research community at the intersection of advanced computing and cancer research, initiated team science collaborative projects to explore the development and implementation of predictive Cancer Patient Digital Twins. Several diverse pilot projects were launched to provide key insights into important features of this emerging landscape and to determine the requirements for the development and adoption of cancer patient digital twins. Projects included exploring approaches to using a large cohort of digital twins to perform deep phenotyping and plan treatments at the individual level, prototyping self-learning digital twin platforms, using adaptive digital twin approaches to monitor treatment response and resistance, developing methods to integrate and fuse data and observations across multiple scales, and personalizing treatment based on cancer type. Collectively these efforts have yielded increased insights into the opportunities and challenges facing cancer patient digital twin approaches and helped define a pa..."}}
{"id": "26e6kN4ICxN", "cdate": 1640995200000, "mdate": 1681652018547, "content": {"title": "Investigating key cell types and molecules dynamics in PyMT mice model of breast cancer through a mathematical model", "abstract": ""}}
{"id": "aIdWJ431ir_", "cdate": 1609459200000, "mdate": 1681652018564, "content": {"title": "Efficient Self-Ensemble Framework for Semantic Segmentation", "abstract": ""}}
{"id": "OtJcfZlpeB", "cdate": 1609459200000, "mdate": 1681652018616, "content": {"title": "Strategies to Reduce Long-Term Drug Resistance by Considering Effects of Differential Selective Treatments", "abstract": ""}}
{"id": "uk1cmBVrBDT", "cdate": 1577836800000, "mdate": 1681652018565, "content": {"title": "Single cell tracking based on Voronoi partition via stable matching", "abstract": ""}}
{"id": "Q3N65tybhO", "cdate": 1577836800000, "mdate": 1681652018646, "content": {"title": "Activation vs. Organization: Prognostic Implications of T and B Cell Features of the PDAC Microenvironment", "abstract": ""}}
{"id": "6ty5r5P8mh8", "cdate": 1577836800000, "mdate": 1681652018565, "content": {"title": "DISSECT: DISentangle SharablE ConTent for Multimodal Integration and Crosswise-mapping", "abstract": ""}}
