{"id": "026hEw26i3-", "cdate": 1621629866106, "mdate": null, "content": {"title": "The decomposition of the higher-order homology embedding constructed from the $k$-Laplacian", "abstract": "The null space of the $k$-th order Laplacian $\\mathbf{\\mathcal L}_k$, known as the {\\em $k$-th homology vector space}, encodes the non-trivial topology of a manifold or a network. Understanding the structure of the homology embedding can thus disclose geometric or topological information from the data. The study of the null space embedding of the graph Laplacian $\\mathbf{\\mathcal L}_0$ has spurred new research and applications, such as spectral clustering algorithms with theoretical guarantees and estimators of the Stochastic Block Model. In this work, we investigate the geometry of the $k$-th homology embedding and focus on cases reminiscent of spectral clustering. Namely, we analyze the {\\em connected sum} of manifolds as a perturbation to the direct sum of their homology embeddings. We propose an algorithm to factorize the homology embedding into subspaces corresponding to a manifold's simplest topological components. The proposed framework is applied to the {\\em shortest homologous loop detection} problem, a problem known to be NP-hard in general. Our spectral loop detection algorithm scales better than existing methods and is effective on diverse data such as point clouds and images. "}}
{"id": "sDvM9pqqXO", "cdate": 1609459200000, "mdate": 1681887515551, "content": {"title": "The decomposition of the higher-order homology embedding constructed from the $k$-Laplacian", "abstract": "The null space of the $k$-th order Laplacian $\\mathbf{\\mathcal L}_k$, known as the {\\em $k$-th homology vector space}, encodes the non-trivial topology of a manifold or a network. Understanding the structure of the homology embedding can thus disclose geometric or topological information from the data. The study of the null space embedding of the graph Laplacian $\\mathbf{\\mathcal L}_0$ has spurred new research and applications, such as spectral clustering algorithms with theoretical guarantees and estimators of the Stochastic Block Model. In this work, we investigate the geometry of the $k$-th homology embedding and focus on cases reminiscent of spectral clustering. Namely, we analyze the {\\em connected sum} of manifolds as a perturbation to the direct sum of their homology embeddings. We propose an algorithm to factorize the homology embedding into subspaces corresponding to a manifold's simplest topological components. The proposed framework is applied to the {\\em shortest homologous loop detection} problem, a problem known to be NP-hard in general. Our spectral loop detection algorithm scales better than existing methods and is effective on diverse data such as point clouds and images."}}
{"id": "TlP3gxaCtE", "cdate": 1609459200000, "mdate": 1681887515563, "content": {"title": "The decomposition of the higher-order homology embedding constructed from the k-Laplacian", "abstract": "The null space of the $k$-th order Laplacian $\\mathbf{\\mathcal L}_k$, known as the {\\em $k$-th homology vector space}, encodes the non-trivial topology of a manifold or a network. Understanding the structure of the homology embedding can thus disclose geometric or topological information from the data. The study of the null space embedding of the graph Laplacian $\\mathbf{\\mathcal L}_0$ has spurred new research and applications, such as spectral clustering algorithms with theoretical guarantees and estimators of the Stochastic Block Model. In this work, we investigate the geometry of the $k$-th homology embedding and focus on cases reminiscent of spectral clustering. Namely, we analyze the {\\em connected sum} of manifolds as a perturbation to the direct sum of their homology embeddings. We propose an algorithm to factorize the homology embedding into subspaces corresponding to a manifold's simplest topological components. The proposed framework is applied to the {\\em shortest homologous loop detection} problem, a problem known to be NP-hard in general. Our spectral loop detection algorithm scales better than existing methods and is effective on diverse data such as point clouds and images."}}
{"id": "0bGQtj6XjQ0", "cdate": 1609459200000, "mdate": 1681887515586, "content": {"title": "Helmholtzian Eigenmap: Topological feature discovery & edge flow learning from point cloud data", "abstract": "The manifold Helmholtzian (1-Laplacian) operator $\\Delta_1$ elegantly generalizes the Laplace-Beltrami operator to vector fields on a manifold $\\mathcal M$. In this work, we propose the estimation of the manifold Helmholtzian from point cloud data by a weighted 1-Laplacian $\\mathbf{\\mathcal L}_1$. While higher order Laplacians ave been introduced and studied, this work is the first to present a graph Helmholtzian constructed from a simplicial complex as an estimator for the continuous operator in a non-parametric setting. Equipped with the geometric and topological information about $\\mathcal M$, the Helmholtzian is a useful tool for the analysis of flows and vector fields on $\\mathcal M$ via the Helmholtz-Hodge theorem. In addition, the $\\mathbf{\\mathcal L}_1$ allows the smoothing, prediction, and feature extraction of the flows. We demonstrate these possibilities on substantial sets of synthetic and real point cloud datasets with non-trivial topological structures; and provide theoretical results on the limit of $\\mathbf{\\mathcal L}_1$ to $\\Delta_1$."}}
{"id": "SJlhNVHlLS", "cdate": 1567802420328, "mdate": null, "content": {"title": "Selecting the independent coordinates of manifolds with large aspect ratios", "abstract": "Many manifold embedding algorithms fail apparently when the data manifold has a large aspect ratio (such as a long, thin strip). Here, we formulate success and failure in terms of finding a smooth embedding, showing also that the problem is pervasive and more complex than previously recognized. Then, we propose a bicriterial {\\em Independent Eigencoordinate Selection (IES)} algorithm that selects smooth embeddings with few eigenvectors. The algorithm is grounded in theory, has low computational overhead, and is successful on synthetic and large real data. "}}
{"id": "uxLFgyZsu-t", "cdate": 1546300800000, "mdate": 1681887515560, "content": {"title": "Selecting the independent coordinates of manifolds with large aspect ratios", "abstract": "Many manifold embedding algorithms fail apparently when the data manifold has a large aspect ratio (such as a long, thin strip). Here, we formulate success and failure in terms of finding a smooth embedding, showing also that the problem is pervasive and more complex than previously recognized. Mathematically, success is possible under very broad conditions, provided that embedding is done by carefully selected eigenfunctions of the Laplace-Beltrami operator $\\Delta$. Hence, we propose a bicriterial Independent Eigencoordinate Selection (IES) algorithm that selects smooth embeddings with few eigenvectors. The algorithm is grounded in theory, has low computational overhead, and is successful on synthetic and large real data."}}
{"id": "qrWE1FX1pvr", "cdate": 1546300800000, "mdate": 1681887515565, "content": {"title": "On Dynamic Network Models and Application to Causal Impact", "abstract": "Dynamic extensions of Stochastic block model (SBM) are of importance in several fields that generate temporal interaction data. These models, besides producing compact and interpretable network representations, can be useful in applications such as link prediction or network forecasting. In this paper we present a conditional pseudo-likelihood based extension to dynamic SBM that can be efficiently estimated by optimizing a regularized objective. Our formulation leads to a highly scalable approach that can handle very large networks, even with millions of nodes. We also extend our formalism to causal impact for networks that allows us to quantify the impact of external events on a time dependent sequence of networks. We support our work with extensive results on both synthetic and real networks."}}
