{"id": "rJwuIltVCH", "cdate": 1640995200000, "mdate": 1683879149573, "content": {"title": "Joint Motion-Correction and Reconstruction in Cryo-Em Tomography", "abstract": "Tilt-series cryo-electron tomography (cryoET) is an established imaging technique used in several scientific fields to determine samples’ three-dimensional (3D) structures at nearatomic resolutions. However, the motion and misalignment that occur during the acquisition stage are major limiting factors to reaching smaller resolutions. Indeed, they introduce blur and artifacts, which deteriorate the reconstruction quality. In this paper, we propose a joint motion-correction and reconstruction framework to improve the quality of the output volume and, consequently, its resolution. Our framework first estimates the motion field in the sample in order to correct the captured data. Then an iterative plug-and-play prior approach is used to reconstruct the sample. The validation of our approach on real captured datasets shows a good quality reconstruction translated in a resolution improvement."}}
{"id": "ojgPwcB1VQ1", "cdate": 1640995200000, "mdate": 1683879149529, "content": {"title": "Neural Adaptive SCEne Tracing", "abstract": "Neural rendering with implicit neural networks has recently emerged as an attractive proposition for scene reconstruction, achieving excellent quality albeit at high computational cost. While the most recent generation of such methods has made progress on the rendering (inference) times, very little progress has been made on improving the reconstruction (training) times. In this work, we present Neural Adaptive Scene Tracing (NAScenT), the first neural rendering method based on directly training a hybrid explicit-implicit neural representation. NAScenT uses a hierarchical octree representation with one neural network per leaf node and combines this representation with a two-stage sampling process that concentrates ray samples where they matter most near object surfaces. As a result, NAScenT is capable of reconstructing challenging scenes including both large, sparsely populated volumes like UAV captured outdoor environments, as well as small scenes with high geometric complexity. NAScenT outperforms existing neural rendering approaches in terms of both quality and training time."}}
{"id": "h-joBa5jlT", "cdate": 1640995200000, "mdate": 1683879149539, "content": {"title": "NeAT: neural adaptive tomography", "abstract": "In this paper, we present Neural Adaptive Tomography (NeAT), the first adaptive, hierarchical neural rendering pipeline for tomography. Through a combination of neural features with an adaptive explicit representation, we achieve reconstruction times far superior to existing neural inverse rendering methods. The adaptive explicit representation improves efficiency by facilitating empty space culling and concentrating samples in complex regions, while the neural features act as a neural regularizer for the 3D reconstruction. The NeAT framework is designed specifically for the tomographic setting, which consists only of semi-transparent volumetric scenes instead of opaque objects. In this setting, NeAT outperforms the quality of existing optimization-based tomography solvers while being substantially faster. https://github.com/darglein/NeAT"}}
{"id": "JNa97FquMj", "cdate": 1640995200000, "mdate": 1683879149539, "content": {"title": "NeAT: Neural Adaptive Tomography", "abstract": "In this paper, we present Neural Adaptive Tomography (NeAT), the first adaptive, hierarchical neural rendering pipeline for multi-view inverse rendering. Through a combination of neural features with an adaptive explicit representation, we achieve reconstruction times far superior to existing neural inverse rendering methods. The adaptive explicit representation improves efficiency by facilitating empty space culling and concentrating samples in complex regions, while the neural features act as a neural regularizer for the 3D reconstruction. The NeAT framework is designed specifically for the tomographic setting, which consists only of semi-transparent volumetric scenes instead of opaque objects. In this setting, NeAT outperforms the quality of existing optimization-based tomography solvers while being substantially faster."}}
{"id": "4QUHkjGr0Nm", "cdate": 1640995200000, "mdate": 1683879149626, "content": {"title": "Neural Adaptive Scene Tracing (NAScenT)", "abstract": ""}}
{"id": "30bLgUUmje", "cdate": 1640995200000, "mdate": 1683879149624, "content": {"title": "Rethinking Learning-based Demosaicing, Denoising, and Super-Resolution Pipeline", "abstract": "Imaging is usually a mixture problem of incomplete color sampling, noise degradation, and limited resolution. This mixture problem is typically solved by a sequential solution that applies demosaicing (DM), denoising (DN), and super-resolution (SR) sequentially in a fixed and predefined pipeline (execution order of tasks), DM→DN→SR. The most recent work on image processing focuses on developing more sophisticated architectures to achieve higher image quality. Little attention has been paid to the design of the pipeline, and it is still not clear how significant the pipeline is to image quality. In this work, we comprehensively study the effects of pipelines on the mixture problem of learning-based DN, DM, and SR, in both sequential and joint solutions. On the one hand, in sequential solutions, we find that the pipeline has a non-trivial effect on the resulted image quality. Our suggested pipeline DN→SR→DM yields consistently better performance than other sequential pipelines in various experimental settings and benchmarks. On the other hand, in joint solutions, we propose an end-to-end Trinity Pixel Enhancement NETwork (TENet) that achieves the state-of-the-art performance for the mixture problem. We further present a novel and simple method that can integrate a certain pipeline into a given end-to-end network by providing intermediate supervision using a detachable head. Extensive experiments show that an end-to-end network with the proposed pipeline can attain only a consistent but insignificant improvement. Our work indicates that the investigation of pipelines is applicable in sequential solutions, but is not very necessary in end-to-end networks."}}
{"id": "uV8H-0IHyWk", "cdate": 1577836800000, "mdate": 1683879149672, "content": {"title": "Stereo Event-Based Particle Tracking Velocimetry for 3D Fluid Flow Reconstruction", "abstract": "Existing Particle Imaging Velocimetry techniques require the use of high-speed cameras to reconstruct time-resolved fluid flows. These cameras provide high-resolution images at high frame rates, which generates bandwidth and memory issues. By capturing only changes in the brightness with a very low latency and at low data rate, event-based cameras have the ability to tackle such issues. In this paper, we present a new framework that retrieves dense 3D measurements of the fluid velocity field using a pair of event-based cameras. First, we track particles inside the two event sequences in order to estimate their 2D velocity in the two sequences of images. A stereo-matching step is then performed to retrieve their 3D positions. These intermediate outputs are incorporated into an optimization framework that also includes physically plausible regularizers, in order to retrieve the 3D velocity field. Extensive experiments on both simulated and real data demonstrate the efficacy of our approach."}}
{"id": "P7V9OzCOM6", "cdate": 1451606400000, "mdate": 1683879149631, "content": {"title": "A High-Speed Digital True Random Number Generator Based on Cross Ring Oscillator", "abstract": ""}}
