{"id": "c3hamOSuCJ", "cdate": 1640995200000, "mdate": 1669133829657, "content": {"title": "Unsupervised Pose-aware Part Decomposition for Man-Made Articulated Objects", "abstract": "Man-made articulated objects exist widely in the real world. However, previous methods for unsupervised part decomposition are unsuitable for such objects because they assume a spatially fixed part location, resulting in inconsistent part parsing. In this paper, we propose PPD (unsupervised Pose-aware Part Decomposition) to address a novel setting that explicitly targets man-made articulated objects with mechanical joints, considering the part poses in part parsing. As an analysis-by-synthesis approach, We show that category-common prior learning for both part shapes and poses facilitates the unsupervised learning of (1) part parsing with abstracted part shapes, and (2) part poses as joint parameters under single-frame shape supervision. We evaluate our method on synthetic and real datasets, and we show that it outperforms previous works in consistent part parsing of the articulated objects based on comparable part pose estimation performance to the supervised baseline."}}
{"id": "dLDzuxaN0Hd", "cdate": 1632875514712, "mdate": null, "content": {"title": "Unsupervised Pose-Aware Part Decomposition for 3D Articulated Objects", "abstract": "Articulated objects exist widely in the real world. However, previous 3D generative methods for unsupervised part decomposition are unsuitable for such objects, because they assume a spatially fixed part location, resulting in inconsistent part parsing. In this paper, we propose PPD (unsupervised Pose-aware Part Decomposition) to address a novel setting that explicitly targets man-made articulated objects with mechanical joints, considering the part poses. We show that category-common prior learning for both part shapes and poses facilitates the unsupervised learning of (1) part decomposition with non-primitive-based implicit representation, and (2) part pose as joint parameters under single-frame shape supervision. We evaluate our method on synthetic and real datasets, and we show that it outperforms previous works in consistent part parsing of the articulated objects based on comparable part pose estimation performance to the supervised baseline."}}
{"id": "SOUkWCPT1X", "cdate": 1577836800000, "mdate": 1669133829664, "content": {"title": "Neural Star Domain as Primitive Representation", "abstract": "Reconstructing 3D objects from 2D images is a fundamental task in computer vision. Acurate structured reconstruction by parsimonious and semantic primitive representation further broadens its application. When reconstructing a target shape with multiple primitives, it is preferable that one can instantly access the union of basic properties of the shape such as collective volume and surface, treating the primitives as if they are one single shape. This becomes possible by primitive representation with unified implicit and explicit representations. However, primitive representations in current approaches do not satisfy all of the above requirements at the same time. To solve this problem, we propose a novel primitive representation named neural star domain (NSD) that learns primitive shapes in the star domain. We show that NSD is a universal approximator of the star domain and is not only parsimonious and semantic but also an implicit and explicit shape representation. We demonstrate that our approach outperforms existing methods in image reconstruction tasks, semantic capabilities, and speed and quality of sampling high-resolution meshes."}}
{"id": "JuiV07DjCkI", "cdate": 1514764800000, "mdate": 1669133829660, "content": {"title": "Ensemble convolutional neural networks for pose estimation", "abstract": ""}}
{"id": "TXxwtpLYgI", "cdate": 1483228800000, "mdate": 1669133829656, "content": {"title": "Occluded Appearance Modeling with Sample Weighting for Human Pose Estimation", "abstract": ""}}
{"id": "oURJPoIMTz", "cdate": 1420070400000, "mdate": 1669133829647, "content": {"title": "Occlusion-free appearance modeling of body parts for human pose estimation", "abstract": ""}}
{"id": "15v8O2cQAF8", "cdate": 1420070400000, "mdate": 1669133829664, "content": {"title": "Occlusion-robust model learning for human pose estimation", "abstract": ""}}
