{"id": "lLsAMcXub1", "cdate": 1701388800000, "mdate": 1705146192638, "content": {"title": "Exploring the potential of channel interactions for image restoration", "abstract": ""}}
{"id": "-trvRfDAsdX", "cdate": 1693526400000, "mdate": 1699142491663, "content": {"title": "PSNet: Towards Efficient Image Restoration With Self-Attention", "abstract": "Image restoration aims to recover a clean image from various degradations, <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">e.g.,</i> haze, snow, and blur, playing an important role in robot vision, autonomous vehicles, and medical imaging. Recently, the use of Transformer has witnessed a significant improvement in multifarious image restoration tasks. However, despite a few remedies to reduce the quadratic complexity of self-attention, these approaches are still impractical for real-world applications, which need high efficiency and speed. To ameliorate this issue, we propose an efficient framework for image restoration based on self-attention. To this end, we combine the strengths of patch-based and strip-based self-attention units to improve efficiency. More specifically, we apply self-attention of different operation scales to features of different resolutions, i.e., we adopt a relatively smaller region for self-attention on high-resolution features while a larger region for low-restoration features. In addition, instead of using global self-attention in each partitioned region, we leverage a strip-based version for low complexity. To further improve efficiency, we insert our design into a U-shaped CNN network to establish our framework, dubbed PSNet. Extensive experiments demonstrate that our network receives state-of-the-art performance on five representative image restoration tasks with low computational complexity and high speed, including single-image defocus deblurring, image dehazing, image motion deblurring, image desnowing, and image denoising."}}
{"id": "p_1nfz1eQ4", "cdate": 1672531200000, "mdate": 1699142491670, "content": {"title": "Dual-Domain Attention for Image Deblurring", "abstract": "As a long-standing and challenging task, image deblurring aims to reconstruct the latent sharp image from its degraded counterpart. In this study, to bridge the gaps between degraded/sharp image pairs in the spatial and frequency domains simultaneously, we develop the dual-domain attention mechanism for image deblurring. Self-attention is widely used in vision tasks, however, due to the quadratic complexity, it is not applicable to image deblurring with high-resolution images. To alleviate this issue, we propose a novel spatial attention module by implementing self-attention in the style of dynamic group convolution for integrating information from the local region, enhancing the representation learning capability and reducing computational burden. Regarding frequency domain learning, many frequency-based deblurring approaches either treat the spectrum as a whole or decompose frequency components in a complicated manner. In this work, we devise a frequency attention module to compactly decouple the spectrum into distinct frequency parts and accentuate the informative part with extremely lightweight learnable parameters. Finally, we incorporate attention modules into a U-shaped network. Extensive comparisons with prior arts on the common benchmarks show that our model, named Dual-domain Attention Network (DDANet), obtains comparable results with a significantly improved inference speed."}}
{"id": "W3IeBcl5ByF", "cdate": 1672531200000, "mdate": 1699142491660, "content": {"title": "Selective Frequency Network for Image Restoration", "abstract": ""}}
{"id": "H_Anci-j1WZ", "cdate": 1672531200000, "mdate": 1699142491676, "content": {"title": "Strip Attention for Image Restoration", "abstract": "As a long-standing task, image restoration aims to recover the latent sharp image from its degraded counterpart. In recent years, owing to the strong ability of self-attention in capturing long-range dependencies, Transformer based methods have achieved promising performance on multifarious image restoration tasks. However, the canonical self-attention leads to quadratic complexity with respect to input size, hindering its further applications in image restoration. In this paper, we propose a Strip Attention Network (SANet) for image restoration to integrate information in a more efficient and effective manner. Specifically, a strip attention unit is proposed to harvest the contextual information for each pixel from its adjacent pixels in the same row or column. By employing this operation in different directions, each location can perceive information from an expanded region. Furthermore, we apply various receptive fields in different feature groups to enhance representation learning. Incorporating these designs into a U-shaped backbone, our SANet performs favorably against state-of-the-art algorithms on several image restoration tasks. The code is available at https://github.com/c-yn/SANet."}}
{"id": "5jJnoxfAGG", "cdate": 1672531200000, "mdate": 1699142491687, "content": {"title": "IRNeXt: Rethinking Convolutional Network Design for Image Restoration", "abstract": "We present IRNeXt, a simple yet effective convolutional network architecture for image restoration. Recently, Transformer models have dominated the field of image restoration due to the powerful ab..."}}
{"id": "tyZ1ChGZIKO", "cdate": 1663850536141, "mdate": null, "content": {"title": "Selective Frequency Network for Image Restoration", "abstract": "Image restoration aims to reconstruct the latent sharp image from its corrupted counterpart. Besides dealing with this long-standing task in the spatial domain, a few approaches seek solutions in the frequency domain in consideration of the large discrepancy between spectra of sharp/degraded image pairs. However, these works commonly utilize transformation tools, e.g., wavelet transform, to split features into several frequency parts, which is not flexible enough to select the most informative frequency component to recover. In this paper, we exploit a multi-branch and content-aware module to decompose features into separate frequency subbands dynamically and locally, and then accentuate the useful ones via channel-wise attention weights. In addition, to handle large-scale degradation blurs, we propose an extremely simple decoupling and modulation module to enlarge the receptive field via global and window-based average pooling. Integrating two developed modules into a U-Net backbone, the proposed Selective Frequency Network (SFNet) performs favorably against state-of-the-art algorithms on five image restoration tasks, including single-image defocus deblurring, image dehazing, image motion deblurring, image desnowing, and image deraining."}}
