{"id": "t3kPbr5NAk", "cdate": 1672531200000, "mdate": 1681523997099, "content": {"title": "Robust Dynamic Radiance Fields", "abstract": ""}}
{"id": "fU5ouyw6LU", "cdate": 1672531200000, "mdate": 1681523997102, "content": {"title": "360MVSNet: Deep Multi-view Stereo Network with 360° Images for Indoor Scene Reconstruction", "abstract": ""}}
{"id": "PHVv1ugGuD", "cdate": 1672531200000, "mdate": 1681490137049, "content": {"title": "Physically Plausible Animation of Human Upper Body from a Single Image", "abstract": ""}}
{"id": "49An32KVcR", "cdate": 1672531200000, "mdate": 1695368644840, "content": {"title": "NeighborTrack: Single Object Tracking by Bipartite Matching with Neighbor Tracklets and Its Applications to Sports", "abstract": "We propose a post-processor, called NeighborTrack, that leverages neighbor information of the tracking target to validate and improve single-object tracking (SOT) results. It requires no additional data or retraining. Instead, it uses the confidence score predicted by the backbone SOT network to automatically derive neighbor information and then uses this information to improve the tracking results. When tracking an occluded target, its appearance features are untrustworthy. However, a general siamese network often cannot tell whether the tracked object is occluded by reading the confidence score alone, because it could be misled by neighbors with high confidence scores. Our proposed NeighborTrack takes advantage of unoccluded neighbors’ information to reconfirm the tracking target and reduces false tracking when the target is occluded. For the VOT challenge dataset commonly used in short-term object tracking, we improve three famous SOT networks, Ocean, TransT, and OSTrack, by an average of 1.92% EAO and 2.11% robustness. For the mid- and long-term tracking experiments based on OSTrack, we achieve state-of-the-art 72.25% AUC on LaSOT and 75.7% AO on GOT-10K. Most of the tracking examples we have used are related to sports."}}
{"id": "t3iJiVPbYk", "cdate": 1667581162131, "mdate": 1667581162131, "content": {"title": "Multi-Resolution Shared Representative Filtering for Real-Time Depth Completion", "abstract": "We present shared representative filtering for real-time high-resolution depth completion with RGB-D sensors. Conventional filtering-based methods face a dilemma when the missing regions of the depth map are large. When the filter window is small, the filter fails to include enough samples. On the other hand, when the window is large, the method could oversmooth depth boundaries due to the error introduced by the extra samples. Our method adapts the filter kernels to the shape of the missing regions to collect a sufficient number of samples while avoiding oversmoothing. We collect depth samples by searching for a small set of similar pixels, which we call the representatives, using an efficient line search algorithm. We then combine the representatives using a joint bilateral weight. Experiments show that our method can filter a high-resolution depth map within a few milliseconds while outperforming previous filtering-based methods on both real-world and synthetic data in terms of both efficiency and accuracy, especially when dealing with large missing regions in depth maps."}}
{"id": "qDzGOAEY3c", "cdate": 1667581007225, "mdate": 1667581007225, "content": {"title": "Learning to Cluster for Rendering with Many Lights", "abstract": "We present an unbiased online Monte Carlo method for rendering with many lights. Our method adapts both the hierarchical light clustering and the sampling distribution to our collected samples. Designing such a method requires us to make clustering decisions under noisy observation, and mak- ing sure that the sampling distribution adapts to our target. Our method is based on two key ideas: a coarse-to-fine clustering scheme that can find good clustering configurations even with noisy samples, and a discrete stochastic successive approximation method that starts from a prior distribution and provably converges to a target distribution. We compare to other state-of- the-art light sampling methods, and show better results both numerically and visually."}}
{"id": "xvqgZEWbp9j", "cdate": 1640995200000, "mdate": 1681490137119, "content": {"title": "Physically Plausible Animation of Human Upper Body from a Single Image", "abstract": ""}}
{"id": "t4mH_vOVp1I", "cdate": 1640995200000, "mdate": 1681523997100, "content": {"title": "ScannerNet: A Deep Network for Scanner-Quality Document Images under Complex Illumination", "abstract": ""}}
{"id": "YshDsVBSvR", "cdate": 1640995200000, "mdate": 1681523997101, "content": {"title": "SearchTrack: Multiple Object Tracking with Object-Customized Search and Motion-Aware Features", "abstract": ""}}
{"id": "V6i83NYakMk", "cdate": 1640995200000, "mdate": 1681523997100, "content": {"title": "StyleFaceUV: a 3D Face UV Map Generator for View-Consistent Face Image Synthesis", "abstract": ""}}
