{"id": "g3Oee0ARWr", "cdate": 1698796800000, "mdate": 1699157735344, "content": {"title": "Object Affinity Learning: Towards Annotation-Free Instance Segmentation", "abstract": "We address the problem of annotation-free instance segmentation in the wild, aiming to relieve the expensive cost of manual mask annotations. Existing approaches utilize appearance cues, such as color, edge, and texture information, to generate pseudo masks for instance segmentation. However, due to the ambiguity of defining an object by visual appearance alone, these methods fail to distinguish objects from the background under complex scenes. Beyond visual cues, objects are one-piece in space and move together over time, which indicates that geometry cues, such as spatial continuity and motion consistency, are also exploitable for this problem. To directly utilize geometry cues, we propose an affinity-based paradigm for annotation-free instance segmentation. The new paradigm is called <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">object affinity learning</i> , a proxy task of annotation-free instance segmentation, which aims to tell whether two pixels come from the same object by learning feature representation from geometry cues. During inference, the learned object affinity could be further converted into instance segmentation masks by some graph partition algorithms. The proposed object affinity learning achieves much better instance segmentation performance than existing pseudo-mask-based methods on the large-scale Waymo Open Dataset and KITTI dataset."}}
{"id": "j2Yhrj3h6v", "cdate": 1672531200000, "mdate": 1681554485992, "content": {"title": "FrustumFormer: Adaptive Instance-aware Resampling for Multi-view 3D Detection", "abstract": ""}}
{"id": "eQfuHqEsUj", "cdate": 1652737286736, "mdate": null, "content": {"title": "4D Unsupervised Object Discovery", "abstract": "Object discovery is a core task in computer vision. While fast progresses have been made in supervised object detection, its unsupervised counterpart remains largely unexplored. With the growth of data volume, the expensive cost of annotations is the major limitation hindering further study.  Therefore, discovering objects without annotations has great significance. However, this task seems impractical on still-image or point cloud alone due to the lack of discriminative information. Previous studies underlook the crucial temporal information and constraints naturally behind multi-modal inputs. In this paper, we propose 4D unsupervised object discovery, jointly discovering objects from 4D data -- 3D point clouds and 2D RGB images with temporal information. We present the first practical approach for this task by proposing a ClusterNet on 3D point clouds, which is jointly iteratively optimized with a 2D localization network. Extensive experiments on the large-scale Waymo Open Dataset suggest that the localization network and ClusterNet achieve competitive performance on both class-agnostic 2D object detection and 3D instance segmentation, bridging the gap between unsupervised methods and full supervised ones. Codes and models will be made available at https://github.com/Robertwyq/LSMOL."}}
{"id": "fcRX4-69_j6", "cdate": 1640995200000, "mdate": 1681554486259, "content": {"title": "Emergence of Machine Language: Towards Symbolic Intelligence with Neural Networks", "abstract": ""}}
{"id": "PlbRoLQ3268", "cdate": 1640995200000, "mdate": 1681554486591, "content": {"title": "4D Unsupervised Object Discovery", "abstract": ""}}
