{"id": "okqvDmW01o", "cdate": 1707451179078, "mdate": 1707451179078, "content": {"title": "Arithmetic Sampling: Parallel Diverse Decoding for Large Language Models", "abstract": "Decoding methods for large language models\noften trade-off between diversity of outputs\nand parallelism of computation. Methods such\nas beam search and Gumbel top-k sampling\ncan guarantee a different output for each\nelement of the beam, but are not easy to\nparallelize. Alternatively, methods such as\ntemperature sampling and its modifications (top-k\nsampling, nucleus sampling, typical decoding,\nand others), are embarrassingly parallel, but have\nno guarantees about duplicate samples. We\npresent a framework for sampling according\nto an arithmetic code book implicitly defined\nby a large language model, compatible with\ncommon sampling variations, with provable beam\ndiversity under certain conditions, as well as being\nembarrassingly parallel and providing unbiased\nand consistent expectations from the original\nmodel. We demonstrate the effectiveness of\nour approach on WMT machine translation,\nmore than halving the standard deviation when\nestimating expected BLEU score reward, and\nclosing the BLEU score gap between independent\nsampling and beam search by up to 63%."}}
{"id": "VVb9Y0G6yE6", "cdate": 1672531200000, "mdate": 1680027549686, "content": {"title": "Pre-computed memory or on-the-fly encoding? A hybrid approach to retrieval augmentation makes the most of your compute", "abstract": ""}}
{"id": "22fS67Cr_L", "cdate": 1672531200000, "mdate": 1680027549686, "content": {"title": "CoLT5: Faster Long-Range Transformers with Conditional Computation", "abstract": ""}}
{"id": "c3fGYw5BF1", "cdate": 1640995200000, "mdate": 1680027549692, "content": {"title": "Mention Memory: incorporating textual knowledge into Transformers through entity mention attention", "abstract": ""}}
{"id": "aZsyr4W4cFe", "cdate": 1640995200000, "mdate": 1680027549691, "content": {"title": "Generate-and-Retrieve: use your predictions to improve retrieval for semantic parsing", "abstract": ""}}
{"id": "Q_6znv4njaM", "cdate": 1640995200000, "mdate": 1680027549688, "content": {"title": "Generate-and-Retrieve: Use Your Predictions to Improve Retrieval for Semantic Parsing", "abstract": ""}}
{"id": "Hczd0N2a2b", "cdate": 1640995200000, "mdate": 1680027549693, "content": {"title": "Arithmetic Sampling: Parallel Diverse Decoding for Large Language Models", "abstract": ""}}
{"id": "GvfDps1ygXE", "cdate": 1640995200000, "mdate": 1680027549699, "content": {"title": "FiDO: Fusion-in-Decoder optimized for stronger performance and faster inference", "abstract": ""}}
{"id": "OY1A8ejQgEX", "cdate": 1632875543767, "mdate": null, "content": {"title": "Mention Memory: incorporating textual knowledge into Transformers through entity mention attention", "abstract": "Natural language understanding tasks such as open-domain question answering often require retrieving and assimilating factual information from multiple sources. We propose to address this problem by integrating a semi-parametric representation of a large text corpus into a Transformer model as a source of factual knowledge. \nSpecifically, our method represents knowledge with ``mention memory'', a table of dense vector representations of every entity mention in a corpus. The proposed model - TOME - is a Transformer that accesses the information through internal memory layers in which each entity mention in the input passage attends to the mention memory. This approach enables synthesis of and reasoning over many disparate sources of information within a single Transformer model. \nIn experiments using a memory of 150 million Wikipedia mentions, TOME achieves strong  performance on several open-domain knowledge-intensive tasks, including the claim verification benchmarks HoVer and FEVER and several entity-based QA benchmarks. We also show that the model learns to attend to informative mentions without any direct supervision.  Finally we demonstrate that the model can generalize to new unseen entities by updating the memory without retraining."}}
{"id": "SqpBeckqCO", "cdate": 1609459200000, "mdate": 1680027549726, "content": {"title": "ReadTwice: Reading Very Large Documents with Memories", "abstract": ""}}
