{"id": "rf9UWlu7IR", "cdate": 1672531200000, "mdate": 1699240482144, "content": {"title": "BAProto: Boundary-Aware Prototype for High-quality Instance Segmentation", "abstract": "To date, the boundary quality remains unsatisfactory in instance segmentation, resulting in increasing attention to the mask refinement mechanism. Such a mechanism is supposed to be accurate, efficient and generic to the existing models. Yet, few methods met the three factors simultaneously. In this paper, to address this issue, we propose a Boundary-Aware Prototype (BAProto) for boundary refinement, which conducts pixel-wise prediction through the similarity of boundary representation and the specific prototype. Such a prototype is obtained by a memory unit for comprehensive learning. To our best knowledge, BAProto is the first approach that satisfies the above three factors at the same time. In particular, we elaborately design a three-phase segmentation loss, focusing on the learning of different regions to extract discriminating boundary representations for prototype establishment. Extensive experimental results show that BAProto is precise, efficient and model-agnostic on COCO and Cityscapes datasets."}}
{"id": "FvjHdwF_d9", "cdate": 1672531200000, "mdate": 1699240482150, "content": {"title": "FGNet: Towards Filling the Intra-class and Inter-class Gaps for Few-shot Segmentation", "abstract": "Current few-shot segmentation (FSS) approaches have made tremendous achievements based on prototypical learning techniques. However, due to the scarcity of the support data provided, FSS methods still suffer from the intra-class and inter-class gaps. In this paper, we propose a uniform network to fill both the gaps, termed FGNet. It consists of the novel design of a Self-Adaptive Module (SAM) to emphasize the query feature to generate an enhanced prototype for self-alignment. Such a prototype caters to each query sample itself since it contains the underlying intra-instance information, which gets around the intra-class appearance gap. Moreover, we design an Inter-class Feature Separation Module (IFSM) to separate the feature space of the target class from other classes, which contributes to bridging the inter-class gap. In addition, we present several new losses and a method termed B-SLIC, which help to further enhance the separation performance of FGNet. Experimental results show that FGNet reduces both the gaps for FSS by SAM and IFSM respectively, and achieves state-of-the-art performances on both PASCAL-5i and COCO-20i datasets compared with previous top-performing approaches."}}
{"id": "LlfM4SYOZS", "cdate": 1640995200000, "mdate": 1683983375689, "content": {"title": "BSOLO: Boundary-Aware One-Stage Instance Segmentation SOLO", "abstract": "Current one-stage instance segmentation methods ignore the boundary information of masks, resulting in coarse masks that are far from the ground truth. In this paper, we propose a boundary-aware method to refine boundary information, called BSOLO. The core idea of BSOLO is to design a Hungarian-Algorithm-based boundary loss to calculate matching costs between boundaries. This loss effectively measures the difference between boundaries and suits for boundary regression, contributing to generating refined instance masks with high-quality boundaries. Besides, we propose a Feature Fusion Network (FFN) to capture long-range dependency. Through constructing the relationship between pixels, such a module is beneficial for predicting masks with large or uncontinuous region. Furthermore, we introduce a Prototype Attention Module (PAM) for mask assembling through channel attention, which enhances informative features and spotlights important prototypes. To evaluate the performance of BSOLO, we conduct extensive experiments. Experimental results show that BSOLO achieves 39.3 AP on MS COCO test-dev2017, outperforming SOLO and other methods by a large margin. We hope that BSOLO broadens the perspective for designing more valid boundary constraints."}}
{"id": "I2WMdkC3h7", "cdate": 1609459200000, "mdate": 1699240482147, "content": {"title": "A novel deep auto-encoder considering energy and label constraints for categorization", "abstract": ""}}
