{"id": "_X49MumiKW1", "cdate": 1704067200000, "mdate": 1707793510639, "content": {"title": "Leveraging spatial residual attention and temporal Markov networks for video action understanding", "abstract": ""}}
{"id": "xiqfP9Ky9u", "cdate": 1690848000000, "mdate": 1707793482042, "content": {"title": "Active Learning With Co-Auxiliary Learning and Multi-Level Diversity for Image Classification", "abstract": "Due to the fact that it is expensive and time-consuming to annotate a large amount of data, the available labeled data to train a deep neural network is usually scarce, resulting in the poor performance of the deep classification network in most cases. In this paper, we propose a novel active learning method to train a competitive deep classification neural network by labeling a limited amount of diverse images. The proposed method advances most of the active learning methods in two aspects. First, active learning is enhanced with a co-auxiliary learning strategy. We use an auxiliary network to provide diverse pseudo-labels for the primary network. The auxiliary network is also adopted to remove a part of redundancy information from the candidate pool of active learning when image predictions of the primary network and the auxiliary network are the same. Meanwhile, the primary network can also provide pseudo-labels to improve the performance of the auxiliary network. Second, we further remove the redundancy within the query samples with multi-level diversity selection. The multi-level diversity strategy not only considers the feature-level diversity but also the class-level diversity with the predictions of the primary network, and it can select both representative and uncertain samples effectively and efficiently from the large-scale data. The extensive experiments on four large-scale datasets show that the proposed method outperforms the state-of-the-art methods."}}
{"id": "ayZ5MtbY-b", "cdate": 1680307200000, "mdate": 1707793482040, "content": {"title": "Coherence-aware context aggregator for fast video object segmentation", "abstract": ""}}
{"id": "sYqmZlRBpee", "cdate": 1640995200000, "mdate": 1670138936807, "content": {"title": "Multi-marginal Contrastive Learning for Multilabel Subcellular Protein Localization", "abstract": "Protein subcellular localization(PSL) is an important task to study human cell functions and cancer pathogenesis. It has attracted great attention in the computer vision community. However, the huge size of immune histochemical (IHC) images, the disorganized location distribution in different tissue images and the limited training images are always the challenges for the PSL to learn a strong generalization model with deep learning. In this paper, we propose a deep protein subcellular localization method with multi-marginal contrastive learning to perceive the same PSLs in different tissue images and different PSLs within the same tissue image. In the proposed method, we learn the representation of an IHC image by fusing the global features from the downsampled images and local features from the selected patches with the activation map to tackle the oversize of an IHC image. Then a multi-marginal attention mechanism is proposed to generate contrastive pairs with different margins and improve the discriminative features of PSL patterns effectively. Finally, the ensemble prediction of each IHC image is obtained with different patches. The results on the benchmark datasets show that the proposed method achieves significant improvements for the PSL task."}}
{"id": "gPu_6LQrtrI", "cdate": 1640995200000, "mdate": 1670138936829, "content": {"title": "Self-Guided Network for Fine-Grained Object Localization Using Weakly Supervised Learning", "abstract": "Weakly supervised object localization (WSOL) aims at pre-dicting the location of objects with image-level labels. Fine-grained WSOL task has its characteristic challenge compared with generic object localization. The structural information of the objects in fine-grained benchmark has little relevance to class. Previous WSOL works mainly focus on learning the most class discriminative parts recursively, leading to se-rious structural feature missing issue. In this paper, we pro-pose a self-guided network (SGN) which consists of two branch deep classification networks. It adopts a coarse-to-fine strategy to detect the structural information of the ob-ject. First, we devise a self-adaptive method (SAM) to de-tect the most body structure of the object by directly leveraging the feature recognition ability of the first classifier. Then, an object structure generation (OSG) method is proposed in the fine localization phase. OSG helps the second classifier to learn the boundary feature of the object with less back-ground noise. Extensive experiments on four well-known fine-grained benchmarks, including CUB, FGVC Aircraft, Stanford Dogs, and Stanford Cars show that the proposed SGN outperforms the state-of-the-art WSOL methods."}}
{"id": "_Izsv5WnjwO", "cdate": 1640995200000, "mdate": 1670138936828, "content": {"title": "Self-paced Supervision for Multi-source Domain Adaptation", "abstract": "Multi-source domain adaptation has attracted great attention in machine learning community. Most of these methods focus on weighting the predictions produced by the adaptation networks of different domains. Thus the domain shifts between certain of domains and target domain are not effectively relieved, resulting in that these domains are not fully exploited and even may have a negative influence on multi-source domain adaptation task. To address such challenge, we propose a multi-source domain adaptation method to gradually improve the adaptation ability of each source domain by producing more high-confident pseudo-labels with self-paced learning for conditional distribution alignment. The proposed method first trains several separate domain branch networks with single domains and an ensemble branch network with all domains. Then we obtain some high-confident pseudo-labels with the branch networks and learn the branch specific pseudo-labels with self-paced learning. Each branch network reduces the domain gap by aligning the conditional distribution with its branch specific pseudo-labels and the pseudo-labels provided by all branch networks. Experiments on Office31, Office-Home and DomainNet show that the proposed method outperforms the state-of-the-art methods."}}
{"id": "h-KshIqCrw4", "cdate": 1609459200000, "mdate": 1670138936806, "content": {"title": "Incorporating Distribution Matching into Uncertainty for Multiple Kernel Active Learning", "abstract": "Due to the lack of the labeled data and the complex structures of various data, it is very hard to learn the uncertainty and representativeness accurately in active learning. In this paper, we propose a multiple kernel active learning framework that incorporates a group regularizer of distribution information into the estimation of uncertainty. The proposed method takes the advantage of multiple kernel learning to learn the kernel space in which the complex structures can be well captured by kernel weights. Meanwhile, we have developed an efficient optimization algorithm to solve the proposed method. Experimental results on twelve UCI benchmark data sets and eight subsets of ImageNet show that the proposed method outperforms several state-of-the-art active learning methods. Moreover, we also have applied the proposed method to multiple feature scenario on Caltech101, and the promising results are also obtained compared with single feature scenario."}}
{"id": "hMTpg1IE0l", "cdate": 1577836800000, "mdate": 1670138936805, "content": {"title": "Domain Adaptation With Neural Embedding Matching", "abstract": "Domain adaptation aims to exploit the supervision knowledge in a source domain for learning prediction models in a target domain. In this article, we propose a novel representation learning-based domain adaptation method, i.e., neural embedding matching (NEM) method, to transfer information from the source domain to the target domain where labeled data is scarce. The proposed approach induces an intermediate common representation space for both domains with a neural network model while matching the embedding of data from the two domains in this common representation space. The embedding matching is based on the fundamental assumptions that a cross-domain pair of instances will be close to each other in the embedding space if they belong to the same class category, and the local geometry property of the data can be maintained in the embedding space. The assumptions are encoded via objectives of metric learning and graph embedding techniques to regularize and learn the semisupervised neural embedding model. We also provide a generalization bound analysis for the proposed domain adaptation method. Meanwhile, a progressive learning strategy is proposed and it improves the generalization ability of the neural network gradually. Experiments are conducted on a number of benchmark data sets and the results demonstrate that the proposed method outperforms several state-of-the-art domain adaptation methods and the progressive learning strategy is promising."}}
{"id": "SkN7GVf_bS", "cdate": 1514764800000, "mdate": null, "content": {"title": "Matrix completion with Preference Ranking for Top-N Recommendation", "abstract": "Matrix completion has become a popular method for top-N recommendation due to the low rank nature of sparse rating matrices. However, many existing methods produce top-N recommendations by recovering a user-item matrix solely based on a low rank function or its relaxations, while ignoring other important intrinsic characteristics of the top-N recommendation tasks such as preference ranking over the items. In this paper, we propose a novel matrix completion method that integrates the low rank and preference ranking characteristics of recommendation matrix under a self-recovery model for top-N recommendation. The proposed method is formulated as a joint minimization problem and solved using an ADMM algorithm. We conduct experiments on E-commerce datasets. The experimental results show the proposed approach outperforms several state-of-the-art methods."}}
{"id": "ryVaxNzdbH", "cdate": 1483228800000, "mdate": null, "content": {"title": "On Gleaning Knowledge from Multiple Domains for Active Learning", "abstract": "How can a doctor diagnose new diseases with little historical knowledge, which are emerging over time? Active learning is a promising way to address the problem by querying the most informative samples. Since the diagnosed cases for new disease are very limited, gleaning knowledge from other domains (classical prescriptions) to prevent the bias of active leaning would be vital for accurate diagnosis. In this paper, a framework that attempts to glean knowledge from multiple domains for active learning by querying the most uncertain and representative samples from the target domain and calculating the importance weights for re-weighting the source data in a single unified formulation is proposed. The weights are optimized by both a supervised classifier and distribution matching between the source domain and target domain with maximum mean discrepancy. Besides, a multiple domains active learning method is designed based on the proposed framework as an example. The proposed method is verified with newsgroups and handwritten digits data recognition tasks, where it outperforms the state-of-the-art methods."}}
