{"id": "vKjS9B56yn", "cdate": 1640995200000, "mdate": 1679935075948, "content": {"title": "Can the Mathematical Correctness of Object Configurations Affect the Accuracy of Their Perception?", "abstract": ""}}
{"id": "Zj3a1oJ3_s", "cdate": 1609459200000, "mdate": 1679935075952, "content": {"title": "Compositional Embedding Models for Speaker Identification and Diarization with Simultaneous Speech From 2+ Speakers", "abstract": ""}}
{"id": "PvQvlTiyqb", "cdate": 1609459200000, "mdate": 1679935075978, "content": {"title": "Compositional Embeddings for Multi-Label One-Shot Learning", "abstract": ""}}
{"id": "IQDZ7jDwXgc", "cdate": 1609459200000, "mdate": 1679935076008, "content": {"title": "Compositional Affinity Propagation: When Clusters Have Compositional Structure", "abstract": ""}}
{"id": "ipqFLdvONL", "cdate": 1577836800000, "mdate": 1679935075920, "content": {"title": "How Does Label Noise Affect the Quality of Speaker Embeddings?", "abstract": ""}}
{"id": "_LcMgIi1y5", "cdate": 1577836800000, "mdate": 1679935075979, "content": {"title": "Toward Better Speaker Embeddings: Automated Collection of Speech Samples From Unknown Distinct Speakers", "abstract": ""}}
{"id": "ScTYO1cqcrd", "cdate": 1577836800000, "mdate": 1679935076006, "content": {"title": "Compositional embedding models for speaker identification and diarization with simultaneous speech from 2+ speakers", "abstract": ""}}
{"id": "1dHTRg9ZwZ", "cdate": 1577836800000, "mdate": 1679935075954, "content": {"title": "Compositional Embeddings for Multi-Label One-Shot Learning", "abstract": ""}}
{"id": "BJx-ZeSKDB", "cdate": 1569439736571, "mdate": null, "content": {"title": "Compositional Embeddings: Joint Perception and Comparison of Class Label Sets", "abstract": "We explore the idea of compositional set embeddings that can be used to infer not\njust a single class, but the set of classes associated with the input data (e.g., image,\nvideo, audio signal). This can be useful, for example, in multi-object detection in\nimages, or multi-speaker diarization (one-shot learning) in audio. In particular, we\ndevise and implement two novel models consisting of (1) an embedding function\nf trained jointly with a “composite” function g that computes set union opera-\ntions between the classes encoded in two embedding vectors; and (2) embedding\nf trained jointly with a “query” function h that computes whether the classes en-\ncoded in one embedding subsume the classes encoded in another embedding. In\ncontrast to prior work, these models must both perceive the classes associated\nwith the input examples, and also encode the relationships between different class\nlabel sets. In experiments conducted on simulated data, OmniGlot, and COCO\ndatasets, the proposed composite embedding models outperform baselines based\non traditional embedding approaches."}}
