{"id": "tRc7qzpJjz", "cdate": 1640995200000, "mdate": 1683625063193, "content": {"title": "A Variational Inequality Model for the Construction of Signals from Inconsistent Nonlinear Equations", "abstract": "Building up on classical linear formulations, we posit that a broad class of problems in signal synthesis and in signal recovery are reducible to the basic task of finding a point in a closed convex subset of a Hilbert space that satisfies a number of nonlinear equations involving firmly nonexpansive operators. We investigate this formalism in the case when, due to inaccurate modeling or perturbations, the nonlinear equations are inconsistent. A relaxed formulation of the original problem is proposed in the form of a variational inequality. The properties of the relaxed problem are investigated, and a provenly convergent block-iterative algorithm, whereby only blocks of the underlying firmly nonexpansive operators are activated at a given iteration, is devised to solve it. Numerical experiments illustrate robust recoveries in several signal and image processing applications."}}
{"id": "hAiXA9tfUf", "cdate": 1640995200000, "mdate": 1683625063210, "content": {"title": "Signal Recovery from Inconsistent Nonlinear Observations", "abstract": "We show that many nonlinear observation models in signal recovery can be represented using firmly nonexpansive operators. To address problems with inaccurate measurements, we propose solving a variational inequality relaxation which is guaranteed to possess solutions under mild conditions and which coincides with the original problem if it happens to be consistent. We then present an efficient algorithm for its solution, as well as numerical applications in signal and image recovery, including an experimental operator-theoretic method of promoting sparsity."}}
{"id": "e1chFbUs9N", "cdate": 1640995200000, "mdate": 1683625063198, "content": {"title": "Block-Activated Algorithms For Multicomponent Fully Nonsmooth Minimization", "abstract": "Under consideration are multicomponent minimization problems involving a separable nonsmooth convex function penalizing the components individually, and nonsmooth convex coupling terms penalizing linear mixtures of the components. We investigate the application of block-activated proximal algorithms for solving such problems, i.e., algorithms which, at each iteration, need to use only a block of the underlying functions, as opposed to all of them as in standard methods. For smooth coupling functions, several block-activated algorithms exist and they are well understood. By contrast, in the fully nonsmooth case, few block-activated methods are available and little effort has been devoted to assessing them. Our goal is to shed more light on the implementation, the features, and the behavior of these algorithms, compare their merits, and provide machine learning and image recovery experiments illustrating their performance."}}
{"id": "8iotkn-KSR", "cdate": 1609459200000, "mdate": 1683625063209, "content": {"title": "Reconstruction of functions from prescribed proximal points", "abstract": ""}}
{"id": "o-iju9kLbSi", "cdate": 1577836800000, "mdate": 1683625063212, "content": {"title": "A Fixed Point Framework for Recovering Signals from Nonlinear Transformations", "abstract": "We consider the problem of recovering a signal from nonlinear transformations, under convex constraints modeling a priori information. Standard feasibility and optimization methods are ill-suited to tackle this problem due to the nonlinearities. We show that, in many common applications, the transformation model can be associated with fixed point equations involving firmly nonexpansive operators. In turn, the recovery problem is reduced to a tractable common fixed point formulation, which is solved efficiently by a provably convergent, block-iterative algorithm. Applications to signal and image recovery are demonstrated. Inconsistent problems are also addressed."}}
{"id": "p7vxmOstsIS", "cdate": 1483228800000, "mdate": 1683625055401, "content": {"title": "Obstructions to convexity in neural codes", "abstract": ""}}
{"id": "rvDEKhfxFt", "cdate": 1451606400000, "mdate": 1683625055402, "content": {"title": "Analyzing multistationarity in chemical reaction networks using the determinant optimization method", "abstract": ""}}
