{"id": "w22mvGyIysy", "cdate": 1663850385466, "mdate": null, "content": {"title": "Synthetic Pre-Training Tasks for Neural Machine Translation", "abstract": "Pre-training is an effective technique for ensuring robust performance on a variety of machine learning tasks. It typically depends on large-scale crawled corpora that can result in toxic or biased models. Such data can also be problematic with respect to copyright, attribution, and privacy. Pre-training with synthetic tasks and data is a promising way of alleviating such concerns since no real-world information is ingested by the model. Our goal in this paper is to understand what makes for a good pre-trained model when using synthetic resources. We answer this question in the context of neural machine translation by considering two novel approaches to translation model pre-training. Our first approach studies the effect of pre-training on obfuscated data derived from a parallel corpus by mapping words to a vocabulary of `nonsense' tokens. Our second approach explores the effect of pre-training on procedurally generated synthetic parallel data that does not depend on any real human language corpus. Our empirical evaluation on multiple language pairs shows that, to a surprising degree, the benefits of pre-training can be realized even with obfuscated or purely synthetic parallel data. In our analysis, we consider the extent to which obfuscated and synthetic pre-training techniques can be used to mitigate the issue of hallucinated model toxicity."}}
{"id": "rlg032mVJc", "cdate": 1644604598511, "mdate": null, "content": {"title": "Weakly Supervised Contrastive Learning for Chest X-Ray Report Generation", "abstract": "Radiology report generation aims at generating descriptive text from radiology images automatically, which may present an opportunity to improve radiology reporting and interpretation. A typical setting consists of training encoder-decoder models on image-report pairs with a cross entropy loss, which struggles to generate informative sentences for clinical diagnoses since normal findings dominate the datasets. To tackle this challenge and encourage more clinically-accurate text outputs, we propose a novel weakly supervised contrastive loss for medical report generation. Experimental results demonstrate that our method benefits from contrasting target reports with incorrect but semantically-close ones. It outperforms previous work on both clinical correctness and text generation metrics for two public benchmarks."}}
{"id": "rJEjjoR9K7", "cdate": 1538087843292, "mdate": null, "content": {"title": "Learning Robust Representations by Projecting Superficial Statistics Out", "abstract": "Despite impressive performance as evaluated on i.i.d. holdout data, deep neural networks depend heavily on superficial statistics of the training data and are liable to break under distribution shift. For example, subtle changes to the background or texture of an image can break a seemingly powerful classifier. Building on previous work on domain generalization, we hope to produce a classifier that will generalize to previously unseen domains, even when domain identifiers are not available during training. This setting is challenging because the model may extract many distribution-specific (superficial) signals together with distribution-agnostic (semantic) signals. To overcome this challenge, we incorporate the gray-level co-occurrence matrix (GLCM) to extract patterns that our prior knowledge suggests are superficial: they are sensitive to the texture but unable to capture the gestalt of an image. Then we introduce two techniques for improving our networks' out-of-sample performance. The first method is built on the reverse gradient method that pushes our model to learn representations from which the GLCM representation is not predictable. The second method is built on the independence introduced by projecting the model's representation onto the subspace orthogonal to GLCM representation's.\nWe test our method on the battery of standard domain generalization data sets and, interestingly, achieve comparable or better performance as compared to other domain generalization methods that explicitly require samples from the target distribution for training."}}
{"id": "rkNxPGGO-r", "cdate": 1514764800000, "mdate": null, "content": {"title": "Leveraging Gloss Knowledge in Neural Word Sense Disambiguation by Hierarchical Co-Attention", "abstract": "It is well known in the literature studies that the theoretical time-optimal control of boost converters can be achieved using switching surfaces based on the converter&#x2019;s natural state trajectories. However, this method has two important drawbacks: First, the transient current peak of the time-optimal controller is far beyond the current limitations of related circuit elements in many practical cases. Second, switching based on the converter&#x2019;s natural trajectories has high computational complexity and high dependence on circuit parameters. In this paper, based on the hybrid dynamical model of the converter and geometrical representation of its corresponding vector fields, a proximate constrained time-optimal sliding mode controller is proposed. The proposed method has a fast response that is near that of a time-optimal controller, with less computational complexity and sensitivity to parameter changes. The proposed method and its relevant theoretical framework are validated on an experimental setup with a boost converter prototype and an eZdsp TMS320F2812 processor board."}}
{"id": "B1Z77BbuZB", "cdate": 1514764800000, "mdate": null, "content": {"title": "A Large-Scale Study of Mobile Search Examination Behavior", "abstract": "With the rapid growth of mobile web search, it is necessary and important to understand user's examination behavior on mobile devices in the absence of clicks. Previous studies used viewport metrics to estimate user's attention. However, there still lacks an in-depth understanding of how search users examine and interact with the mobile SERP. In this work, based on the large-scale real search log collected from a popular commercial mobile search engine, we present a comprehensive analysis of examination behavior. Specifically, we analyze the position bias, the relationship with click behavior, and examination's change as the session continues. The findings shed new light on the understanding of user's examination behavior, and also provide some implication for the improvement and evaluation of mobile search engine."}}
