{"id": "uX7MwOIez3", "cdate": 1683919326297, "mdate": 1683919326297, "content": {"title": "GCF: Generalized Causal Forest for Heterogeneous Treatment Effects Estimation in Online Marketplace", "abstract": "Uplift modeling is a rapidly growing approach that utilizes causal inference and machine learning methods to directly estimate the heterogeneous treatment effects. It has been widely applied to various online marketplaces to assist large-scale decision-making in recent years. The existing popular methods, like causal forest (CF), are limited to either discrete treatments or parametric assumptions on the outcome-treatment relationship that may suffer model misspecification. However, continuous treatments (e.g., discount, duration) often arise in marketplaces. To alleviate these restrictions, we use a kernel-based doubly robust estimator to recover the non-parametric dose-response functions that can flexibly model continuous treatment effects. Moreover, we propose a generic distance-based splitting criterion to capture the heterogeneity for the continuous treatments. We call the proposed algorithm generalized causal forest (GCF) as it generalizes the use case of CF to a much broader setting. We show the effectiveness of GCF by deriving the asymptotic property of the estimator and comparing it to popular uplift modeling methods on both synthetic and real-world datasets. We implement GCF on Spark and deploy it into DiDi's large scale online pricing system. Online A/B testing results further validate the superiority of GCF."}}
{"id": "8aaM-YV7ItB", "cdate": 1648695194080, "mdate": 1648695194080, "content": {"title": "GCF: Generalized Causal Forest for Heterogeneous Treatment Effect Estimation in Online Marketplace", "abstract": "Uplift modeling is a rapidly growing approach that utilizes machine learning and causal inference methods to estimate the heterogeneous treatment effects. It has been widely adopted and applied to online marketplaces to assist large-scale decision-making in recent years. The existing popular methods, like forest-based modeling, either work only for discrete treatments or make partially linear or parametric assumptions that may suffer from model misspecification. To alleviate these problems, we extend causal forest (CF) with non-parametric dose-response functions (DRFs) that can be estimated locally using a kernel-based doubly robust estimator. Moreover, we propose a distance-based splitting criterion in the functional space of conditional DRFs to capture the heterogeneity for the continuous treatments. We call the proposed algorithm generalized causal forest (GCF) as it generalizes the use case of CF to a much broader setup. We show the effectiveness of GCF by comparing it to popular uplift modeling models on both synthetic and real-world datasets. We implement GCF in Spark and successfully deploy it into DiDi's real-time pricing system. Online A/B testing results further validate the superiority of GCF."}}
{"id": "ugxdsne_TlO", "cdate": 1632875609460, "mdate": null, "content": {"title": "GCF: Generalized Causal Forest for Heterogeneous Treatment Effect Estimation Using Nonparametric Methods", "abstract": "Heterogeneous treatment effect (HTE) estimation with continuous treatment is essential in multiple disciplines, such as the online marketplace and pharmaceutical industry. The existing machine learning (ML) methods,  like forest-based modeling,  either work only for discrete treatments or make partially linear or parametric assumptions that may suffer from model misspecification. To alleviate these problems, we extend causal forest (CF) with non-parametric dose-response functions (DRFs) that can be estimated locally using kernel-based Double/Debiased ML estimators.  Moreover, we propose a distance-based splitting criterion in the functional space of Partial DRFs to capture the heterogeneity for continuous treatments. We call the proposed algorithm generalized causal forest (GCF) as it generalizes the use case of CF to a much broader setup. We show the effectiveness of GCF compared to SOTA on synthetic data and proprietary real-world data sets."}}
