{"id": "iBePgSM7UMh", "cdate": 1675209600000, "mdate": 1699227458483, "content": {"title": "Attention-Based Interrelation Modeling for Explainable Automated Driving", "abstract": "Automated driving desires better performance on tasks like motion planning and interacting with pedestrians in mixed-traffic environments. Deep learning algorithms can achieve high performance in these tasks with remarkable visual scene understanding and generalization abilities. However, when common scene-parsing methods are used to train end-to-end models, limitations of explainability in such algorithms inhibit their implementations in fully automated driving. The main challenges include algorithm performance deficiencies and inconsistencies, insufficient AI transparency, degraded user trust, and undermining human-AI interactions. This research aids the decision-making performance and transparency of automated driving systems by providing multi-modal explanations, especially when interacting with pedestrians. The proposed algorithm combines global visual features and interrelation features by parsing scene images as self-constructed graphs and using an attention-based module to capture the interrelationship among the ego-vehicle and other traffic-related objects. The output modules make decisions while simultaneously generating semantic text explanations. The results show that the fusion of the features from global frames and interrelational graphs improves decision-making and explanation predictions compared to two state-of-the-art benchmark algorithms. The interrelation module also enhances algorithm transparency by disclosing the visual attention used for decision-making. The importance of interrelation features on the two prediction tasks is further revealed along with the underlying mechanism of multitask learning on the datasets with hierarchical labels. The proposed model improves driving decision-making during pedestrian interactions with intelligible reasoning cues for building an appropriate mental model of automated driving performance for human users."}}
{"id": "Is9YWSMw-Ow", "cdate": 1672531200000, "mdate": 1699227458488, "content": {"title": "TrEP: Transformer-Based Evidential Prediction for Pedestrian Intention with Uncertainty", "abstract": "With rapid development in hardware (sensors and processors) and AI algorithms, automated driving techniques have entered the public’s daily life and achieved great success in supporting human driving performance. However, due to the high contextual variations and temporal dynamics in pedestrian behaviors, the interaction between autonomous-driving cars and pedestrians remains challenging, impeding the development of fully autonomous driving systems. This paper focuses on predicting pedestrian intention with a novel transformer-based evidential prediction (TrEP) algorithm. We develop a transformer module towards the temporal correlations among the input features within pedestrian video sequences and a deep evidential learning model to capture the AI uncertainty under scene complexities. Experimental results on three popular pedestrian intent benchmarks have verified the effectiveness of our proposed model over the state-of-the-art. The algorithm performance can be further boosted by controlling the uncertainty level. We systematically compare human disagreements with AI uncertainty to further evaluate AI performance in confusing scenes. The code is released at https://github.com/zzmonlyyou/TrEP.git."}}
{"id": "_N_v7JiIuK", "cdate": 1609459200000, "mdate": 1667347916045, "content": {"title": "Trust and Automation: A Systematic Review and Bibliometric Analysis", "abstract": "With the development of machine learning, high-level automation in many aspects is promising or even fledgling. However, a challenge that appears at this moment is that how people trust in automation. This study is a systematic literature review of this topic using bibliometric analysis. Tools like Scopus, VOSviewer, AuthorMapper, MAXQDA, Vicinitas, Harzing's Publish or Perish, and Web of Science are used to conduct bibliometric analyses and content analyses. The results identify the most influential publications and trends of research topics. In addition, topics related to automated vehicles are found to be high-profile applications in the area."}}
{"id": "WKl4Uh_v9i", "cdate": 1609459200000, "mdate": 1667347916006, "content": {"title": "Implementation and Performance Evaluation of In-vehicle Highway Back-of-Queue Alerting System Using the Driving Simulator", "abstract": "This paper proposes a prototype in-vehicle highway back-of-queue alerting system that is based on an Android-based smartphone app, which is capable of delivering warning information to on-road drivers approaching traffic queues. To evaluate the effectiveness of this alerting system, subjects were recruited to participate in the designed test scenarios on a driving simulator. The test scenarios include three warning types (no alerts, roadside alerts, and in-vehicle auditory alerts), three driver states (normal, distracted, and drowsy), and two weather conditions (sunny and foggy). Driver responses related to vehicle dynamics data were collected and analyzed. The results indicate that on average, the drowsy state decreases the minimum time-to-collision by 1.6 seconds compared to the normal state. In-vehicle auditory alerts can effectively increase the driving safety across different combinations of situations (driver states and weather conditions), while roadside alerts perform better than no alerts."}}
