{"id": "dcgUrYwBkV", "cdate": 1698796800000, "mdate": 1699145045349, "content": {"title": "Unlabeled backdoor poisoning on trained-from-scratch semi-supervised learning", "abstract": ""}}
{"id": "E9EfW5FPgQM", "cdate": 1698796800000, "mdate": 1699145045325, "content": {"title": "Learning to Immunize Images for Tamper Localization and Self-Recovery", "abstract": "Digital images are vulnerable to nefarious tampering attacks such as content addition or removal that severely alter the original meaning. It is somehow like a person without protection that is open to various kinds of viruses. Image immunization (Imuge) is a technology of protecting the images by introducing trivial perturbation, so that the protected images are immune to the viruses in that the tampered contents can be auto-recovered. This paper presents Imuge+, an enhanced scheme for image immunization. By observing the invertible relationship between image immunization and the corresponding self-recovery, we employ an invertible neural network to jointly learn image immunization and recovery respectively in the forward and backward pass. We also introduce an efficient attack layer that involves both malicious tamper and benign image post-processing, where a novel distillation-based JPEG simulator is proposed for improved JPEG robustness. Our method achieves promising results in real-world tests where experiments show accurate tamper localization as well as high-fidelity content recovery. Additionally, we show superior performance on tamper localization compared to state-of-the-art schemes based on passive forensics."}}
{"id": "w-qFdCRC5bL", "cdate": 1685577600000, "mdate": 1699145045351, "content": {"title": "Image Sanitization in Online Social Networks: A General Framework for Breaking Robust Information Hiding", "abstract": "With the development of robust information hiding (RIH) approaches, secret messages can be extracted successfully from stego-data after transmission through lossy channels of online social networks (OSNs). To interrupt illegal covert communications in OSNs, some methods sanitize the uploaded images by image processing operations to destroy the hidden data that may exist. However, none of the existing methods takes the RIH methods that can resist scaling into consideration, while scaling is a common operation in OSNs. In this paper, we first propose a general framework for image sanitization in OSN platforms, which serves as a countermeasure against the RIH. By using such a framework, the secret messages embedded in the upload images can be removed and the quality of the sanitized image can be well maintained. Our framework contains two deep neural networks: Scaling-Net and SC-Net. The Scaling-Net is dedicated to the sanitization of oversized images while the SC-Net is designed for other images. To achieve a good image quality, we also propose a discriminator for adversarial training of the Scaling-Net and SC-Net. Experimental results on different datasets demonstrate that our proposed method outperforms the state-of-the-art methods. The source code and pretrained models are available at our code repository ( <uri xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">https://github.com/zyzhu19/Image_Sanitization</uri> )."}}
{"id": "HCn5tC3J-L9", "cdate": 1682386554857, "mdate": 1682386554857, "content": {"title": "Hiding Images into Images with Real-world Robustness", "abstract": "The existing image embedding networks are basically vulnerable to malicious attacks such as JPEG compression and noise adding, not applicable for real-world copyright protection tasks. To solve this problem, we introduce a generative deep network based method for hiding images into images while assuring high-quality extraction from the destructive synthesized images. An embedding network is sequentially concatenated with an attack layer, a decoupling network and an image extraction network. The addition of decoupling network learns to extract the embedded secret image from the attacked image. We also pinpoint the weaknesses of the adversarial training for robustness in previous works and build our improved real-world attack simulator. Experimental results demonstrate the superiority of the proposed method against typical digital attacks by a large margin, as well as the performance boost of the recovered images with the aid of progressive recovery strategy. Besides, we are the first to robustly hide three secret images."}}
{"id": "T325bA9c0rW", "cdate": 1682386401558, "mdate": 1682386401558, "content": {"title": "RWN: Robust Watermarking Network for Image Cropping Localization", "abstract": "Image cropping can be maliciously used to manipulate the layout of an image and alter the underlying meaning. Previous image cropping detection schemes only predict whether an image has been cropped, ignoring which part of the image is cropped. This paper presents a novel robust watermarking network for image cropping localization. We train an anti-cropping processor (ACP) that embeds a watermark into a target image. The visually indistinguishable protected image is then posted on the social network instead of the original image. At the recipient’s side, ACP extracts the watermark from the attacked image, and we conduct feature matching on the original and extracted watermark to locate the position of the cropping. We further extend our scheme to detect tampering attacks on the attacked image, and a simple yet efficient method (JPEG-Mixup) is proposed that noticeably improves the generalization of JPEG robustness. We demonstrate that our scheme is the first to provide high-accuracy and robust image cropping localization."}}
{"id": "z_lnGWQkK5", "cdate": 1682386136169, "mdate": 1682386136169, "content": {"title": "Image Protection for Robust Cropping Localization and Recovery", "abstract": "Existing image cropping detection schemes ignore that recovering the cropped-out contents can unveil the purpose of the behaved cropping attack. This paper presents CLR-Net, a novel image protection scheme addressing the combined challenge of image Cropping Localization and Recovery. We first protect the original image by introducing imperceptible perturbations. Then, typical image post-processing attacks are simulated to erode the protected image. On the recipient's side, we predict the cropping mask and recover the original image. Besides, we propose a novel Fine-Grained generative JPEG simulator (FG-JPEG) as well as a feature alignment network to improve the real-world robustness. Comprehensive experiments prove that the quality of the recovered image and the accuracy of crop localization are both satisfactory."}}
{"id": "tS2AkSDLYZ", "cdate": 1682385813645, "mdate": 1682385813645, "content": {"title": "Bootstrapping Multi-view Representations for Fake News Detection", "abstract": "Previous researches on multimedia fake news detection include a series of complex feature extraction and fusion networks to gather useful information from the news. However, how cross-modal consistency relates to the fidelity of news and how features from different modalities affect the decision-making are still open questions. This paper presents a novel scheme of Bootstrapping Multi-view Representations (BMR) for fake news detection. Given a multi-modal news, we extract representations respectively from the views of the text, the image pattern and the image semantics. Improved Multi-gate Mixture-of-Expert networks (iMMoE) are proposed for feature refinement and fusion. Representations from each view are separately used to coarsely predict the fidelity of the whole news, and the multimodal representations are able to predict the cross-modal consistency. With the prediction scores, we reweigh each view of the representations and bootstrap them for fake news detection. Extensive experiments conducted on typical fake news detection datasets prove that the proposed BMR outperforms state-of-the-art schemes."}}
{"id": "4pTmBKp2XY", "cdate": 1682385660127, "mdate": 1682385660127, "content": {"title": "From image to imuge: Immunized image generation", "abstract": "We introduce Imuge, an image tamper resilient generative scheme for image self-recovery. The traditional manner of concealing image content within the image are inflexible and fragile to diverse digital attack, i.e. image cropping and JPEG compression. To address this issue, we jointly train a U-Net backboned encoder, a tamper localization network and a decoder for image recovery. Given an original image, the encoder produces a visually indistinguishable immunized image.  At the recipient’s side, the verifying network localizes the malicious modifications, and the original content can be approximately recovered by the decoder, despite the presence of the attacks. Several strategies are proposed to boost the training efficiency. We demonstrate that our method can recover the details of the tampered regions with a high quality despite the presence of various kinds of attacks. Comprehensive ablation studies are conducted to validate our network designs."}}
{"id": "Z4RhjCbIulk", "cdate": 1675209600000, "mdate": 1699145045399, "content": {"title": "Image Inpainting Anti-Forensics Network via Attention-Guided Hierarchical Reconstruction", "abstract": "Privacy security and property rights protection have gradually attracted the attention of people. Users not only hope that the images edited by themselves will not be forensically investigated, but also hope that the images they share will not be tampered with. Aiming at the problem that inpainted images can be located by forensics, this paper proposes a general anti-forensics framework for image inpainting with copyright protection. Specifically, we employ a hierarchical attention model to symmetrically reconstruct the inpainting results based on existing deep inpainting methods. The hierarchical attention model consists of a structural attention stream and a texture attention stream in parallel, which can fuse hierarchical features to generate high-quality reconstruction results. In addition, the user’s identity information can be symmetrically embedded and extracted to protect copyright. The experimental results not only had high-quality structural texture information, but also had homologous features with the original region, which could mislead the detection of forensics analysis. At the same time, the protection of users’ privacy and property rights is also achieved."}}
{"id": "NpNWWtIqbX", "cdate": 1675209600000, "mdate": 1698565164225, "content": {"title": "SNIS: A Signal Noise Separation-Based Network for Post-Processed Image Forgery Detection", "abstract": "Image forgery detection has aroused widespread research interest in both academia and industry because of its potential security threats. Existing forgery detection methods achieve excellent tampered regions localization performance when forged images have not undergone post-processing, which can be detected by observing changes in the statistical features of images. However, forged images may be carefully post-processed to conceal forgery boundaries in a particular scenario. It becomes tough challenging to these methods. In this paper, we perform an analogous analysis between image forgery detection and blind signal separation, and formulate the post-processed image forgery detection problem into a signal noise separation problem. We also propose a signal noise separation-based (SNIS) network to solve the problem of detecting post-processed image forgery. Specifically, we first adopt the signal noise separation module to separate tampered region from the complex background region with post-processing noise, which weakens or even eliminates the negative impact of post-processing on forgery detection. Then, the multi-scale feature learning module uses a parallel atrous convolution architecture to learn high-level global features from multiple perspectives. Besides, a feature fusion module is utilized to enhance the discriminability of tampered regions and real regions by strengthening the boundary information. Finally, the prediction module is designed to predict the tampered region and classify the type of tampering operation. Extensive experiments show that the proposed SNIS is not only effective for forgery detection on forged images without post-processing, but also promising in robustness against multiple post-processing attacks. Furthermore, SNIS is robust in detecting forged images from unknown sources."}}
