{"id": "cYHL5PDEQRK", "cdate": 1698796800000, "mdate": 1699195286386, "content": {"title": "Cross-City Multi-Granular Adaptive Transfer Learning for Traffic Flow Prediction", "abstract": "Accurate traffic prediction is one of the most important techniques in building a smart city. Many works, especially deep learning models, have made great progress in traffic prediction based on rich historical data. However, many cities still suffer from the problem of data scarcity in many aspects. Some works use transfer learning to solve this kind of problem, but what and how to transfer is still an important problem. In this article, we propose a novel Cross-city Multi-Granular Adaptive Transfer Learning method named MGAT for traffic prediction with only a few data in the target city. We first use the meta-learning algorithm to train the model on multiple source cities to get a good initialization. And at the same time, the multi-granular regional characteristics of each source city will be obtained based on our model structure. Then we design an Adaptive Transfer module mainly composed of Spatial-Attention and Multi-head Attention mechanism to automatically select the most appropriate features from the multi-granular features trained from multiple source cities, to achieve the best transfer effect. We conduct extensive experiments on two kinds of real-world traffic datasets cross several cities. Experimental results with other state-of-the-art models demonstrate the effectiveness of the proposed model."}}
{"id": "Ybpb5SRnhhI", "cdate": 1698796800000, "mdate": 1699195286540, "content": {"title": "Evaluating Edge Credibility in Evolving Noisy Social Networks", "abstract": "Despite the massive surge of evolving social network analysis in popularity, existing research usually represent the observed social interactions among individuals as completely credible edges. However, due to information inaccuracy, individual non-response and dropout, and sampling biases in observations, the evolving noisy social network that coexists true edges and spurious edges is pervasive in actual applications, where the ignoration of credibility otherness of observed edges could lead to the wrong estimates of social properties and misleading conclusions. To discover credible edge information to shape correct social interactions among individuals, we propose a universal and explainable multiple-neighbor evolutional filtering method ( <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">MEFM</i> ) to evaluate how credible of observed edges to ‘truly’ exist in the evolving noisy social network. <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">MEFM</i> consists of an evolutional extractor and a filtering evaluator. To resist the noisy disturbance, the evolutional extractor exploits the evolutional states of edges from the perspective of evolution mechanisms within multiple-neighbor ranges, which applies different link prediction algorithms to fit the evolution mechanism in the formation of each edge. Further, the filtering evaluator reconstructs Kalman filter to predict and refine the evolutional states of edges based on their evolving local structures. As a result, <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">MEFM</i> combines the evolutional extractor and the filtering evaluator to analyze the evolutional fluctuations of the observed edges to evaluate their credibility. Extensive experiments on real-world datasets demonstrate that our proposed <italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">MEFM</i> can effectively and reasonably evaluate edge credibility in evolving noisy social networks."}}
{"id": "w2RwqEQrwI", "cdate": 1696118400000, "mdate": 1699152275443, "content": {"title": "LiteWSEC: A Lightweight Framework for Web-Scale Spectral Ensemble Clustering", "abstract": "Spectral Clustering (SC) is an effective clustering method for its excellent performance in partitioning non-linearly distributed data. On the other hand, Ensemble Clustering (EC), a different clustering technology, can promote cluster quality by ensembling the results of base clusterings. In this work, we concentrate on an EC framework that utilizes SC as the base method. Nevertheless, SC suffers from scalability due to its high computational complexity in constructing the Laplacian graph and computing the corresponding eigendecomposition. In the past decades, many efforts have been made to it. However, SC suffers from the scalability issue in processing extensive data, especially in web-scale scenarios. Additionally, EC requires multiple clustering results as the ensemble bases, which further aggravates resource consumption. To address this issue, LiteWSEC, a simple yet efficient Lightweight Framework for Web-scale Spectral Ensemble Clustering, is proposed to cluster web-scale data with limited resource requirements. It adopts the Web-scale Spectral Clustering (WSC) as the base method, which has minimal space overhead without computing overall embedding explicitly. LiteWSEC is highly flexible in the memory requirement, which is adaptive to the available resource. It can partition web-scale data (e.g., <inline-formula><tex-math notation=\"LaTeX\">$n $</tex-math></inline-formula> = 8,000 k) in an resource-limited host (e.g., memory is restricted to 1 GB). Experiments on real-world, large-scale, and web-scale datasets demonstrate both the efficiency and effectiveness of LiteWSEC over state-of-the-art SC and EC methods."}}
{"id": "AWYoioBwIVx", "cdate": 1696118400000, "mdate": 1699195286369, "content": {"title": "IRLM: Inductive Representation Learning Model for Personalized POI Recommendation", "abstract": "With the rapid development of the Internet of Things technology, the concept of smart cities that aims to help residents improve their quality of life has raised much attention in several application areas. In the context of smart cities, the provision of point of interest (POI) recommendations become an important requirement because a wide range of POIs are available for urban dwellers. Location-based social networks (LBSNs) such as Foursquare and Gowalla provide a massive volume of user check-in records that can assist users in choosing new POIs. However, user trajectories are mostly sparse in the real world. For example, users only check in a few POIs, and this makes it difficult to provide recommendations based on limited history trajectories. Though some attempts have adopted auxiliary geographical information to enhance POI recommendation, they still encounter the following problems: 1) the geographical trajectories of users are usually sparse in real-world datasets; 2) users may be more interested in the remote POIs; and 3) the previous models inherently perform transductive learning that cannot handle well the recommendation of unseen users and POIs. To address these problems, we propose an inductive representation learning model (IRLM) for location recommendation. IRLM contains two parts, namely geographic feature extraction and inductive representation learning. IRLM first captures global geographical influences among POIs through a standard Gaussian mixture model (GMM). Then IRLM adopts an attention neural network for the recommendation. Experimental results indicate that our proposed model can achieve superior performance over state-of-the-art models."}}
{"id": "ynQiYlNA2s", "cdate": 1693526400000, "mdate": 1699195286391, "content": {"title": "A Neural Inference of User Social Interest for Item Recommendation", "abstract": "User-generated content is daily produced in social media, as such user interest summarization is critical to distill salient information from massive information for recommendation tasks. While the interested messages (e.g., tags or posts) from a single user are usually sparse becoming a bottleneck for existing methods, we propose a neural inference method (NIGraphNet) by mining user social interest for item recommendation. It can unearth user latent topics combined with user relation learning. Specifically, we exploit a neural variational inference approach to learn the distributions between user interests and hidden topics. (We denote it as interest-topic distributions in the following.) Then, we adopt a unified graph-based training loss that jointly learns the hidden topics and user relations for item recommendation. Experiments on two datasets collected from well-known social media platforms demonstrate the superior performance of our model in the tasks of user interest summarization and item recommendation. Further discussions also show that exploiting the latent topic representations and user relations is conducive to the user’s automatic language understanding."}}
{"id": "BZeeZtQp2Z", "cdate": 1690848000000, "mdate": 1699151693135, "content": {"title": "CMFT: Contrastive Memory Feature Transfer for Nonshared-and-Imbalanced Unsupervised Domain Adaption", "abstract": "Recently, nonshared-and-imbalanced unsupervised domain adaption has been proposed to fix domain shift from Big Data source domain with long-tail distribution to specific small target domain with imbalanced distribution, including two challenges: 1) nonshared classes sharing in big data with long-tail distribution; and 2) imbalanced domain adaptation. Prior approaches explore knowledge sharing between classes to improve performance of unsupervised domain adaption methods. However these methods have inductive bias for prior tree or graph. And previous contrastive domain adaptation methods take center-based prototypes as positive samples which only coarsely characterize the domain structure, and fail to depict the local data structure. To fix these problems, we propose a novel framework called contrastive memory feature transfer (CMFT). To solve nonshared data sharing without inductive bias, we build a centroid memory based <bold xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">directed memory transfer</b> mechanism to enhance imbalanced class features with similar nonshared class centroid. To address the imbalanced domain adaptation, we design a fault-tolerant and fine-grained <bold xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">neighborhood prototype</b> for the contrastive learning which can narrow the domain shift. The proposed CMFT outperforms previous methods on most benchmarks."}}
{"id": "9ruFjNuq9XU", "cdate": 1685577600000, "mdate": 1699195286372, "content": {"title": "Micro-Supervised Disturbance Learning: A Perspective of Representation Probability Distribution", "abstract": "The instability is shown in the existing methods of representation learning based on Euclidean distance under a broad set of conditions. Furthermore, the scarcity and high cost of labels prompt us to explore more expressive representation learning methods which depends on as few labels as possible. To address above issues, the small-perturbation ideology is firstly introduced on the representation learning model based on the representation probability distribution. The positive small-perturbation information (SPI) which only depend on two labels of each cluster is used to stimulate the representation probability distribution and then two variant models are proposed to fine-tune the expected representation distribution of Restricted Boltzmann Machine (RBM), namely, Micro-supervised Disturbance Gaussian-binary RBM (Micro-DGRBM) and Micro-supervised Disturbance RBM (Micro-DRBM) models. The Kullback-Leibler (KL) divergence of SPI is minimized in the same cluster to promote the representation probability distributions to become more similar in Contrastive Divergence (CD) learning. In contrast, the KL divergence of SPI is maximized in the different clusters to enforce the representation probability distributions to become more dissimilar in CD learning. To explore the representation learning capability under the continuous stimulation of the SPI, we present a deep Micro-supervised Disturbance Learning (Micro-DL) framework based on the Micro-DGRBM and Micro-DRBM models and compare it with a similar deep structure which has no external stimulation. Experimental results demonstrate that the proposed deep Micro-DL architecture shows better performance in comparison to the baseline method, the most related shallow models and deep frameworks for clustering."}}
{"id": "lbz9ETfUlh", "cdate": 1682899200000, "mdate": 1699152275454, "content": {"title": "RESKM: A General Framework to Accelerate Large-Scale Spectral Clustering", "abstract": ""}}
{"id": "4PxjZNB7Ws", "cdate": 1682899200000, "mdate": 1699195286372, "content": {"title": "Shortening Passengers' Travel Time: A Dynamic Metro Train Scheduling Approach Using Deep Reinforcement Learning", "abstract": "Urban metros have become the foremost public transit to modern cities, carrying millions of daily rides. As travel efficiency matters to the work productivity of the city, shortening passengers’ travel time for metros is therefore a pressing need, which can bring substantial economic benefits. In this paper, we study a fine-grained, safe, and energy-efficient strategy to improve the efficiency of metro systems by dynamically scheduling dwell time for trains. However, developing such a strategy is very challenging because of three aspects: 1) The objective of optimizing the average travel time of passengers is complex, as it needs to properly balance passengers’ waiting time at platforms and journey time on trains, as well as considering long-term impacts on the whole metro system; 2) Capturing dynamic spatio-temporal (ST) correlations of incoming passengers for metro stations is difficult; and 3) For each train, the dwell time scheduling is affected by other trains on the same metro line, which is not easy to measure. To tackle these challenges, we propose a novel deep neural network, entitled AutoDwell. Specifically, AutoDwell optimizes the long-term rewards of dwell time settings in terms of passengers’ waiting time at platforms and journey time on trains by a reinforcement learning framework. Next, AutoDwell employs gated recurrent units and graph attention networks to extract the ST correlations of the passenger flows among metro stations. In addition, attention mechanisms are leveraged in AutoDwell for capturing the interactions between the trains on the same metro line. Extensive experiments on two real-world datasets collected from Beijing and Hangzhou, China, demonstrate the superior performance of AutoDwell over several baselines, capable of saving passengers’ overall travel time. In particular, the model can shorten the waiting time by at least 9%, which can boost passengers’ experience significantly."}}
{"id": "z9gLjOdvvc", "cdate": 1672531200000, "mdate": 1699195286541, "content": {"title": "Unsupervised Feature Learning Architecture with Multi-clustering Integration RBM", "abstract": "Feature learning is a crucial phase machine learning [1] – [3] . How to obtain appropriate features distribution without any background is still a hard problem in machine learning. In this paper, we present a novel unsupervised feature learning architecture (see Fig. 1 ), which consists of a multi-clustering integration module and a variant of RBM termed multi-clustering integration RBM (MIRBM). In the multi-clustering integration module, we choose three clusterers to obtain three different global clustering partitions (CPs). Then, an unanimous voting strategy is used to generate the local clustering partition (LCP) of visible layer data. Hence, the LCP only has partial visible layer data. The novel MIRBM model is a core feature encoding part of the proposed unsupervised feature learning architecture. The novelty of it is that the LCP as an unsupervised guidance is integrated into the CD 1 learning to guide the distribution of the hidden layer features. For the instance in the same LCP cluster, the hidden and reconstructed hidden layer features of the MIRBM model in the proposed architecture tend to constrict together in the training process. Meanwhile, each LCP center tends to disperse from each other as much as possible in the hidden and reconstructed hidden layer during training. This work has three main contributions: 1) A novel unsupervised feature learning architecture is proposed, which consists of a multi-clustering integration module and an MIRBM model. 2) In the multi-clustering integration module of the proposed architecture, three unsupervised algorithms are employed to obtain three different global CPs without any background knowledge or label. 3) The MIRBM model in the proposed architecture uses the LCP as an unsupervised guidance to guide the distribution of the hidden layer features by integrating the LCP into the CD 1 learning."}}
