{"id": "_fLxZ6VpXTH", "cdate": 1632875482268, "mdate": null, "content": {"title": "Stabilized Likelihood-based Imitation Learning via Denoising Continuous Normalizing Flow", "abstract": "State-of-the-art imitation learning (IL) approaches, e.g, GAIL, apply adversarial training to minimize the discrepancy between expert and learner behaviors, which is prone to unstable training and mode collapse. In this work, we propose SLIL – Stabilized Likelihood-based Imitation Learning – a novel IL approach that directly maximizes the likelihood of observing the expert demonstrations. SLIL is a two-stage optimization framework, where in stage one the expert state distribution is estimated via a new method for denoising continuous normalizing flow, and in stage two the learner policy is trained to match both the expert’s policy and state distribution. Experimental evaluation of SLIL compared with several baselines in ten different physics-based control tasks reveals superior results in terms of learner policy performance, training stability, and mode distribution preservation."}}
{"id": "wf2AJRi8gxe", "cdate": 1609459200000, "mdate": null, "content": {"title": "Improving SD-WAN Resilience: From Vertical Handoff to WAN-Aware MPTCP", "abstract": "Demands for wide-area connectivity between enterprise site-edge networks and central office core networks/cloud data centers have grown rapidly. Various software defined wide area network (SD-WAN) solutions have been developed with the primary aim of improving WAN link utilization. However, mechanisms used by existing SD-WAN solutions fail to provide high reliability and performance required by today's edge to cloud applications. In this article, we present WAN-aware MPTCP which seamlessly aggregates multiple WAN links into a “big pipe” for better WAN resilience thus minimizing application performance degradation under WAN link failures. We leverage the congestion control of MPTCP to balance traffic across multiple WAN links. The key innovation is to combine LAN virtualization at end systems with WAN virtualization at SD-WAN gateways. Through evaluation in both emulated testbeds and real-world deployment, we demonstrate the performance gain of WAN-aware MPTCP in terms of resilience and throughput over existing SD-WAN solutions."}}
{"id": "dWYqs3PRqt6", "cdate": 1609459200000, "mdate": null, "content": {"title": "ECIoT: Case for an Edge-Centric IoT Gateway", "abstract": "Numerous cloud service providers (CSPs) have developed IoT gateways and devices that connect IoT devices solely to their respective clouds. We term these gateways cloud-centric. In this paper, we propose an alternative, edge-centric approach to developing IoT gateways, Edge-Centric IoT Gateways, or ECIoT. ECIoT gateways will: enable sites to direct IoT sensor data to the CSP of their choice for processing and storage and permit IoT sensor data to be easily and efficiently forwarded to multiple CSPs simultaneously, which can simplify these functions in multi-vendor IoT systems. Evaluation of a preliminary, proof-of-concept prototype suggests that the ECIoT gateway can achieve these multi-vendor objectives with minimal overhead."}}
{"id": "a-bvTqaPfsD", "cdate": 1609459200000, "mdate": null, "content": {"title": "GlobeSnap: An Efficient Globally Consistent Statistics Collection for Software-Defined Networks", "abstract": "Software defined networking (SDN) controller requires crucial statistics like flow-wise statistics from the switches to make decisions related to routing, load balancing, and QoS provisioning. These statistics, when viewed across the switches are likely to be inconsistent if a specific order is not enforced while collecting statistics. Collecting consistent statistics requires coordination among all the participating switches. A few approaches in the literature collect globally consistent statistics of a network in the SDN domain. However, these approaches are not time-efficient, robust, and synchronous for OpenFlow based networks. We propose, GlobeSnap, a time-efficient, robust, and synchronous method to collect globally consistent statistics for OpenFlow networks. GlobeSnap collects consistent statistics for all flows in a single round and is therefore, time-efficient. Moreover, GlobeSnap is robust since it resumes the statistics collection process from where it left in case of interruption. GlobeSnap also provides a near-synchronous snapshot of statistics of the switches traversed by a given flow. We also propose a mechanism to persistently store states in OpenFlow based networks using registers, multiple flow tables, and multiple pipelines. We find that GlobeSnap outperforms the state-of-the-art approaches in consistency evaluation. Further we present two use-cases which are sensitive to inconsistent flow statistics, that is, computing packet loss and identifying bottleneck links, to show the time-efficiency, robustness, and synchronicity of GlobeSnap. GlobeSnap provides 100% consistency in OpenFlow based SDN networks. Whereas the existing methods achieve a maximum of 59.89% consistency."}}
{"id": "_WAcqFQxYwy", "cdate": 1609459200000, "mdate": null, "content": {"title": "Introduction to the Special Issue on Urban Computing and Smart Cities", "abstract": "No abstract available."}}
{"id": "88tPqrAxkC-", "cdate": 1609459200000, "mdate": null, "content": {"title": "One Host with So Many IPs! On The Security Implications of Dynamic Virtual Private Servers", "abstract": "Many malicious activities require a large number of IP addresses for altering user identities. It is well known that a large number of IP addresses could be obtained through compromising numerous machines and building botnets. However, we recently found that a special type of off-the-shelf virtual private server (VPS), which we refer to as dynamic VPSs, can retrieve a huge number of IP addresses using just a single virtual machine. Although dynamic VPSs are intended for legitimate purposes, whether they are actually misused in malicious activities has never been investigated. In this article, we take the first step to study dynamic VPSs, with an emphasis on their security implications. We reveal that dynamic VPSs are surprisingly and extensively involved in malicious activities, explore their internal working mechanisms, and suggest that the linkage of dynamic VPSs to the security domain deserves adequate attention."}}
{"id": "-HXQ76kRY8m", "cdate": 1609459200000, "mdate": null, "content": {"title": "AggreFlow: Achieving Power Efficiency, Load Balancing, and Quality of Service in Data Center Networks", "abstract": "Power-efficient Data Center Networks (DCNs) have been proposed to save power of DCNs using OpenFlow. In these DCNs, the OpenFlow controller adaptively turns on/off links and OpenFlow switches to form a minimum-power subnet that satisfies the traffic demand. As the subnet changes, flows are dynamically routed and rerouted to the routes composed of active switches and links. However, existing flow scheduling schemes could cause undesired results: (1) power inefficiency: due to unbalanced traffic allocation on active routes, extra switches and links may be activated to cater to bursty traffic surges on congested routes, and (2) Quality of Service (QoS) fluctuation: because of the limited flow entry processing ability, switches may not be able to timely install/delete/update flow entries to properly route/reroute flows. In this paper, we propose AggreFlow, a dynamic flow scheduling scheme that achieves power efficiency and QoS improvement using three techniques: Flow-set Routing, Lazy Rerouting, and Adaptive Rerouting. Flow-set Routing achieves load balancing with a small number of flow entry operations by routing flows in a coarse-grained flow-set fashion. Lazy Rerouting spreads rerouting operations over a relatively long period of time, reducing the burstiness of entry operation on switches. Adaptive Rerouting selectively reroutes flow-sets to maintain load balancing. We built an NS3 based fat-tree network simulation platform to evaluate AggreFlow's performance. The simulation results show that AggreFlow reduces power consumption by about 18%, yet achieving load balancing and improved QoS (low packet loss rate and reducing the number of processing entries for flow scheduling by 98%), compared with baseline schemes."}}
{"id": "woQEQieKbPh", "cdate": 1577836800000, "mdate": null, "content": {"title": "Enhancing Performance, Security, and Management in Network Function Virtualization", "abstract": "In an era of ubiquitous connectivity, various new applications, network protocols, and online services (e.g., cloud services, distributed machine learning, cryptocurrency) have been constantly creating, underpinning many of our daily activities. Emerging demands for networks have led to growing traffic volume and complexity of modern networks, which heavily rely on a wide spectrum of specialized network functions (e.g., Firewall, Load Balancer) for diverse purposes. Although these (virtual) network functions (VNFs) are widely deployed, they are instantiated in an uncoordinated manner failing to meet growing demands of evolving networks. In this dissertation, we argue that networks equipped with VNFs can be designed in a fashion similar to how computer software is programmed today. By following the blueprint of modularization, networks can be made more efficient, secure, and manageable."}}
{"id": "wPXPJ9mRJFi", "cdate": 1577836800000, "mdate": null, "content": {"title": "MasQ: RDMA for Virtual Private Cloud", "abstract": "RDMA communication in virtual private cloud (VPC) networks is still a challenging job due to the difficulty in fulfilling all virtualization requirements without sacrificing RDMA communication performance. To address this problem, this paper proposes a software-defined solution, namely, MasQ, which is short for \"queue masquerade\". The core insight of MasQ is that all RDMA communications should associate with at least one queue pair (QP). Thus, the requirements of virtualization, such as network isolation and the application of security rules, can be easily fulfilled if QP's behavior is properly defined. In particular, MasQ exploits the virtio-based paravirtualization technique to realize the control path. Moreover, to avoid performance overhead, MasQ leaves all data path operations, such as sending and receiving, to the hardware. We have implemented MasQ in the OpenFabrics Enterprise Distribution (OFED) framework and proved its scalability and performance efficiency by evaluating it against typical applications. The results demonstrate that MasQ achieves almost the same performance as bare-metal RDMA for data communication."}}
{"id": "ttLevmlyxn", "cdate": 1577836800000, "mdate": null, "content": {"title": "On Virtual Id Assignment in Networks for High Resilience Routing: A Theoretical Framework", "abstract": "In recent years, the effort of promoting versatile, easy to manage routing schemes, as a replacement to OSPF has gathered momentum particularly in the context of large-scale enterprise networks, data center networks and software-defined wide area networks (SD-WANs). Such routing schemes rely on embedding the network into a geometric/topological space (e.g. a binary tree) to facilitate multi-path routing with reduced state maintenance and quick recovery in localized failure scenarios. In this work, we propose a systematic framework to embed the network topology into a hierarchical binary virtual-identity-space that is particularly amenable to multi-path routing. Our methodology firstly involves a relaxed form of the connected graph bi-partitioning problem that exploits a geometric embedding of the network in an n-dimensional Euclidean space (n being the number of hosts in the network) based on the Moore-Penrose pseudo inverse of the Laplacian for the graph associated with the network. The edges of the network are mapped to a weight distribution that helps construct a spanning tree from the core of the network towards the periphery, thereby providing a point of symmetry in the network to facilitate balanced bi- partitions. This, in turn, yields a (nearly) full balanced binary tree embedding of the network and consequently a good virtual-id space. We also explore the binary identity assignment problem in another point of view by using bi-connected graph as the input graph to introduce a recursive bipartition algorithm. Through rigorous theoretical analysis and experimentation, we demonstrate that our methods perform well within reasonable bounds of computational complexity."}}
