{"id": "SFmWjaVHsL", "cdate": 1640995200000, "mdate": 1666492975131, "content": {"title": "Requirements Engineering for Machine Learning: A Review and Reflection", "abstract": "Today, many industrial processes are undergoing digital transformation, which often requires the integration of well-understood domain models and state-of-the-art machine learning technology in business processes. However, requirements elicitation and design decision making about when, where and how to embed various domain models and end-to-end machine learning techniques properly into a given business workflow requires further exploration. This paper aims to provide an overview of the requirements engineering process for machine learning applications in terms of cross domain collaborations. We first review the literature on requirements engineering for machine learning, and then go through the collaborative requirements analysis process step-by-step. An example case of industrial data-driven intelligence applications is also discussed in relation to the aforementioned steps."}}
{"id": "ry4WC1-dZH", "cdate": 1514764800000, "mdate": null, "content": {"title": "Multi-Adversarial Domain Adaptation", "abstract": "Recent advances in deep domain adaptation reveal that adversarial learning can be embedded into deep networks to learn transferable features that reduce distribution discrepancy between the source and target domains. Existing domain adversarial adaptation methods based on single domain discriminator only align the source and target data distributions without exploiting the complex multimode structures. In this paper, we present a multi-adversarial domain adaptation (MADA) approach, which captures multimode structures to enable fine-grained alignment of different data distributions based on multiple domain discriminators. The adaptation can be achieved by stochastic gradient descent with the gradients computed by back-propagation in linear-time. Empirical evidence demonstrates that the proposed model outperforms state of the art methods on standard domain adaptation datasets."}}
{"id": "hUuws50ssm", "cdate": 1325376000000, "mdate": 1666492975462, "content": {"title": "Energy efficient ant colony algorithms for data aggregation in wireless sensor networks", "abstract": ""}}
