{"id": "osIppnySBTV", "cdate": 1663850526949, "mdate": null, "content": {"title": "DEFENDING BACKDOOR ATTACKS VIA ROBUSTNESS AGAINST NOISY LABEL", "abstract": "Many deep neural networks are vulnerable to backdoor poisoning attacks, in which an adversary strategically injects a backdoor trigger into a small fraction of the training data. The trigger can later be applied during inference to manipulate prediction labels. While the data label could be changed to arbitrary values by an adversary, the extent of corruption injected into the feature values is strictly limited to keep the backdoor attack in disguise, which leads to a resemblance between the backdoor attack and a milder attack that involves only noisy labels.\nThis paper investigates an intriguing question: \\textit{Can we leverage algorithms that defend against noisy label corruptions to defend against general backdoor attacks?} We first discuss the limitations of directly using current noisy-label defense algorithms to defend against backdoor attacks. We then propose a meta-algorithm for both supervised and semi-supervised settings that transforms an existing noisy label defense algorithm into one that protects against backdoor attacks. Extensive experiments on different settings show that, by introducing a lightweight alteration for minimax optimization to the existing noisy-label defense algorithms, the robustness against backdoor attacks can be substantially improved, while the initial form of those algorithms would fail in the presence of a backdoor attack."}}
{"id": "2_dQlkDHnvN", "cdate": 1632875744078, "mdate": null, "content": {"title": "Defending Backdoor Data Poisoning Attacks by Using Noisy Label Defense Algorithm", "abstract": "Training deep neural networks with data corruption is a challenging problem. One example of such corruption is the backdoor data poisoning attack, in which an adversary strategically injects a backdoor trigger to a small fraction of the training data to subtly compromise the training process. Consequently, the trained deep neural network would misclassify testing examples that have been corrupted by the same trigger. While the label of the data could be changed to arbitrary values by an adversary, the extent of corruption injected to the feature values are strictly limited in order to keep the backdoor attack in disguise, which leads to a resemblance between the backdoor attack and a milder attack that involves only noisy labels. In this paper, we investigate an intriguing question: Can we leverage algorithms that defend against noisy labels corruptions to defend against general backdoor attacks? We first discuss the limitations of directly using the noisy-label defense algorithms to defend against backdoor attacks. Next, we propose a meta-algorithm that transforms an existing noisy label defense algorithm to one that protects against backdoor attacks. Extensive experiments on different types of backdoor attacks show that, by introducing a lightweight alteration for minimax optimization to the existing noisy-label defense algorithms, the robustness against backdoor attacks can be substantially improved, while the intial form of those algorithms would fail in presence of a backdoor attacks."}}
{"id": "vZKIrjmDTq", "cdate": 1577836800000, "mdate": null, "content": {"title": "Transfer Learning in Deep Reinforcement Learning: A Survey", "abstract": "Reinforcement learning is a learning paradigm for solving sequential decision-making problems. Recent years have witnessed remarkable progress in reinforcement learning upon the fast development of deep neural networks. Along with the promising prospects of reinforcement learning in numerous domains such as robotics and game-playing, transfer learning has arisen to tackle various challenges faced by reinforcement learning, by transferring knowledge from external expertise to facilitate the efficiency and effectiveness of the learning process. In this survey, we systematically investigate the recent progress of transfer learning approaches in the context of deep reinforcement learning. Specifically, we provide a framework for categorizing the state-of-the-art transfer learning approaches, under which we analyze their goals, methodologies, compatible reinforcement learning backbones, and practical applications. We also draw connections between transfer learning and other relevant topics from the reinforcement learning perspective and explore their potential challenges that await future research progress."}}
{"id": "G9UA77NqRCf", "cdate": 1577836800000, "mdate": null, "content": {"title": "Off-Policy Imitation Learning from Observations", "abstract": "Learning from Observations (LfO) is a practical reinforcement learning scenario from which many applications can benefit through the reuse of incomplete resources. Compared to conventional imitation learning (IL), LfO is more challenging because of the lack of expert action guidance. In both conventional IL and LfO, distribution matching is at the heart of their foundation. Traditional distribution matching approaches are sample-costly which depend on on-policy transitions for policy learning. Towards sample-efficiency, some off-policy solutions have been proposed, which, however, either lack comprehensive theoretical justifications or depend on the guidance of expert actions. In this work, we propose a sample-efficient LfO approach which enables off-policy optimization in a principled manner. To further accelerate the learning procedure, we regulate the policy update with an inverse action model, which assists distribution matching from the perspective of mode-covering. Extensive empirical results on challenging locomotion tasks indicate that our approach is comparable with state-of-the-art in terms of both sample-efficiency and asymptotic performance."}}
{"id": "9-0O_r-UZBh", "cdate": 1577836800000, "mdate": null, "content": {"title": "Learning Sparse Rewarded Tasks from Sub-Optimal Demonstrations", "abstract": "Model-free deep reinforcement learning (RL) has demonstrated its superiority on many complex sequential decision-making problems. However, heavy dependence on dense rewards and high sample-complexity impedes the wide adoption of these methods in real-world scenarios. On the other hand, imitation learning (IL) learns effectively in sparse-rewarded tasks by leveraging the existing expert demonstrations. In practice, collecting a sufficient amount of expert demonstrations can be prohibitively expensive, and the quality of demonstrations typically limits the performance of the learning policy. In this work, we propose Self-Adaptive Imitation Learning (SAIL) that can achieve (near) optimal performance given only a limited number of sub-optimal demonstrations for highly challenging sparse reward tasks. SAIL bridges the advantages of IL and RL to reduce the sample complexity substantially, by effectively exploiting sup-optimal demonstrations and efficiently exploring the environment to surpass the demonstrated performance. Extensive empirical results show that not only does SAIL significantly improve the sample-efficiency but also leads to much better final performance across different continuous control tasks, comparing to the state-of-the-art."}}
{"id": "TNM_XnqJ6xq", "cdate": 1546300800000, "mdate": null, "content": {"title": "Writing in the Air with WiFi Signals for Virtual Reality Devices", "abstract": "Recently, handwriting recognition approaches has been widely applied to Human-Computer Interface (HCI) applications. The emergence of the novel mobile terminals urges a more man-machine friendly interface mode. The previous air-writing recognition approaches have been accomplished by virtue of cameras and sensors. However, the vision based approaches are susceptible to the light condition and sensor based methods have disadvantages in deployment and highcost. The latest researches have demonstrated that the pervasive wireless signals can be used to identify different gestures. In this paper, we attempt to utilize channel state information (CSI) derived from wireless signals to realize the device-free air-write recognition called Wi-Fi. Compared to the gesture recognition, the increased diversity and complexity of characters of the alphabet make it challenging. The Principle Component Analysis (PCA) is used for denoising effectively and the energy indicator derived from the Fast Fourier Transform (FFT) is to detect action continuously. The unique CSI waveform caused by unique writing patterns of 26 letters serve as feature space. Finally, the Hidden Markov model (HMM) is used for character modeling and classification. We conduct experiments in our laboratory and get the average accuracy of the Wi-Fi are 86.75 and 88.74 percent in two writing areas, respectively."}}
{"id": "91WnddIFCSB", "cdate": 1546300800000, "mdate": null, "content": {"title": "MagAttack: Guessing Application Launching and Operation via Smartphone", "abstract": "Mobile devices have emerged as the most popular platforms to access information. However, they have also become a major concern of privacy violation and previous researches have demonstrated various approaches to infer user privacy based on mobile devices. In this paper, we study a new side channel of a laptop that could be harvested by a commercial-off-the-shelf (COTS) mobile device, eg, a smartphone. We propose MagAttack, which exploits the electromagnetic (EM) side channel of a laptop to infer user activities, i.e., application launching and application operation. The key insight of MagAttack is that applications are discrepant in essence due to the different compositions of instructions, which can be reflected on the CPU power consumption, and thus the corresponding EM emissions. MagAttack is challenging since that EM signals are noisy due to the dynamics of applications and the limited sampling rate of the built-in magnetometers in COTS mobile devices. We overcome these challenges and convert noisy coarse-grained EM signals to robust fine-grained features. We implement MagAttack on both an iOS and an Android smartphone without any hardware modification, and evaluate its performance with 13 popular applications and 50 top websites in China. The results demonstrate that MagAttack can recognize aforementioned 13 applications with an average accuracy of 98.6%, and figure out the visiting operation among 50 websites with an average accuracy of 84.7%."}}
{"id": "kLuUVd7TDFQ", "cdate": 1514764800000, "mdate": null, "content": {"title": "Minimize the Make-span of Batched Requests for FPGA Pooling in Cloud Computing", "abstract": "Using FPGA as accelerators is gaining popularity in Cloud computing. Usually, FPGA accelerators in a datacenter are managed as a single resource pool. By issuing a request to this pool, a tenant can transparently access FPGA resources. FPGA requests usually arrive in batches. The objective of scheduling is to minimize the make-span of a given batch of requests, which is the completion time of the entire batch of jobs. As a result, either the responsiveness is improved, or the system throughput is maximized. The key technical challenge is the existence of multiple resource bottlenecks. An FPGA job can be bottlenecked by either computation (i.e., computation-intensive) or network (i.e., network-intensive), and sometimes by both. To the best of our knowledge, this is the first work that minimizes the make-span of batched requests for an FPGA accelerator pool in Cloud computing that considers multiple resource bottlenecks. In this paper, we design several scheduling algorithms to address the challenge. We implement our scheduling algorithms in an IBM Cloud system. We conduct extensive evaluations on both a small scale testbed and a large-scale simulator. Compared with the Shortest-Job-First scheduling, our algorithms can reduce the make-span by 36.25 percent, and improve the system throughput by 36.05 percent."}}
{"id": "o2yob4LSsFs", "cdate": 1451606400000, "mdate": null, "content": {"title": "MagAttack: remote app sensing with your phone", "abstract": "By tracking changes in electromagnetic radiation footprint emitted from computers using a magnetometer on commodity mobile devices, a malicious attacker can easily learn the secrets of the computer's owner without physically peeping at or hacking into the victim's system. Targeting at Applications and Web browsers, we present MagAttack, which uses the built-in magnetometer on commodity mobile phones to infer which App is running or which webpage the user is browsing on a nearby computer, as well as finer-grained information about victim's interests, habits, etc. Our preliminary results show that MagAttack is independent of the earth's magnetic filed, model of phones, and magnetometer sampling rates. We also conducted an in-the-wild evaluation where an instrumented participant uses her laptop as usual and MagAttack can detect when she opens 10 different popular Apps. MagAttack achieves a classification accuracy of up to 98%."}}
