{"id": "i1SSMM2BmYw", "cdate": 1672531200000, "mdate": 1696000094959, "content": {"title": "Efficient Sparse Reduced-Rank Regression With Covariance Estimation", "abstract": "Multivariate linear regression is a fundamental model widely used in many fields of signal processing and machine learning. To enhance its interpretability and predicting performance, many approaches have been developed. Among them, the sparse reduced-rank regression with covariance estimation (SRRRCE) method has been shown to be promising. SRRRCE is powerful, which jointly considers the dimension reduction and variable selection of the regression coefficient, as well as a covariance selection target. In this paper, we will propose a new optimization formulation for SRRRCE by modifying the variable coupling constraint in the existing formulation. For efficient problem solving, a convergent single-loop algorithm based on the block majorization-minimization algorithmic framework is developed. Numerical experiments demonstrate the proposed estimation method possesses better prediction performance and faster convergence speed compared to the existing one."}}
{"id": "NkD6E4vp4iz", "cdate": 1672531200000, "mdate": 1696000095027, "content": {"title": "A Novel Algorithm for GARCH Model Estimation", "abstract": "Generalized autoregressive conditional heteroskedasticity (GARCH) is a popular model to describe the time-varying conditional volatility of a time series, which is widely used in signal processing and machine learning. In this paper, we focus on the model parameter estimation of GARCH based on the Gaussian maximum likelihood estimation method. Due to the recursively coupling nature of parameters in GARCH, the optimization problem is highly non-convex. In this paper, we propose a novel algorithm based on the block majorization-minimization algorithmic framework, which can take care of the per-block variable structures for efficient problem solving. Numerical experiments demonstrate that the proposed algorithm can achieve comparable and even better performance in terms of parameter estimation errors. More importantly, estimated parameters from our algorithm always guarantee a stationary model, which is a desirable property in time series volatility modeling."}}
{"id": "5b0m2PeZZjY", "cdate": 1672531200000, "mdate": 1696000095019, "content": {"title": "C-ISTA: Iterative Shrinkage-Thresholding Algorithm for Sparse Covariance Matrix Estimation", "abstract": "Covariance matrix estimation is a fundamental task in many fields related to data analysis. As the dimension of the covariance matrix becomes large, it is desirable to obtain a sparse estimator and an efficient algorithm to compute it. In this paper, we consider the covariance matrix estimation problem by minimizing a Gaussian negative log-likelihood loss function with an ℓ <inf xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</inf> penalty, which is a constrained non-convex optimization problem. We propose to solve the covariance estimator via a simple iterative shrinkage-thresholding algorithm (C-ISTA) with provable convergence. Numerical simulations with comparison to the benchmark methods demonstrate the computational efficiency and good estimation performance of C-ISTA."}}
{"id": "wQ-Tqt4eYQ", "cdate": 1663850210358, "mdate": null, "content": {"title": "ASGNN: Graph Neural Networks with Adaptive Structure", "abstract": "The graph neural network (GNN) has presented impressive achievements in numerous machine learning tasks. However, many existing GNN models are shown to be extremely vulnerable to adversarial attacks, which makes it essential to build robust GNN architectures. In this work, we propose a novel interpretable message passing scheme with adaptive structure (ASMP) to defend against adversarial attacks on graph structure. Layers in ASMP are derived based on optimization steps that minimize an objective function that simultaneously learns the node feature and the graph structure. ASMP is adaptive in the sense that the message passing process in different layers is able to be carried out over different graphs. Such a property allows more fine-grained handling of the noisy graph structure and hence improves the robustness. Integrating ASMP with neural networks can lead to a new family of GNNs with adaptive structure (ASGNN). Extensive experiments on semi-supervised node classification tasks demonstrate that the proposed ASGNN outperforms the state-of-the-art GNN architectures with respect to classification performance under various graph adversarial attacks."}}
{"id": "qXNJSVAoGR9", "cdate": 1640995200000, "mdate": 1696000094961, "content": {"title": "ASGNN: Graph Neural Networks with Adaptive Structure", "abstract": "The graph neural network (GNN) models have presented impressive achievements in numerous machine learning tasks. However, many existing GNN models are shown to be vulnerable to adversarial attacks, which creates a stringent need to build robust GNN architectures. In this work, we propose a novel interpretable message passing scheme with adaptive structure (ASMP) to defend against adversarial attacks on graph structure. Layers in ASMP are derived based on optimization steps that minimize an objective function that learns the node feature and the graph structure simultaneously. ASMP is adaptive in the sense that the message passing process in different layers is able to be carried out over dynamically adjusted graphs. Such property allows more fine-grained handling of the noisy (or perturbed) graph structure and hence improves the robustness. Convergence properties of the ASMP scheme are theoretically established. Integrating ASMP with neural networks can lead to a new family of GNN models with adaptive structure (ASGNN). Extensive experiments on semi-supervised node classification tasks demonstrate that the proposed ASGNN outperforms the state-of-the-art GNN architectures in terms of classification performance under various adversarial attacks."}}
{"id": "J08-8lTfgb", "cdate": 1640995200000, "mdate": 1696000094965, "content": {"title": "Towards Understanding Graph Neural Networks: An Algorithm Unrolling Perspective", "abstract": "The graph neural network (GNN) has demonstrated its superior performance in various applications. The working mechanism behind it, however, remains mysterious. GNN models are designed to learn effective representations for graph-structured data, which intrinsically coincides with the principle of graph signal denoising (GSD). Algorithm unrolling, a \"learning to optimize\" technique, has gained increasing attention due to its prospects in building efficient and interpretable neural network architectures. In this paper, we introduce a class of unrolled networks built based on truncated optimization algorithms (e.g., gradient descent and proximal gradient descent) for GSD problems. They are shown to be tightly connected to many popular GNN models in that the forward propagations in these GNNs are in fact unrolled networks serving specific GSDs. Besides, the training process of a GNN model can be seen as solving a bilevel optimization problem with a GSD problem at the lower level. Such a connection brings a fresh view of GNNs, as we could try to understand their practical capabilities from their GSD counterparts, and it can also motivate designing new GNN models. Based on the algorithm unrolling perspective, an expressive model named UGDGNN, i.e., unrolled gradient descent GNN, is further proposed which inherits appealing theoretical properties. Extensive numerical simulations on seven benchmark datasets demonstrate that UGDGNN can achieve superior or competitive performance over the state-of-the-art models."}}
{"id": "qPJEsmHvVu6", "cdate": 1609459200000, "mdate": 1648719090301, "content": {"title": "Weighted Sum-Rate Maximization for Multi-Hop RIS-Aided Multi-User Communications: A Minorization-Maximization Approach", "abstract": "The reconfigurable intelligent surface (RIS) has arose an upsurging research interest recently due to its promising outlook in 5G-and-beyond wireless networks. With the assistance of RIS, the wireless propagation environment is no longer static and could be customized to support diverse service requirements. In this paper, we will approach the rate maximization problems in RIS-aided wireless networks by considering the beamforming and reflecting design jointly. Three representative design problems from different system settings are investigated based on a proposed unified algorithmic framework via the block minorization-maximization (BMM) method. Extensions and generalizations of the proposed framework in dealing with some other related problems are further presented. Merits of the proposed algorithms are demonstrated through numerical simulations in comparison with the state-of-the-art methods."}}
{"id": "cYun_gEx9nJ", "cdate": 1609459200000, "mdate": 1648719089825, "content": {"title": "Joint Design of Transmit Waveforms and Receive Filters for MIMO Radar via Manifold Optimization", "abstract": "The problem of joint design of transmit waveforms and receive filters is desirable in many application scenarios of multiple-input multiple-output (MIMO) radar systems. In this paper, the joint design problem is investigated under the signal-to-interference-plus-noise ratio (SINR) performance metric, in which case the problem is formulated to maximize the SINR at the receiver side subject to some practical transmit waveform constraints. A numerical algorithm is proposed for problem resolution based on the manifold optimization method, which has been shown to be powerful and flexible to address nonconvex constrained optimization problems in many engineering applications. The proposed algorithm is able to efficiently solve the SINR maximization problem with different waveform constraints under a unified framework. Numerical experiments show that the proposed algorithm outperforms the existing benchmarks in terms of computation efficiency and achieves comparable SINR performance."}}
{"id": "arGKo_JdCvn", "cdate": 1609459200000, "mdate": 1648719089415, "content": {"title": "Sparse Reduced-Rank Regression With Adaptive Selection of Groups of Predictors", "abstract": "Sparse reduced-rank regression (SRRR) model has been widely used for dimension reduction and variable selection with wide applications in machine learning, signal processing, econometrics, etc. In this paper, the SRRR estimation problem is investigated which aims at adaptively selecting the whole group of predictors. The problem is formulated to minimize the least squares loss with a sparsity-inducing penalty. For effective variable selection, a novel sparse estimation scheme, called Sorted L-One Penalized Estimation (SLOPE), is considered, where a group-SLOPE type penalty is adopted. An algorithm leveraging the block majorization-minimization framework is developed for efficient problem resolution. Simulations on synthetic data illustrate the effectiveness of the proposed algorithm. The competitive performance of the proposed model in prediction accuracy is numerically demonstrated on real data with comparison to the state-of-the-art methods."}}
{"id": "RudJDNd7pfG", "cdate": 1609459200000, "mdate": 1648719090123, "content": {"title": "Weighted Sum-Rate Maximization for Multi-Hop RIS-Aided Multi-User Communications: A Minorization-Maximization Approach", "abstract": "The reconfigurable intelligent surface (RIS) has aroused much research attention recently due to its potential benefits in 5G and beyond wireless networks. This paper considers a general multi-hop RIS-aided multi-user communication system and the weighted sum-rate maximization problem is studied by jointly designing the active beamforming matrix at the base station and multiple phase-shift matrices at the RISs (considering both continuous and discrete phase constraints). To tackle the resulting highly nonconvex optimization problem, a problem-tailored low-complexity and globally convergent algorithm based on block minorization-maximization (BMM) is proposed. The effectiveness of the proposed BMM approach and the performance improvement gained with multi-hop RISs are both demonstrated through numerical simulations. The merits of the proposed algorithms are further illustrated by indicating their adaptivity in solving many other RIS-related system designs."}}
