{"id": "rUqeQ7wZUbc", "cdate": 1646823195407, "mdate": null, "content": {"title": "Model-Value Inconsistency as a Signal for Epistemic Uncertainty", "abstract": "Using a model of the environment and a value function, an agent can construct many estimates of a state’s value, by unrolling the model for different lengths and bootstrapping with its value function. Our key insight is that one can treat this set of value estimates as a type of ensemble, which we call an \\emph{implicit value ensemble} (IVE). Consequently, the discrepancy between these estimates can be used as a proxy for the agent’s epistemic uncertainty; we term this signal \\emph{model-value inconsistency} or \\emph{self-inconsistency} for short. Unlike prior work which estimates uncertainty by training an ensemble of many models and/or value functions, this approach requires only the single model and value function which are already being learned in most model-based reinforcement learning algorithms. We provide empirical evidence in both tabular and function approximation settings from pixels that self-inconsistency is useful (i) as a signal for exploration, (ii) for acting safely under distribution shifts, and (iii) for robustifying value-based planning with a learned model."}}
{"id": "x2rdRAx3QF", "cdate": 1621630080465, "mdate": null, "content": {"title": "Self-Consistent Models and Values", "abstract": "Learned models of the environment provide reinforcement learning (RL) agents with flexible ways of making predictions about the environment.\nModels enable planning, i.e. using more computation to improve value functions or policies, without requiring additional environment interactions.\nIn this work, we investigate a way of augmenting model-based RL, by additionally encouraging a learned model and value function to be jointly \\emph{self-consistent}.\nThis lies in contrast to classic planning methods like Dyna, which only update the value function to be consistent with the model.\nWe propose a number of possible self-consistency updates, study them empirically in both the tabular and function approximation settings, and find that with appropriate choices self-consistency can be useful both for policy evaluation and control."}}
{"id": "B1ba6xW_ZH", "cdate": 1546300800000, "mdate": null, "content": {"title": "Automated Fact Checking in the News Room", "abstract": "Fact checking is an essential task in journalism; its importance has been highlighted due to recently increased concerns and efforts in combating misinformation. In this paper, we present an automated fact checking platform which given a claim, it retrieves relevant textual evidence from a document collection, predicts whether each piece of evidence supports or refutes the claim, and returns a final verdict. We describe the architecture of the system and the user interface, focusing on the choices made to improve its user friendliness and transparency. We conduct a user study of the fact-checking platform in a journalistic setting: we integrated it with a collection of news articles and provide an evaluation of the platform using feedback from journalists in their workflow. We found that the predictions of our platform were correct 58% of the time, and 59% of the returned evidence was relevant."}}
{"id": "B1ZuLQZ_bB", "cdate": 1546300800000, "mdate": null, "content": {"title": "Jointly Extracting and Compressing Documents with Summary State Representations", "abstract": "Afonso Mendes, Shashi Narayan, Sebastião Miranda, Zita Marinho, André F. T. Martins, Shay B. Cohen. Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers). 2019."}}
{"id": "SyNRNoWdbH", "cdate": 1514764800000, "mdate": null, "content": {"title": "Recurrent Predictive State Policy Networks", "abstract": "We introduce Recurrent Predictive State Policy(RPSP) networks, a recurrent architecture that brings insights from predictive state representations to reinforcement learning in partially ob-servable..."}}
{"id": "SkZoMGGdWr", "cdate": 1451606400000, "mdate": null, "content": {"title": "Semi-Supervised Learning of Sequence Models with Method of Moments", "abstract": ""}}
