{"id": "zJXg_Wmob03", "cdate": 1663850047909, "mdate": null, "content": {"title": "Progressive Voronoi Diagram Subdivision Enables Accurate Data-free Class-Incremental Learning", "abstract": "Data-free Class-incremental Learning (CIL) is a challenging problem because rehearsing data from previous phases is strictly prohibited, causing catastrophic forgetting of Deep Neural Networks (DNNs). In this paper, we present \\emph{iVoro}, a novel framework derived from computational geometry. We found Voronoi Diagram (VD), a classical model for space subdivision, is especially powerful for solving the CIL problem, because VD itself can be constructed favorably in an incremental manner -- the newly added sites (classes) will only affect the proximate classes, making the non-contiguous classes hardly forgettable. Furthermore, we bridge DNN and VD using Power Diagram Reduction, and show that the VD structure can be progressively refined along the phases using a divide-and-conquer algorithm. Moreover, our VD construction is not restricted to the deep feature space, but is also applicable to multiple intermediate feature spaces, promoting VD to be multilayer VD that efficiently captures multi-grained features from DNN. Importantly, \\emph{iVoro} is also capable of handling uncertainty-aware test-time Voronoi cell assignment and has exhibited high correlations between geometric uncertainty and predictive accuracy (up to ${\\sim}0.9$). Putting everything together, \\emph{iVoro} achieves up to $25.26\\%$, $37.09\\%$, and $33.21\\%$ improvements on CIFAR-100, TinyImageNet, and ImageNet-Subset, respectively, compared to the state-of-the-art non-exemplar CIL approaches. In conclusion, \\emph{iVoro} enables highly accurate, privacy-preserving, and geometrically interpretable CIL that is particularly useful when cross-phase data sharing is forbidden, e.g. in medical applications."}}
{"id": "whGCp9V0sfL", "cdate": 1640995200000, "mdate": 1681656168723, "content": {"title": "Few-shot Learning via Dirichlet Tessellation Ensemble", "abstract": "Few-shot learning (FSL) is the process of rapid generalization from abundant base samples to inadequate novel samples. Despite extensive research in recent years, FSL is still not yet able to generate satisfactory solutions for a wide range of real-world applications. To confront this challenge, we study the FSL problem from a geometric point of view in this paper. One observation is that the widely embraced ProtoNet model is essentially a Voronoi Diagram (VD) in the feature space. We retrofit it by making use of a recent advance in computational geometry called Cluster-induced Voronoi Diagram (CIVD). Starting from the simplest nearest neighbor model, CIVD gradually incorporates cluster-to-point and then cluster-to-cluster relationships for space subdivision, which is used to improve the accuracy and robustness at multiple stages of FSL. Specifically, we use CIVD (1) to integrate parametric and nonparametric few-shot classifiers; (2) to combine feature representation and surrogate representation; (3) and to leverage feature-level, transformation-level, and geometry-level heterogeneities for a better ensemble. Our CIVD-based workflow enables us to achieve new state-of-the-art results on mini-ImageNet, CUB, and tiered-ImagenNet datasets, with ${\\sim}2\\%{-}5\\%$ improvements upon the next best. To summarize, CIVD provides a mathematically elegant and geometrically interpretable framework that compensates for extreme data insufficiency, prevents overfitting, and allows for fast geometric ensemble for thousands of individual VD. These together make FSL stronger."}}
{"id": "vVq9h7Dgfcu", "cdate": 1640995200000, "mdate": 1682458578403, "content": {"title": "In-Range Farthest Point Queries and Related Problem in High Dimensions", "abstract": "Range-aggregate query is an important type of queries with numerous applications. It aims to obtain some structural information (defined by an aggregate function $F(\\cdot)$) of the points (from a point set $P$) inside a given query range $B$. In this paper, we study the range-aggregate query problem in high dimensional space for two aggregate functions: (1) $F(P \\cap B)$ is the farthest point in $P \\cap B$ to a query point $q$ in $\\mathbb{R}^d$ and (2) $F(P \\cap B)$ is the minimum enclosing ball (MEB) of $P \\cap B$. For problem (1), called In-Range Farthest Point (IFP) Query, we develop a bi-criteria approximation scheme: For any $\\epsilon>0$ that specifies the approximation ratio of the farthest distance and any $\\gamma>0$ that measures the \"fuzziness\" of the query range, we show that it is possible to pre-process $P$ into a data structure of size $\\tilde{O}_{\\epsilon,\\gamma}(dn^{1+\\rho})$ in $\\tilde{O}_{\\epsilon,\\gamma}(dn^{1+\\rho})$ time such that given any $\\mathbb{R}^d$ query ball $B$ and query point $q$, it outputs in $\\tilde{O}_{\\epsilon,\\gamma}(dn^{\\rho})$ time a point $p$ that is a $(1-\\epsilon)$-approximation of the farthest point to $q$ among all points lying in a $(1+\\gamma)$-expansion $B(1+\\gamma)$ of $B$, where $0<\\rho<1$ is a constant depending on $\\epsilon$ and $\\gamma$ and the hidden constants in big-O notations depend only on $\\epsilon$, $\\gamma$ and $\\text{Polylog}(nd)$. For problem (2), we show that the IFP result can be applied to develop query scheme with similar time and space complexities to achieve a $(1+\\epsilon)$-approximation for MEB."}}
{"id": "q8CnjtVyHOr", "cdate": 1640995200000, "mdate": 1682458578515, "content": {"title": "In-Range Farthest Point Queries and Related Problem in High Dimensions", "abstract": "Range-aggregate query is an important type of queries with numerous applications. It aims to obtain some structural information (defined by an aggregate function F(⋅)) of the points (from a point set P) inside a given query range B. In this paper, we study the range-aggregate query problem in high dimensional space for two aggregate functions: (1) F(P ∩ B) is the farthest point in P ∩ B to a query point q in ℝ^d and (2) F(P ∩ B) is the minimum enclosing ball (MEB) of P ∩ B. For problem (1), called In-Range Farthest Point (IFP) Query, we develop a bi-criteria approximation scheme: For any ε > 0 that specifies the approximation ratio of the farthest distance and any γ > 0 that measures the \"fuzziness\" of the query range, we show that it is possible to pre-process P into a data structure of size Õ_{ε,γ}(dn^{1+ρ}) in Õ_{ε,γ}(dn^{1+ρ}) time such that given any ℝ^d query ball B and query point q, it outputs in Õ_{ε,γ}(dn^ρ) time a point p that is a (1-ε)-approximation of the farthest point to q among all points lying in a (1+γ)-expansion B(1+γ) of B, where 0 < ρ < 1 is a constant depending on ε and γ and the hidden constants in big-O notations depend only on ε, γ and Polylog(nd). For problem (2), we show that the IFP result can be applied to develop query scheme with similar time and space complexities to achieve a (1+ε)-approximation for MEB. To the best of our knowledge, these are the first theoretical results on such high dimensional range-aggregate query problems. Our results are based on several new techniques, such as multi-scale construction and ball difference range query, which are interesting in their own rights and could be potentially used to solve other range-aggregate problems in high dimensional space."}}
{"id": "duNSpj-KPW", "cdate": 1640995200000, "mdate": 1682458579528, "content": {"title": "Small Candidate Set for Translational Pattern Search", "abstract": "In this paper, we study the following pattern search problem: Given a pair of point sets A and B in fixed dimensional space $$\\mathbb {R}^d$$ R d , with $$|B| = n,|A| = m$$ | B | = n , | A | = m and $$n \\ge m$$ n ≥ m , the pattern search problem is to find the translations $$\\mathcal {T}$$ T ’s of A such that each of the identified translations induces a matching between $$\\mathcal {T}(A)$$ T ( A ) and a subset $$B'$$ B ′ of B with cost no more than some given threshold, where the cost is defined as the minimum bipartite matching cost of $$\\mathcal {T}(A)$$ T ( A ) and $$B'$$ B ′ . We present a novel algorithm to produce a small set of candidate translations for the pattern search problem. For any $$B' \\subseteq B$$ B ′ ⊆ B with $$|B'| = |A|$$ | B ′ | = | A | , there exists at least one translation $$\\mathcal {T}$$ T in the candidate set such that the minimum bipartite matching cost between $$\\mathcal {T}(A)$$ T ( A ) and $$B'$$ B ′ is no larger than $$(1+\\epsilon )$$ ( 1 + ϵ ) times the minimum bipartite matching cost between A and $$B'$$ B ′ under any translation (i.e., the optimal translational matching cost). We also show that there exists an alternative solution to this problem, which constructs a candidate set of size $$O_{d,\\epsilon }(n \\log ^2 n)$$ O d , ϵ ( n log 2 n ) in $$O_{d,\\epsilon }(n \\log ^2 n)$$ O d , ϵ ( n log 2 n ) time with high probability of success. As a by-product of our construction, we obtain a weak $$\\epsilon $$ ϵ -net for hypercube ranges, which significantly improves the construction time and the size of the candidate set. Our technique can be applied to a number of applications, including the translational pattern matching problem."}}
{"id": "ZWMmxM9RMfM", "cdate": 1640995200000, "mdate": 1670465926649, "content": {"title": "Progressive Voronoi Diagram Subdivision: Towards A Holistic Geometric Framework for Exemplar-free Class-Incremental Learning", "abstract": "Exemplar-free Class-incremental Learning (CIL) is a challenging problem because rehearsing data from previous phases is strictly prohibited, causing catastrophic forgetting of Deep Neural Networks (DNNs). In this paper, we present iVoro, a holistic framework for CIL, derived from computational geometry. We found Voronoi Diagram (VD), a classical model for space subdivision, is especially powerful for solving the CIL problem, because VD itself can be constructed favorably in an incremental manner -- the newly added sites (classes) will only affect the proximate classes, making the non-contiguous classes hardly forgettable. Further, in order to find a better set of centers for VD construction, we colligate DNN with VD using Power Diagram and show that the VD structure can be optimized by integrating local DNN models using a divide-and-conquer algorithm. Moreover, our VD construction is not restricted to the deep feature space, but is also applicable to multiple intermediate feature spaces, promoting VD to be multi-centered VD (CIVD) that efficiently captures multi-grained features from DNN. Importantly, iVoro is also capable of handling uncertainty-aware test-time Voronoi cell assignment and has exhibited high correlations between geometric uncertainty and predictive accuracy (up to ~0.9). Putting everything together, iVoro achieves up to 25.26%, 37.09%, and 33.21% improvements on CIFAR-100, TinyImageNet, and ImageNet-Subset, respectively, compared to the state-of-the-art non-exemplar CIL approaches. In conclusion, iVoro enables highly accurate, privacy-preserving, and geometrically interpretable CIL that is particularly useful when cross-phase data sharing is forbidden, e.g. in medical applications. Our code is available at https://machunwei.github.io/ivoro."}}
{"id": "XY-ox2bks90", "cdate": 1640995200000, "mdate": 1681656168800, "content": {"title": "Few-shot Learning as Cluster-induced Voronoi Diagrams: A Geometric Approach", "abstract": "Few-shot learning (FSL) is the process of rapid generalization from abundant base samples to inadequate novel samples. Despite extensive research in recent years, FSL is still not yet able to generate satisfactory solutions for a wide range of real-world applications. To confront this challenge, we study the FSL problem from a geometric point of view in this paper. One observation is that the widely embraced ProtoNet model is essentially a Voronoi Diagram (VD) in the feature space. We retrofit it by making use of a recent advance in computational geometry called Cluster-induced Voronoi Diagram (CIVD). Starting from the simplest nearest neighbor model, CIVD gradually incorporates cluster-to-point and then cluster-to-cluster relationships for space subdivision, which is used to improve the accuracy and robustness at multiple stages of FSL. Specifically, we use CIVD (1) to integrate parametric and nonparametric few-shot classifiers; (2) to combine feature representation and surrogate representation; (3) and to leverage feature-level, transformation-level, and geometry-level heterogeneities for a better ensemble. Our CIVD-based workflow enables us to achieve new state-of-the-art results on mini-ImageNet, CUB, and tiered-ImagenNet datasets, with ${\\sim}2\\%{-}5\\%$ improvements upon the next best. To summarize, CIVD provides a mathematically elegant and geometrically interpretable framework that compensates for extreme data insufficiency, prevents overfitting, and allows for fast geometric ensemble for thousands of individual VD. These together make FSL stronger."}}
{"id": "SGgvXtZSvk", "cdate": 1640995200000, "mdate": 1682458579366, "content": {"title": "FLS: A New Local Search Algorithm for K-means with Smaller Search Space", "abstract": "The k-means problem is an extensively studied unsupervised learning problem with various applications in decision making and data mining. In this paper, we propose a fast and practical local search algorithm for the k-means problem. Our method reduces the search space of swap pairs from O(nk) to O(k^2), and applies random mutations to find potentially better solutions when local search falls into poor local optimum. With the assumption of data distribution that each optimal cluster has \"average\" size of \\Omega(n/k), which is common in many datasets and k-means benchmarks, we prove that our proposed algorithm gives a (100+\\epsilon)-approximate solution in expectation. Empirical experiments show that our algorithm achieves better performance compared to existing state-of-the-art local search methods on k-means benchmarks and large datasets."}}
{"id": "9UEyafqzyTO", "cdate": 1640995200000, "mdate": 1682458579542, "content": {"title": "Small Candidate Set for Translational Pattern Search", "abstract": "In this paper, we study the following pattern search problem: Given a pair of point sets A and B in fixed dimensional space $$\\mathbb {R}^d$$ R d , with $$|B| = n,|A| = m$$ | B | = n , | A | = m and $$n \\ge m$$ n ≥ m , the pattern search problem is to find the translations $$\\mathcal {T}$$ T ’s of A such that each of the identified translations induces a matching between $$\\mathcal {T}(A)$$ T ( A ) and a subset $$B'$$ B ′ of B with cost no more than some given threshold, where the cost is defined as the minimum bipartite matching cost of $$\\mathcal {T}(A)$$ T ( A ) and $$B'$$ B ′ . We present a novel algorithm to produce a small set of candidate translations for the pattern search problem. For any $$B' \\subseteq B$$ B ′ ⊆ B with $$|B'| = |A|$$ | B ′ | = | A | , there exists at least one translation $$\\mathcal {T}$$ T in the candidate set such that the minimum bipartite matching cost between $$\\mathcal {T}(A)$$ T ( A ) and $$B'$$ B ′ is no larger than $$(1+\\epsilon )$$ ( 1 + ϵ ) times the minimum bipartite matching cost between A and $$B'$$ B ′ under any translation (i.e., the optimal translational matching cost). We also show that there exists an alternative solution to this problem, which constructs a candidate set of size $$O_{d,\\epsilon }(n \\log ^2 n)$$ O d , ϵ ( n log 2 n ) in $$O_{d,\\epsilon }(n \\log ^2 n)$$ O d , ϵ ( n log 2 n ) time with high probability of success. As a by-product of our construction, we obtain a weak $$\\epsilon $$ ϵ -net for hypercube ranges, which significantly improves the construction time and the size of the candidate set. Our technique can be applied to a number of applications, including the translational pattern matching problem."}}
{"id": "6d7LHzuoyzu", "cdate": 1640995200000, "mdate": 1682458579242, "content": {"title": "In-Range Farthest Point Queries and Related Problem in High Dimensions", "abstract": "Range-aggregate query is an important type of queries with numerous applications. It aims to obtain some structural information (defined by an aggregate function F(⋅)) of the points (from a point set P) inside a given query range B. In this paper, we study the range-aggregate query problem in high dimensional space for two aggregate functions: (1) F(P ∩ B) is the farthest point in P ∩ B to a query point q in ℝ^d and (2) F(P ∩ B) is the minimum enclosing ball (MEB) of P ∩ B. For problem (1), called In-Range Farthest Point (IFP) Query, we develop a bi-criteria approximation scheme: For any ε > 0 that specifies the approximation ratio of the farthest distance and any γ > 0 that measures the \"fuzziness\" of the query range, we show that it is possible to pre-process P into a data structure of size Õ_{ε,γ}(dn^{1+ρ}) in Õ_{ε,γ}(dn^{1+ρ}) time such that given any ℝ^d query ball B and query point q, it outputs in Õ_{ε,γ}(dn^ρ) time a point p that is a (1-ε)-approximation of the farthest point to q among all points lying in a (1+γ)-expansion B(1+γ) of B, where 0 < ρ < 1 is a constant depending on ε and γ and the hidden constants in big-O notations depend only on ε, γ and Polylog(nd). For problem (2), we show that the IFP result can be applied to develop query scheme with similar time and space complexities to achieve a (1+ε)-approximation for MEB. To the best of our knowledge, these are the first theoretical results on such high dimensional range-aggregate query problems. Our results are based on several new techniques, such as multi-scale construction and ball difference range query, which are interesting in their own rights and could be potentially used to solve other range-aggregate problems in high dimensional space."}}
